[
  {
    "Type": "DataTable",
    "Name": "DT_Translation_Events_RestoringThePeace",
    "Class": "UScriptClass'DataTable'",
    "Properties": {
      "RowStruct": {
        "ObjectName": "ScriptStruct'LocalizedText'",
        "ObjectPath": "/Script/ManorLords"
      }
    },
    "Rows": {
      "restoring_the_peace": {
        "en_US": "Restoring the Peace",
        "zh_CN": "重建和平",
        "zh_TW": "恢復和平",
        "ja_JA": "平和の再建",
        "ko_KR": "평화 회복",
        "de_DE": "Wiederherstellung des Friedens",
        "es_ES": "Restaurar la paz",
        "fr_FR": "Restaurer la paix",
        "pt_BR": "Reestabelecendo a Paz",
        "pl_PL": "Przywrócenie pokoju",
        "ru_RU": "Да будет мир",
        "it_IT": "Ristabilire la pace",
        "tr_TR": "Barışı yeniden sağla",
        "cs_CZ": "Nastolení míru",
        "hu_HU": "A béke helyreállítása",
        "uk_UA": "Хай буде мир",
        "da_DK": "Genoprettelse af freden",
        "nl_NL": "De vrede herstellen",
        "sv_SE": "Återställ freden"
      },
      "restoring_the_peace_descr": {
        "en_US": "By the grace of His Royal Highness, the prince of this realm, you have been chosen to govern a land of great peril and promise. {br}{br}It has suffered long from the scourge of banditry, but there is another threat that looms over this land: an illegitimate baron who claims the northern territories as his own. {br}{br}Will you prove yourself worthy of this honor, or will you perish by the traitor’s steel? ",
        "zh_CN": "承蒙王子殿下的恩典，你被选中管理这片危机与希望并存的土地。{br}{br}长久以来，此地饱受强盗的侵扰，但更大的威胁已然逼近：一位非法男爵声称整片北部领土为他所有。{br}{br}你是否能够证明自己有能力扛起这一重任，还是会惨败于背叛者的利剑之下？ ",
        "zh_TW": "承蒙我國王子殿下的恩典，你被選中管理這片充滿危險和希望的土地。{br}{br}此處不但長期遭受盜匪肆虐，還有著另一個威脅：有一名私生子以男爵自尊，且自稱領有整片北部領土。{br}{br}你會證明自己值得這份榮耀，還是會死於叛徒的亂劍之下呢？ ",
        "ja_JA": "この国には王子がいた。殿下と称される彼の計らいにより、あなたは危険と希望に満ちた、ある土地の統治者として選ばれる。{br}{br}長らく盗賊の被害に悩まされてきたその地に、また新たな脅威が襲いかかる。王位とは無関係の男爵が北方の地を自らの物だと謳い始めたのだ。{br}{br}この栄誉に相応しい存在となるか、逆賊の刃に倒れるか、その手腕が試される時だ。 ",
        "ko_KR": "이 영토의 주인이신 전하의 은총으로, 당신은 커다란 위험과 가능성이 가득한 땅을 통치하도록 선택받았습니다. {br}{br}이 땅은 만연한 도적질로 인해 오랫동안 고통을 받았습니다. 심지어 자신을 북부 영토의 주인으로 일컫는 자칭 남작마저 활개 치는 판국입니다. {br}{br}당신은 이 명예를 누릴 자격이 있음을 몸소 증명하시겠습니까? 아니면 배신자의 칼날 아래 죽음을 맞이하시겠습니까?  ",
        "de_DE": "Durch die Gnade Seiner Königlichen Hoheit, des Prinzen dieses Reiches, wurdet Ihr dazu auserwählt, ein Land mit großen Gefahren und Versprechungen zu regieren. {br}{br}Zu lange hat es unter der Geißel des Banditentums gelitten, doch nun gibt es eine weitere Bedrohung, die ebendiesem Lande dräut: Ein unrechtmäßiger Baron, der die nördlichen Territorien für sich beansprucht. {br}{br}Werdet Ihr Euch dieser Ehre würdig erweisen oder werdet Ihr dem Schwerte des Verräters erliegen? ",
        "es_ES": "Se te ha sido otorgado por gloria y gracia de su alteza real, príncipe de estos reinos, el derecho de ejercer como gobernante de ciertas tierras, tan prometedoras como peligrosas. {br}{br}Hablamos de parajes que sufren el azote de grupos de bandidos desde hace tiempo, pero esa no es la única amenaza que se cierne sobre ellos; al parecer, un barón ilegítimo reclama los territorios del norte para sí.{br}{br}¿Por tu parte, serás capaz de demostrar que estás a la altura de tal honor? ¿O acaso logrará semejante traidor prevenir tus gestas a punta de espada? ",
        "fr_FR": "Sa Majesté, prince de ce royaume, vous a confié l’autorité souveraine sur une terre recelant autant de promesses que de dangers.{br}{br}Longtemps cette contrée a été en proie aux bandits de la pire espèce, mais une autre menace plane désormais sur elle : un baron illégitime revendique les terres du nord comme siennes.{br}{br}Serez-vous digne de cet honneur ou le traître vous passera-t-il par le fil de son épée ? ",
        "pt_BR": "Pela graça de Sua Alteza Real, o príncipe deste reino, seu nome foi escolhido para governar terras de grande perigo e promessa.{br}{br}Há muito que elas sofrem com a praga do banditismo, mas há ainda outra ameaça que paira sobre este terreno: um barão ilegítimo que declara posse sobre os territórios nortes.{br}{br}Você provará seu merecimento desta honra, ou perecerá sob a espada do traidor? ",
        "pl_PL": "Z łaski jego wysokości księcia tej krainy wybrano cię do zarządzania ziemiami, które są bardzo obiecujące, ale zarazem niebezpieczne. {br}{br}Region ten jest od dawna nękany przez rozbójników, ale zagraża mu też inne niebezpieczeństwo: pewien baron bezprawnie zajął jego północą część i traktuje ją jak swoją własność. {br}{br}Czy sprostasz temu zaszczytowi i przepędzisz uzurpatora, czy też zginiesz od szabel jego siepaczy? ",
        "ru_RU": "Милостью Его Королевского Высочества, властителя этих земель, вам поручено взять под свое управление область сколь многострадальную, столь и многообещающую. {br}{br}Она уже давно стонет от такой напасти, как бандитские набеги, но с недавних пор над жителями нависла еще одна угроза: незаконнорожденный барон, который объявил северные территории своей собственностью. {br}{br}Покажете ли вы себя достойным этой чести, или вам суждено принять смерть от клинка предателя? ",
        "it_IT": "Per grazia di Sua Altezza Reale, il principe di questo regno, il tuo nome è stato scelto per governare una terra piena di insidie, ma anche di promesse. {br}{br}A lungo questa regione è stata vittima di scorribande di briganti, ma esiste una nuova minaccia incombente: un barone illegittimo che vuole per sé i territori a Nord. {br}{br}Ti dimostrerai all'altezza di questo onore, oppure perirai per mano del traditore? ",
        "tr_TR": "Bu diyarın prensi Majestelerinin lütfuyla, büyük tehlikelerle ve umutlarla dolu bir bölgeyi yönetmek için seçildin. {br}{br}Bölge, haydutların pençesinde uzun zamandır acı çekiyor ancak bu topraklarda baş gösteren başka bir tehdit daha var: kuzey bölgelerinin kendisine ait olduğunu iddia eden gayrimeşru bir baron. {br}{br}Bu onura layık olduğunu kanıtlayacak mısın yoksa hainin kılıcıyla yok olup gidecek misin? ",
        "cs_CZ": "Z milosti jeho královské výsosti, prince této říše, byla tvá osoba vyvolena, aby vládla zemi, jež skýtá velký příslib i velké nebezpečenství. {br}{br}Tato země již drahnou dobu trpí pod jhem zbojníků, avšak tyčí se nad ní ještě jiná hrozba: baron-levoboček, který si severní území nárokuje pro sebe. {br}{br}Prokážeš, že si tuto poctu zasloužíš, anebo padneš proti zrádcově oceli? ",
        "hu_HU": "E birodalom hercegének, Ő Királyi Fenségének kegyelméből téged választottak ki, hogy egy nagy veszélyekkel és ígéretekkel kecsegtető földet kormányozz. {br}{br}Régóta szenved a banditák sanyargatásaitól, de más fenyegetés is leselkedik erre a földre: egy törvénytelen báró, aki az északi területeket a magáénak követeli. {br}{br}Bizonyítod-e, hogy méltó vagy erre a megtiszteltetésre, vagy elveszejt az áruló acélja? ",
        "uk_UA": "Милістю Його Королівської Високості, володаря цих земель, вам доручено взяти під своє управління область, яка є як багатостраждальною, так і багатообіцяючою. {br}{br}Вона вже давно стогне від такої напасті, як бандитські набіги, але віднедавна над жителями нависла ще одна загроза: незаконнонароджений барон, який оголосив північні території своєю власністю. {br}{br}Чи покажете ви себе гідним цієї честі, чи вам судилося прийняти смерть від клинка зрадника? ",
        "da_DK": "Ved Hans Kongelige Højheds nåde, prinsen af dette rige, er du blevet udvalgt til at regere et land med store farer og løfter. {br}{br}Det har længe lidt under banditternes svøbe, men der er en anden trussel, der truer dette land: En uægte baron, der har gjort krav på de nordlige territorier, som var de hans egne. {br}{br}Vil du vise dig værdig til denne ære, eller vil du gå til grunde for forræderens stål? ",
        "nl_NL": "Met dank aan de gratie van Zijne Koninklijke Hoogheid, de prins van dit rijk, ben je gekozen om te heersen over een land vol gevaar, maar ook vol mogelijkheden. {br}{br}Het land wordt al lange tijd geplaagd door bandieten, maar er is nog een andere dreiging die dit rijk overschaduwt: een onrechtmatige baron die de noordelijke gebieden voor zichzelf opeist. {br}{br}Ben je het vertrouwen van de koning waard, of ga je ten onder tegen een snoodaard? ",
        "sv_SE": "Genom hans kungliga höghets nåd, det här rikets prins, har du valts ut att styra de här löftesrika men farofyllda ägorna.{br}{br}Länge har banditer plågat landsbygden, men det finns även ett annat hot: en baron som hävdar att de norra territorierna tillhör honom.{br}{br}Har du det som krävs för att visa dig värdig den här äran eller kommer du att möta ditt slut på förrädarens blankpolerade stål? "
      },
      "I_will_restore_peace": {
        "en_US": "I vow to restore peace and prosperity to this land.",
        "zh_CN": "我立誓为这片大地带来和平与繁荣。",
        "zh_TW": "我誓要恢復這片土地的和平與繁榮。",
        "ja_JA": "この地に平和と繁栄を取り戻すと誓おう。",
        "ko_KR": "이 땅에 평화와 번영을 되찾아 오겠다고 맹세한다.",
        "de_DE": "Ich schwöre, dass ich diesem Land aufs Neue Frieden und Wohlstand bringen werde.",
        "es_ES": "A todos pongo por testigos de que restauraré la paz y traeré prosperidad a estas tierras.",
        "fr_FR": "Je jure de restaurer la paix et la prospérité sur ces terres.",
        "pt_BR": "Eu juro restituir a paz e a prosperidade a essas terras",
        "pl_PL": "Przysięgam przywrócić pokój i powodzenie tej krainie.",
        "ru_RU": "Я клянусь восстановить мир и привести этот регион к процветанию.",
        "it_IT": "Giuro solennemente di ristabilire la pace e la prosperità di questa terra.",
        "tr_TR": "Bu topraklarda barışı ve refahı yeniden sağlayacağıma ant içiyorum.",
        "cs_CZ": "Přísahám, že této zemi přinesu mír a blahobyt.",
        "hu_HU": "Esküszöm, hogy helyreállítom a békét és a jólétet ezen a földön.",
        "uk_UA": "Я клянуся відновити мир і привести ці землі до процвітання.",
        "da_DK": "Jeg sværger, at jeg vil genskabe fred og velstand i dette land.",
        "nl_NL": "Ik zweer dit land weer vredig en welvarend te zullen maken.",
        "sv_SE": "Jag svär att återställa freden och det här landets välstånd."
      },
      "weapons_delivery": {
        "en_US": "Armament delivery",
        "zh_CN": "武器配给",
        "zh_TW": "採購武器",
        "ja_JA": "武器調達",
        "ko_KR": "병기 배달",
        "de_DE": "Waffenlieferung",
        "es_ES": "Envío de armas",
        "fr_FR": "Livraison d’armes",
        "pt_BR": "Entrega de Armamentos",
        "pl_PL": "Dostawa uzbrojenia",
        "ru_RU": "Доставка оружия",
        "it_IT": "Consegna di armamenti",
        "tr_TR": "Mühimmat teslimatı",
        "cs_CZ": "Dodávka zbraní",
        "hu_HU": "Fegyverzetszállítmány",
        "uk_UA": "Доставка зброї",
        "da_DK": "Levering af våben",
        "nl_NL": "Wapenlevering",
        "sv_SE": "Vapenleverans"
      },
      "weapons_delivery_descr": {
        "en_US": "A strong militia is paramount to the survival of any settlement. Luckily, a shipment of weapons has just arrived, and you will now be able to create your first militia banners to serve you and protect your people. {br}{br}However, we will need more weapons to equip all the people as the settlement grows, either by making them or importing them from other lands.",
        "zh_CN": "一支强大的民兵对任何定居点来说都至关重要。幸运的是，一批武器刚刚成功到达。现在你可以为自己组建第一批民兵了，他们将忠诚于你，并保护你的人民。{br}{br}但随着定居点逐渐壮大，我们需要获得更多的武器进行武装，你可以自行制造武器，也可以从其他地方购入。",
        "zh_TW": "強大的民兵是所有聚落生存的關鍵。幸運的是，一批熱騰騰的武器剛剛送達，你可以藉此樹立第一面民兵旗，為你作戰並保護你的子民。{br}{br}然而，隨著聚落逐漸壯大，武器的需求量也會不斷攀升，你可以自行製造武器或從其他地區進口武器。",
        "ja_JA": "どんな居留地であっても、生き残りの鍵となるのは強力な民兵である。運良く、先ほど武器の荷が届いたばかりだ。これで初めて兵たちの旗を作れるようになる。あなたに仕え、民を守るために「民兵隊」を編成せよ。{br}{br}ただし、居留地が発展するにつれて、それだけの人口を補うだけの装備を整えなければならず、より多くの武器が必要となってくる。自前で武器を作るか、他の領地から輸入するか、そのどちらかを選ぶことになるだろう。",
        "ko_KR": "정착지가 생존하려면 강력한 민병대가 필요합니다. 다행히 조금 전에 무기가 도착했습니다. 이제 당신을 섬기고 주민을 보호할 첫 민병대의 깃발을 올릴 수 있습니다. {br}{br}다만 정착지가 성장함에 따라, 모든 병사를 무장시키려면 더 많은 무기가 필요할 것입니다. 직접 생산하든 다른 땅에서 수입하든 수단과 방법은 중요하지 않습니다.",
        "de_DE": "Eine starke Miliz ist für das Überleben einer jeden Siedlung unerlässlich. Glücklicherweise ist gerade eine Waffenlieferung eingetroffen und Ihr könnt nun Eure ersten Milizen erstellen, die für Euch den Militärdienst leisten und das Volk beschützen. {br}{br}Sobald die Siedlung wächst, brauchen wir jedoch mehr Waffen, um alle Menschen auszurüsten – entweder indem wir sie selbst herstellen oder aus anderen Ländern importieren.",
        "es_ES": "Una milicia fuerte es una necesidad vital para cualquier asentamiento que desee garantizar su supervivencia. Por suerte, acabamos de recibir un cargamento de armas, por lo que podremos crear la primera milicia para tu protección y la de los tuyos.{br}{br}No obstante, necesitaremos hacernos con más armamento con el que equipar a nuestro pueblo a medida que crece, ya sea a través de su fabricación o de su importación.",
        "fr_FR": "Pour survivre, la colonie a besoin d’une milice puissante. Heureusement, des armes viennent d’être livrées et vous êtes maintenant en mesure de lever vos premières bannières de miliciens. Leur rôle est de vous servir et de protéger votre peuple. {br}{br}Cependant, à mesure que votre cité grandira, il vous faudra davantage d’armes, que vous devrez fabriquer ou importer depuis d’autres contrées.",
        "pt_BR": "Ter uma milícia forte é fundamental para a sobrevivência de qualquer vilarejo. Felizmente, uma remessa de armas acabou de chegar e você poderá criar os primeiros estandartes da sua milícia, para que ela sirva e proteja o seu povo.{br}{br}Porém, você precisará de mais armas para equipar todas as pessoas conforme seu vilarejo cresça. É possível fabricá-las ou importá-las de outras terras.",
        "pl_PL": "Silna milicja ma zasadnicze znaczenie dla bezpieczeństwa każdej osady. Na szczęście do twojej wsi właśnie dotarł transport broni, dzięki czemu możesz utworzyć pierwsze oddziały milicji, które będą ci służyć i chronić twoich poddanych. {br}{br}Jednak w miarę rozwoju osady do uzbrojenia wszystkich mieszkańców będziemy potrzebować więcej uzbrojenia. Możemy je wyprodukować lub sprowadzić z innych krain.",
        "ru_RU": "Ни одному селу не выстоять без крепкого ополчения. К счастью, только что прибыла партия оружия, и теперь вы сможете созвать под свои знамена первую когорту воинов, которые станут людям защитой и опорой. {br}{br}Однако по мере роста поселения вам понадобится еще больше оружия, так что надо будет изготовить его или привезти из других регионов.",
        "it_IT": "Una milizia potente è fondamentale per la sopravvivenza di un insediamento. Fortunatamente è appena arrivato un carico di armi, e adesso potrai creare i tuoi primi vessilli militari cosicché servano te e proteggano il tuo popolo. {br}{br}Tuttavia, per equipaggiare tutti gli abitanti man mano che l'insediamento crescerà ci serviranno più armi: potrai fabbricarle oppure importarle da altre terre.",
        "tr_TR": "Güçlü bir milis, herhangi bir yerleşimin hayatta kalması için hayati önem taşır. Neyse ki bir silah teslimatı az önce eline ulaştı. Artık sana hizmet edecek ve halkını koruyacak ilk milis sancaklarını oluşturabileceksin. {br}{br}Gelgelelim, yerleşim büyüdükçe tüm halkın kuşanmasını sağlamak için daha fazla silaha ihtiyacımız olacak. Bu silahları ya üretmeli ya da diğer topraklardan ithal etmelisin.",
        "cs_CZ": "Silná domobrana je pro přežití každé osady klíčová. Naštěstí právě dorazila dodávka zbraní, takže si budeš moct založit první prapory domobrany, které budou sloužit tvému lidu a chránit ho. {br}{br}Abychom však dokázali vybavit všechny lidi v rozrůstající se osadě, budeme potřebovat více zbraní – buď je vyrobíme, nebo dovezeme z jiných zemí.",
        "hu_HU": "Az erős milícia minden település túléléséhez elengedhetetlen. Szerencsére most érkezett egy szállítmány fegyver, és mostantól létrehozhatod az első milícia bandériumokat, hogy szolgáljanak és megvédjék néped. {br}{br}A település növekedésével azonban több fegyverre lesz szükségünk, hogy az összes embert felfegyverezhessük, akár saját készítésű, akár külhonból importált fegyverekkel.",
        "uk_UA": "Жодному поселенню не вистояти без міцного ополчення. На щастя, щойно прибула партія зброї, і тепер ви зможете скликати під свої прапори перший загін воїнів, які стануть людям захистом і опорою. {br}{br}Утім, у міру зростання поселення вам знадобиться ще більше зброї, тож треба буде виготовити її або привезти з інших регіонів.",
        "da_DK": "En stærk milits er altafgørende for enhver bosættelses overlevelse. Heldigvis er en sending våben netop ankommet, og du kan nu skabe dine første militsbannere til at tjene dig og beskytte dit folk. {br}{br}Men vi får brug for flere våben til at udruste alle folk, efterhånden som bosættelsen vokser, enten ved at fremstille dem eller importere dem.",
        "nl_NL": "Voor het overleven van elke nederzetting is een sterke militie van uiterst belang. Gelukkig is er zojuist een levering wapens binnengekomen, en kun je je eerste militievaandels maken om je te dienen en je volk te beschermen. {br}{br}Een groeiende nederzetting betekent echter ook een grotere behoefte aan wapens voor de dappere lieden van je militie. Die wapens kun je zelf vervaardigen of uit andere gebieden importeren.",
        "sv_SE": "En stark milis är av yttersta vikt om en bosättning ska kunna överleva. Som tur är har en leverans med vapen precis anlänt, och du kommer nu att kunna skapa dina första milisbaner att tjäna dig och skydda ditt folk.{br}{br}Vi behöver dock fler vapen om vi ska kunna rusta alla i takt med att bosättningen växer. Antingen gör vi vapnen själva eller så importerar vi dem."
      }
    }
  }
]