[
  {
    "Type": "DataTable",
    "Name": "DT_Translation_in_progress",
    "Class": "UScriptClass'DataTable'",
    "Flags": "RF_Public | RF_Standalone | RF_Transactional | RF_WasLoaded | RF_LoadCompleted",
    "Properties": {
      "RowStruct": {
        "ObjectName": "ScriptStruct'LocalizedText'",
        "ObjectPath": "/Script/ManorLords"
      }
    },
    "Rows": {
      "barter_warning": {
        "en_US": "Both Regions must offer something for barter to work",
        "zh_CN": "两个区域必须互相提供一些物品才能进行交换",
        "zh_TW": "兩個地區都必須提供物品才能進行交換",
        "ja_JA": "物々交換を成立させるには、互いに何らかの物品を差し出さなければならない",
        "ko_KR": "물물 교환이 되려면 두 지역이 모두 물자를 제공해야 합니다.",
        "de_DE": "Damit ein Tauschhandel zustande kommt, müssen beide Regionen Tauschgut anbieten.",
        "es_ES": "Ambas regiones deben ofrecer algo para que se pueda hacer un trueque.",
        "fr_FR": "Pour que l'échange fonctionne, chaque région doit proposer quelque chose",
        "pt_BR": "Ambas as regiões devem oferecer algum produto para que a permuta seja possível.",
        "pl_PL": "Aby wymiana była możliwa, oba regiony muszą coś oferować",
        "ru_RU": "Чтобы обмен состоялся, оба региона должны что-то предложить.",
        "it_IT": "Entrambe le regioni devono offrire qualcosa per rendere valido il baratto",
        "tr_TR": "Değiş tokuş yapılabilmesi için iki Bölge de bir şeyler teklif etmelidir",
        "cs_CZ": "Aby mohl směnný obchod fungovat, musí oba regiony něco nabídnout",
        "hu_HU": "Mindkét régiónak fel kell ajánlania valamit a cserekereskedelemhez",
        "uk_UA": "Обидва регіони повинні запропонувати щось на обмін, щоб відбувся бартер.",
        "da_DK": "Begge regioner skal tilbyde noget, før der kan handles",
        "nl_NL": "Beide gebieden moeten iets aanbieden om de ruilhandel te laten slagen",
        "sv_SE": "Båda regionerna måste erbjuda handelsvaror"
      },
      "market_supply_descr": {
        "en_US": "This view shows the <h>Availability</> of Goods and Services provided by this building to the <h>Burgage Plots</>.{br}{br}By hovering over the type of Good or Service below, an overlay will indicate the <h>Burgage Plots</> level of access to that type. The <h>Availability</> of goods and services always reaches the nearest <h>Burgage Plots</> first.{br}{br}Additionally, the tooltip shows how many <h>Burgage Plots</> are currently supplied, and how much of the Good or Service is in surplus.",
        "zh_CN": "此视图可显示该建筑为各 <h>堡地</>提供商品和服务的 <h>状况</>。{br}{br}将鼠标悬停在下方的商品或服务类型上时，会出现图层信息，显示该类型商品或服务在各 <h>堡地</> 的供应状况。商品和服务始终会率先 <h>满足</> 最近的 <h>堡地</>。{br}{br}此外，信息栏中还会显示当前已获供应的 <h>堡地</> 数量以及商品或服务的盈余量。",
        "zh_TW": "本圖顯示此建築提供<h>堡地</>貨物與服務的<h>取得難度</>。{br}{br}將游標懸停在下方任意貨物與服務上，便會顯示<h>堡地</>獲得該類型物資的等級。對距離最近的<h>堡地</>而言，貨物與服務的<h>取得難度</>最低。{br}{br}此外，提示也會顯示目前有多少<h>堡地</>獲得供應，以及多少貨物與服務有剩餘。",
        "ja_JA": "この表示は、この施設が <h>生活区画</> に提供する物資やサービスの <h>入手可能性</> を表しています。{br}{br}下に表示されている物資やサービスの種類にカーソルを合わせると、それに対する <h>生活区画</> の入手レベル がオーバーレイで表示されます。物資やサービスの <h>入手可能性</> は、常に最も近い <h>生活区画</> から優先されます。{br}{br}さらに、ツールチップでは現在供給されている <h>生活区画</> の数や、物資やサービスの余剰量を確認することができます。",
        "ko_KR": "이 보기는 해당 건물이 <h>거주 구획</>에 제공하는 물자 및 서비스의 <h>가용성</>을 보여줍니다.{br}{br}아래의 물자 또는 서비스 유형 위에 마우스를 올리면 해당 유형에 대한 <h>거주 구획</>의 액세스 수준이 오버레이로 나타냅니다. 물자 및 서비스의 <h>가용성</>은 항상 가장 가까운 <h>거주 구획</>에 먼저 도달합니다.{br}{br}또한 툴팁은 현재 공급된 <h>거주 구획</>의 수와 물자 또는 서비스의 여분을 보여줍니다.",
        "de_DE": "Diese Ansicht zeigt die <h>Verfügbarkeit</> von Waren und Diensten, die den <h>Hofstätten</> durch dieses Gebäude zur Verfügung gestellt werden.{br}{br}Bewegt den Mauszeiger unten über die gewünschte Ware oder die gewünschte Dienstleistung, um ein Overlay zu aktivieren, in dem die Zugangsstufe der <h>Hofstätten</> zu selbiger angezeigt wird. Die nächstgelegenen <h>Hofstätten</> werden im Hinblick auf die <h>Verfügbarkeit</> von Waren und Diensten stets priorisiert.{br}{br}Zusätzlich wird im Tooltip angezeigt, wie viele <h>Hofstätten</> aktuell versorgt werden und wie viel Überschuss für eine gewünschte Ware oder eine gewünschte Dienstleistung vorhanden ist.",
        "es_ES": "Esta vista muestra la <h>DISPONIBILIDAD</> de recursos y servicios que proporciona esta construcción a los <h>SEÑORÍOS</>.{br}{br}Al pasar el cursor por encima del tipo de recurso o servicio que aparece debajo, una capa indicará el nivel de acceso de los <h>SEÑORÍOS</> de este tipo. La <h>DISPONIBILIDAD</> de los recursos y servicios abarca primero los <h>SEÑORÍOS</> más próximos.{br}{br}De manera adicional, los cuadros informativos muestran cuántos <h>SEÑORÍOS</> están abastecidos, además de la cantidad de excedente del recurso o servicio.",
        "fr_FR": "Cette vue affiche les <h>censives</> pour lesquelles les ressources et les services de ce bâtiment sont <h>disponibles</>. {br}{br}Survolez le type de service ou de ressource ci-dessous pour afficher le niveau d'accès des <h>censives</> pour ce type. Les ressources et les services sont rendus <h>disponibles</> en priorité aux <h>censives</> les plus proches du bâtiment. {br}{br}L'infobulle indique également combien de <h>censives</> ont accès aux ressources ou services, et quelle quantité reste disponible après approvisionnement.",
        "pt_BR": "Esta camada exibe a <h>DISPONIBILIDADE</> dos produtos e serviços oferecidos por esta construção aos <h>lotes senhoriais</>. {br}{br}Ao passar o mouse sobre um tipo de produto ou serviço abaixo, uma camada indicará o nível de acesso dos <h>LOTES SENHORIAIS</> àquele tipo. Os <h>LOTES SENHORIAIS</> mais próximos sempre terão <h>DISPONIBILIDADE</> aos produtos e serviços oferecidos  primeiro. {br}{br}Além disso, o quadro de dica exibe quantos <h>LOTES SENHORIAIS</> estão sendo atendidos e qual a quantidade excedente dos produtos e serviços.",
        "pl_PL": "Ten widok przedstawia <h>dostępność</> zapewnianych przez ten budynek towarów i usług dla <h>parcel mieszkalnych</>.{br}{br}Po wskazaniu kursorem typu towaru lub usługi poniżej wyświetlona zostanie nakładka informująca o poziomie dostępu <h>parcel mieszkalnych</> do tego typu towaru lub usługi. <h>Dostępność</> towarów i usług zawsze dosięga najpierw najbliższych <h>parcel mieszkalnych</>.{br}{br}Ponadto okienko informacyjne wskazuje, ile <h>parcel mieszkalnych</> jest aktualnie zaopatrywanych i jak duża jest nadwyżka towaru lub usługi.",
        "ru_RU": "В этом режиме показана <h>доступность</> товаров и услуг, которыми данная постройка обеспечивает жителей <h>хозяйств</>.{br}{br}Если навести курсор на ту или иную категорию, у <h>хозяйств</> отобразится уровень доступа к соответствующему товару или услуге. В первую очередь товары и услуги становятся <h>доступны</> ближайшим <h>хозяйствам</>.{br}{br}Кроме того, вы можете посмотреть, сколько <h>хозяйств</> обеспечено на данный момент и сколько избыточных товаров у вас имеется.",
        "it_IT": "Questa visuale mostra la <h>disponibilità</> di risorse e attività fornite da questo edificio ai <h>burgage</>.{br}{br}Passando il mouse sul tipo di risorsa o attività in basso, una sovrapposizione indicherà il livello di accesso di <h>burgage</> a quel tipo di risorsa o attività. La <h>disponibilità</> di risorse e attività raggiunge sempre prima il <h>burgage</> più vicino.{br}{br}Inoltre, il suggerimento mostra quanti <h>burgage</> sono attualmente riforniti e la quantità di risorse o attività in eccesso.",
        "tr_TR": "Bu görünüm, bu yapının <h>Tımar Arazilerine</> sağladığı Malların ve Hizmetlerin <h>Mevcudiyetini</> gösterir.{br}{br}Aşağıdaki bir Mal veya Hizmet türünün üzerine geldiğinde bir gösterge, <h>Tımar Arazilerinin</> o türe erişim seviyesini gösterir. Malların ve Hizmetlerin <h>Mevcudiyeti</> her zaman ilk önce en yakın <h>Tımar Arazilerine</> ulaşır.{br}{br}Ayrıca bilgi çubuğu şu an kaç adet <h>Tımar Arazisine</> mal tedarik edildiğini ve ne kadar fazladan Mal ve Hizmet bulunduğunu gösterir.",
        "cs_CZ": "Tento pohled ukazuje <h>dostupnost</> zboží a služeb, které tato budova poskytuje <h>držebním domům</>.{br}{br}Když níže najedeš kurzorem na druh zboží nebo služby, překrytí ti ukáže přístup <h>držebních domů</> k danému druhu. <h>Dostupnost</> zboží a služeb je vždy nejvyšší u těch nejbližších <h>držebních domů</>.{br}{br}Popisek navíc udává, kolik <h>držebních domů</> se momentálně zásobuje a jak velký je přebytek zboží a služeb.",
        "hu_HU": "Ez a nézet az épület által a <h>Polgári parcellák</> számára nyújtott áruk és szolgáltatások <h>elérhetőségét</> mutatja.{br}{br}Alább valamelyik áru- vagy szolgáltatástípus fölé víve az egeret láthatod a <h>Polgári parcellák</> hozzáférési szintjét az adott típushoz. Az áruk és szolgáltatások <h>elérhetősége</> mindig a legközelebbi <h>Polgári parcellát</> éri el először.{br}{br}Az eszköztipp emellett megmutatja, hogy jelenleg hány <h>Polgári parcella</> van ellátva, és hogy az adott áruból vagy szolgáltatásból mennyi a többlet.",
        "uk_UA": "Тут показано <h>наявність</> товарів і послуг, що надаються цією будівлею <h>господарствам</>.{br}{br}Якщо навести вказівник миші на тип товару або послуги нижче, відобразиться рівень доступу <h>господарств</> до цього типу. <h>Наявність</> товарів і послуг завжди в першу чергу охоплює найближчі <h>господарства</>.{br}{br}Крім того, підказка показує, скільки <h>господарств</> зараз забезпечено, а також яка кількість товару чи послуги залишилася.",
        "da_DK": "Denne oversigt viser <h>tilgængeligheden</> af varer og ydelser, som bygningen forsyner <h>borgerlodderne</> med.{br}{br}Hvis du holder musen over typen af vare eller ydelse, kan du se, hvor god adgang <h>borgerlodderne</> har til den pågældende type. <h>Tilgængeligheden</> af varer og ydelser når altid først frem til de nærmeste <h>borgerlodder</>.{br}{br}Derudover viser værktøjstippet, hvor mange <h>borgerlodder</>, der i øjeblikket er forsynede, og hvor mange varer og tjenester, der er i overskud.",
        "nl_NL": "Dit zicht toont de <h>beschikbaarheid</> van goederen en diensten die door dit gebouw worden geleverd aan de <h>pachtkavels</>.{br}{br}Als je de cursor boven de soort goederen of diensten hieronder houdt, laat een overlay de beschikbaarheid van die soort zien voor <h>pachtkavels</>. Goederen en diensten worden altijd als eerste <h>beschikbaar</> voor de <h>pachtkavels</> die het dichtst in de buurt zijn.{br}{br}Daarnaast laat de tooltip zien hoeveel <h>pachtkavels</> momenteel worden bevoorraad, en hoe groot het overschot is van de goederen of diensten.",
        "sv_SE": "Den här vyn visar <h>vilka varor och tjänster</> som den här byggnaden kan ge till <h>hyrestomterna</>.{br}{br}Genom att hålla markören över de olika varorna och tjänsterna nedan dyker det upp ett överlägg som visar om <h>hyrestomterna</> har tillgång till den sorten. <h>Varorna och tjänsterna</> når alltid de närmsta <h>hyrestomterna</> först.{br}{br}Infofönstret visar även hur många <h>hyrestomter</> som får varor och tjänster, och huruvida det finns ett överskott."
      },
      "market_limits": {
        "en_US": "Supply limits",
        "zh_CN": "供给上限",
        "zh_TW": "供應上限",
        "ja_JA": "物資供給の上限",
        "ko_KR": "공급 한도",
        "de_DE": "Angebotslimits",
        "es_ES": "Límites de la oferta",
        "fr_FR": "Limites d'approvisionnement",
        "pt_BR": "Limites de suprimento",
        "pl_PL": "Granice podaży",
        "ru_RU": "Ограничение спроса",
        "it_IT": "Limiti di offerta",
        "tr_TR": "Arz sınırları",
        "cs_CZ": "Limity nabídky",
        "hu_HU": "Ellátási korlátok",
        "uk_UA": "Ліміт пропозиції",
        "da_DK": "Forsyningsgrænser",
        "nl_NL": "Voorraadbeperking",
        "sv_SE": "Tillgångsbegränsningar"
      },
      "current_town_size": {
        "en_US": "Settlement size",
        "zh_CN": "定居点规模",
        "zh_TW": "聚落規模",
        "ja_JA": "居留地の規模",
        "ko_KR": "정착지 규모",
        "de_DE": "Siedlungsgröße",
        "es_ES": "Tamaño del asentamiento",
        "fr_FR": "Taille de la colonie",
        "pt_BR": "Tamanho do assentamento",
        "pl_PL": "Wielkość osady",
        "ru_RU": "Размер поселения",
        "it_IT": "Dimensioni dell'insediamento",
        "tr_TR": "Yerleşim boyutu",
        "cs_CZ": "Velikost osady",
        "hu_HU": "Település mérete",
        "uk_UA": "Розмір поселення",
        "da_DK": "Bosættelsens størrelse",
        "nl_NL": "Grootte nederzetting",
        "sv_SE": "Bosättningsstorlek"
      },
      "load_custom_coat": {
        "en_US": "Load a custom texture",
        "zh_CN": "加载自定义纹理",
        "zh_TW": "載入自訂紋理",
        "ja_JA": "カスタムテクスチャのロード",
        "ko_KR": "커스텀 텍스처 불러오기",
        "de_DE": "Benutzerdefinierte Textur laden",
        "es_ES": "Cargar textura personalizada",
        "fr_FR": "Charger une texture personnalisée",
        "pt_BR": "Carregar textura personalizada",
        "pl_PL": "Wczytaj własną teksturę",
        "ru_RU": "Загрузить свою текстуру",
        "it_IT": "Carica una texture personalizzata",
        "tr_TR": "Özel doku yükle",
        "cs_CZ": "Načíst vlastní texturu",
        "hu_HU": "Egyéni textúra betöltése",
        "uk_UA": "Завантажити користувацьку текстуру",
        "da_DK": "Indlæs en brugerdefineret tekstur",
        "nl_NL": "Een aangepaste texture laden",
        "sv_SE": "Ladda en anpassad textur"
      },
      "load_custom_coat_descr": {
        "en_US": "Go to Drive/Users/Username/AppData/Local/ManorLords/Saved/SaveGames/ and place your square custom_coat.png file to import your custom graphic for the coat of arms and the banner.",
        "zh_CN": "前往 Drive/Users/Username/AppData/Local/ManorLords/Saved/SaveGames/ 放置你的 square custom_coat.png 文件，即可自定义家族纹章与旗帜外观。",
        "zh_TW": "前往 Drive/Users/Username/AppData/Local/ManorLords/Saved/SaveGames/ 並放置你的 square custom_coat.png file 即可匯入自訂紋章及旗幟圖案。",
        "ja_JA": "以下のフォルダ（Drive/Users/Username/AppData/Local/ManorLords/Saved/SaveGames/）に正方形の画像ファイル（custom_coat.png）を格納すると、あなたがデザインした紋章と旗が読み込まれます。",
        "ko_KR": "Drive/Users/AppData/ManorLords/Saved/SavedGames 폴더에 custom_coat.png라는 이름으로 사각형 이미지 파일을 넣으면 나만의 커스텀 상징을 게임에 추가할 수 있습니다.",
        "de_DE": "Öffnet Drive/Users/Username/AppData/Local/ManorLords/Saved/SaveGames/ und platziert „square custom_coat.png“, um Eure benutzerdefinierte Graphik als Wappen und Banner importieren zu können.",
        "es_ES": "Ve a (Tu equipo)/Users/(Tu usuario)/AppData/Local/ManorLords/Saved/SaveGames/ y coloca allí tu archivo cuadrado en png con el nombre «custom_coat.png» para importar una imagen personalizada que poder usar en el escudo heráldico y bandera de tu líder.",
        "fr_FR": "Ouvrez le dossier C:/Utilisateurs/(nom d'utilisateur)/AppData/Local/ManorLords/Saved/SaveGames/ et déposez un fichier au format carré nommé custom_coat.png afin d'importer un dessin personnalisé pour votre blason et votre bannière.",
        "pt_BR": "Acesse a pasta Drive/Users/Username/AppData/Local/ManorLords/Saved/SaveGames/ e deixe um arquivo quadrado identificado como custom_coat.png para importar uma imagem personalizada para ser seu brasão e estandarte.",
        "pl_PL": "Przejdź do folderu Drive/Users/Username/AppData/Local/ManorLords/Saved/SaveGames/ i umieść w nim swój kwadratowy obraz custom_coat.png, by móc zaimportować własną grafikę na herb i sztandar.",
        "ru_RU": "В качестве текстуры для герба и знамени вы можете использовать свое изображение: убедитесь, что оно имеет квадратную форму, сохраните его под названием custom_coat.png и скопируйте файл в директорию «[диск]/Users/[имя пользователя]/AppData/Local/ManorLords/Saved/SaveGames/».",
        "it_IT": "Vai in Drive/Users/Username/AppData/Local/ManorLords/Saved/SaveGames/ e inserisci un file custom_coat.png per importare la tua grafica personale per il blasone e il vessillo.",
        "tr_TR": "Arma ve sancak için özel bir görsel yüklemek istersen kare biçimindeki custom_coat.png dosyanı Drive/Users/Username/AppData/Local/ManorLords/Saved/SaveGames/ konumuna yerleştirebilirsin.",
        "cs_CZ": "Pokud chceš importovat vlastní grafiku pro erb a prapor, otevři složku Drive/Users/Username/AppData/Local/ManorLords/Saved/SaveGames/ a vlož tam vlastní soubor custom_coat.png.",
        "hu_HU": "Menj a Drive/Users/Username/AppData/Local/ManorLords/Saved/SaveGames/ mappába, és oda helyezd el a négyzet alakú custom_coat.png fájlt, hogy egyéni képet importálhass a címerhez és a zászlóhoz.",
        "uk_UA": "Виберіть Drive/Users/Username/AppData/Local/ManorLords/Saved/SaveGames/ і розмістіть там ваш файл custom_coat.png, щоб імпортувати користувацьке зображення для герба й прапора.",
        "da_DK": "Placér din kvadratiske custom_coat.png-fil i Drev\\Users\\Brugernavn\\AppData\\Local\\ManorLords\\Saved\\SaveGames\\, så kan du bruge din egen grafik til våbenskjoldet og banneret.",
        "nl_NL": "Ga naar Drive/Users/Username/AppData/Local/ManorLords/Saved/SaveGames/ en plaats daar je vierkante bestand genaamd custom_coat.png om je aangepaste afbeelding te importeren voor het wapen en de vaandel.",
        "sv_SE": "Gå till Enhet/Användare/Användarnamn/AppData/Local/ManorLords/Saved/SaveGames/ och lägg en kvadratisk png-fil med namnet custom_coat.png där för att importera din egen bild till vapenskölden och fanan."
      }
    }
  }
]