[
  {
    "Type": "DataTable",
    "Name": "DT_Translation_Diplomacy",
    "Class": "UScriptClass'DataTable'",
    "Flags": "RF_Public | RF_Standalone | RF_Transactional | RF_WasLoaded | RF_LoadCompleted",
    "Properties": {
      "RowStruct": {
        "ObjectName": "ScriptStruct'LocalizedText'",
        "ObjectPath": "/Script/ManorLords"
      }
    },
    "Rows": {
      "welcome_positive": {
        "en_US": "It's a pleasure to meet you.",
        "zh_CN": "很高兴见到你。",
        "zh_TW": "很高興認識你。",
        "ja_JA": "そなたに会えて嬉しい。",
        "ko_KR": "만나서 반갑군.",
        "de_DE": "Es ist mir ein Vergnügen, Euch kennenzulernen.",
        "es_ES": "Es todo un placer.",
        "fr_FR": "C’est un plaisir de faire votre connaissance.",
        "pt_BR": "É um prazer lhe conhecer.",
        "pl_PL": "Miło mi cię poznać.",
        "ru_RU": "Рад нашей встрече.",
        "it_IT": "Piacere di conoscerti.",
        "tr_TR": "Seninle tanışmak güzel.",
        "cs_CZ": "Je mi ctí, že tě poznávám.",
        "hu_HU": "Örülök, hogy megismerhetlek.",
        "uk_UA": "Радий нашій зустрічі.",
        "da_DK": "Det er en fornøjelse at møde dig.",
        "nl_NL": "Leuk om kennis met u te maken.",
        "sv_SE": "Angenämt."
      },
      "welcome_negative": {
        "en_US": "Ah, yet another dog has crawled here.",
        "zh_CN": "啊，又有一条狗蹑手蹑脚过来了。",
        "zh_TW": "啊，又有一條狗前來奉承了。",
        "ja_JA": "やれやれ、また犬が寄ってきたか。",
        "ko_KR": "아, 어디서 또 개가 짖는군.",
        "de_DE": "Aha. Noch mehr räudiges Ungeziefer.",
        "es_ES": "Anda, no me esperaba toparme con más arrastrados.",
        "fr_FR": "Tiens, voilà encore un pendard qui débarque.",
        "pt_BR": "Ah, vejo que mais um cão se arrastou até aqui.",
        "pl_PL": "Ach, przyczołgał się kolejny kundel...",
        "ru_RU": "А, очередная приблудная псина.",
        "it_IT": "Ah, guarda come strisciano fin qui con la coda tra le gambe.",
        "tr_TR": "Ah, bir köpek daha sürünerek buraya gelmiş.",
        "cs_CZ": "Á, připlazil se sem další pes.",
        "hu_HU": "Ah, még egy kutya kúszott ide.",
        "uk_UA": "А, чергова приблуда.",
        "da_DK": "Nå, endnu en hund er kravlet hertil.",
        "nl_NL": "Ah, er is weer een hond hierheen gekropen.",
        "sv_SE": "Jaha, ännu en fähund har letat sig hit."
      },
      "welcome_hildebolt_open_positive": {
        "en_US": "Greetings, Hildebolt von Bereneute, the rightful lord of Selbitz and Hofstetten.",
        "zh_CN": "你好，希尔德伯特·冯·贝罕诺特，塞尔比茨与霍夫施泰滕尊贵的领主大人。",
        "zh_TW": "你好，塞爾比茨和霍夫施泰滕的尊貴領主，希爾德伯特·馮·貝罕諾特。",
        "ja_JA": "ご機嫌よう。ゼルビッツとホーフシュテッテンの正統なる領主、ヒルデボルト・フォン・ベレヌート卿。",
        "ko_KR": "반갑군, 젤비츠와 호프슈테텐의 정당한 영주인 힐데볼트 폰 베레네우트.",
        "de_DE": "Seid gegrüßt! Hildebolt von Bereneute, rechtmäßiger Herr von Selbitz und Hofstetten.",
        "es_ES": "Mis más cordiales saludos, Hildebolt von Bereneute, figura legítima al mando de Selbitz y Hofstetten.",
        "fr_FR": "Bienvenue, Hildebolt von Bereneute, souverain légitime de Selbitz et Hofstetten.",
        "pt_BR": "Eu lhe saúdo, Hildebolt von Bereneute, o justo lorde de Selbitz e Hofstetten.",
        "pl_PL": "Witaj, Hildebolcie von Bereneute, prawowity władco Selbitzu i Hofstettenu.",
        "ru_RU": "Приветствую! Хильдебольт фон Беренойте, полноправный владетель Зельбица и Хофштеттена.",
        "it_IT": "Saluti, Hildebolt von Bereneute, legittimo signore di Selbitz e Hofstetten.",
        "tr_TR": "Merhaba Hildebolt von Bereneute, Selbitz ve Hofstetten'ın meşru lordu.",
        "cs_CZ": "Zdravím tě, Hildebolte von Bereneute, právoplatný pane Selbitzu a Hofstettenu.",
        "hu_HU": "Üdvözöllek, Hildebolt von Bereneute, Selbitz és Hofstetten jogos ura!",
        "uk_UA": "Вітаю! Гільдебольт фон Беренойте, повноправний володар Зельбіца і Хофштеттена.",
        "da_DK": "Vær hilset, Hildebolt von Bereneute, Selbitz' og Hofstettens retmæssige hersker.",
        "nl_NL": "Gegroet, Hildebolt von Bereneute, de rechtmatige heer van Selbitz en Hofstetten.",
        "sv_SE": "Var hälsad, Hildebolt von Bereneute. Selbitz och Hofstettens rättmätiga härskare."
      },
      "welcome_hildebolt_open_positive_followup_peaceful": {
        "en_US": "I am interested in knowing more about you and your plans, for I share your desire to bring peace and stability to these regions, which have been plagued by war and turmoil.",
        "zh_CN": "我对你和你的计划都很感兴趣，因为我和你一样，想要为这些饱经战争与动乱的地方，带来和平与安宁。",
        "zh_TW": "我很樂意深入了解你和你的計畫，因為我們都渴望為這些地區帶來和平與穩定，戰爭與混亂在這裡肆虐太久了。",
        "ja_JA": "そなたのことと今後の目指すところについて知りたい。私もまた、長らく戦争と混乱に苦しんできたこの地に、平和と安定をもたらすことを望んでいる。",
        "ko_KR": "그대와 앞으로의 계획에 관해 자세히 알고 싶군. 이 지역은 전쟁과 혼란으로 고통을 겪고 있지. 그 와중에 그대가 평화와 안정을 위해 애쓰고 있다는 것 알아. 나도 마찬가지일세.",
        "de_DE": "Ich bin daran interessiert, mehr über Euch und Eure Pläne zu erfahren, denn es ist mein Wunsch, diesen Landen, die in der Vergangenheit von Kriegen und Tumult heimgesucht wurden, Frieden und Stabilität zu bringen.",
        "es_ES": "Me interesa conocer los detalles que quiera compartirme sobre sus planes, pues me gustaría traer la paz y la estabilidad a estas regiones, tan asoladas por la guerra y otras tempestades. Empresa que creo le resulta familiar.",
        "fr_FR": "Je souhaiterais en savoir davantage à votre sujet et connaître vos projets. Je suis moi aussi désireux de rétablir la paix et la stabilité dans ces contrées, qui sont rongées par la guerre et le chaos.",
        "pt_BR": "Tenho interesse em saber mais sobre você e seus planos, pois compartilho seu desejo de trazer paz e estabilidade para estas regiões castigadas por guerras e transtornos.",
        "pl_PL": "Interesują mnie Twoje plany i Twoja osoba, albowiem podzielam Twe pragnienia zaprowadzenia spokoju i porządku w tych okolicach, trapionych dotąd wojną i zamętem.",
        "ru_RU": "Мне бы хотелось узнать больше о ваших планах, поскольку я разделяю ваше стремление привнести мир и порядок на эти земли, разоренные войной.",
        "it_IT": "Desidero saperne di più sul tuo conto e sui tuoi piani. Condivido infatti il tuo nobile intento di riportare la pace e la stabilità in queste terre tormentate dalla guerra e dai disordini.",
        "tr_TR": "Sizi ve planlarınızı daha yakından tanımak isterim zira savaş ve kargaşadan muzdarip bu bölgelere barışı ve istikrarı getirme isteğinizi ben de paylaşıyorum.",
        "cs_CZ": "Zajímají mě podrobnosti o tobě a tvých plánech, neboť i já chci vnést mír a klid do těchto krajů, které sužuje válka a zmatek.",
        "hu_HU": "Szeretnék többet tudni rólad és a terveidről, mert osztozom a vágyadban, hogy békét és stabilitást hozz ezekre a háborútól és zűrzavartól sújtott vidékekre.",
        "uk_UA": "Мені б хотілося дізнатися більше про ваші плани, оскільки я поділяю ваше прагнення привнести мир і порядок на ці землі, розорені війною.",
        "da_DK": "Jeg vil gerne vide mere om dig og dine planer, for jeg deler dit ønske om at bringe fred og stabilitet til disse områder, som har været plaget af krig og tumult.",
        "nl_NL": "Ik zou graag meer willen weten over u en uw plannen, want ik deel uw verlangen om vrede en stabiliteit naar deze gebieden te brengen, die zijn geplaagd door oorlog en onrust.",
        "sv_SE": "Jag skulle vilja veta mer om dig och dina planer, för precis som du vill jag bringa ordning och fred till dessa regioner. Få ett slut på allt krig och alla plågor."
      },
      "welcome_hildebolt_open_positive_followup_peaceful_1": {
        "en_US": "I believe that we can work together for the common good, and that we can achieve great things.",
        "zh_CN": "相信我们可以一起合作，共创辉煌。",
        "zh_TW": "相信我們可以攜手合作，互相共好，創造輝煌的事業。",
        "ja_JA": "我々が力を合わせれば、大いなる目的のためにさらなる偉業を挙げることもできよう。",
        "ko_KR": "우린 힘을 합쳐서 공동의 이익을 노릴 수 있다고 믿는다네. 위업을 해낼 수 있다고 말이야.",
        "de_DE": "Ich denke, dass wir zum Wohl der Gesellschaft zusammenarbeiten und Großes erreichen können.",
        "es_ES": "Opino que una cooperación entre ambas partes nos permitirá velar por el bien común y cosechar, así, grandes triunfos.",
        "fr_FR": "Je crois que nous pouvons œuvrer ensemble pour le bien commun et faire des miracles.",
        "pt_BR": "Acredito que possamos trabalhar em conjunto pelo bem comum e que podemos obter grandes resultados.",
        "pl_PL": "Wierzę, iż będziemy współpracować dla wspólnego dobra i że dzięki temu osiągniemy wielkie rzeczy.",
        "ru_RU": "Я полагаю, мы можем объединить усилия ради общего блага и вместе добиться больших успехов.",
        "it_IT": "Confido che, unendo i nostri sforzi per un bene comune, potremo raggiungere traguardi ambiziosi.",
        "tr_TR": "Herkesin iyiliği için birlikte çalışabileceğimize ve harika şeyler başarabileceğimize inanıyorum.",
        "cs_CZ": "Domnívám se, že můžeme spolupracovat v zájmu obecného blaha a dosáhnout společně velkých věcí.",
        "hu_HU": "Hiszem, hogy együttműködhetünk a közjó érdekében, és hogy nagy dolgokat érhetünk el.",
        "uk_UA": "Я вважаю, що ми можемо об'єднати зусилля заради спільного блага і разом досягти великих успіхів.",
        "da_DK": "Jeg tror, at vi kan arbejde sammen til vores fælles bedste, og at vi kan opnå storslåede resultater.",
        "nl_NL": "Ik denk dat wij samen kunnen werken voor het gemeenschappelijk belang, en dat we samen prachtige dingen kunnen doen.",
        "sv_SE": "Tillsammans kan vi skapa en ljusare framtid och åstadkomma stordåd."
      },
      "welcome_hildebolt_open_positive_followup_flatter": {
        "en_US": "I write to you with admiration and curiosity, for I have heard much about you and your deeds.",
        "zh_CN": "我怀着一颗敬慕与好奇之心写下此信，先前我已听说过太多你的故事和事迹。",
        "zh_TW": "我懷著仰慕和好奇的心寫信給你，因為我聽聞許多關於你和相關事蹟的傳聞。",
        "ja_JA": "そなたの業績については多くのことを聞いている故に、敬意と興味を込めてこの手紙をしたためる。",
        "ko_KR": "그대와 그대의 행적에 관해 들은 이야기가 많기에, 감탄과 호기심을 담아서 이 편지를 쓴다네.",
        "de_DE": "Ich schreibe Euch voller Bewunderung und Neugier, da ich schon vielerlei über Euch und Eure Taten gehört habe.",
        "es_ES": "El motivo de mi mensaje no es otro que expresar mi más absoluta admiración. Aunque he de admitir que siento curiosidad por su persona, pues me han hablado mucho de sus gestas.",
        "fr_FR": "Je vous transmets toute mon admiration et ma curiosité, car j’ai beaucoup entendu parler de vous et de vos exploits.",
        "pt_BR": "Eu lhe escrevo com admiração e curiosidade, pois ouvi muito sobre você e seus feitos.",
        "pl_PL": "Piszę do Ciebie z podziwem i ciekawością, gdyż wiele słyszy się o Tobie i Twoich czynach.",
        "ru_RU": "Я пишу вам с чувством восторга и любопытства, ибо наслышан о вас и ваших свершениях.",
        "it_IT": "Mosso da ammirazione e vivida curiosità, ti scrivo per farti giungere i miei complimenti per le tue imprese, di cui ho tanto sentito parlare.",
        "tr_TR": "Size ve başarılarınıza dair çok şey duyduğumdan bu mektubu size hayranlık ve merak içinde yazıyorum.",
        "cs_CZ": "Píši ti s obdivem a zvědavostí, neb o tobě i tvých skutcích se mi již doneslo mnohé.",
        "hu_HU": "Csodálattal és kíváncsisággal írok Néked, mert sokat hallottam terólad és tetteidről.",
        "uk_UA": "Я пишу вам із почуттям захоплення і цікавості, бо чув про вас і ваші звершення.",
        "da_DK": "Jeg skriver til dig med beundring og nysgerrighed, for jeg har hørt meget om dig og dine bedrifter.",
        "nl_NL": "Ik schrijf naar u met bewondering en nieuwsgierigheid, want ik heb veel gehoord over u en uw daden.",
        "sv_SE": "Det är med beundran och nyfikenhet jag skriver till dig, för jag har hört om dina bragder."
      },
      "welcome_hildebolt_open_positive_followup_flatter_1": {
        "en_US": "You have risen to power and glory, despite the obstacles and enemies that stood in your way.",
        "zh_CN": "你已升至力量和荣耀的殿堂，无惧困难与沿途的敌人。",
        "zh_TW": "儘管有許多障礙和敵人擋住你的道路，你依然能夠崛起，獲得權力與榮耀。",
        "ja_JA": "数々の困難と敵を乗り越え、そなたは力と名誉を勝ち取った。",
        "ko_KR": "온갖 장애물과 적이 앞을 가로막는 와중에도 권세와 영광을 손에 쥐었다지.",
        "de_DE": "Trotz Widrigkeiten und Feinden, die sich Euch in den Weg stellten, habt Ihr Ruhm und Macht erlangt.",
        "es_ES": "A pesar de todos los enemigos y obstáculos que han tratado de interponerse en su camino, es gloriosa la forma en la que ha logrado sobreponerse y alzarse en el poder.",
        "fr_FR": "Vous avez accédé au pouvoir et à la gloire, malgré les obstacles et les ennemis qui vous barraient la route.",
        "pt_BR": "Você obteve poder e glória, mesmo com os obstáculos e inimigos que se puseram em seu caminho.",
        "pl_PL": "Zdobyłeś władzę i chwałę pomimo przeszkód i wrogów stojących na Twojej drodze.",
        "ru_RU": "Вы обрели славу и могущество, несмотря на то что на вашем пути стояло множество преград и врагов.",
        "it_IT": "Hai conseguito potere e gloria, nonostante gli ostacoli e i nemici che si sono presentati sul tuo cammino.",
        "tr_TR": "Yolunuzda duran engellere ve düşmanlara rağmen güç ve şana eriştiniz.",
        "cs_CZ": "Získal sis moc i slávu navzdory překážkám a nepřátelům, již ti stáli v cestě.",
        "hu_HU": "Hatalomra és dicsőségre emelkedtél, az utadba álló akadályok és ellenségek ellenére.",
        "uk_UA": "Ви здобули славу й могутність, незважаючи на те що на вашому шляху стояло безліч перешкод і ворогів.",
        "da_DK": "Du har opnået magt og storhed på trods af de forhindringer og fjender, der har stået i vejen for dig.",
        "nl_NL": "U heeft veel macht en roem vergaard, ondanks de obstakels en vijanden die op uw pad kwamen.",
        "sv_SE": "Du har vunnit ära och makt i skuggan av alla hot och hinder."
      },
      "welcome_hildebolt_open_positive_followup_flatter_2": {
        "en_US": "You have my admiration and curiosity, and I hope to earn yours.",
        "zh_CN": "我对你充满了敬慕与好奇，希望我也能够赢得你的尊重。",
        "zh_TW": "我對你充滿仰慕和好奇，希望也能獲得你的尊重。",
        "ja_JA": "そなたに敬意と興味を持っているが故に、その信頼も得たいと思っている。",
        "ko_KR": "감탄과 호기심을 전하고 싶군. 그대에 대해 알고 싶은 게 많아.",
        "de_DE": "Seid Euch meiner Neugier und Bewunderung gewiss. Ich hoffe, ich kann mir im Gegenzug die Eure verdienen.",
        "es_ES": "No siento más que admiración y curiosidad hacia su figura. Espero poder ganarme lo mismo por su parte.",
        "fr_FR": "Vous avez toute mon admiration et ma curiosité, et j'espère gagner les vôtres.",
        "pt_BR": "Você tem minhas admiração e curiosidade, espero que o sentimento venha a ser recíproco.",
        "pl_PL": "Masz mój szacunek i zainteresowanie, a ja mam nadzieję zasłużyć na to samo z Twojej strony.",
        "ru_RU": "Вы заслужили мое восхищение и любопытство, и я надеюсь заслужить ваше.",
        "it_IT": "Hai suscitato in me grande ammirazione e curiosità. Spero di poter, in futuro, guadagnare la tua stima.",
        "tr_TR": "Size karşı duyduğum hayranlığı ve merakı gelecekte bana karşı duyacağınızı umuyorum.",
        "cs_CZ": "Podařilo se ti vzbudit můj obdiv a zvídavost a doufám, že se to samé podaří i mně.",
        "hu_HU": "Csodálattal és kíváncsisággal tekintek rád, és remélem, hogy én is kiérdemlem a tiédet.",
        "uk_UA": "Ви заслужили моє захоплення і цікавість, і я сподіваюся заслужити ваше.",
        "da_DK": "Du har min beundring og nysgerrighed, og jeg håber på at opnå din.",
        "nl_NL": "U heeft mijn bewondering en nieuwsgierigheid, en ik hoop die van u te verdienen.",
        "sv_SE": "Jag är både beundrad och nyfiken och hoppas du känner detsamma."
      },
      "welcome_hildebolt_open_negative": {
        "en_US": "I write to you with disdain and suspicion, for I have heard much about you and your crimes.",
        "zh_CN": "我怀着一颗敬慕与好奇之心写下此信，先前我已听说过太多你的故事和罪恶。",
        "zh_TW": "我帶著鄙視和懷疑寫信給你，因為我聽到許多關於你和相關罪行的報告。",
        "ja_JA": "そなたの悪行については多くのことを耳にしているが故に、軽蔑と不信感を持ってこの手紙をしたためる。",
        "ko_KR": "그대와 그대의 죄에 관해 들은 이야기가 많기에, 경멸과 의심을 담아서 이 편지를 쓴다네.",
        "de_DE": "Ich schreibe Euch voll Argwohn und Verachtung, da ich schon vielerlei über Euch und Eure Verbrechen gehört habe.",
        "es_ES": "He de confesar que la sospecha y el desdén son los autores de este mensaje, pues sus crímenes han llegado a mis oídos.",
        "fr_FR": "J’ai beaucoup entendu parler de vous et de vos crimes, c’est donc avec méfiance et dédain que je vous écris.",
        "pt_BR": "Eu lhe escrevo com desdém e suspeita, pois ouvi muito sobre você e seus crimes.",
        "pl_PL": "Piszę do Ciebie z pogardą i podejrzliwością, gdyż wiele słyszy się o Tobie i Twoich występkach.",
        "ru_RU": "Я пишу вам с чувством презрения и недоверия, ибо наслышан о вас и ваших злодействах.",
        "it_IT": "Mosso da sdegno e sospetto, ti scrivo poiché ho sentito ho sentito parlare molto di te e delle tue malefatte.",
        "tr_TR": "Size ve suçlarınıza dair çok şey duyduğumdan bu mektubu size horgörü ve şüphe içinde yazıyorum.",
        "cs_CZ": "Píši ti s opovržením a podezřením, neb o tobě i tvých zločinech se mi již doneslo mnohé.",
        "hu_HU": "Megvetéssel és gyanakvással írok Néked, mert sokat hallottam rólad és a bűneidről.",
        "uk_UA": "Я пишу вам із почуттям презирства й недовіри, бо чув про вас і ваші лиходійства.",
        "da_DK": "Jeg skriver til dig med foragt og mistro, for jeg har hørt meget om dig og dine ugerninger.",
        "nl_NL": "Ik schrijf naar u met minachting en argwaan, want ik heb veel gehoord over u en uw misdaden.",
        "sv_SE": "Det är med ringaktning jag skriver till dig, för jag har hört om dina missgärningar."
      },
      "welcome_hildebolt_open_negative_followup": {
        "en_US": "You have seized power and wealth, despite the laws that forbade you. ",
        "zh_CN": "你获得了力量与财富，挣脱了法律的束缚。 ",
        "zh_TW": "儘管有種種法律束縛，你依然奪得了權力和財富。",
        "ja_JA": "そなたは数々の不正を働き、富と権力を手にした。",
        "ko_KR": "그대를 용납지 않는 법률에도 불구하고 부와 권세를 손에 쥐었더군. ",
        "de_DE": "Ihr habt Euch Macht und Reichtum gerafft, obwohl die Gesetze es Euch versagten. ",
        "es_ES": "Su fortuna y poder los ha tomado por fuerza, no le pertenecen. Así lo dicta la ley, la misma que condena sus actos. ",
        "fr_FR": "Vous avez mis la main sur le pouvoir et la richesse, au mépris des lois qui vous l’interdisaient. ",
        "pt_BR": "Você acabou obtendo poder e riquezas, a despeito das leis que lhe impediam. ",
        "pl_PL": "Przejąłeś władzę i majątek, mimo iż prawo Ci tego zakazywało. ",
        "ru_RU": "Вы прибрали к рукам власть и богатство, при этом нарушив не один закон. ",
        "it_IT": "Hai ottenuto potere e ricchezza infrangendo le leggi che te lo impedivano. ",
        "tr_TR": "Önünüzde duran kanunlara rağmen gücü ve refahı zorla ele geçirdiniz. ",
        "cs_CZ": "Podařilo se ti uchvátit moc a bohatství navzdory zákonům, které stály proti tobě. ",
        "hu_HU": "Magadhoz ragadtad a hatalmat és gazdagságot, a törvények ellenére, amelyek megtiltották neked. ",
        "uk_UA": "Ви прибрали до рук владу й багатство, незважаючи на закони, які вам заважали. ",
        "da_DK": "Du har tilranet dig magt og rigdomme på trods af de love, der forbød dig det. ",
        "nl_NL": "U heeft veel macht en rijkdom gegrepen, ondanks de wetten die u dit verboden. ",
        "sv_SE": "Du har tillskansat dig ära och makt utan en tanke på lagen. "
      },
      "welcome_hildebolt_open_negative_followup_1": {
        "en_US": "You have shown yourself to be an unworthy occupant of these lands, and a bastard of lowly origin.",
        "zh_CN": "你不配在这片土地上生活，劣等基因的混蛋。",
        "zh_TW": "你不配擁有這片土地，出身下賤的私生子。",
        "ja_JA": "貴様は自ら、卑しき私生児であることを証明したのだ。この地に住むに値しない。",
        "ko_KR": "미천한 출신의 사생아이자 이 땅에 대해 자격이 없는 무단 점거자임을 스스로 보여줬어.",
        "de_DE": "Ihr seid erwiesenermaßen ein unwürdiger Besatzer dieser Lande und ein regelrechter Bastard niedrigsten Standes.",
        "es_ES": "Usted no se diferencia en nada de cualquier otro bastardo o plebeyo indigno. No está en posición de ocupar estas tierras.",
        "fr_FR": "Vous avez prouvé au monde que vous n’étiez pas digne d’occuper ces terres, tel un vulgaire bâtard.",
        "pt_BR": "Você demonstrou que não possui a dignidade para ocupar essas terras e que a ilegitimidade de seu nascimento se estende a todas as suas ações.",
        "pl_PL": "Okazałeś się niegodnym dręczycielem tych ziem, a na dodatek bękartem z gminu.",
        "ru_RU": "Вы показали себя безродной сволочью, недостойной занимать эти земли.",
        "it_IT": "Sei una canaglia di umili origini e hai dimostrato di non meritarti di occupare queste terre.",
        "tr_TR": "Bu toprakların haksız bir işgalcisi ve alçak soylu bir aşağılık olduğunuzu gösterdiniz.",
        "cs_CZ": "Prokázal jsi, že jsi nehoden obývat tyto kraje a že jsi parchant mrzkého původu.",
        "hu_HU": "Méltatlannak bizonyultál e földek birtoklására, és alacsony származású fattyúnak.",
        "uk_UA": "Ви показали себе безрідною наволоччю, негідною займати ці землі.",
        "da_DK": "Du har vist dig at være en uværdig indvåner i disse lande og en horeunge af ringe herkomst.",
        "nl_NL": "U heeft laten zien dat u een onwaardige bezetter bent van deze landen, en een proleet van laag allooi.",
        "sv_SE": "Du har visat dig vara en ovärdig härskare – en oäkting av ringa börd."
      },
      "welcome_hildebolt_open_negative_followup_2": {
        "en_US": "I am concerned about you and your actions, for I fear that you will bring more trouble and violence to these regions, which have been ravaged by war and chaos. ",
        "zh_CN": "我对你和你的行为感到担忧，因为我怕你会给这些饱受战乱摧残的地方，带去更多的暴力与混乱。 ",
        "zh_TW": "你和你的行為令我擔憂，因為我怕你會為這些地區帶來更多的問題和暴力，這些地區已經飽受戰爭和混亂的摧殘。",
        "ja_JA": "そなたの振る舞いに対して抱くのは懸念の一点だけだ。戦争と混乱で荒廃したこの地にさらなる混乱と暴力をもたらすのではないかと危惧している。",
        "ko_KR": "이 지역은 전쟁과 혼란으로 고통을 겪고 있지. 그대와 앞으로의 행적이 걱정이야. 더 많은 문제와 폭력만을 야기할 것이 뻔히 보이는 걸 어쩌겠나. ",
        "de_DE": "Ich bin wegen Euch und Eurer Taten besorgt, denn mich deucht, dass Ihr diesen Landen, die in der Vergangenheit schon zu oft von Krieg und Tumult heimgesucht wurden, weitere Schwierigkeiten und Gewalttaten bringen werdet. ",
        "es_ES": "He de admitir que me preocupan sus actos, pues temo que su presencia vaya de la mano de la violencia. No haría otra cosa que traer más problemas a una región que ya ha sufrido las penurias de la guerra y el caos. ",
        "fr_FR": "Vos agissements sont pour moi une source d'inquiétude. Je crains qu’ils ne fassent qu’empirer le chaos et la violence en ces contrées, déjà durement abîmées par la guerre et le désordre. ",
        "pt_BR": "Você e suas ações me preocupam, pois temo que você trará mais problemas e violência para essas regiões já castigadas por guerras e transtornos. ",
        "pl_PL": "Ty sam i Twoje poczynania są dla mnie powodem troski, albowiem obawiam się, że będziesz szerzyć więcej przemocy i zamieszania w krainach już i tak spustoszonych przez chaos i wojnę. ",
        "ru_RU": "Я обеспокоен ваши деяниями, так как боюсь, что вы привнесете смуту и бесчинства на эти земли, и без того разоренные войной. ",
        "it_IT": "Sono preoccupato per te e per le tue azioni, perché temo che porterai ancora più guai e violenza in queste regioni, già devastate dalla guerra e dal caos. ",
        "tr_TR": "Savaşla ve kargaşayla tahrip edilen bu bölgelere daha fazla sorun ve şiddet getireceğinizden korktuğum için size ve eylemlerinize dair endişeliyim. ",
        "cs_CZ": "Ty i tvé skutky mi dělají starosti, neb se obávám, že vneseš další násilí a potíže do těchto krajů, které byly zpustošeny válkou a zmatkem. ",
        "hu_HU": "Aggódom miattad és a tetteid miatt, mert attól tartok, hogy még több bajt és erőszakot hozol ezekre a háború és káosz dúlta vidékekre. ",
        "uk_UA": "Я стурбований вашими діяннями, бо боюся, що ви привнесете смуту й безчинства на ці землі, і без того розорені війною. ",
        "da_DK": "Jeg er bekymret for dig og dine handlinger, for jeg frygter, at du vil bringe mere ufred og vold til disse områder, som allerede er blevet hærget af krig og kaos. ",
        "nl_NL": "Ik ben bezorgd over u en uw handelingen, want ik vrees dat u meer problemen en geweld naar deze gebieden zult brengen, die al zijn verscheurd door oorlog en chaos. ",
        "sv_SE": "Du och dina förehavanden skrämmer mig; du lär besudla dessa regioner med ännu mer våld och oro. Detta efter krig och kaos i överflöd. "
      },
      "welcome_hildebolt_open_negative_followup_3": {
        "en_US": "You have my contempt and distrust, and I hope to inspire yours.",
        "zh_CN": "我对你只有鄙视和怀疑，希望能引起你的同感。",
        "zh_TW": "我鄙視你，不信任你，我也希望你能感同身受。",
        "ja_JA": "私はそなたに対して軽蔑と疑念を抱いている。同じように、そなたも私のことを軽蔑してくれ。",
        "ko_KR": "그대를 보고 있으면 경멸과 불신만이 떠올라. 아무쪼록 나도 그대에게 같은 감정을 일으키길 바라겠어.",
        "de_DE": "Seid Euch meiner Geringschätzung gewiss, da Ihr es selbst wohl nicht anders haltet. Ich misstraue Euch zutiefst.",
        "es_ES": "Le hago saber de mi desprecio y desconfianza hacia su persona. Espero inspirarle lo mismo.",
        "fr_FR": "Vous ne méritez que mon mépris et ma défiance, et j'espère vous inspirer des sentiments similaires.",
        "pt_BR": "Você tem meus desprezo e desconfiança, espero lhe inspirar o mesmo.",
        "pl_PL": "Czuję do Ciebie wyłącznie wzgardę i nieufność, i spodziewam się, że uczucia te zostaną odwzajemnione.",
        "ru_RU": "Вы заслужили мое презрение и недоверие, и я надеюсь внушить вам те же чувства.",
        "it_IT": "Hai il mio disprezzo e la mia diffidenza, e spero di suscitarti altrettanto.",
        "tr_TR": "Size karşı kin ve kuşku duymaktayım, ben de sizde aynı hisleri telkin etmeyi umuyorum.",
        "cs_CZ": "Podařilo se ti ve mně vyvolat pohrdání a nedůvěru a já doufám, že to samé vyvolám i já v tobě.",
        "hu_HU": "Megvetésem és bizalmatlanságom a tiéd, és remélem, te is hasonlóan érzel.",
        "uk_UA": "Ви заслужили моє презирство й недовіру, і я сподіваюся вселити вам ті ж почуття.",
        "da_DK": "Du har min foragt og mistro, som jeg håber på, at du vil komme til at gengælde.",
        "nl_NL": "U heeft mijn hoon en wantrouwen, en ik hoop dat ook bij u te inspireren.",
        "sv_SE": "Jag kokar av ilska och misstro, och hoppas att jag kan få dig att göra detsamma."
      },
      "welcome_from_hildebolt": {
        "en_US": "I have heard of your renown. I only seek to defend my rights and my honour against those who would wrong me. {br}{br}I hope you will not judge me by the rumours and slanders that some may spread about me.",
        "zh_CN": "我听说过你的威名。我只希望维护我自己的权利和荣耀不受恶人侵害。{br}{br}希望你不要受有心之人散布的流言和诬蔑，对我有所偏见。",
        "zh_TW": "我曾聽聞你的名聲。我只是想對抗以不公待我的人，捍衛我的權利和榮譽。{br}{br}希望你不要根據他人刻意散播的謠言和誹謗來評斷我。",
        "ja_JA": "そなたの名声については、よく耳にしている。私はただ、こちらを貶めようとする輩から権利と名誉を守ろうとしているだけだ。{br}{br}悪い噂には惑わされないでもらいたい。",
        "ko_KR": "그대의 명성에 대해서는 들은 바가 있다네. 나는 그저 내게 잘못을 저지르는 자들로부터 권리와 명예를 지키려는 것뿐이야.{br}{br}날 두고 퍼지는 헛된 소문과 비방만으로 날 판단하지는 말아주기를 바라지.",
        "de_DE": "Euer Ruf eilt Euch voraus. Ich wünsche nur, meine Rechte und meine Ehre gegen jene zu verteidigen, die mir Unrechtes tun. {br}{br}Ich hoffe, Ihr seht davon ab, die Gerüchte und Verleumdungen zu glauben, die manch einer über mich zu verbreiten scheint.",
        "es_ES": "Su fama y renombre no me es ajena, mas lo único que me mueve es la defensa de mi honor y mis derechos frente a aquellos que tratan de arremeter contra mí. {br}{br}Espero que sepa discernir la verdad de los rumores y calumnias que me rodean, y que eso no nuble su juicio.",
        "fr_FR": "Votre renommée vous précède. Je ne cherche qu’à défendre mes droits et mon honneur contre quiconque me voudrait du tort.{br}{br}J’espère que vous ne me jugerez pas au regard des rumeurs et des calomnies propagées par ceux qui souhaitent salir mon nom.",
        "pt_BR": "Eu ouvi sobre seus feitos e seu renome. Eu busco apenas defender meus direitos e minha honra contra aqueles que desejam meu mal. {br}{br}Espero que você não me julgue com base nos rumores e calúnias que alguns têm espalhado sobre mim.",
        "pl_PL": "Twa sława sięga daleko. Ja pragnę jedynie bronić mych praw i mego honoru przed łotrami, którzy źle mi życzą. {br}{br}Mam nadzieję, że nie osądzisz mnie wedle plotek i oszczerstw, które być może doszły do Twoich uszu.",
        "ru_RU": "До меня дошли рассказы о ваших свершениях. Я лишь хочу защитить свои права и свое доброе имя от посягательств недоброжелателей. {br}{br}Надеюсь, вы не будете судить обо мне по тем слухам и сплетням, что распространяют недоброхоты.",
        "it_IT": "La tua fama ti precede. Cerco solo di difendere i miei diritti e il mio onore da coloro che intendono lederli. {br}{br}Confido che non mi giudicherai in base a mere voci e calunnie che alcuni potrebbero diffondere sul mio conto.",
        "tr_TR": "Namınızı duydum. Yalnızca bana yanlış yapanlara karşı haklarımı ve onurumu savunmayı istiyorum. {br}{br}Umarım beni, bazılarının hakkımda yayabileceği söylentilere ve iftiralara göre yargılamazsınız.",
        "cs_CZ": "S tvým věhlasem jsem obeznámen. Chci jen bránit svá práva a čest proti těm, kteří mi ukřivdili. {br}{br}Doufám, že mne nebudeš soudit dle drbů a pomluv, jež o mně někteří šíří.",
        "hu_HU": "Ismerem a hírneved. Csak a jogaimat és a becsületemet akarom megvédeni rosszakaróimmal szemben. {br}{br}Remélem, nem a pletykák és rágalmak alapján ítélsz meg, amiket egyesek terjesztenek rólam.",
        "uk_UA": "До мене дійшли вісті про ваші звершення. Я лише хочу захистити свої права й добре ім'я від зазіхань недоброзичливців. {br}{br}Сподіваюся, ви не будете судити про мене за тими чутками й плітками, що поширюють деякі.",
        "da_DK": "Jeg kender dit omdømme. Jeg søger blot at forsvare min ret og min ære mod dem, der vil gøre mig uret. {br}{br}Jeg håber ikke, at du vil dømme mig på de rygter og den sladder, andre har spredt om mig.",
        "nl_NL": "Uw reputatie is u vooruitgesneld. Ik wil alleen mijn rechten en eer verdedigen tegen zij die kwaad in de zin hebben.{br}{br}Ik hoop dat u mij niet veroordeelt op basis van de leugens en laster die sommigen over mij verspreiden.",
        "sv_SE": "Jag har hört om dina bragder. Jag vill bara försvara min heder mot de som försöker dra mig i smutsen.{br}{br}Jag hoppas att du inte dömer ut mig på grund av alla tomma rykten folk och fä har för vana att sprida."
      },
      "welcome_response_positive": {
        "en_US": "Thank you for your hearty welcome.",
        "zh_CN": "谢谢你的欢迎，用心了。",
        "zh_TW": "感謝你誠懇的歡迎。",
        "ja_JA": "心温まる歓迎に感謝を申し上げたい。",
        "ko_KR": "진심 어린 환영의 인사는 고맙군.",
        "de_DE": "Danke für Euren herzlichen Empfang.",
        "es_ES": "Le agradezco tan caluroso recibimiento.",
        "fr_FR": "Je vous remercie de votre accueil chaleureux.",
        "pt_BR": "Agradeço pelas calorosas boas-vindas.",
        "pl_PL": "Dziękuję za serdeczne powitanie.",
        "ru_RU": "Благодарю вас за радушный прием.",
        "it_IT": "Ti ringrazio per il caloroso benvenuto.",
        "tr_TR": "Samimi karşılamanız için teşekkür ederim.",
        "cs_CZ": "Děkuji za vřelé přijetí.",
        "hu_HU": "Köszönöm a szívélyes fogadtatást.",
        "uk_UA": "Дякую вам за привітний прийом.",
        "da_DK": "Tak for din hjertelige velkomst.",
        "nl_NL": "Bedankt voor uw warme welkom.",
        "sv_SE": "Tack för det varma välkomnandet."
      },
      "welcome_response_negative": {
        "en_US": "Who the hell are you, sausage breath?",
        "zh_CN": "你算哪根葱？下贱胚子。",
        "zh_TW": "你是什麼東西，下賤之人？",
        "ja_JA": "貴様はいったい何者だ？息からソーセージの臭いが漂っているぞ。",
        "ko_KR": "근데 그대는 대체 누구길래 소시지 냄새나 풍기고 있는 건가?",
        "de_DE": "Und wer zur Hölle seid Ihr, Hundsfott?",
        "es_ES": "¿Y tú quién eres? Huele a perro mojado.",
        "fr_FR": "Et qui êtes-vous donc, espèce d’andouille faisandée ?",
        "pt_BR": "E quem diabos é você, bafo de linguiça?",
        "pl_PL": "Kim u diabła jesteś, czosnkozieju?",
        "ru_RU": "А это еще что за наглая харя?",
        "it_IT": "Ma chi diavolo sei, furfante dall'alito cattivo?",
        "tr_TR": "Bu nefesi leş gibi kokan da kim be?",
        "cs_CZ": "Co jsi k čertu zač, ty smradlavý kozle?",
        "hu_HU": "Ki a fene vagy te, hagymaszagú?",
        "uk_UA": "А це ще що за нахабна пика?",
        "da_DK": "Hvem fanden er du, pølseånde?",
        "nl_NL": "Wie bent u in godsnaam? U meurt naar worst.",
        "sv_SE": "Och vem är du, din lågpanna?"
      },
      "welcome_response_mediating": {
        "en_US": "I'm sorry, have I wronged you somehow?",
        "zh_CN": "抱歉，我冒犯到你了吗？",
        "zh_TW": "抱歉，我曾經得罪過你嗎？",
        "ja_JA": "すまないが、私が何か気に障ることでもしたか？",
        "ko_KR": "미안하네만 내가 무슨 잘못이라도 했나?",
        "de_DE": "Verzeihung, habe ich Euch irgendwie Unrecht getan?",
        "es_ES": "Disculpe, ¿es que acaso le he hecho algún mal?",
        "fr_FR": "Pardonnez-moi, vous ai-je causé du tort ?",
        "pt_BR": "Perdão, eu lhe fiz algum mal?",
        "pl_PL": "Przepraszam, czy uczyniłem Ci coś złego?",
        "ru_RU": "Прошу прощения, вы на меня за что-то в обиде?",
        "it_IT": "Mi dispiace, ti ho forse offeso in qualche modo?",
        "tr_TR": "Üzgünüm, size bir şekilde yanlış mı yaptım?",
        "cs_CZ": "Omlouvám se, stalo se ti snad z mé strany nějaké příkoří?",
        "hu_HU": "Bocsánat, valahogy megbántottalak?",
        "uk_UA": "Перепрошую, ви на мене за щось образилися?",
        "da_DK": "Undskyld mig, har jeg gjort dig uret på en eller anden måde?",
        "nl_NL": "Sorry, heb ik u iets misdaan?",
        "sv_SE": "Ursäkta? Har jag gjort nåt?"
      },
      "welcome_response_escalating": {
        "en_US": "Nice to meet you too, you filthy bastard.",
        "zh_CN": "很高兴见到你，肮脏的混蛋。",
        "zh_TW": "我也很高興認識你，下流的私生子。",
        "ja_JA": "こちらこそ、お目にかかれて光栄だ。下賎な者よ。",
        "ko_KR": "나도 만나서 반갑군. 그래도 자네가 개자식이란 사실은 변하지 않아.",
        "de_DE": "Schön Euch kennenzulernen, dreckiger Bastard.",
        "es_ES": "Un placer, vil indeseable.",
        "fr_FR": "Tout le plaisir est pour moi, sale bâtard.",
        "pt_BR": "É um prazer lhe conhecer também, verme desprezível.",
        "pl_PL": "Mnie też miło Cię poznać, nędzny bękarcie.",
        "ru_RU": "И тебе здорово, вшивая скотина.",
        "it_IT": "Piacere di conoscerti, sporca canaglia.",
        "tr_TR": "Sizinle tanışmak da güzel alçak herif.",
        "cs_CZ": "I já tě rád poznávám, ty parchante špinavý.",
        "hu_HU": "Én is örülök, hogy megismertelek, mocskos fattyú.",
        "uk_UA": "І тобі здорово, вшива скотиняка.",
        "da_DK": "Det er også rart at møde dig, din svinske skiderik.",
        "nl_NL": "Ook fijn om met u kennis te maken, smeerlap.",
        "sv_SE": "Hej på dig med, din luspudel."
      },
      "welcome_response_peace": {
        "en_US": "I hope our fiefdoms grow in prosperity together.",
        "zh_CN": "愿我们的领地共享繁荣。",
        "zh_TW": "希望我們的封地能共同邁向繁榮。",
        "ja_JA": "互いの領地が共に繁栄することを願おう。",
        "ko_KR": "아무쪼록 그대와 나의 영지가 함께 번영해 나가면 좋겠군.",
        "de_DE": "Ich hoffe, dass unsere Lehen gemeinsam wachsen und gedeihen werden.",
        "es_ES": "Deseo que nuestros señoríos prosperen juntos.",
        "fr_FR": "J’espère que nos fiefs pourront prospérer de concert.",
        "pt_BR": "Espero que nossos feudos cresçam e prosperem juntos.",
        "pl_PL": "Mam nadzieję, że nasze lenna będą wspólnie rosły w siłę.",
        "ru_RU": "Я надеюсь, мои и ваши владения ждет совместное процветание.",
        "it_IT": "Spero che i nostri feudi crescano insieme in prosperità.",
        "tr_TR": "Umarım derebeyliklerimiz birlikte refaha ulaşır.",
        "cs_CZ": "Doufám, že naše léna budou společným úsilím vzkvétat.",
        "hu_HU": "Remélem, hogy a hűbérbirtokaink együtt gyarapodnak a jólétben.",
        "uk_UA": "Я сподіваюся, на мої і ваші володіння чекає спільне процвітання.",
        "da_DK": "Jeg håber, at vores len kan vokse og blomstre sammen.",
        "nl_NL": "Mogen onze domeinen samen groeien in welvaart.",
        "sv_SE": "Måtte båda våra län blomstra av välstånd."
      },
      "welcome_response_to_hildebolt_positive": {
        "en_US": "You have proven yourself to be a true leader of Selbitz and Hofstetten.",
        "zh_CN": "你已经证明了自己，是塞尔比茨和霍夫施泰滕真正的领袖。",
        "zh_TW": "你證明了自己是塞爾比茨和霍夫施泰滕的真正領袖。",
        "ja_JA": "そなたはゼルビッツとホーフシュテッテンの真の指導者であることを証明した。",
        "ko_KR": "그대는 본인이 젤비츠와 호프슈테텐의 진정한 지도자임을 입증했어.",
        "de_DE": "Ihr habt Euch als würdiger Machthaber von Selbitz und Hofstetten erwiesen.",
        "es_ES": "Ha demostrado ser un buen líder de Selbitz y Hofstetten, de verdad.",
        "fr_FR": "Vous avez prouvé votre valeur en tant que dirigeant de Selbitz et Hofstetten.",
        "pt_BR": "Você provou ser a verdadeira liderança de Selbitz e Hofstetten.",
        "pl_PL": "Jesteś godnym przywódcą Selbitzu i Hofstettenu.",
        "ru_RU": "Вы показали себя настоящим правителем Зельбица и Хофштеттена.",
        "it_IT": "Hai dimostrato di saper guidare bene Selbitz e Hofstetten.",
        "tr_TR": "Selbitz ve Hofstetten için doğru lider olduğunuzu kanıtladınız.",
        "cs_CZ": "Prokázal jsi, že jsi skutečný vůdce Selbitzu a Hofstettenu.",
        "hu_HU": "Már bebizonyítottad, hogy Selbitz és Hofstetten igazi vezetője vagy.",
        "uk_UA": "Ви показали себе справжнім правителем Зельбіца й Хофштеттена.",
        "da_DK": "Du har vist dig at være en sand leder af Selbitz og Hofstetten.",
        "nl_NL": "U heeft zich bewezen als de ware leider van Selbitz en Hofstetten.",
        "sv_SE": "Du har visat dig vara en utmärkt ledare av Selbitz och Hofstetten."
      },
      "welcome_response_to_hildebolt_positive_1": {
        "en_US": "I have no doubt that you are the rightful heir of these lands, and that your bloodline is pure and noble.",
        "zh_CN": "我确信你是这片土地的合法继承人，你的血统纯正而高贵。",
        "zh_TW": "你是這片土地的合法繼承人，我毫不懷疑，你的血統既純正又高貴。",
        "ja_JA": "そなたがこの地の正統なる後継者であり、清らかで高貴なる血族であることは疑いようもない。",
        "ko_KR": "그대가 이 땅의 정당한 상속자이며, 순수하고 고귀한 혈통이란 사실을 믿어 의심치 않는다네.",
        "de_DE": "Ich zweifle nicht daran, dass Ihr der rechtmäßige Erbe dieser Lande seid, und bin von der Reinheit und Erlauchtheit Eures Geblüts überzeugt.",
        "es_ES": "No me cabe duda de que le corresponde heredar con total legitimidad estas tierras, veo la pureza y nobleza de su linaje.",
        "fr_FR": "Vous êtes à n’en pas douter l’héritier légitime de ces terres, de sang pur et noble.",
        "pt_BR": "Eu não tenho dúvidas do seu justo direito a essas terras, e de que sua linhagem é pura e nobre.",
        "pl_PL": "Nie mam wątpliwości, że jesteś prawowitym dziedzicem tych ziem i że Twój ród jest szlachetny i prawy.",
        "ru_RU": "Я не сомневаюсь, что вы правомочный наследник этих земель с безукоризненной родословной.",
        "it_IT": "Non ho alcun dubbio che queste terre ti spettino di diritto, e che il tuo lignaggio sia puro e nobile.",
        "tr_TR": "Bu toprakların meşru vârisi olduğunuza ve soyunuzun saflığı ile asilliğine dair bir şüphem yok.",
        "cs_CZ": "Nemám pochyb o tom, že jsi právoplatným dědicem a že tvá pokrevní linie je ryzí a urozená.",
        "hu_HU": "Nincs kétségem afelől, hogy te vagy e földek jogos örököse, és hogy a vérvonalad tiszta és nemes.",
        "uk_UA": "Я не сумніваюся у вашому бездоганному родоводі, як і в тому, що ви правомочно отримали ці землі у спадщину.",
        "da_DK": "Jeg er ikke i tvivl om, at du er den retmæssige arving af disse lande, og at din slægt er kysk og ædel.",
        "nl_NL": "Ik twijfel er niet aan dat u de rechtmatige heerser van deze landen bent en dat uw bloedlijn puur en nobel is.",
        "sv_SE": "Jag vet att du är regionernas rättmätige arvtagare, med en släkt av nobel börd."
      },
      "welcome_response_to_hildebolt_negative": {
        "en_US": "You have no rightful claim to Selbitz and Hofstetten.",
        "zh_CN": "你没有资格统领塞尔比茨和霍夫施泰滕。",
        "zh_TW": "你沒有統領塞爾比茨和霍夫施泰滕的正當權利。",
        "ja_JA": "ゼルビッツとホーフシュテッテン。そなたにこれらの地を有する正当な権利などない。",
        "ko_KR": "그대에겐 젤비츠와 호프슈테텐에 대한 정당한 명분이 없어.",
        "de_DE": "Ihr habt keinen rechtmäßigen Anspruch auf Selbitz und Hofstetten.",
        "es_ES": "Selbitz y Hofstetten no le pertenecen por derecho.",
        "fr_FR": "Vous n'avez aucune légitimité à régner sur Selbitz et Hofstetten.",
        "pt_BR": "Você não tem direito a reivindicar Selbitz e Hofstetten.",
        "pl_PL": "Nie możesz rościć sobie żadnych praw do Selbitzu i Hofstettenu.",
        "ru_RU": "У вас нет никаких прав на Зельбиц и Хофштеттен.",
        "it_IT": "Non hai alcun diritto di rivendicare Selbitz e Hofstetten.",
        "tr_TR": "Selbitz ve Hofstten üstünde haklı bir iddianız yok.",
        "cs_CZ": "Nemáš žádný oprávněný nárok na Selbitz a Hofstetten.",
        "hu_HU": "Nincs jogos követelésed Selbitzre és Hofstettenre.",
        "uk_UA": "У вас жодних законних прав на Зельбіц і Хофштеттен.",
        "da_DK": "Du har intet retmæssigt krav på Selbitz og Hofstetten.",
        "nl_NL": "U kunt Selbitz en Hofstetten niet rechtmatig opeisen.",
        "sv_SE": "Du är inte den rättmätiga ledaren av Selbitz och Hofstetten."
      },
      "peace_offer": {
        "en_US": "Let there be peace and prosperity between us.",
        "zh_CN": "愿我们共享和平与繁荣。",
        "zh_TW": "願我們共享和平與繁榮。",
        "ja_JA": "我らの間に平和と繁栄があらんことを。",
        "ko_KR": "우리 사이에 평화와 번영이 있기를 바라네.",
        "de_DE": "Zwischen uns möge Frieden herrschen und unsere Lande mögen wachsen und gedeihen.",
        "es_ES": "Que haya paz y prosperidad entre nosotros.",
        "fr_FR": "Que la paix et la prospérité perdurent entre nous.",
        "pt_BR": "Que haja paz e prosperidade entre nós.",
        "pl_PL": "Niech między nami panuje pokój i współpraca.",
        "ru_RU": "Да будем мы всегда жить в мире и достатке.",
        "it_IT": "Che ci sia pace e prosperità tra noi.",
        "tr_TR": "Aramızda barış ve saadet olsun.",
        "cs_CZ": "Budiž mezi námi mír a prospěch.",
        "hu_HU": "Legyen béke és jólét közöttünk.",
        "uk_UA": "Хай будемо ми завжди жити в мирі й достатку.",
        "da_DK": "Må der være fred og fremgang mellem os.",
        "nl_NL": "Laat er vrede en welvaart tussen ons opbloeien.",
        "sv_SE": "Låt mig få föreslå ett fredsavtal."
      },
      "peace_offer_accept": {
        "en_US": "I accept. Let there be peace between our fiefdoms.",
        "zh_CN": "我同意。愿我们的领地和平共处。",
        "zh_TW": "我接受。我們的封地會和平相處。",
        "ja_JA": "その申し出、受け入れよう。我らの間に平和があらんことを。",
        "ko_KR": "좋군. 그대와 나의 영지 사이에 평화가 있기를 바라지.",
        "de_DE": "Ich nehme an. Unsere Lehen sollen nebeneinander in Frieden bestehen.",
        "es_ES": "Acepto. Que haya paz entre nuestros señoríos.",
        "fr_FR": "C’est entendu. Que la paix soit faite entre nos fiefs.",
        "pt_BR": "Eu aceito. Que haja paz entre nossos feudos.",
        "pl_PL": "Zgadzam się. Niech między naszymni lennami zapanuje pokój.",
        "ru_RU": "Я принимаю ваше предложение. Пусть наши подданные живут в мире.",
        "it_IT": "Accetto. Che la pace regni tra i nostri feudi.",
        "tr_TR": "Kabul ediyorum. Derebeyliklerimiz barış içinde olsun.",
        "cs_CZ": "Přijímám. Budiž mezi našimi lény mír.",
        "hu_HU": "Elfogadom. Legyen béke a hűbérbirtokaink között.",
        "uk_UA": "Я приймаю вашу пропозицію. Нехай наші піддані живуть у мирі.",
        "da_DK": "Jeg indvilliger. Lad der være fred mellem vores len.",
        "nl_NL": "Ik aanvaard. Laat er vrede zijn tussen onze domeinen.",
        "sv_SE": "Låt gå. Fred är den sanna vägen."
      },
      "peace_offer_reject": {
        "en_US": "I apologise, but I do not feel like a peace treaty would benefit my cause.",
        "zh_CN": "抱歉，但我不觉得和平条约对我有利。",
        "zh_TW": "很抱歉，我不覺得和平條約對我有利。",
        "ja_JA": "すまないが、和平条約が我が為になるとは思えない。",
        "ko_KR": "미안하네만 평화 협정 따위가 내 대의에 이득이 될 것 같지는 않아.",
        "de_DE": "Ich bitte um Verzeihung, doch mich deucht, ein Friedensvertrag würde meiner Sache keinen Nutzen bringen.",
        "es_ES": "Mis más sinceras disculpas, no veo en qué podría beneficiar a mi causa un tratado de paz.",
        "fr_FR": "Pardonnez-moi, mais je crains fort qu’un traité de paix ne soit pas en ma faveur.",
        "pt_BR": "Eu lamento, mas não acredito que um tratado de paz seria beneficial à minha causa.",
        "pl_PL": "Przykro mi, ale nie odnoszę wrażenia, by traktat pokojowy był dla mnie korzystny.",
        "ru_RU": "Прошу прощения, но мирный договор мне не выгоден.",
        "it_IT": "Mi scuso, ma non credo che un trattato di pace risulterebbe vantaggioso per la mia causa.",
        "tr_TR": "Üzgünüm ancak bir barış antlaşmasının gayem için faydalı olacağını düşünmüyorum.",
        "cs_CZ": "Omlouvám se, ale nemám pocit, že by mírová smlouva prospěla mému snažení.",
        "hu_HU": "Elnézést kérek, de nem érzem úgy, hogy egy békeszerződés az én ügyem javát szolgálná.",
        "uk_UA": "Прошу вибачення, але мирний договір мені не вигідний.",
        "da_DK": "Jeg beklager, men jeg føler ikke, at en fredsaftale ville komme min sag til gavn.",
        "nl_NL": "Het spijt me zeer, maar ik denk niet dat een vredesverdrag mij verder zou helpen.",
        "sv_SE": "Jag tror tyvärr inte att fred är det bästa för mig just nu."
      },
      "antagonism": {
        "en_US": "I hope your fiefdom rots to hell, and soon.",
        "zh_CN": "愿你的领地在地狱腐烂。",
        "zh_TW": "我希望你的封地在地獄中滅亡。",
        "ja_JA": "一刻も早く、その所領とともに地獄へ落ちろ。",
        "ko_KR": "그대의 영지가 머지않아 지옥으로 떨어지길 바라겠네.",
        "de_DE": "Euer Lehen soll in der Hölle verrotten. Und zwar bald.",
        "es_ES": "Aguardo el momento de que su señorío arda en el infierno.",
        "fr_FR": "Puisse votre fief brûler en enfer sans tarder !",
        "pt_BR": "Espero que seus feudos queimem no inferno sem demora.",
        "pl_PL": "Mam szczerą nadzieję, że Twe lenno zgnije niczym bagno, i to szybko.",
        "ru_RU": "Чтоб твои земли сгнили ко всем чертям, и поскорее.",
        "it_IT": "Spero che il tuo feudo marcisca all'inferno, e che lo faccia subito.",
        "tr_TR": "Umarım derebeyliğiniz tez zamanda cehennemi boylar.",
        "cs_CZ": "Doufám, že tvé léno brzy shnije k čertu.",
        "hu_HU": "Remélem, hogy hűbérbirtokod elemészti a rossebb, méghozzá hamar.",
        "uk_UA": "Щоб твої землі згнили до всіх чортів, і скоріше.",
        "da_DK": "Jeg håber, at dit len rådner op i Helvede hurtigst muligt.",
        "nl_NL": "Moge uw domein branden in de hel, en snel.",
        "sv_SE": "Må ditt län falla och förruttna, och det snart."
      },
      "insult": {
        "en_US": "Your mother was a hamster, and your father smelt of elderberries.",
        "zh_CN": "你妈是个风流老徐娘，你爸就是个恶臭酒蒙子。",
        "zh_TW": "你媽就是個風流老蕩婦，而你爹就是個該死的臭酒鬼。",
        "ja_JA": "母親はハムスター、父親はニワトコの香りがするらしいな。",
        "ko_KR": "그대 어미는 술집 여자에... 아비는 술독에 빠진 작자라지?",
        "de_DE": "Eure Mutter war ein Hamster und Euer Vater roch nach vergorenem Holunder.",
        "es_ES": "Tu madre era una cabra y tu padre olía a cobaya.",
        "fr_FR": "Votre mère était un hamster et votre père puait le sureau pourri.",
        "pt_BR": "Sua mãe era uma meretriz e seu pai um condenado.",
        "pl_PL": "Twoja matka była chomikiem, a Twój ojciec śmierdział skisłymi jagodami.",
        "ru_RU": "Твоя мать была хомяком, а от отца несло бузиной.",
        "it_IT": "Tua madre era un criceto e tuo padre odorava di bacche di sambuco.",
        "tr_TR": "Anneniz bir hamsterdı, babanız da mürver kokardı.",
        "cs_CZ": "Tvoje matka byla křeček a otec páchl po bezinkách.",
        "hu_HU": "Anyád hörcsög volt, apád pedig bodzától bűzlött.",
        "uk_UA": "Ваша мати була хом'яком, а від батька несло бузиною.",
        "da_DK": "Din mor var en hamster, og din far lugtede af hyldebær.",
        "nl_NL": "Uw moeder was een hamster en uw vader rook naar vlierbessen.",
        "sv_SE": "Din mor var en hamster, och din far luktade fläderbär."
      },
      "insult_2": {
        "en_US": "You are a bastard and a fraud, and your bloodline is tainted and cursed.",
        "zh_CN": "你是个骗子、杂种，血脉里流淌着污秽和诅咒。",
        "zh_TW": "你是個私生子，騙子，你的血脈受到污染和詛咒。",
        "ja_JA": "卑しきドブネズミめ。不義の子である貴様のその血は穢れ、呪われている。",
        "ko_KR": "사생아에 사기꾼 같은 녀석. 더럽고 저주받은 핏줄을 타고났군.",
        "de_DE": "Ihr seid ein Bastard und ein Hochstapler, Euer Blut ist vergiftet und verflucht.",
        "es_ES": "No eres más que un fraude, alguien indigno, con un linaje impuro y perverso.",
        "fr_FR": "Vous n’êtes qu’un bâtard et un imposteur, votre lignée est ignoble et suinte le blasphème.",
        "pt_BR": "Ademais de uma cria ilegítima e uma fraude, sua linhagem é indigna e maldita.",
        "pl_PL": "Jesteś bękartem i oszustem z rodu czyścicieli wychodków.",
        "ru_RU": "Вы бастард и обманщик, а ваш род опорочен и проклят.",
        "it_IT": "Sei una canaglia truffatrice, e tutta la tua discendenza è corrotta e maledetta.",
        "tr_TR": "Alçaksınız ve sahtekârsınız. Soyunuz da lekeli ve lanetli.",
        "cs_CZ": "Jsi parchant a podvodník a tvůj rodokmen je poskvrněný a prokletý.",
        "hu_HU": "Te fattyú vagy és csaló, a vérvonalad romlott és átkozott.",
        "uk_UA": "Ви бастард і шахрай, а ваш рід зганьблений і проклятий.",
        "da_DK": "Du er en horeunge og en svindler, og dit stamtræ er besudlet og forbandet.",
        "nl_NL": "U bent een smeerlap en een fraudeur, en uw bloedlijn is bezoedeld en vervloekt.",
        "sv_SE": "Du är en bastard och bedragare, med en släkt lika rutten som förhatlig."
      },
      "insult_3": {
        "en_US": "You are a tyrant and a coward, and you have no vision or honor.",
        "zh_CN": "你这个暴君、懦夫，胸无远见，心无荣耀。",
        "zh_TW": "你既是暴君，又是懦夫，既沒有遠見，也沒有榮譽。",
        "ja_JA": "そなたは暴君でもあるが、腰抜けだな。名誉も展望も何一つ持ち合わせていない。",
        "ko_KR": "그대는 폭군에 겁쟁이야. 명예도 비전도 없는 무능력자란 얘기지.",
        "de_DE": "Ihr seid ein Tyrann und ein Feigling ohne Weitsicht und Ehre.",
        "es_ES": "Tanta tiranía y cobardía albergas en tu corazón, que en tu cabeza no cabe la palabra «honor».",
        "fr_FR": "Vous êtes un tyran et un couard, vous n’avez ni ambition ni honneur.",
        "pt_BR": "Além da tirania e da covardia que lhe sobram, lhe faltam visão e honra.",
        "pl_PL": "Jesteś tyranem i tchórzem, nie masz szczytnej idei ani honoru.",
        "ru_RU": "Вы деспот и трус, лишенный видения и понятия не имеющий о чести.",
        "it_IT": "Agisci con tirannia e codardia, non hai né lungimiranza né onore.",
        "tr_TR": "Despotsunuz ve korkaksınız. Ayrıca ne vizyonunuz var ne de onurunuz.",
        "cs_CZ": "Jsi krutovládce a zbabělec a o cti nemáš ani potuchy.",
        "hu_HU": "Zsarnok vagy és gyáva, és nincs jövőd vagy becsületed.",
        "uk_UA": "Ви деспот і боягуз, позбавлені бачення і поняття не маєте про честь.",
        "da_DK": "Du er en tyran og en kujon, og du har hverken visioner eller ære.",
        "nl_NL": "U bent een tiran en een lafaard, en u heeft geen visie of eer.",
        "sv_SE": "Du är en feg tyrann utan vare sig vision eller heder."
      },
      "competitive": {
        "en_US": "This letter is a warning and a challenge. I will not rest until I see you defeated and dethroned.",
        "zh_CN": "这封信是对你的警告，也是一次挑战。在看到你被击败并废黜之前，我决不罢休。",
        "zh_TW": "這封信是警告，也是戰帖。我不會停手，直到我看到你被打敗、廢黜。",
        "ja_JA": "この書状は警告であり挑戦状でもある。そなたを王座から引きずり下ろすまで、この手を休めるつもりはない。",
        "ko_KR": "이 편지는 경고이자 도전장이라네. 그대가 패배해서 물러날 때까지 난 멈출 생각이 없어.",
        "de_DE": "Möge dieser Brief als Warnung und Herausforderung dienen. Ich werde nicht ruhen, ehe Ihr entthront und besiegt seid.",
        "es_ES": "Interprétese esta carta como una advertencia, un desafío. No pegaré ojo hasta que pueda ver su más profunda degradación.",
        "fr_FR": "Que cette lettre fasse office d’avertissement et de sommation. Je me battrai jusqu’à ce que vous soyez vaincu et hors du trône.",
        "pt_BR": "Esta carta é um aviso e um desafio. Não descansarei até que ver sua derrota e sua deposição.",
        "pl_PL": "Ten list to ostrzeżenie, a zarazem wyzwanie. Nie spocznę, dopóki Cię nie pokonam i nie pozbawię tronu.",
        "ru_RU": "Это письмо – предупреждение и вызов. Я не успокоюсь, пока вы не будете разгромлены и низложены.",
        "it_IT": "Questa lettera è un avvertimento e una sfida. Non riposerò finché non ti sconfiggeranno e detronizzeranno.",
        "tr_TR": "Bu mektup bir uyarı ve bir meydan okumadır. Bozguna uğrayıp tahttan indirildiğinizi görene kadar bana rahat yok.",
        "cs_CZ": "Toto psaní ber jako varování a výzvu. Nespočinu, dokud nebudeš poražen a sesazen z trůnu.",
        "hu_HU": "Ez a levél figyelmeztetés és kihívás. Nem nyugszom, amíg nem látlak legyőzve és trónodtól megfosztva.",
        "uk_UA": "Цей лист – попередження і виклик. Я не заспокоюся, доки вас не розгромлять і не скинуть.",
        "da_DK": "Dette brev er en advarsel og en udfordring. Jeg vil ikke hvile, før du er besejret og sat af tronen.",
        "nl_NL": "Deze brief is een waarschuwing en een uitdaging. Ik zal niet rusten tot u bent verslagen en van de troon bent verwijderd.",
        "sv_SE": "Det här brevet är både en varning och en utmaning. Jag ger mig inte förrän du ligger och kvider i gyttjan."
      },
      "competitive_01": {
        "en_US": " I will be the one to bring justice and order to these lands and to restore their rightful owners. ",
        "zh_CN": " 我将为这片土地带来正义与秩序，将它们还给真正的主人。 ",
        "zh_TW": "我會為這片土地帶來正義與秩序，使其回歸合法擁有者的名下。",
        "ja_JA": "この地に正義と秩序を取り戻し、正統なる者を復権させる。",
        "ko_KR": " 나는 이 땅에 정의와 질서를 안겨줄 생각이야. 올바른 주인을 되찾아 줄 심산이지. ",
        "de_DE": " Ich werde diesen Landen Recht und Ordnung bringen und sie ihren rechtmäßigen Besitzer zurückgeben. ",
        "es_ES": " Me aseguraré de ser quien traiga orden y justicia a estas tierras, que han de volver a sus legítimos dueños. ",
        "fr_FR": " Je rétablirai la justice et l’ordre à ces contrées et les rendrai à leurs maîtres légitimes. ",
        "pt_BR": " Caberá a mim trazer justiça e ordem a essas terras e restituir os devidos donos. ",
        "pl_PL": " Przyniosę tym ziemiom prawo i sprawiedliwość, i przywrócę je prawowitym właścicielom. ",
        "ru_RU": " Я стану тем, кто наведет порядок на этих землях и вернет их в руки законных владельцев. ",
        "it_IT": " Sarò io a portare giustizia e ordine in queste terre e a ripristinare i loro legittimi proprietari. ",
        "tr_TR": " Bu topraklara adaleti ve düzeni getirip meşru sahiplerini geri kazandıracak kişi ben olacağım. ",
        "cs_CZ": " To já v těchto krajích zavedu spravedlnost a pořádek a navrátím jejich právoplatné majitele. ",
        "hu_HU": " Én leszek az, aki igazságot és rendet teremt ezeken a földeken, és visszahozom jogos tulajdonosaikat. ",
        "uk_UA": " Я стану тим, хто наведе порядок на цих землях і поверне їх до рук законних власників. ",
        "da_DK": " Det bliver mig, der bringer retfærdighed og orden til disse lande og giver dem tilbage til deres retmæssige ejere. ",
        "nl_NL": " Ik zal degene zijn die gerechtigheid en orde naar deze landen brengt en de rechtmatige eigenaren in ere herstelt. ",
        "sv_SE": " Jag tänker ge regionen rättvisan den förtjänar, och ge tillbaka den till dess sanna härskare. "
      },
      "competitive_02": {
        "en_US": "Prepare yourself for war, for I am coming for you. ",
        "zh_CN": "准备迎战吧，我等着你。 ",
        "zh_TW": "準備迎戰吧，因為我來了。",
        "ja_JA": "戦の支度をせよ。首を洗って待っておけ。",
        "ko_KR": "전쟁을 준비하게. 내가 그대를 잡으러 갈 테니. ",
        "de_DE": "Bereitet Euch auf den Krieg vor, denn ich werde kommen, um Euch zu holen. ",
        "es_ES": "Prepárese para la guerra, pues nos veremos las caras muy pronto. ",
        "fr_FR": "Préparez-vous à la guerre, je ne ferai pas de quartiers. ",
        "pt_BR": "Prepare-se para guerrear, pois eu estou a caminho. ",
        "pl_PL": "Gotuj się do wojny, albowiem nadciągam. ",
        "ru_RU": "Готовьтесь к войне, ибо я иду за вами. ",
        "it_IT": "Preparati a combattere, perché il mio esercito è alle porte. ",
        "tr_TR": "Kendinizi savaşa hazırlayın çünkü peşinize düşeceğim. ",
        "cs_CZ": "Připrav se na válku, jdu si pro tebe. ",
        "hu_HU": "Készülj a háborúra, mert eljövök érted. ",
        "uk_UA": "Готуйтеся до війни, бо я йду на вас. ",
        "da_DK": "Gør klar til krig, for jeg kommer efter dig. ",
        "nl_NL": "Bereid u voor op een oorlog, ik kom eraan. ",
        "sv_SE": "Bered dig på krig, för snart kommer jag. "
      },
      "signature_default": {
        "en_US": "Signed and sealed by my own seal, ",
        "zh_CN": "此信已由本人盖章封缄， ",
        "zh_TW": "本人親署用印後彌封",
        "ja_JA": "では、これにて失礼する。",
        "ko_KR": "직접 서명하고 봉인함, ",
        "de_DE": "Gezeichnet und mit Siegel, ",
        "es_ES": "Firmo y ratifico el contenido con mi propio sello, ",
        "fr_FR": "Signé et frappé de mon sceau, ",
        "pt_BR": "Assinado e selado por meu próprio selo, ",
        "pl_PL": "Podpisano i opatrzono własną pieczęcią, ",
        "ru_RU": "Подписано и скреплено моей собственной печатью ",
        "it_IT": "Firmato e sigillato con il mio sigillo, ",
        "tr_TR": "Kendi mührümle imzalandı ve damgalandı, ",
        "cs_CZ": "Má pečeť a vlastnoruční podpis ",
        "hu_HU": "Aláírásommal ellátva és saját pecsétemmel lepecsételve, ",
        "uk_UA": "Підписано і скріплено моєю власною печаткою ",
        "da_DK": "Underskrevet og forseglet med mit eget sejl ",
        "nl_NL": "Ondertekend en verzegeld met mijn eigen zegel, ",
        "sv_SE": "Hälsningar, "
      },
      "write_back": {
        "en_US": "Write back",
        "zh_CN": "回信",
        "zh_TW": "回信",
        "ja_JA": "返信する",
        "ko_KR": "답장하기",
        "de_DE": "Zurückschreiben",
        "es_ES": "Responder.",
        "fr_FR": "Répondre",
        "pt_BR": "Responder",
        "pl_PL": "Odpisz",
        "ru_RU": "Написать ответное письмо",
        "it_IT": "Rispondi",
        "tr_TR": "Cevap ver",
        "cs_CZ": "Odepsat",
        "hu_HU": "Válaszlevél",
        "uk_UA": "Написати листа у відповідь",
        "da_DK": "Skriv tilbage",
        "nl_NL": "Terugschrijven",
        "sv_SE": "Svara"
      },
      "end_conversation": {
        "en_US": "End conversation",
        "zh_CN": "结束对话",
        "zh_TW": "結束對話",
        "ja_JA": "話を終える",
        "ko_KR": "대화 끝내기",
        "de_DE": "Konversation beenden",
        "es_ES": "Acabar la conversación.",
        "fr_FR": "Terminer la conversation",
        "pt_BR": "Encerrar conversa",
        "pl_PL": "Zakończ korespondencję",
        "ru_RU": "Закончить разговор",
        "it_IT": "Termina conversazione",
        "tr_TR": "Konuşmayı sonlandır",
        "cs_CZ": "Neodepisovat",
        "hu_HU": "Beszélgetés vége",
        "uk_UA": "Закінчити розмову",
        "da_DK": "Afslut samtalen",
        "nl_NL": "Briefwisseling beëindigen",
        "sv_SE": "Avsluta konversation"
      },
      "peace_silver_offer": {
        "en_US": "I can make it worthwhile if you drop all your claims.",
        "zh_CN": "如若你放弃所有主权，我可以提供更有利的条件。",
        "zh_TW": "如果你放棄所有主張，我可以提供更好的條件。",
        "ja_JA": "全ての要求を取り下げれば、それに見合ったものを用意しよう。",
        "ko_KR": "모든 주장을 철회한다면 그만한 대가를 제공할 수 있다.",
        "de_DE": "Es könnte sich für Euch lohnen, all Eure Ansprüche zurückzuziehen.",
        "es_ES": "Si cesa en sus reclamaciones, estará en mi mano hacer que merezca la pena.",
        "fr_FR": "Je peux vous faire une offre des plus intéressantes, si vous renoncez à vos revendications.",
        "pt_BR": "Posso fazer valer a pena se você abandonar suas reivindicações.",
        "pl_PL": "Jeśli zrezygnujesz ze wszystkich roszczeń, to Ci się opłaci.",
        "ru_RU": "Если вы откажетесь от своих притязаний, я в долгу не останусь.",
        "it_IT": "Posso rendere l'affare interessante se rinunci a tutte le tue rivendicazioni.",
        "tr_TR": "Tüm iddialarınızdan vazgeçerseniz size karşılığını verebilirim.",
        "cs_CZ": "Pokud stáhneš všechny své nároky, vynahradím ti to.",
        "hu_HU": "Nem lennék hálátlan, ha minden követelésedről lemondasz.",
        "uk_UA": "Якщо відмовитеся від усіх претензій, я зроблю так, щоб це було вартим того.",
        "da_DK": "Du vil blive belønnet, hvis du frafalder alle dine krav.",
        "nl_NL": "Ik kan het u de moeite waard maken als u al uw aanspraken laat varen.",
        "sv_SE": "Lägg ner vapnen så ska du få något av mig."
      },
      "peace_silver": {
        "en_US": "We can end this squabble - for a small payment.",
        "zh_CN": "我们可以结束这场纷争——只需要支付一小笔费用。",
        "zh_TW": "我們可以結束這場紛爭——只需要小小的代價。",
        "ja_JA": "僅かな代償を支払えば、こんな下らぬ争いなど終わらせられる。",
        "ko_KR": "작은 대가라도 있다면 이 하찮은 다툼을 끝내지 못할 것도 없지.",
        "de_DE": "Wir können dieses Gezänk beenden – gegen eine kleine Bezahlung.",
        "es_ES": "Podríamos dejar a un lado nuestras diferencias. Tan solo requiero un pequeño tributo.",
        "fr_FR": "Nous pouvons clore cette querelle moyennant une petite somme.",
        "pt_BR": "Nós podemos acabar com essa disputa inconsequente... Por um pequeno pagamento.",
        "pl_PL": "Możemy zakończyć ten spór – za niewielką gratyfikacją.",
        "ru_RU": "Мы можем положить конец этой склоке… за небольшую плату.",
        "it_IT": "Possiamo porre fine a questa disputa... in cambio di una piccola somma.",
        "tr_TR": "Bu didişmeyi... ufak bir ücret karşılığında sonlandırabiliriz.",
        "cs_CZ": "Tuto rozmíšku můžeme ukončit – za malý poplatek.",
        "hu_HU": "Véget vethetünk ennek a civakodásnak – egy kis fizetségért cserébe.",
        "uk_UA": "Можемо покласти край чварам – за невелику ціну.",
        "da_DK": "Vi kan sætte dette kævl bag os mod et mindre vederlag.",
        "nl_NL": "We kunnen deze ruzie oplossen - voor een klein bedrag.",
        "sv_SE": "Vi kan sätta punkt för det här… till ett pris."
      },
      "claim_press": {
        "en_US": "I declare myself the true liege of...",
        "zh_CN": "我宣布，我将正式统领……",
        "zh_TW": "我宣布自己是真正的領主，統領……",
        "ja_JA": "ここに、我こそが正統なる領主であることを宣言しよう…",
        "ko_KR": "나야말로 다음 지역의 진정한 영주임을 선언한다 -",
        "de_DE": "Hiermit erkläre ich mich zum rechtmäßigen Lehensherren von ...",
        "es_ES": "Declaro mi legitimidad como líder de...",
        "fr_FR": "Je me déclare seigneur légitime de...",
        "pt_BR": "Eu me declaro a verdadeira liderança de...",
        "pl_PL": "Oświadczam, że zgodnie z prawem dzierżę władzę w regionie...",
        "ru_RU": "Я объявляю себя истинным правителем…",
        "it_IT": "Mi dichiaro regnante di diritto di...",
        "tr_TR": "Kendimi buranın gerçek lordu ilan ediyorum.",
        "cs_CZ": "Prohlašuji se právoplatným vládcem území...",
        "hu_HU": "Kijelentem, hogy én vagyok az igazi hűbérese…",
        "uk_UA": "Оголошую себе повноправним паном…",
        "da_DK": "Jeg erklærer hermed, at jeg er den sande herre over ...",
        "nl_NL": "Ik roep mijzelf uit tot de ware heerser van...",
        "sv_SE": "Härmed utropar jag mig till rättmätig härskare av…"
      },
      "peace_silver_offer_accept": {
        "en_US": "I may withdraw my claims for such a price.",
        "zh_CN": "凭此代价，我或许会放弃我的主权。",
        "zh_TW": "我接受以此代價撤回我的主張。",
        "ja_JA": "条件次第では、要求を取り下げることもやぶさかではない。",
        "ko_KR": "이런 성의라면 주장을 철회할 생각도 드는군.",
        "de_DE": "Für einen solchen Preis vermag ich auf meine Ansprüche zu verzichten.",
        "es_ES": "Por ese precio, me sería posible prescindir de mis reclamaciones.",
        "fr_FR": "Je pourrais renoncer à mes revendications en échange d’une telle somme.",
        "pt_BR": "Eu poderia abandonar minhas reivindicações por um preço.",
        "pl_PL": "Mogę cofnąć swoje roszczenia za taką cenę.",
        "ru_RU": "За такую плату я могу отказаться от своих притязаний.",
        "it_IT": "Potrei ritirare le mie rivendicazioni, ma ti costerà.",
        "tr_TR": "Böyle bir ücret karşılığında iddialarımı geri çekebilirim.",
        "cs_CZ": "Za takovou cenu své nároky stáhnout mohu.",
        "hu_HU": "Egy ilyen összegért lemondhatok a követeléseimről.",
        "uk_UA": "За таку ціну можна відмовитися від своїх претензій.",
        "da_DK": "Mod en sådan betaling kunne jeg trække mine krav tilbage.",
        "nl_NL": "Ik kan mijn aanspraken intrekken voor deze prijs.",
        "sv_SE": "Till det priset kan jag kanske fundera på saken."
      },
      "peace_silver_offer_accept_descr": {
        "en_US": "Accept the offer to withdraw claims in exchange for payment.",
        "zh_CN": "接受提议，支付费用放弃主权。",
        "zh_TW": "接受提議，撤回主張以交換金錢。",
        "ja_JA": "金銭と引き換えに、主張を撤回する申し出を受け入れる。",
        "ko_KR": "대가를 받고 주장을 철회하라는 제안을 수락합니다.",
        "de_DE": "Nehmt das Angebot an und verzichtet gegen eine Bezahlung auf Eure Ansprüche.",
        "es_ES": "Acepto cesar en mis reclamaciones a cambio del pago.",
        "fr_FR": "Accepter l’offre de renoncer à vos revendications en échange d’un paiement.",
        "pt_BR": "Aceite a oferta de abandonar as reivindicações por um pagamento.",
        "pl_PL": "Przyjmij propozycję wycofania roszczeń w zamian za pieniądze.",
        "ru_RU": "Согласиться отозвать свои притязания в обмен на вознаграждение.",
        "it_IT": "Accetta l'offerta di ritirare le rivendicazioni in cambio di un pagamento.",
        "tr_TR": "Ödeme karşılığında iddiaları geri çekme teklifini kabul et.",
        "cs_CZ": "Přijmi tuto nabídku na stažení nároků výměnou za poplatek.",
        "hu_HU": "Elfogadod az ajánlatot, hogy lemondasz a követeléseidről a fizetségért cserébe.",
        "uk_UA": "Прийняти пропозицію щодо відмови від претензій в обмін на плату.",
        "da_DK": "Tag imod tilbuddet om at trække dine krav tilbage mod betaling.",
        "nl_NL": "Aanvaard het aanbod om aanspraken in te trekken in ruil voor betaling.",
        "sv_SE": "Godta förslaget om att lägga ner vapnen mot betalning."
      },
      "peace_silver_offer_refuse": {
        "en_US": "My claims are non negotiable.",
        "zh_CN": "我的主权不容谈判。",
        "zh_TW": "我的主張沒有商議的餘地。",
        "ja_JA": "この主張を取り下げる気はない。",
        "ko_KR": "나의 주장은 협상의 대상이 아니다.",
        "de_DE": "Meine Ansprüche sind nicht verhandelbar.",
        "es_ES": "No es negociable.",
        "fr_FR": "Mes revendications ne sont pas négociables.",
        "pt_BR": "Minhas reivindicações não estão à venda.",
        "pl_PL": "Moje roszczenia nie podlegają negocjacjom.",
        "ru_RU": "Мои притязания не обсуждаются.",
        "it_IT": "Le mie rivendicazioni non sono negoziabili.",
        "tr_TR": "İddialarım tartışmaya kapalıdır.",
        "cs_CZ": "O svých nárocích vyjednávat nebudu.",
        "hu_HU": "A követeléseimből nem engedek.",
        "uk_UA": "Мої претензії не обговорюються.",
        "da_DK": "Mine krav står ikke til forhandling.",
        "nl_NL": "Over mijn aanspraken valt niet te onderhandelen.",
        "sv_SE": "Mina anspråk är inte förhandlingsbara."
      },
      "peace_silver_offer_refuse_descr": {
        "en_US": "Decline offer to withdraw claims in exchange for payment.",
        "zh_CN": "拒绝提议，支付费用放弃主权。",
        "zh_TW": "拒絕以放棄主張交換金錢的提議。",
        "ja_JA": "金銭と引き換えに、主張を取り下げるとの申し出を断る。",
        "ko_KR": "대가를 받고 주장을 철회하라는 제안을 거절합니다.",
        "de_DE": "Lehnt das Angebot ab, gegen Bezahlung auf Eure Ansprüche zu verzichten.",
        "es_ES": "Me niego a retroceder por un tributo.",
        "fr_FR": "Refuser l’offre de renoncer à vos revendications en échange d’un paiement.",
        "pt_BR": "Recuse a oferta de abandonar as reivindicações por um pagamento.",
        "pl_PL": "Odrzuć propozycję wycofania roszczeń w zamian za pieniądze.",
        "ru_RU": "Отказаться отозвать свои притязания в обмен на вознаграждение.",
        "it_IT": "Declina l'offerta di ritirare le rivendicazioni in cambio di un pagamento.",
        "tr_TR": "Ödeme karşılığında iddiaları geri çekme teklifini reddet.",
        "cs_CZ": "Odmítni tuto nabídku na stažení nároků výměnou za poplatek.",
        "hu_HU": "Visszautasítod az ajánlatot, hogy lemondasz a követeléseidről a fizetségért cserébe.",
        "uk_UA": "Відхилити пропозицію щодо відмови від претензій в обмін на плату.",
        "da_DK": "Afvis tilbuddet om at trække dine krav tilbage mod betaling.",
        "nl_NL": "Sla het aanbod om aanspraken in te trekken in ruil voor betaling af.",
        "sv_SE": "Avböj förslaget om att lägga ner vapnen mot betalning."
      },
      "letter_start_prefix_optional": {
        "en_US": "Dear",
        "zh_CN": "致",
        "zh_TW": "致",
        "ja_JA": "親愛なる",
        "ko_KR": "친애하는",
        "de_DE": "Verehrte/r",
        "es_ES": "Ilustre",
        "fr_FR": "Cher",
        "pt_BR": "Saudações,",
        "pl_PL": "Do:",
        "ru_RU": "Приветствую,",
        "it_IT": "Illustre",
        "tr_TR": "Sevgili",
        "cs_CZ": "Zdravím,",
        "hu_HU": "Kedves",
        "uk_UA": "Шановний",
        "da_DK": "Kære",
        "nl_NL": "Beste",
        "sv_SE": "Kära"
      },
      "letter_start_suffix_optional": {
        "en_US": " ",
        "zh_CN": "",
        "zh_TW": " ",
        "ja_JA": "",
        "ko_KR": " ",
        "de_DE": "",
        "es_ES": " ",
        "fr_FR": "",
        "pt_BR": " ",
        "pl_PL": "",
        "ru_RU": "",
        "it_IT": "",
        "tr_TR": "",
        "cs_CZ": "",
        "hu_HU": "",
        "uk_UA": "",
        "da_DK": "",
        "nl_NL": "",
        "sv_SE": ""
      },
      "paragraph_free": {
        "en_US": "No influence cost",
        "zh_CN": "无需耗费影响力",
        "zh_TW": "無需耗費影響力",
        "ja_JA": "影響力：コストなし",
        "ko_KR": "영향력 비용 없음",
        "de_DE": "Keine Einflusskosten",
        "es_ES": "Sin coste de influencia",
        "fr_FR": "Gratuit",
        "pt_BR": "Sem custo de influência",
        "pl_PL": "Brak kosztów we wpływach",
        "ru_RU": "Не расходует очки влияния",
        "it_IT": "Nessun costo in termini di influenza",
        "tr_TR": "Nüfuz maliyeti yok",
        "cs_CZ": "Žádná spotřeba vlivu",
        "hu_HU": "Nincs befolyási költség",
        "uk_UA": "Без витрат впливу",
        "da_DK": "Koster ikke indflydelse",
        "nl_NL": "Geen invloedkosten",
        "sv_SE": "Ingen inflytandekostnad"
      },
      "paragraph_greetingsOnly": {
        "en_US": "<img id=\"Warn\"/> <r>Available only on greeting</>",
        "zh_CN": "<img id=\"Warn\"/> <r>仅问候时可用</>",
        "zh_TW": "<img id=\"Warn\"/> <r>僅能在問候時使用</>",
        "ja_JA": "<imgid=\"Warn\"/> <r>挨拶だけ実行可能</>",
        "ko_KR": "<img id=\"Warn\"/> <r>인사에서만 이용 가능</>",
        "de_DE": "<img id=\"Warn\"/> <r>Nur bei Begrüßung verfügbar</>",
        "es_ES": "<img id=\"Warn\"/> <r>Disponible solo al saludar</>",
        "fr_FR": "<img id=\"Warn\"/> <r>Utilisable uniquement comme salutation</>",
        "pt_BR": "<img id=\"Warn\"/> <r>Disponível apenas para saudação</>",
        "pl_PL": "<img id=\"Warn\"/> <r>Dostępne tylko przy powitaniu</>",
        "ru_RU": "<img id=\"Warn\"/> <r>Доступно только при приветствии</>",
        "it_IT": "<img id=\"Warn\"/> <r>Disponibile solo in seguito ai saluti</>",
        "tr_TR": "<img id=\"Warn\"/> <r>Yalnızca selamlama sırasında mevcut</>",
        "cs_CZ": "<img id=\"Warn\"/> <r>Dostupné pouze při pozdravu</>",
        "hu_HU": "<img id=\"Warn\"/> <r>Csak üdvözléskor érhető el</>",
        "uk_UA": "<img id=\"Warn\"/> <r>Доступно лише при вітанні</>",
        "da_DK": "<img id=\"Warn\"/> <r>Kan kun bruges til hilsen</>",
        "nl_NL": "<img id=\"Warn\"/> <r>Alleen beschikbaar bij begroeting</>",
        "sv_SE": "<img id=\"Warn\"/> <r>Bara tillgängligt vid hälsning</>"
      },
      "need_silver": {
        "en_US": "I require silver for my endavours.",
        "zh_CN": "我的付出要以银钱衡量才行。",
        "zh_TW": "我的付出需以銀幣衡量。",
        "ja_JA": "我が大望を成すには銀が要る。",
        "ko_KR": "내가 들인 노력에 대가를 요구한다.",
        "de_DE": "Ich benötige Silber für meine Unternehmungen.",
        "es_ES": "Requiero monedas para mis menesteres.",
        "fr_FR": "J'estime que mes efforts méritent de l'argent.",
        "pt_BR": "Eu preciso de prata para meus empreendimentos.",
        "pl_PL": "Potrzebuję srebra na swoje przedsięwzięcia.",
        "ru_RU": "Мне требуется серебро для нужд народа.",
        "it_IT": "Necessito di argento per le mie imprese.",
        "tr_TR": "Uğraşlarım için gümüşe ihtiyacım var.",
        "cs_CZ": "Potřebuji stříbro pro svoje snažení.",
        "hu_HU": "Ezüstre van szükségem vállalkozásaimhoz.",
        "uk_UA": "Для моїх цілей потрібне срібло.",
        "da_DK": "Jeg har brug for sølv til mit arbejde.",
        "nl_NL": "Ik heb zilver nodig voor mijn inspanningen.",
        "sv_SE": "Min tid kostar silver."
      },
      "war_surprise": {
        "en_US": "Your time has come!",
        "zh_CN": "你的死期到了！",
        "zh_TW": "你的死期到了！",
        "ja_JA": "時は来た！",
        "ko_KR": "드디어 때가 왔다!",
        "de_DE": "Eure Zeit ist gekommen!",
        "es_ES": "¡Ha llegado tu hora!",
        "fr_FR": "Votre heure est venue !",
        "pt_BR": "Sua hora chegou!",
        "pl_PL": "Wybiła twoja godzina!",
        "ru_RU": "Время пришло!",
        "it_IT": "La tua ora è giunta!",
        "tr_TR": "Ecelin geldi!",
        "cs_CZ": "Nadešel tvůj čas!",
        "hu_HU": "Eljött a te időd!",
        "uk_UA": "Твій час прийшов!",
        "da_DK": "Din tid er inde!",
        "nl_NL": "Jouw tijd is gekomen!",
        "sv_SE": "Din tid är kommen!"
      }
    }
  }
]