[
  {
    "Type": "DataTable",
    "Name": "DT_Translation_GameSetups",
    "Class": "UScriptClass'DataTable'",
    "Properties": {
      "RowStruct": {
        "ObjectName": "ScriptStruct'LocalizedText'",
        "ObjectPath": "/Script/ManorLords"
      }
    },
    "Rows": {
      "baron": {
        "en_US": "Restoring the Peace",
        "zh_CN": "重建和平",
        "zh_TW": "恢復和平",
        "ja_JA": "平和の修復",
        "ko_KR": "평화 회복",
        "de_DE": "Wiederherstellung des Friedens",
        "es_ES": "Restaurar la paz",
        "fr_FR": "Restaurer la paix",
        "pt_BR": "Reestabelecendo a Paz",
        "pl_PL": "Przywrócenie pokoju",
        "ru_RU": "Да будет мир",
        "it_IT": "Ristabilire la pace",
        "tr_TR": "Barışı yeniden sağla",
        "cs_CZ": "Nastolení míru",
        "hu_HU": "A béke helyreállítása",
        "uk_UA": "Хай буде мир",
        "da_DK": "Genoprettelse af freden",
        "nl_NL": "De vrede herstellen",
        "sv_SE": "Återställ freden"
      },
      "baron_setup": {
        "en_US": "Two territories in the north are claimed by the illegitimate Baron whose castle is located off the map. Bandit camps reside in the other, unclaimed regions. {br}{br}Build and expand at your own pace. When ready, challenge the Baron for the northern territories.",
        "zh_CN": "北方有两处领土被一位非法男爵占领了，他的城堡在地图之外。其余未有人占领的土地则充斥着强盗营地。{br}{br}按照你自己的节奏建造并扩张。待一切准备就绪后，与男爵争夺北部领土的归属权。",
        "zh_TW": "北方有兩處領土被一個私生子男爵佔領，他的城堡位於地圖的範圍之外。其他未被佔領的地區則是盜匪營地充斥。{br}{br}以你自己的步調進行建設及擴張。做好準備時，向那名男爵挑戰，爭取北方的領地。",
        "ja_JA": "北部二つの領地が、マップ外に居城を構える自称男爵によって占拠されています。他の地域には盗賊の野営地が点在しています。{br}{br}プレイヤーのペースに合わせて施設を建設し、領地を拡大していきましょう。準備が整ったら、北方の領地を求めて男爵に挑みましょう。",
        "ko_KR": "지도 외부에 성을 가진 자칭 남작이 2개의 북부 영토를 점령했습니다. 다른 미점령 지역들에는 도적 야영지가 눌러앉은 상황입니다.{br}{br}각자의 속도에 맞춰 건물을 짓고 세력을 확장하십시오. 준비가 됐다면 남작에게 도전하여 북부 영토를 차지할 차례입니다.",
        "de_DE": "Zwei Gebiete im Norden werden von einem unrechtmäßigen Baron beansprucht, dessen Burg abseits der Karte liegt. In anderen, unbesetzten Regionen befinden sich Banditenlager. {br}{br}Baut und erweitert, so schnell oder langsam es Euch beliebt. Sobald Ihr bereit seid, könnt Ihr den Baron zum Kampf um die nördlichen Territorien herausfordern.",
        "es_ES": "Un barón ilegítimo, con un castillo a las afueras del mapa, ha reclamado dos territorios del norte para sí. Pero también hay otras regiones sin reclamar, a merced de los bandidos. {br}{br}Construye y expande tu asentamiento a tu ritmo. Cuando esté todo listo, podrás desafiar al barón de las tierras norteñas.",
        "fr_FR": "Deux territoires au nord sont sujets aux prétentions d’un baron illégitime dont le château se trouve hors de la carte. Les autres régions, sans seigneur, sont occupées par des camps de bandits.{br}{br}Installez-vous et développez votre fief à votre rythme. Opposez-vous ensuite au baron pour mettre la main sur les territoires du nord.",
        "pt_BR": "Dois territórios nortenhos foram reivindicados pelo ilegítimo barão cujo castelo está fora do mapa. Há campos de bandidos nas outras regiões não reivindicadas. {br}Construa e expanda sua cidade em seu próprio ritmo para desafiar o barão pelo controle dos territórios nortenhos.",
        "pl_PL": "Dwa terytoria na północy zostały zajęte przez nieprawowitego barona, którego zamek znajduje się poza mapą. W pozostałych, niezajętych regionach znajdują się obozy rozbójników.{br}{br}Buduj i rozwijaj się w swoim tempie. Gdy twoi ludzie będą gotowi, rzuć wyzwaniem baronowi na terytoriach północnych.",
        "ru_RU": "Две территории на севере присвоил себе незаконнорожденный барон, чей замок располагается за пределами карты. В ничейных регионах орудуют разбойники. {br}{br}Стройте и расширяйте свое поселение, никуда не торопясь. Когда будете готовы, бросьте вызов барону и отбейте у него северные территории.",
        "it_IT": "A nord, due territori sono stati rivendicati da un barone illegittimo, il cui castello si trova oltre i confini della mappa. Le altre regioni, non ancora rivendicate, ospitano vari accampamenti dei banditi. {br}{br}Espandi e sviluppa i tuoi domini al tuo ritmo, e preparati a sfidare il barone per i territori del nord una volta che ti sentirai all'altezza.",
        "tr_TR": "Kuzeydeki iki bölge, kalesi haritanın dışında bulunan gayrimeşru Baron tarafından ele geçirildi. Ele geçirilmeyen diğer bölgelerde haydut kampları yer alıyor. {br}{br}Kendi hızında inşa et ve genişle. Hazır olduğunda kuzeydeki bölgeler için Baron'a meydan oku.",
        "cs_CZ": "Dvě území na severu si zabral samozvaný baron, jehož hrad se nachází mimo mapu. V ostatních, nezabraných regionech se nacházejí zbojnické tábory. {br}{br}Buduj a rozšiřuj své území po svém. Až budeš připraven, vyzvi barona o severní území.",
        "hu_HU": "Északon két területet követel magának a törvénytelen báró, akinek a vára a térképen túl található. A többi, senki által nem birtokolt területen banditatáborok találhatók. {br}{br}Építs és terjeszkedj a saját tempódban. Ha készen állsz, hívd ki a bárót az északi területekért.",
        "uk_UA": "На дві території на півночі претендує незаконнонароджений барон, замок якого знаходиться за межами мапи. Табори розбійників розташовані в інших незайнятих регіонах. {br}{br}Відбудовуйте й розширюйте територію у власному темпі. Коли будете готові, киньте баронові виклик у боротьбі за північні території.",
        "da_DK": "Den uægte baron, hvis borg ligger uden for kortet, har gjort krav på to territorier mod nord. Der er banditlejre i de andre regioner, som ingen endnu har gjort krav på. {br}{br}Byg og udvid i dit eget tempo. Når du er klar, kan du bestride baronens krav på de nordlige territorier.",
        "nl_NL": "Twee gebieden in het noorden zijn opgeëist door de onrechtmatige baron, wiens kasteel zich buiten de kaart bevindt. In de andere, vrije gebieden hebben bandieten hun kampen opgeslagen.{br}{br}Bouw en breid op je eigen tempo uit. Als je er klaar voor bent, kun je met de baron strijden om de noordelijke gebieden.",
        "sv_SE": "Två territorier i norr har erövrats av den orättmätige baronen, vars slott ligger utanför kartan. Det finns banditläger i de andra regionerna, som inte erövrats.{br}{br}Bygg och expandera i din egen takt. När du känner dig redo utmanar du baronen i norr."
      },
      "baron_goal": {
        "en_US": "Conquer every region.",
        "zh_CN": "征服所有区域。",
        "zh_TW": "征服所有地區。",
        "ja_JA": "全ての領土を占領しましょう。",
        "ko_KR": "모든 지역을 점령하십시오.",
        "de_DE": "Erobert alle Regionen.",
        "es_ES": "Conquista todas las regiones.",
        "fr_FR": "Emparez-vous de toutes les régions.",
        "pt_BR": "Conquiste todas as regiões.",
        "pl_PL": "Opanuj wszystkie regiony.",
        "ru_RU": "Захватите все регионы.",
        "it_IT": "Conquista ogni regione.",
        "tr_TR": "Tüm bölgeleri fethet.",
        "cs_CZ": "Dobuď všechny regiony.",
        "hu_HU": "Hódíts meg minden régiót.",
        "uk_UA": "Підкоріть кожен регіон.",
        "da_DK": "Indtag alle regioner.",
        "nl_NL": "Verover elk gebied.",
        "sv_SE": "Erövra alla regioner."
      },
      "survival": {
        "en_US": "On the edge ",
        "zh_CN": "情势紧急 ",
        "zh_TW": "情勢緊急 ",
        "ja_JA": "一触即発",
        "ko_KR": "칼날 위 발악 ",
        "de_DE": "Auf Messers Schneide ",
        "es_ES": "Condiciones extremas",
        "fr_FR": "Sur le fil ",
        "pt_BR": "No limite ",
        "pl_PL": "Na krawędzi ",
        "ru_RU": "На грани ",
        "it_IT": "Al limite ",
        "tr_TR": "Diken üstünde ",
        "cs_CZ": "Na ostří ",
        "hu_HU": "Borotvaélen",
        "uk_UA": "На межі ",
        "da_DK": "På kanten ",
        "nl_NL": "Aan de afgrond ",
        "sv_SE": "Alltid beredd "
      },
      "survival_setup": {
        "en_US": "Grow your city and raise forces as quickly as you can. The lands are pestered by raiders and undefended settlements will quickly perish.",
        "zh_CN": "用最快的速度发展你的城市，组织军队。袭击者在这片土地上纠缠不休，不设防的定居点很快就会被攻破。",
        "zh_TW": "盡你所能地以最快的速度帶領城市成長，並組建軍隊。各地飽受襲擊者所苦，無力防禦的聚落很快就會消亡。",
        "ja_JA": "できるだけ早く都市を発展させ、兵力を拡大しましょう。領地周辺には侵略者が跋扈しており、無防備な集落は瞬く間に壊滅してしまいます。",
        "ko_KR": "최대한 빠르게 도시를 성장시키고 병력을 모으십시오. 약탈자들이 이 땅을 끊임없이 노리고 있습니다. 보호받지 못하는 정착지는 빠르게 사라질 것입니다.",
        "de_DE": "Baut Eure Stadt auf und stellt so schnell wie möglich eine Streitmacht auf. Diese Lande werden von Räubern heimgesucht und Siedlungen ohne Verteidigung werden schnell zugrunde gehen.",
        "es_ES": "Expande tu ciudad y recluta a tus milicias lo más rápido posible. Oleadas de bandidos arremeterán contra cualquier asentamiento indefenso.",
        "fr_FR": "Développez votre village et levez une milice aussi vite que possible. Les pillards fourmillent dans ces contrées et les colonies sans défense ne tiendront pas longtemps.",
        "pt_BR": "Expanda sua cidade e crie tropas o mais rápido que puder. Suas terras logo serão assaltadas por saqueadores e cidades desprotegidas não durarão muito tempo.",
        "pl_PL": "Rozwiń swoje miasto i zgromadź wojska jak najszybciej. Ziemie są nękane przez najeźdźców, a nieobronione osady szybko zostaną unicestwione.",
        "ru_RU": "Ваша задача – как можно скорее расширить свой город и организовать оборону. В этих краях бесчинствуют налетчики, так что незащищенное поселение долго не простоит.",
        "it_IT": "Espandi la tua città e raduna le tue forze il più rapidamente possibile. Le terre sono tormentate dalle incursioni e gli insediamenti indifesi soccomberanno in fretta.",
        "tr_TR": "Elinden geldiğince hızlı bir şekilde şehrini büyüt ve birlik topla. Bu topraklara baskıncılar musallat oluyor, savunmasız yerleşimler kısa sürede mahvolur.",
        "cs_CZ": "Rozviň své město a sestav vojsko co možná nejrychleji. Země sužují nájezdníci a osady bez obrany rychle zaniknou.",
        "hu_HU": "Növeld a városodat és állíts ki sereget, amilyen gyorsan csak tudsz. A vidéket portyázók zaklatják, és a védtelen települések gyorsan odavesznek.",
        "uk_UA": "Розвивайте місто й набирайте війська якнайшвидше. На ці землі набігають рейдери, тож незахищені поселення швидко занепадуть.",
        "da_DK": "Udvid din by, og opbyg dit militær så hurtigt som muligt. Landet er hærget af ransmænd, og forsvarsløse bosættelser vil hurtigt gå til grunde.",
        "nl_NL": "Laat je stad groeien en zet zo snel mogelijk een leger op. Het land wordt geplaagd door rovers en zonder verdediging zullen de nederzettingen snel vallen.",
        "sv_SE": "Bygg upp din stad och dina styrkor så snabbt som möjligt. Landet plågas av plundrare, och bosättningar med bristfälligt försvar stryker snabbt med."
      },
      "survival_goal": {
        "en_US": "Survive all the attacks and reach the \"Large town\" settlement level.",
        "zh_CN": "抵抗入侵，达到“大型城镇”定居点等级。",
        "zh_TW": "在所有攻擊中生存下來，並到達「大型城鎮」等級。",
        "ja_JA": "あらゆる襲撃を耐え抜いて、居留地レベル「大都市」を達成しましょう。",
        "ko_KR": "모든 공격에서 살아남아 \"대형 마을\" 정착지 레벨에 도달하십시오.",
        "de_DE": "Überlebt alle Angriffe und erreicht die Siedlungsstufe „Große Stadt“.",
        "es_ES": "Sobrevive a las incursiones y haz que tu asentamiento alcance el nivel «Ciudad grande».",
        "fr_FR": "Survivez à toutes les attaques et transformez votre colonie en grande ville.",
        "pt_BR": "Sobreviva a todos os ataques e alcance o nível de assentamento Cidade Grande.",
        "pl_PL": "Przetrwaj wszystkie ataki i osiągnij poziom osady „Okazałe miasto”.",
        "ru_RU": "Вам нужно отбить все атаки и довести свое поселение до уровня «большой город».",
        "it_IT": "Sopravvivi a tutti gli attacchi e raggiungi il livello di insediamento \"Città grande\".",
        "tr_TR": "Tüm saldırılara karşı hayatta kal ve \"Büyük kasaba\" yerleşim seviyesine ulaş.",
        "cs_CZ": "Přežij všechny útoky a dosáhni úrovně osady „Velké město“.",
        "hu_HU": "Élj túl minden támadást, és érd el a „Nagyváros” településszintet.",
        "uk_UA": "Переживіть усі напади й досягніть рівня поселення «Велике місто».",
        "da_DK": "Overlev alle angreb, og nå bosættelsesniveauet \"Stor by\".",
        "nl_NL": "Overleef alle aanvallen en bereik het nederzettingsniveau 'Grote stad'.",
        "sv_SE": "Överlev alla angrepp och nå bosättningsnivån Stor stad."
      },
      "peaceful_citybuilding": {
        "en_US": "Rise to prosperity",
        "zh_CN": "昌盛之旅",
        "zh_TW": "邁向繁榮",
        "ja_JA": "繁栄の始まり",
        "ko_KR": "번영의 시작",
        "de_DE": "Aufstieg zum Wohlstand",
        "es_ES": "Camino a la prosperidad",
        "fr_FR": "Bâtir et prospérer",
        "pt_BR": "Ascenção e Prosperidade",
        "pl_PL": "Droga do sukcesu",
        "ru_RU": "Путь к процветанию",
        "it_IT": "Verso la prosperità",
        "tr_TR": "Topraklarını refaha ulaştır",
        "cs_CZ": "Vzestup k rozkvětu",
        "hu_HU": "Virágoztasd fel településedet",
        "uk_UA": "Шлях до процвітання",
        "da_DK": "Vejen til velstand",
        "nl_NL": "Welvaart en welzijn",
        "sv_SE": "Nytt välstånd"
      },
      "peaceful_citybuilding_setup": {
        "en_US": "Fulfill the requirements of your citizens, plan and rule your medieval town as you see fit, without worrying about combat.",
        "zh_CN": "满足公民们的需求，随心所欲地规划、统领你的中世纪小镇，无需担心战斗。",
        "zh_TW": "滿足人民的需求，以你認為合適的方式規劃並統治你的中古城鎮，不需擔心戰鬥的問題。",
        "ja_JA": "民の需要を満たし、思うがままに中世の街を運営・統治しましょう。戦闘は発生しません。",
        "ko_KR": "시민들의 요구를 충족시키며 중세 도시를 자유롭게 설계하고 다스리십시오. 전투는 발생하지 않습니다.",
        "de_DE": "Erfüllt die Bedürfnisse Eurer Bewohner, plant und beherrscht Eure mittelalterliche Stadt nach Eurem Ermessen und kümmert Euch nicht um kriegerische Auseinandersetzungen.",
        "es_ES": "Cumple con los requisitos de tus ciudadanos y planifica y dirige tu ciudad medieval sin preocuparte por cuestiones de guerra.",
        "fr_FR": "Répondez aux besoins de vos citoyens, dessinez votre bourgade médiévale et gouvernez-la comme vous l’entendez, sans vous soucier des combats.",
        "pt_BR": "Atenda às demandas dos seus aldeões, planeje sua expansão e governe sua cidade medieval como quiser, sem se preocupar com o combate.",
        "pl_PL": "Spełniaj wymagania swoich mieszkańców, planuj swoje średniowieczne miasto i władaj nim wedle swojego uznania, bez potrzeby przejmowania się walką.",
        "ru_RU": "Спокойно заботьтесь о нуждах жителей и расширяйте свой средневековый город, не опасаясь нападений.",
        "it_IT": "Soddisfa le esigenze dei tuoi cittadini, progetta e governa la tua città medievale come meglio credi, senza preoccuparti di eventuali combattimenti.",
        "tr_TR": "Savaşlar hakkında endişelenmeden halkının ihtiyaçlarını yerine getir, Orta Çağ kasabanı uygun gördüğün şekilde planla ve yönet.",
        "cs_CZ": "Splň požadavky svých obyvatel, naplánuj své středověké město a vládni mu podle svého. S bojováním si nemusíš dělat starosti.",
        "hu_HU": "Teljesítsd a polgáraid igényeit, tervezd meg és vezesd középkori városodat, ahogyan jónak látod, anélkül, hogy a harc miatt aggódnál.",
        "uk_UA": "Задовольняйте вимоги жителів і розвивайте середньовічне місто на власний розсуд без хвилювання про битви.",
        "da_DK": "Opfyld dine borgeres krav, og planlæg og regér din middelalderby, som du har lyst til, uden at bekymre dig om kamp.",
        "nl_NL": "Voldoe aan de behoeften van je inwoners en plan en heers op jouw manier over je middeleeuwse dorp, zonder je zorgen te maken over gevechten.",
        "sv_SE": "Uppfyll invånarnas krav och planera och härska över din medeltida stad så som du själv vill utan att behöva oroa dig för strider."
      },
      "peaceful_citybuilding_goal": {
        "en_US": "Reach the \"Large town\" settlement level. After that, you may choose to continue in the endless mode.",
        "zh_CN": "达到“大型城镇”定居点等级。在那之后，你可以选择在无尽模式中继续游戏。",
        "zh_TW": "到達「大型城鎮」聚落等級。之後你可以選擇在無限模式中繼續遊戲。",
        "ja_JA": "居留地レベル「大都市」を達成しましょう。その後は、エンドレスモードでプレイすることができます。",
        "ko_KR": "\"대형 마을\" 정착지 레벨에 도달하십시오. 이후 무한 모드에서 계속 플레이할 수 있습니다.",
        "de_DE": "Erreicht die Siedlungsstufe „Große Stadt“. Danach könnt Ihr auf Wunsch im Endlosmodus weiterspielen.",
        "es_ES": "Haz que tu asentamiento alcance el nivel «Ciudad grande». Después, podrás decidir seguir jugando en el modo Infinito.",
        "fr_FR": "Transformez votre colonie en grande ville. Vous pourrez ensuite poursuivre votre partie en mode infini.",
        "pt_BR": "Alcance o nível de assentamento Cidade Grande. Você poderá continuar no modo infinito em seguida, se desejar.",
        "pl_PL": "Osiągnij poziom osady „Okazałe miasto”. Potem można będzie wybrać kontynuowanie rozgrywki w trybie niekończącej się rozgrywki.",
        "ru_RU": "Вам нужно довести свое поселение до уровня «большой город». После этого вы при желании сможете продолжить игру в бесконечном режиме.",
        "it_IT": "Raggiungi il livello di insediamento \"Città grande\". Dopodiché, potrai scegliere di continuare in modalità infinita.",
        "tr_TR": "\"Büyük kasaba\" yerleşim seviyesine ulaş. Ardından sonsuz modda devam etmeyi seçebilirsin.",
        "cs_CZ": "Dosáhni úrovně osady „Velké město“. Pak můžeš pokračovat v nekonečném režimu.",
        "hu_HU": "Érd el a „Nagyváros” településszintet. Ezután dönthetsz úgy, hogy végtelenített módban folytathatod.",
        "uk_UA": "Досягніть рівня поселення «Велике місто». Після цього можна продовжити гру в нескінченному режимі.",
        "da_DK": "Nå frem til bosættelsesniveauet \"Stor by\". Derefter kan du vælge at fortsætte i den endeløse spiltilstand.",
        "nl_NL": "Bereik het nederzettingsniveau 'Grote stad'. Daarna kun je kiezen om door te spelen in het eindeloze speltype.",
        "sv_SE": "Nå bosättningsnivån Stor stad. Efter det kan du välja att fortsätta i det oändliga läget."
      }
    }
  }
]