[
  {
    "Type": "DataTable",
    "Name": "DT_Translation_MercenaryCompanies",
    "Class": "UScriptClass'DataTable'",
    "Properties": {
      "RowStruct": {
        "ObjectName": "ScriptStruct'LocalizedText'",
        "ObjectPath": "/Script/ManorLords"
      }
    },
    "Rows": {
      "brotherhood_of_the_forest": {
        "en_US": "The Brotherhood of the Forest",
        "zh_CN": "森林兄弟会",
        "zh_TW": "森林兄弟會",
        "ja_JA": "森の戦友",
        "ko_KR": "숲의 전우",
        "de_DE": "Die Bruderschaft des Waldes",
        "es_ES": "La hermandad del bosque",
        "fr_FR": "La Confrérie de la forêt",
        "pt_BR": "A Irmandade da Floresta",
        "pl_PL": "Leśne Bractwo",
        "ru_RU": "Лесное братство",
        "it_IT": "La Confraternita della Foresta",
        "tr_TR": "Orman Kardeşliği",
        "cs_CZ": "Lesní bratrstvo",
        "hu_HU": "Az Erdő Testvérisége",
        "uk_UA": "Лісове братство",
        "da_DK": "Skovens broderskab",
        "nl_NL": "Het Broederschap van het woud",
        "sv_SE": "Skogens brödraskap"
      },
      "brotherhood_of_the_forest_descr": {
        "en_US": "Those men seem to pride themselves on stealing from the rich and giving to the poor. They also seem to wear extremely tight hosen.",
        "zh_CN": "这帮人似乎以劫富济贫为荣。而且喜欢穿非常紧身的裤子。",
        "zh_TW": "這些人似乎以劫富濟貧為傲。他們似乎也穿著極貼身的褲子。",
        "ja_JA": "金持ちの財宝を盗み出して貧しい人に与える行為を誇りに思っている集団です。 見るからに窮屈そうなズボンを主に履いています。",
        "ko_KR": "부자의 재물을 훔쳐 빈민에게 나눠주는 행위를 자랑스럽게 여기는 집단입니다. 굉장히 달라붙는 바지를 주로 입습니다.",
        "de_DE": "Diese Männer scheinen sich damit zu brüsten, von den Reichen zu stehlen und es den Armen zu übergeben. Des Weiteren scheinen sie eine Vorliebe für über die Maßen enge Hosen zu haben.",
        "es_ES": "Estos hombres parecen estar orgullosos de robar a los ricos para dárselo a los pobres y de las calzas exageradamente apretadas que llevan.",
        "fr_FR": "Ces hommes semblent s’enorgueillir de voler aux riches pour donner aux pauvres. Leurs chausses ont l’air particulièrement serrées.",
        "pt_BR": "Estes homens se orgulham em roubar dos ricos e dar aos pobres. Além disso, parece que eles usam meiões bem apertados.",
        "pl_PL": "Ci ludzie wydają się szczycić tym, że okradają bogatych i obdarowują ubogich. Ponadto noszą bardzo obcisłe rajtuzy.",
        "ru_RU": "Эти люди хвалятся тем, что грабят богачей и отдают деньги беднякам. А еще они носят облегающие штаны.",
        "it_IT": "Si dice che questo gruppo si vanti di rubare ai ricchi per dare ai poveri. A quanto pare indossano dei pantaloni aderentissimi.",
        "tr_TR": "Bu adamlar zenginlerden çalıp fakirlere vermekten gurur duyuyorlar. Ayrıca fazlasıyla dar tayt giyiyor gibi görünüyorlar.",
        "cs_CZ": "Tito muži se podle všeho pyšní tím, že bohatým berou a chudým dávají. Rovněž se zdá, že nosí nesmírně těsné kalhoty.",
        "hu_HU": "Úgy tűnik, ezek az emberek büszkék, hogy a gazdagoktól lopnak, és a szegényeknek adják. Külön érdekes, hogy rendkívül szűk harisnyát viselnek.",
        "uk_UA": "Здається, ці люди пишаються тим, що крадуть у багатих і віддають бідним. А ще вони носять надзвичайно тугі панчохи.",
        "da_DK": "Disse mænd sætter en ære i at stjæle fra de rige og give til de fattige. De lader også til at foretrække ekstremt stramme hoser.",
        "nl_NL": "Die mannen zijn er trots op dat ze stelen van de rijken en geven aan de armen. Ze hebben ook onwaarschijnlijk strakke broeken aan.",
        "sv_SE": "Stoltserar med att ta från de rika och ge till de fattiga. Och har på sig extremt tajta hosor."
      },
      "crazy_goose": {
        "en_US": "Flock of Crazy Geese",
        "zh_CN": "疯狂鹅群",
        "zh_TW": "瘋狂鵝群",
        "ja_JA": "狂ったガチョウの群れ",
        "ko_KR": "미친 거위 떼",
        "de_DE": "Verrückte Gänseschar",
        "es_ES": "La bandada de los gansos locos",
        "fr_FR": "La Bande d’Oie-gâteuse",
        "pt_BR": "Bando dos Gansos Loucos",
        "pl_PL": "Szalone Sobole",
        "ru_RU": "Бешеные гуси",
        "it_IT": "Stormo di Allocchi pazzi",
        "tr_TR": "Çılgın Kaz Sürüsü",
        "cs_CZ": "Hejno šílených hus",
        "hu_HU": "Őrült Ludak",
        "uk_UA": "Скажені Гуси",
        "da_DK": "Flok af skøre gæs",
        "nl_NL": "De Waanzinnige ganzenzwerm",
        "sv_SE": "Galna gåsflocken"
      },
      "crazy_goose_descr": {
        "en_US": "The origin of the goose is vague. A lot of members used to be broke farmers. Practically anyone can join this company as long as they do not fear death.",
        "zh_CN": "鹅群的起源有些模糊。很多成员过去都是贫困的农民。实际上，只要不怕死，所有人都能加入。",
        "zh_TW": "他們的出身不明。許多成員曾是貧困的農民。基本上，只要不怕死，任何人都可以加入這個團隊。",
        "ja_JA": "「狂ったガチョウの群れ」の正確な由来は分かっていません。所属傭兵のほとんどは元々貧しい農夫で、死ぬことを恐れない限り、誰でもこの傭兵部隊に加入できました。",
        "ko_KR": "이들의 기원은 모호합니다. 소속 용병 대부분이 과거에는 가난한 농부였습니다. 죽음을 두려워하지 않는 한, 누구나 이 용병단에 가입할 수 있습니다.",
        "de_DE": "Die Herkunft der Gänse ist ungeklärt. Viele der Kumpanen waren einst bankrotte Bauern. Die Kompanie nimmt jeden Rekruten auf, solange er den Tod nicht fürchtet.",
        "es_ES": "No se sabe muy bien quién fundó esta banda. Aunque muchos de sus miembros solían ser granjeros en ruinas cualquiera puede formar parte de ella, a no ser que teman a la muerte.",
        "fr_FR": "À ce jour, l’origine de l’Oie reste floue. Nombre de ses membres étaient des paysans sans le sou. La bande accueille plus ou moins quiconque ne craignant pas la mort.",
        "pt_BR": "A origem dos Gansos é incerta. Muitos dos membros costumavam ser fazendeiros falidos. Praticamente qualquer pessoa pode se juntar à companhia, contanto que não tema a morte.",
        "pl_PL": "Pochodzenie tej grupy ginie w mrokach tajemnicy. Wielu z nich to byli wieśniacy. Może do nich dołączyć praktycznie każdy, jeśli tylko nie boi się śmierci.",
        "ru_RU": "Почему в названии идет речь о гусях, неясно. Многие из этих людей – обнищавшие крестьяне. Вступить в отряд может любой, кто не боится смерти.",
        "it_IT": "I suoi membri sono dei veri allocchi, anche se la fondazione della loro compagnia è avvolta nel mistero. Molti di loro erano ex-contadini squattrinati. Praticamente chiunque può unirsi, a patto che non abbia paura di morire.",
        "tr_TR": "Kazların kökeni meçhul. Üyelerin birçoğu beş parasız çiftçilerdi. Ölümden korkmayan hemen hemen herkes bu bölüğe katılabiliyor.",
        "cs_CZ": "Původ těchto hus je nejasný. Řada z nich bývala chudými farmáři. K tomuto spolku se může připojit prakticky kdokoliv, pokud se nebojí smrti.",
        "hu_HU": "A lúd eredete homályos. A tagok közül sokan csődbe ment gazdák voltak. Gyakorlatilag bárki beléphet ebbe a seregbe, ha nem fél a haláltól.",
        "uk_UA": "Їх походження неясне. Більшість членів – колишні селяни, що розорилися. Майже кожен, хто не боїться смерті, може до них приєднатися.",
        "da_DK": "Gåsens oprindelse er uklar. Mange af medlemmerne lader til at være ruinerede bønder. Stort set alle kan slutte sig til kompagniet, så længe de ikke frygter døden.",
        "nl_NL": "De oorsprong van de gans is onbekend. Veel leden waren vroeger arme boeren. Zo'n beetje iedereen kan zich bij deze groep aansluiten, zolang ze de dood niet vrezen.",
        "sv_SE": "Inte mycket är känt om det här kompaniet förutom att många av medlemmarna var fattiga bönder en gång i tiden. I princip vem som helst som inte räds döden kan gå med."
      },
      "brigands": {
        "en_US": "Brigands for hire",
        "zh_CN": "雇佣山贼",
        "zh_TW": "雇用盜匪",
        "ja_JA": "雇われし山賊たち",
        "ko_KR": "도적 용병",
        "de_DE": "Käufliche Briganten",
        "es_ES": "Bandoleros a sueldo",
        "fr_FR": "Brigands avides",
        "pt_BR": "Armas de Aluguel",
        "pl_PL": "Zbóje do wynajęcia",
        "ru_RU": "Наемные разбойники",
        "it_IT": "Briganti a pagamento",
        "tr_TR": "Kiralık Eşkıyalar",
        "cs_CZ": "Nájemní lupiči",
        "hu_HU": "Felfogadható brigantik",
        "uk_UA": "Наймані розбійники",
        "da_DK": "Lømler til leje",
        "nl_NL": "Bandieten te huur",
        "sv_SE": "Lejda stråtrövare"
      },
      "brigands_descr": {
        "en_US": "A large pack of baddies, lead by the biggest and the toughest of them all.",
        "zh_CN": "一个庞大的恶徒组织，由最壮硕、最强悍的人领导。",
        "zh_TW": "一大群惡棍，由最壯碩、最強悍的人領導。",
        "ja_JA": "山賊の中でも最も大柄で、最もたくましい男が率いる悪党の大群。",
        "ko_KR": "가장 덩치가 크고 강한 사람이 이끄는 대규모 불량배 집단입니다.",
        "de_DE": "Ein großer Haufen schwerer Jungs, angeführt vom größten und zähsten unter ihnen.",
        "es_ES": "Un grupo de matones liderado por el más grande y fuerte de todos.",
        "fr_FR": "Un grand groupe composé de diables enragés, mené par le plus gros et le plus fort d’entre eux.",
        "pt_BR": "Um grupo enorme de malfeitores, liderado pelo maior e mais forte deles.",
        "pl_PL": "Liczna grupa zakapiorów, dowodzona przez największego i najwredniejszego z nich.",
        "ru_RU": "Большая свора злыдней, во главе которой стоит самый сильный и свирепый из них.",
        "it_IT": "Un branco di manigoldi, capeggiati dal tizio più grosso e tosto di tutti.",
        "tr_TR": "En büyük ve en sert haydutların önderliğindeki büyük bir zorba sürüsü.",
        "cs_CZ": "Velká smečka padouchů, kterou vede ten největší a nejdrsnější z nich.",
        "hu_HU": "Egy nagy csapat rosszfiú, akiket a legnagyobb és legdörzsöltebb vezet.",
        "uk_UA": "Велика зграя поганців на чолі з найбільшим і найжорстокішим з них.",
        "da_DK": "En stor gruppe ubehagelige typer, anført af den største og ubehageligste af dem alle.",
        "nl_NL": "Een grote groep slechteriken, onder leiding van de grootste en stoerste van allemaal.",
        "sv_SE": "Ett stort gäng bovar med den största och värsta av dem alla i spetsen."
      },
      "brigands_small": {
        "en_US": "Local thugs",
        "zh_CN": "本地暴徒",
        "zh_TW": "在地黑幫",
        "ja_JA": "村のチンピラ",
        "ko_KR": "동네 깡패",
        "de_DE": "Einheimische Strolche",
        "es_ES": "Matones de la región",
        "fr_FR": "Voyous locaux",
        "pt_BR": "Bandidos Locais",
        "pl_PL": "Miejscowe zbiry",
        "ru_RU": "Местные душегубы",
        "it_IT": "Malviventi del posto",
        "tr_TR": "Yerel Haydutlar",
        "cs_CZ": "Místní hromotluci",
        "hu_HU": "Helyi csirkefogók",
        "uk_UA": "Місцеві душогуби",
        "da_DK": "Lokale bøller",
        "nl_NL": "Plaatselijk gespuis",
        "sv_SE": "Lokala råskinn"
      },
      "brigands_small_descr": {
        "en_US": "A small pack of local misfits and troublemakers.",
        "zh_CN": "由本地边缘人和小流氓组成的小团体。",
        "zh_TW": "一小群本地的混混和惹事精。",
        "ja_JA": "近所の問題児やトラブルメーカーが集まった小さな集団です。",
        "ko_KR": "동네의 문제아와 골칫거리들이 모인 소규모 집단입니다.",
        "de_DE": "Eine kleine Gruppe einheimischer Unruhestifter und Schwerenöter.",
        "es_ES": "Un pequeño grupo de maleantes e inadaptados.",
        "fr_FR": "Une petite troupe de marginaux et de fauteurs de troubles.",
        "pt_BR": "Um pequeno grupo local de desajustados e encrenqueiros.",
        "pl_PL": "Mała banda miejscowych wyrzutków i rozrabiaków.",
        "ru_RU": "Стайка местных отщепенцев и задир.",
        "it_IT": "Un piccolo gruppo di sbandati e combinaguai.",
        "tr_TR": "Uyumsuz ve belalı vatandaşlardan oluşan küçük bir yerel grup.",
        "cs_CZ": "Malá smečka místních pobudů a potížistů.",
        "hu_HU": "Egy kis falka helyi csavargókból és bajkeverőkből.",
        "uk_UA": "Невелика зграя місцевих відступників і шибайголів.",
        "da_DK": "En lille gruppe af lokale fiaskoer og ballademagere.",
        "nl_NL": "Een kleine bende plaatselijke buitenbeentjes en onruststokers.",
        "sv_SE": "En mindre skara lokala byfånar och ligister."
      },
      "wayward_sons": {
        "en_US": "The Wayward Sons",
        "zh_CN": "纨绔子弟",
        "zh_TW": "紈褲子弟",
        "ja_JA": "頑固なやつら",
        "ko_KR": "고집불통 아이들",
        "de_DE": "Die abtrünnigen Söhne",
        "es_ES": "Vástagos de la avaricia",
        "fr_FR": "Les Brebis galeuses",
        "pt_BR": "Os Filhos Pródigos",
        "pl_PL": "Krnąbrni Synowie",
        "ru_RU": "Блудные сыны",
        "it_IT": "I Figli Ribelli",
        "tr_TR": "Yaramaz Evlatlar",
        "cs_CZ": "Vzpurní synové",
        "hu_HU": "Az Útkereső Fiak",
        "uk_UA": "Блудні Сини",
        "da_DK": "De vildfarne sønner",
        "nl_NL": "De Eigenzinnige zonen",
        "sv_SE": "De nyckfulla sönerna"
      },
      "wayward_sons_descr": {
        "en_US": "New to the region, hailing from far in the west: the region of Francia. Their customs and tongue are strange, and they rarely mix with the locals, spending what money they acquire in taverns and retreating to nurse their drinks in the deep woods.",
        "zh_CN": "他们来自遥远的西方：弗兰西亚地区，新来不久。有着奇怪的习惯和口音，很少和本地人交往，喜欢去酒馆买酒，然后回到深林中慢饮。",
        "zh_TW": "來自西方弗蘭西亞地區，初來乍到的新人。他們的習俗和話語都很奇怪，而且很少和本地人來往，只把賺得的錢都花在酒館，或是退到森林深處去享用他們的酒。",
        "ja_JA": "はるか西のフランク地方からやってきた新しい集団です。風習や言語が異なるため、地元の人々とうまく交流できていないようです。人々と交流する代わりに稼いだお金を酒場で使い、森の奥で酒を飲みながらゆっくり休みます。",
        "ko_KR": "서쪽 먼 곳에 있는 프랑크 지역에서 온 새로운 집단입니다. 풍습과 언어가 낯선 탓에 현지인들과 잘 어울리지 못합니다. 대신 벌어들인 돈을 술집에서 탕진하며 숲속 깊은 곳에서 술을 마시고 휴식을 취합니다.",
        "de_DE": "Neu in der Gegend und aus dem Frankenreich fernen Westen zugewandert. Ihre Bräuche sind genauso seltsam wie ihre Sprache und sie mischen sich kaum unters einheimische Volk. Wenn sie dennoch in Tavernen erscheinen, um ihren Sold auszugeben, ziehen sie sich mit ihren Getränken in der Regel in den tiefen Wald zurück.",
        "es_ES": "Oriundos de la región de Francia, situada en el extremo oeste, llegaron recientemente a la región. Sus costumbres y su idioma son singulares y rara vez se mezclan entre la gente local. Gastan lo que ganan en las tabernas y se retiran a beber cerveza en las profundidades del bosque.",
        "fr_FR": "Une bande qui vient d’arriver dans la région, originaire de Francia, un lointain pays de l’ouest. Les coutumes et la langue de ses membres sont étranges. Ces derniers se mêlent rarement à la population locale, dépensant les quelques pièces qu’ils gagnent dans les tavernes pour ensuite s’imbiber loin des autres, au fin fond de la forêt.",
        "pt_BR": "Novos por aqui, este grupo vem da região do Reino Franco no longínquo oeste. Seus costumes e idioma são estranhos, e eles raramente se misturam com o pessoal local, preferindo gastar seu dinheiro nas tavernas e em seguida voltar para as florestas para aproveitar suas bebidas.",
        "pl_PL": "Są nowi w tej okolicy i twierdzą, że pochodzą z dalekiego zachodu: regionu zwanego Galią. Mają dziwaczny język i zwyczaje, i rzadko zadają się z miejscowymi. Zdobyte pieniądze wydają w karczmach na wino, a potem znikają w leśnej gęstwinie, by delektować się nim w spokoju.",
        "ru_RU": "Недавно прибыли в этот регион с далекого запада: из земель, именуемых Франкией. У них странные обычаи и язык, и местных жителей они по большей части обходят стороной. Просто спускают добытые деньги в корчмах и удаляются вместе с выпивкой обратно к себе, в глухую чащу.",
        "it_IT": "Un gruppo di nuovi arrivati, provenienti dal lontano occidente: la regione di Francia. Le loro usanze e la loro lingua sono insoliti, e raramente si mescolano con la gente del posto: preferiscono spendere i loro guadagni nelle taverne per poi ritirarsi a bere nel profondo della foresta.",
        "tr_TR": "Batıdan, Francia bölgesinden gelen, bu bölgede yeni kimseler. Gelenekleri ve dilleri bir tuhaf, yerlilere nadiren karışırlar. Elde ettikleri parayı hanlarda harcayıp ormanın derinliklerinde içkilerini yudumlamaya çekilirler.",
        "cs_CZ": "Pocházejí z dalekého západu, z oblasti Francie, a v tomto regionu jsou noví. Mají podivné obyčeje a jazyk a málokdy se mísí mezi místní. Veškeré získané peníze utrácejí v krčmách a pak utíkají popíjet do hlubokých lesů.",
        "hu_HU": "Újak a régióban, messze nyugatról érkeztek: Frankhonból. Szokásaik és nyelvük furcsa, és ritkán keverednek a helyiekkel, azt a pénzt, amit szereznek, a kocsmában költik el, és az erdő mélyére vonulnak el az italukkal.",
        "uk_UA": "Вони приїхали з далекого заходу – регіону Франкії. Їхні звичаї й мова дивні, вони нечасто спілкуються з місцевими, а зароблені гроші витрачають у тавернах і йдуть пиячити в глухі ліси.",
        "da_DK": "De er nye her på egnen og kommer fra Frankerriget langt mod vest. Deres skikke er lige så sære som deres sprog, og de omgås sjældent de lokale. De bruger de penge, de tilraner sig, i kroer, men de drikke, de køber, tager de med sig ud i skovens mørke.",
        "nl_NL": "Ze zijn nieuw in deze buurt en komen uit het verre westen: het Frankische rijk. Hun gewoonten en spraak zijn vreemd en ze gaan zelden met de lokale bevolking om. Ze geven hun geld uit in taveernes, waarna ze zich terugtrekken in het bos om hun drankje te nuttigen.",
        "sv_SE": "Nykomlingar i regionen med rötterna i Francia – ett område långt, långt bort i väst. Deras seder och språk är ett mysterium, och de beblandar sig sällan med lokalbefolkningen. Istället lägger de alla sina pengar i värdshus och tar med sig drickan till skogens snår, där de super för fulla muggar."
      },
      "greencaps": {
        "en_US": "Greencaps",
        "zh_CN": "绿巾帮",
        "zh_TW": "綠帽子",
        "ja_JA": "緑の帽子",
        "ko_KR": "녹색 모자",
        "de_DE": "Grünkappen",
        "es_ES": "Los yelmos flagelantes",
        "fr_FR": "Les Cornards hargneux",
        "pt_BR": "Gorros Verdes",
        "pl_PL": "Zielone Peleryny",
        "ru_RU": "Зеленые шапки",
        "it_IT": "Berretti Verdi",
        "tr_TR": "Yeşilbaşlar",
        "cs_CZ": "Zelené čapky",
        "hu_HU": "Zöldsüvegesek",
        "uk_UA": "Зелені Шапки",
        "da_DK": "Grønhætterne",
        "nl_NL": "De Groene kappen",
        "sv_SE": "Grönhättorna"
      },
      "greencaps_descr": {
        "en_US": "A reformed band of outlaws, sporting fashionable green hats for which they are known.",
        "zh_CN": "一群洗心革面的法外狂徒，喜爱穿戴时尚的绿帽，并以此闻名。",
        "zh_TW": "一群改過自新的亡命之徒，以其時尚的綠色帽子而廣為人知。",
        "ja_JA": "改心した無法者集団です。最近流行りの緑色の帽子をかぶっていることで有名になりました。",
        "ko_KR": "개심한 무법자 집단입니다. 최근 유행하는 녹색 모자를 쓰고 다녀서 이름을 알렸습니다.",
        "de_DE": "Eine Bande geläuterter Gesetzloser, die mit den für ihre Namensgebung verantwortlichen modischen grünen Kopfbedeckungen ausgestattet ist.",
        "es_ES": "Una banda de prófugos reformados que lucen los sombreros de los que reciben su nombre.",
        "fr_FR": "Une bande de hors-la-loi réformés, dont les membres sont coiffés de chics galurins verts qui ont fait leur célébrité.",
        "pt_BR": "Um bando reformado de foras da lei cujo nome se deve aos estilosos chapéus verdes que usam.",
        "pl_PL": "Banda byłych wygnańców w szykownych zielonych kapeluszach, z których słyną daleko.",
        "ru_RU": "Отряд перевоспитавшихся разбойников. Отличить их можно по щегольским зеленым шапкам.",
        "it_IT": "Una banda riformata di fuorilegge, i cui membri sono celebri per i loro sgargianti berretti verdi.",
        "tr_TR": "Taktıkları modaya uygun yeşil şapkalarıyla tanınan, yenilikçi bir haydut grubu.",
        "cs_CZ": "Napravená banda psanců s fešnými zelenými čepicemi, díky kterým se proslavili.",
        "hu_HU": "Egy újraalakult, törvényen kívüli banda, akik divatos zöld kalapot viselnek ismertetőjelként.",
        "uk_UA": "Реформована банда злочинців, які носять зелені капелюхи, через котрі й стали відомими.",
        "da_DK": "En reformeret gruppe af lovløse, der er kendt for deres moderigtige grønne hatte.",
        "nl_NL": "Een bekeerde groep schurken met stijlvolle groene hoeden, waar ze om bekendstaan.",
        "sv_SE": "Ett reformerat banditgäng som har på sig de snygga gröna huvudbonaderna deras namn antyder."
      },
      "vultures": {
        "en_US": "The Ravenous Vultures",
        "zh_CN": "贪婪秃鹰",
        "zh_TW": "貪婪禿鷹",
        "ja_JA": "貪欲な鷲",
        "ko_KR": "탐욕스러운 독수리",
        "de_DE": "Die Raubgeier",
        "es_ES": "Los buitres rapaces",
        "fr_FR": "Les Vautours déplumés",
        "pt_BR": "Os Abutres Vorazes",
        "pl_PL": "Żarłoczne Sępy",
        "ru_RU": "Ненасытные грифы",
        "it_IT": "Gli Avvoltoi Famelici",
        "tr_TR": "Açgözlü Akbabalar",
        "cs_CZ": "Hladoví supi",
        "hu_HU": "A Falánk Keselyűk",
        "uk_UA": "Ненаситні грифи",
        "da_DK": "De glubske gribbe",
        "nl_NL": "De Hongerige gieren",
        "sv_SE": "De glupska gamarna"
      },
      "vultures_descr": {
        "en_US": "Well disciplined fighters. For an unknown reason they discarded the sword and only use maces and axes as weapons of choice.",
        "zh_CN": "纪律严明的战士。出于某种未知的原因，他们放弃了利剑，只使用狼牙棒和斧头作为武器。",
        "zh_TW": "一群紀律嚴明的戰士。因為不明的原因，他們擯棄長劍，只使用錘和斧頭為武器。",
        "ja_JA": "よく訓練された戦士たちです。 理由はわかりませんが、剣の代わりに鈍器と斧だけを武器として使用しています。",
        "ko_KR": "잘 훈련받은 전사들입니다. 이유는 알 수 없지만, 검 대신 둔기와 도끼만을 무기로 사용합니다.",
        "de_DE": "Äußerst disziplinierte Krieger. Aus unbekannten Gründen verzichten sie gänzlich auf den Einsatz von Schwertern und führen lediglich Streitkolben und Äxte ins Gefecht.",
        "es_ES": "Son luchadores muy disciplinados que, por algún motivo que se desconoce, no van armados con espadas. Tan solo se defienden con mazas y hachas.",
        "fr_FR": "Des combattants disciplinés. Pour une raison que l’on ignore, ils ont délaissé les épées pour ne plus utiliser que des masses et des haches au combat.",
        "pt_BR": "Guerreiros bem disciplinados. Por algum motivo desconhecido, eles abandonaram as espadas e usam apenas maças e machados como armas.",
        "pl_PL": "Zdyscyplinowani wojacy. Z niewiadomych powodów wyzbyli się mieczy i używają teraz wyłącznie buław i toporów.",
        "ru_RU": "Хорошо организованные воители. По неведомой причине они зареклись брать в руки меч и теперь орудуют исключительно булавами и топорами.",
        "it_IT": "Guerrieri ben addestrati che, per un motivo ignoto, hanno abbandonato la spada e combattono esclusivamente con mazze e asce.",
        "tr_TR": "Oldukça disiplinli dövüşçüler. Bilinmeyen bir sebepten ötürü kılıcı bırakıp silah olarak yalnızca gürz ve balta kullanırlar.",
        "cs_CZ": "Ukáznění bojovníci. Z nějakého neznámého důvodu odhodili meče a používají pouze palice a sekery.",
        "hu_HU": "Fegyelmezett harcosok. Ismeretlen okból elvetették a kardot, csak buzogányt és fejszét forgatnak.",
        "uk_UA": "Дисципліновані бійці. З невідомої причини відмовилися від мечів і використовують лише булави й сокири.",
        "da_DK": "Veldisciplinerede krigere. Af uvisse årsager har de afsvoret sværdet og bruger kun stridskøller og økser.",
        "nl_NL": "Goed getrainde vechters. Om onbekende redenen hebben ze het zwaard afgezworen en gebruiken ze alleen nog knuppels en bijlen.",
        "sv_SE": "Väldisciplinerade kämpar som av någon anledning lade svärdet på hyllan och nu bara använder sig av klubbor och yxor."
      },
      "battle_brothers": {
        "en_US": "Battle Brothers",
        "zh_CN": "兄弟连",
        "zh_TW": "戰鬥兄弟檔",
        "ja_JA": "戦場の兄弟たち",
        "ko_KR": "전장의 형제들",
        "de_DE": "Kampfbrüder",
        "es_ES": "Los hermanos de la batalla",
        "fr_FR": "Les Frères de guerre",
        "pt_BR": "Irmãos de Batalha",
        "pl_PL": "Bracia Broni",
        "ru_RU": "Боевые братья",
        "it_IT": "Fratelli in Battaglia",
        "tr_TR": "Savaşçı Kardeşler",
        "cs_CZ": "Bojoví bratři",
        "hu_HU": "Bajtársak",
        "uk_UA": "Бойові брати",
        "da_DK": "Slagsbrødrene",
        "nl_NL": "De Strijdmakkers",
        "sv_SE": "Stridsbröderna"
      },
      "battle_brothers_descr": {
        "en_US": "Story tells they all lost a bet with their former liege in a brothel, leading them to abandoning their former lives and joining him as fighters. They decided to stick to this life.",
        "zh_CN": "传闻他们在妓院中与前领主打赌输了，从而放弃了各自从前的生活，加入他的阵营成为战士。他们决心继续这样的新生活。",
        "zh_TW": "據說他們都在一家妓院裡打賭輸給先前的主君，因此他們拋棄過去的生活，和他一起成為戰士。他們決定繼續維持這種生活。",
        "ja_JA": "売春宿でかつて仕えていた領主との賭けで負けてしまった人たちです。賭けの前の生活を捨てて流浪戦士の生活を始めたようです。何だか今の生活に満足しているようです。",
        "ko_KR": "사창가에서 과거 모시던 영주와 내기를 했다가 패배한 사람들입니다. 내기 결과 이전의 삶을 버리고 떠돌이 전사의 삶을 시작했습니다. 다만, 어쩐지 이런 생활을 마음에 들어 하는 듯합니다.",
        "de_DE": "Der Legende nach verloren sämtliche Brüder einst in einem Freudenhaus eine Wette gegen ihren ehemaligen Lehensherren. Im Anschluss daran gaben sie ihr bisheriges Leben auf, um ihm als Krieger zur Seite zu stehen. Sie blieben letztendlich dabei.",
        "es_ES": "Según ciertos rumores, perdieron una apuesta contra su antiguo señor en un burdel y tuvieron que abandonar sus vidas para unirse a él como compañeros de batalla, una senda que decidieron recorrer sin mirar atrás.",
        "fr_FR": "La légende raconte qu’ils ont tous perdu un pari avec leur ancien seigneur dans une maison de passe, ce qui les poussa à abandonner leur vie d'avant et pour mettre leur épée à son service. Ils ont choisi de rester sur cette voie.",
        "pt_BR": "Dizem as histórias que eles perderam uma aposta com seu antigo senhor em um bordel, o que os levou a abandonarem suas antigas vidas e a se juntarem a ele como guerreiros. Eles decidiram continuar nessa vida.",
        "pl_PL": "Krążą pogłoski, że wszyscy przegrali zakład ze swoim dawnym suwerenem, zawarty w burdelu. Musieli więc porzucić swoje dawne życie i przyłączyć się do niego jako wojownicy. I tego postanowili się trzymać.",
        "ru_RU": "Как рассказывают, они все проиграли спор с неким вельможей в борделе, в результате чего были вынуждены порвать с прошлой жизнью и примкнуть к нему в качестве дружинников. А потом свыклись с этой новой для себя ролью.",
        "it_IT": "Secondo la leggenda, persero una scommessa con il loro vecchio capo in un bordello, che li costrinse a lasciare la loro vita precedente e a seguirlo come combattenti. Da allora, decisero di dedicarsi anima e corpo a questa nuova strada.",
        "tr_TR": "Rivayete göre hepsi bir genelevde eski lordlarıyla girdikleri bir bahsi kaybedip eski hayatlarını bırakmış ve dövüşçüler olarak kendisine katılmışlar. Bu hayata bağlı kalmaya karar vermişler.",
        "cs_CZ": "Legenda praví, že všichni členové prohráli sázku se svým bývalým pánem v nevěstinci, pročež museli opustit svůj minulý život a přidat se k němu coby bojovníci. U tohoto života se pak rozhodli zůstat.",
        "hu_HU": "A történet szerint mindannyian elvesztettek egy fogadást egykori hűbérurukkal szemben egy bordélyban, emiatt felhagytak korábbi életükkel, és harcosnak álltak az oldalán. Úgy döntöttek, ennél az életnél maradnak.",
        "uk_UA": "Подейкують, вони програли парі колишньому пану в борделі, що спонукало їх полишити минуле життя й стати його воїнами. Таке життя їм сподобалося.",
        "da_DK": "Historien vil vide, at de alle tabte et væddemål med deres tidligere hersker i et bordel, hvilket førte dem til at opgive deres gamle liv og slutte sig til ham som krigere. De har valgt at fortsætte dette liv.",
        "nl_NL": "Volgens de geruchten hebben ze een weddenschap verloren van hun vorige heer in een bordeel, waardoor ze hun levens vaarwel zeiden en zich bij hem aansloten als vechters. Ze besloten om dit leven te omarmen.",
        "sv_SE": "Enligt legenden förlorade de ett vad mot sin före detta ledare i en bordell, vilket fick dem att lägga sina gamla liv bakom sig och bli hans soldater. Det har de fortsatt med ända sedan dess."
      },
      "hildebolts_army": {
        "en_US": "Hildebolt von Bereneute",
        "zh_CN": "希尔德伯特·冯·贝罕诺特",
        "zh_TW": "希爾德伯特·馮·貝罕諾特",
        "ja_JA": "ヒルデボルト・フォン・ベレヌート",
        "ko_KR": "힐데볼트 폰 베레네우트",
        "de_DE": "Hildebolt von Bereneute",
        "es_ES": "Hildebolt von Bereneute",
        "fr_FR": "Hildebolt von Bereneute",
        "pt_BR": "Hildebolt von Bereneute",
        "pl_PL": "Hildebolt von Bereneute",
        "ru_RU": "Хильдебольт фон Беренойте",
        "it_IT": "Hildebolt von Bereneute",
        "tr_TR": "Hildebolt von Bereneute",
        "cs_CZ": "Hildebolt von Bereneute",
        "hu_HU": "Hildebolt von Bereneute",
        "uk_UA": "Гільдебольт фон Беренойте",
        "da_DK": "Hildebolt von Bereneute",
        "nl_NL": "Hildebolt von Bereneute",
        "sv_SE": "Hildebolt von Bereneute"
      },
      "hildebolts_army_large": {
        "en_US": "Hildebolt von Bereneute",
        "zh_CN": "希尔德伯特·冯·贝罕诺特",
        "zh_TW": "希爾德伯特·馮·貝罕諾特",
        "ja_JA": "ヒルデボルト・フォン・ベレヌート",
        "ko_KR": "힐데볼트 폰 베레네우트",
        "de_DE": "Hildebolt von Bereneute",
        "es_ES": "Hildebolt von Bereneute",
        "fr_FR": "Hildebolt von Bereneute",
        "pt_BR": "Hildebolt von Bereneute",
        "pl_PL": "Hildebolt von Bereneute",
        "ru_RU": "Хильдебольт фон Беренойте",
        "it_IT": "Hildebolt von Bereneute",
        "tr_TR": "Hildebolt von Bereneute",
        "cs_CZ": "Hildebolt von Bereneute",
        "hu_HU": "Hildebolt von Bereneute",
        "uk_UA": "Гільдебольт фон Беренойте",
        "da_DK": "Hildebolt von Bereneute",
        "nl_NL": "Hildebolt von Bereneute",
        "sv_SE": "Hildebolt von Bereneute"
      }
    }
  }
]