[
  {
    "Type": "DataTable",
    "Name": "DT_Translation_Wiki",
    "Class": "UScriptClass'DataTable'",
    "Properties": {
      "RowStruct": {
        "ObjectName": "ScriptStruct'LocalizedText'",
        "ObjectPath": "/Script/ManorLords"
      }
    },
    "Rows": {
      "construction": {
        "en_US": "Construction",
        "zh_CN": "建造",
        "zh_TW": "建設",
        "ja_JA": "建設",
        "ko_KR": "건설",
        "de_DE": "Gebäude",
        "es_ES": "Construcción",
        "fr_FR": "Construction",
        "pt_BR": "Construção",
        "pl_PL": "Budowa",
        "ru_RU": "Строительство",
        "it_IT": "Costruzione",
        "tr_TR": "İnşaat",
        "cs_CZ": "Stavba",
        "hu_HU": "Építkezés",
        "uk_UA": "Будівництво",
        "da_DK": "Byggeri",
        "nl_NL": "Bouw",
        "sv_SE": "Byggnation"
      },
      "construction_descr": {
        "en_US": "When the player places a new building, it has to be constructed. First, the required <h>CONSTRUCTION GOODS</> need to be physically brought to the construction site. This is done by <h>UNASSIGNED FAMILIES</>, often with the help of <h>OXEN</> hauling the <h>TIMBER</>. Then, <h>UNASSIGNED FAMILIES</> will perform construction tasks until the building is fully constructed. Only then it becomes actually functional. ",
        "zh_CN": "当玩家放置新建筑时，此建筑需要被建造。首先 <h>建筑材料</> 需要被运输至建筑工地。这项工作会由 <h>未指派的家庭</> 完成，通常会在 <h>牛</> 的帮助下拉动 <h>木材</>。然后，<h>未指派的家庭</> 将执行建筑任务直至建筑完全建成。只有在这之后，建筑才会发挥其功能。 ",
        "zh_TW": "玩家放置一棟新建築時，就必須進行建造。首先，必要的 <h>建設貨物</> 必須實際運送到建設地點。這件事由 <h>未指定家庭</> 負責，通常需要 <h>牛</> 協助運送 <h>木材</>。接著，<h>未指定家庭</> 將執行建設工作，直到該建築全部完工。這時候它才能實際發揮功用。 ",
        "ja_JA": "プレイヤーが新たな施設を配置すると建設が始まります。 {br}まず、必要な<h>建設資材</>を建設現場に運ぶ必要があります。 {br}資材の運搬は<h>未配置状態の家族</>が行い、ときに<h>牛</>を使って<h>木材</>の運搬が行われることもあります。 {br}資材が運ばれた後には、<h>未配置状態の家族</>が建設作業を行います。 {br}建物の建設が完了すると、施設が使えるようになります。 ",
        "ko_KR": "플레이어가 새로운 건물을 배치하면 건설 작업이 시작됩니다. 우선, 필요한 <h>건설 자재</> 가 건설 현장으로 운반되어야 합니다. 자재 운반은 <h>미배치 가족</> 이 수행하며, <h>황소</> 의 도움을 받아서 <h>목재</> 를 운반할 수도 있습니다. 이후 건물이 완성될 때까지 <h>미배치 가족</> 들이 건설 업무를 수행합니다. 이 단계가 완료되면 건물을 이용할 수 있습니다. ",
        "de_DE": "Wenn der Spieler ein neues Gebäude platziert hat, muss dieses errichtet werden. Zuerst wird das nötige <h>BAUMATERIAL</> mit körperlichem Aufwand zur Baustelle geschafft werden. Diese Aufgabe übernehmen <h>NICHT ZUGEWIESENE FAMILIEN</>, oft mit der Hilfe von <h>OCHSEN</>, die das <h>BAUHOLZ</> ziehen. Anschließend kümmern sich <h>NICHT ZUGEWIESENE FAMILIEN</> um den Bauauftrag, bis das Gebäude fertiggestellt ist. Erst ab dem Zeitpunkt der Fertigstellung ist es betriebsbereit. ",
        "es_ES": "Hay que edificar las construcciones que se colocan. Primero, se acarrean al lugar los <h>RECURSOS</> necesarios para su construcción. De esta tarea se encargan las <h>FAMILIAS SIN ASIGNAR</>, que transportan la madera con la ayuda de <h>BUEYES</>. Luego, comenzarán a construir hasta que terminen. Las construcciones solo son funcionales una vez terminadas.",
        "fr_FR": "Lorsque vous placez un nouveau bâtiment, ce dernier doit être construit. Tout d’abord, les <h>MATÉRIAUX DE CONSTRUCTION</> requis doivent être transportés physiquement jusqu’au chantier. Cette tâche incombe aux <h>FAMILLES NON AFFECTÉES</>, souvent avec l’aide de <h>BŒUFS</> pour transporter le <h>BOIS</>. Les <h>FAMILLES NON AFFECTÉES</> s’occupent ensuite des travaux. Le bâtiment ne sera fonctionnel qu’une fois la construction terminée. ",
        "pt_BR": "Após um edifício ser posicionado, ele precisa ser construído. Primeiro, os <h>MATERIAIS DE CONSTRUÇÃO</> necessários devem ser transportados ao canteiro de obras. Essa etapa é realizada pelas <h>FAMÍLIAS OCIOSAS</>, normalmente com a ajuda dos <h>BOIS</> que levam os <h>TRONCOS</>. Em seguida, as <h>FAMÍLIAS OCIOSAS</> trabalharão no canteiro até a construção estar concluída. Só então o edifício estará funcionando. ",
        "pl_PL": "Gdy gracz umieści nowy budynek, trzeba go jeszcze zbudować. Najpierw na plac budowy trzeba fizycznie dostarczyć niezbędne <h>MATERIAŁY BUDOWLANE</>. Dokonują tego <h>RODZINY BEZ PRZYDZIAŁU</>, często z pomocą <h>WOŁÓW</> ciągnących <h>KŁODY DREWNA</>. Następnie <h>RODZINY BEZ PRZYDZIAŁU</> będą wykonywać prace budowlane aż do ukończenia budynku. Dopiero potem zacznie on działać. ",
        "ru_RU": "Когда игрок размещает новую постройку, ее еще нужно возвести. Для начала требуется доставить в указанное место необходимые <h>СТРОИТЕЛЬНЫЕ МАТЕРИАЛЫ</>. Это делают <h>НЕЗАНЯТЫЕ СЕМЬИ</>, зачастую посредством <h>ВОЛОВ</>, перевозящих <h>ДРЕВЕСИНУ</>. Затем <h>НЕЗАНЯТЫЕ СЕМЬИ</> начнут выполнять строительные работы, и только по завершении этих работ здание будет введено в эксплуатацию. ",
        "it_IT": "Quando il giocatore posiziona un nuovo edificio, questo deve prima essere costruito. Per prima cosa, le <h>RISORSE DESTINATE ALLA COSTRUZIONE</> necessarie devono essere portate fisicamente al cantiere. Questo compito viene svolto dalle <h>FAMIGLIE NON INCARICATE</>, spesso aiutate da <h>BUOI</> che trasportano il <h>LEGNAME</>. Successivamente, le <h>FAMIGLIE NON INCARICATE</> continueranno le attività edilizie finché i lavori di costruzione non verranno ultimati. Solo allora la struttura diventerà funzionante. ",
        "tr_TR": "Oyuncu yeni bir yapı yerleştirdiğinde bunun inşa edilmesi gerekir. Öncelikle gerekli <h>İNŞAAT MALLARININ</> fiziksel olarak inşaat alanına getirilmesi gerekir. Bu, çoğu zaman <h>KERESTE</> taşıyan <h>ÖKÜZLER</> yardımıyla <h>ATANMAMIŞ AİLELER</> tarafından gerçekleştirilir. Sonrasında <h>ATANMAMIŞ AİLELER</>, yapı tamamen inşa edilene kadar inşaat görevlerini yerine getirir. Yapı ancak bundan sonra işlevsel hâle gelir. ",
        "cs_CZ": "Každá budova se musí nejprve postavit. Potřebné <h>STAVEBNÍ MATERIÁLY</> je kvůli tomu třeba fyzicky dopravit na staveniště. O to se postarají <h>NEPŘIŘAZENÉ RODINY</>, často s pomocí <h>VOLKŮ</>, kteří táhnou <h>DŘEVO</>. <h>NEPŘIŘAZENÉ RODINY</> pak budou vykonávat stavební práce, dokud se budova nepostaví. Teprve poté začne plně fungovat.",
        "hu_HU": "Amikor a játékos új épületet helyez el, azt meg kell építeni. Először a szükséges <h>ÉPÍTÉSI ÁRUT</> fizikailag az építkezés helyszínére kell szállítani. Ezt a <h>FELADATRA NEM RENDELT CSALÁDOK</> végzik, akik a <h>SZÁLFÁKAT</> szállítják, gyakran <h>ÖKRÖK</> segítségével. Ezután a <h>FELADATRA NEM RENDELT CSALÁDOK</> végzik az építési feladatokat, amíg az épület teljesen fel nem épül. Csak ezután válik ténylegesen működőképessé. ",
        "uk_UA": "Коли гравець розміщує нову будівлю, її ще слід збудувати. По-перше, потрібно забезпечити майданчик необхідними <h>БУДІВЕЛЬНИМИ МАТЕРІАЛАМИ</>. Цим займаються <h>НЕЗАЙНЯТІ СІМ'Ї</> – зазвичай за допомогою <h>ВОЛІВ</>, які перевозять <h>ДЕРЕВИНУ</>. Після цього <h>НЕЗАЙНЯТІ СІМ'Ї</> розпочнуть будівництво, поки не зведуть споруду повністю. Лише тоді вона почне працювати. ",
        "da_DK": "Når en spiller placerer en ny bygning, skal den bygges. Først skal de nødvendige <h>BYGGEMATERIALER</> transporteres fysisk til byggepladsen. Dette gøres af <h>IKKE-TILDELTE FAMILIER</>, ofte med hjælp fra <h>OKSER</>, der slæber <h>TØMMER</>. Derefter begynder <h>IKKE-TILDELTE FAMILIER</> at bygge, indtil byggeriet er bygget færdigt. Først da kan bygningen bruges. ",
        "nl_NL": "Als de speler een nieuw gebouw plaatst, moet het worden gebouwd. Eerst moeten de <h>BOUWMATERIALEN</> fysiek naar de bouwplaats worden gebracht. Dit wordt gedaan door <h>GEZINNEN ZONDER OPDRACHT</>, vaak met behulp van <h>OSSEN</> die het <h>HOUT</> vervoeren. Daarna voeren <h>GEZINNEN ZONDER OPDRACHT</> de bouwwerkzaamheden uit, totdat het gebouw klaar is. Pas daarna kan het gebouw functioneren. ",
        "sv_SE": "Du måste uppföra nya byggnader du placerar ut. Först måste du ta de nödvändiga <h>BYGGNATIONSVARORNA</> till byggplatsen fysiskt. Det görs av <h>EJ TILLDELADE FAMILJER</>, ofta med hjälp av <h>OXAR</> som bär <h>TIMMER</>. Därefter utför de <h>EJ TILLDELADE FAMILJERNA</> byggnationsuppgifter tills byggnaden är färdig. Först då går den att använda. "
      },
      "family": {
        "en_US": "Family",
        "zh_CN": "家庭",
        "zh_TW": "家庭",
        "ja_JA": "家族",
        "ko_KR": "가족",
        "de_DE": "Familie",
        "es_ES": "Familia",
        "fr_FR": "Familles",
        "pt_BR": "Família",
        "pl_PL": "Rodzina",
        "ru_RU": "Семья",
        "it_IT": "Famiglia",
        "tr_TR": "Aile",
        "cs_CZ": "Rodina",
        "hu_HU": "Család",
        "uk_UA": "Сім'я",
        "da_DK": "Familie",
        "nl_NL": "Gezinnen",
        "sv_SE": "Familjer"
      },
      "family_descr": {
        "en_US": "Families are the basic unit and the foundation of the whole game. Each family consists of multiple family members. Each family consumes 1 <img id=\"Food\"/> <h>FOOD</> per month, and up to 2<img id=\"Fuel\"/> <h>FUEL</> per month (<h>FUEL CONSUMPTION</>). Families live in <h>RESIDENTIAL BUILDINGS</>, and the <h>FAMILY LEVEL</> is equal to the level of their housing. {br}{br} Each family can be assigned to a specific <h>WORKPLACE</>, unless it has been converted to <h>ARTISANS</>, then it permanently works at their home. Male family members (husbands and sons) can become members of the <h>MILITIA</>.",
        "zh_CN": "家庭是基础单位，也是整个游戏最基础的部分。每户家庭由多个家庭成员组成。每户家庭每月消耗1单位的 <img id=\"Food\"/> <h>食物</> 和最多2单位的 <img id=\"Fuel\"/> <h>燃料</>（<h>燃料消耗</>）。家庭生活在 <h>住宅建筑</> 中，<h>家庭等级</> 与他们的房屋等级相同。{br}{br}每户家庭可以被指派去某个特定的 <h>工作场所</>，除非他们变成了永久居家工作的 <h>工匠</>。男性家庭成员（丈夫和儿子）可以加入 <h>民兵</>。",
        "zh_TW": "家庭是整個遊戲的基本單位，也是基礎。每個家庭包括多位家庭成員。每個家庭每個月消耗 1 單位<img id=\"Food\"/><h>食物</>，以及每個月最多 2 單位<img id=\"Fuel\"/><h>燃料</>（<h>燃料消耗</>）。家庭住在<h>住宅建築</>中，<h>家庭等級</>等同於其住家的等級。{br}{br}每個家庭都可以被指定到一處特定的<h>工作地點</>，除非它已經被轉換成<h>工匠</>，這樣它就會永遠在家裡工作。男性家庭成員（丈夫和兒子）可以成為<h>民兵</>。",
        "ja_JA": "本作の基本的な単位です。家族は複数の家族構成員で構成されています。 {br}各家族は毎月に1個の <img id=\"Food\"/> <h>食糧</>と最大2個の <img id=\"Fuel\"/> <h>燃料</>を消費します（<h>燃料消費</>）。 {br}家族は<h>住居用施設</>で生活し、<h>家族レベル</>は居住用施設のレベルと同じです。 {br}{br}家族は特定の<h>仕事場</>に配置され、<h>職人</>へ変換された後には各自の家で永久的に働くことになります。 {br}男性の家族構成員（夫と息子）は<h>民兵隊</>に所属されることもあります。",
        "ko_KR": "가족은 본 게임의 기본 단위이며 게임 전체의 기반입니다. 가족은 여러 명의 가족 구성원으로 이루어져 있습니다. 각 가족은 매달 1개의 <img id=\"Food\"/> <h>식량</> 과 최대 2개의 <img id=\"Fuel\"/> <h>연료</> 를 소모합니다(<h>연료 소모</> ). 가족은 <h>주거용 건물</> 에서 생활하며, <h>가족 레벨</> 은 거주용 건물 레벨과 동일합니다. {br}{br}각 가족은 특정 <h>일터</> 에 배치될 수 있으며, <h>기능공</> 으로 전환된 가족은 각자의 집에서 영구적으로 일합니다. 남성 가족 구성원(남편과 아들)은 <h>민병대</> 에 소속될 수 있습니다.",
        "de_DE": "Familien sind die grundlegende Einheit und damit das Fundament des gesamten Spiels. Eine Familie besteht aus mehreren Familienmitgliedern. Jede Familie verbraucht pro Monat 1 <img id=\"Food\"/> <h>NAHRUNG</> und bis zu 2 <img id=\"Fuel\"/> <h>BRENNSTOFF</> (<h>BRENNSTOFFVERBRAUCH</>). Familien leben in <h>WOHNGEBÄUDEN</> und die <h>FAMILIENSTUFE</> entspricht der Stufe ihrer Behausung. {br}{br}Jede Familie kann einem bestimmten <h>ARBEITSPLATZ</> zugewiesen werden, sofern sie nicht in eine Familie von <h>HANDWERKERN</> umgewandelt wurde, die dauerhaft in ihrem Wohnhaus arbeitet. Männliche Familienmitglieder (Ehemänner und Söhne) können Mitglieder der <h>MILIZ</> werden.",
        "es_ES": "Las familias están compuestas por varios miembros y son tanto la unidad básica como los cimientos de todo el juego. De manera mensual, cada una consume 1 de <img id=\"Food\"/> <h>ALIMENTO</> y hasta 2 de <img id=\"Fuel\"/> <h>COMBUSTIBLE</>. Viven en <h>CONSTRUCCIONES RESIDENCIALES</> y su <h>NIVEL DE FAMILIA</> es igual al nivel de su residencia. {br}{br}Se pueden asignar a <h>LUGARES DE TRABAJO</> específicos, siempre y cuando no sean <h>ARTESANOS</>. Estos últimos trabajan en casa de forma permanente. Los varones, es decir, los maridos y los hijos, pueden formar parte de la <h>MILICIA</>.",
        "fr_FR": "Les familles représentent les unités de base et sont les fondations du jeu. Chaque famille est composée de plusieurs membres. Elle consomme une unité de <img id=\"Food\"/> <h>NOURRITURE</> par mois et jusqu’à deux unités de <img id=\"Fuel\"/> <h>COMBUSTIBLE</> par mois (<h>CONSOMMATION DE COMBUSTIBLE</>). Les familles vivent dans les <h>BÂTIMENTS RÉSIDENTIELS</> et leur <h>NIVEAU</> est équivalent à celui de leur habitation. {br}{br}Chaque famille peut être affectée à un <h>LIEU DE TRAVAIL</>, sauf si ses membres ont été convertis en <h>ARTISANS</>, auquel cas ils resteront travailler chez eux. Les hommes d’une famille (époux et fils) pourront devenir membres de la <h>MILICE</>.",
        "pt_BR": "As famílias são as unidades básicas que fundamentam todo o jogo. Cada família possui vários membros, e ela fará o consumo mensal de 1 <img id=\"Food\"/> <h>COMIDA</> e até 2 <img id=\"Fuel\"/> <h>COMBUSTÍVEIS</>. As famílias vivem em <h>PRÉDIOS RESIDENCIAIS</> e o <h>NÍVEL DA FAMÍLIA</> é igual ao nível de sua casa. {br}{br}As famílias podem ser designadas a <h>LOCAIS DE TRABALHO</>, a menos que elas se tornem famílias de <h>ARTESÃOS</>, que trabalham de forma fixa na própria casa. Os homens da família (maridos e filhos) podem se tornar membros da milícia.",
        "pl_PL": "Rodziny są podstawową jednostką i fundamentem całej rozgrywki. Na rodzinę składa się kilka osób. Każda rodzina zużywa 1 jednostkę <img id=\"Food\"/> <h>JEDZENIA</> i do 2 jednostek <img id=\"Fuel\"/> <h>OPAŁU</> miesięcznie (<h>ZUŻYCIE OPAŁU</>). Rodziny mieszkają w <h>BUDYNKACH MIESZKALNYCH</>, a <h>POZIOM RODZINY</> jest równy poziomowi ich domostwa. {br}{br}Każdą rodzinę można przydzielić do określonego <h>MIEJSCA PRACY</>, chyba że została zmieniona w <h>RZEMIEŚLNIKÓW</>, którzy pracują cały czas w swoim domu. Męscy członkowie rodzin (mężowie i synowie) mogą dołączyć do <h>MILICJI</>.",
        "ru_RU": "Семья – это базовая единица, лежащая в основе всей игры. Каждая семья насчитывает несколько членов. Каждая семья потребляет 1 меру <img id=\"Food\"/> <h>ЕДЫ</> в месяц и до 2 мер <img id=\"Fuel\"/> <h>ТОПЛИВА</> в месяц (<h>ПОТРЕБЛЕНИЕ ТОПЛИВА</>). Семьи располагаются в <h>ЖИЛЫХ ДОМАХ</>, и <h>УРОВЕНЬ СЕМЬИ</> равен уровню их жилища. {br}{br} Каждую семью можно закрепить за тем или иным <h>РАБОЧИМ МЕСТОМ</>, если только эти люди не получили статус <h>РЕМЕСЛЕННИКОВ</> – тогда они будут трудиться на дому. Члены семьи мужского пола (мужья и сыновья) могут вступить в <h>ОПОЛЧЕНИЕ</>.",
        "it_IT": "Le famiglie sono l'unità di base e l'elemento portante dell'intero gioco. Ogni famiglia è composta da diversi membri e consuma 1 unità di <img id=\"Food\"/> <h>CIBO</> al mese, e fino a 2 unità di <img id=\"Fuel\"/> <h>COMBUSTIBILE</> al mese (<h>CONSUMO DEL COMBUSTIBILE</>). Le famiglie vivono in <h>EDIFICI RESIDENZIALI</> e il <h>LIVELLO DELLA FAMIGLIA</> è uguale a quello della loro abitazione. {br}{br}Ogni famiglia può essere assegnata a un <h>LUOGO DI LAVORO</> specifico, a meno che non venga convertita in un gruppo di <h>ARTIGIANI</>; in quel caso, lavorerà permanentemente all'interno della propria casa. I membri maschi della famiglia (mariti e figli) possono entrare a far parte della <h>MILIZIA</>.",
        "tr_TR": "Aileler temel birimdir ve tüm oyunun esasıdır. Her aile birden fazla aile üyesinden oluşur. Her aile ayda 1 <img id=\"Food\"/> <h>YİYECEK</> ve en fazla 2 <img id=\"Fuel\"/> <h>YAKACAK</> (<h>YAKACAK TÜKETİMİ</>) tüketir. Aileler <h>KONUT YAPILARINDA</> yaşar ve <h>AİLE SEVİYESİ</>, konutlarının seviyesine eşittir. {br}{br} Her aile, <h>ZANAATKÂRLARA</> dönüştürülmedikleri sürece belirli bir <h>ÇALIŞMA ALANINA</> atanabilir. Zanaatkârlara dönüştürülürlerse kalıcı olarak evlerinde çalışırlar. Erkek aile üyeleri (beyler ve oğullar) <h>MİLİS</> üyesi olabilir.",
        "cs_CZ": "Rodiny jsou základní jednotkou a základem celé hry. Každá rodina se skládá z několika členů. Každá rodina spotřebuje měsíčně 1 <img id=\"Food\"/> <h>JÍDLO</> a až 2 jednotky <img id=\"Fuel\"/> <h>PALIVA</> (<h>SPOTŘEBA PALIVA</>). Rodiny bydlí v <h>OBYTNÝCH BUDOVÁCH</> a <h>ÚROVEŇ RODINY</> je rovna úrovni jejího bydlení. {br}{br}Každou rodinu lze přiřadit na konkrétní <h>PRACOVIŠTĚ</>, pokud se z ní nestali <h>ŘEMESLNÍCI</>, kteří permanentně pracují doma. Z mužských členů rodin (manželé a synové) se mohou stát členové <h>DOMOBRANY</>.",
        "hu_HU": "A család az egész játék alapegysége és alapja. Minden család több családtagból áll. Minden család 1 <img id=\"Food\"/> <h>ÉLELMET</> és legfeljebb 2<img id=\"Fuel\"/> <h>TÜZELŐT</> fogyaszt havonta (<h>TÜZELŐFOGYASZTÁS</>). A családok <h>LAKÓÉPÜLETBEN</> élnek, és a <h>CSALÁD SZINTJE</> megegyezik a lakhelyük szintjével. {br}{br} Minden családot kirendelhetsz egy adott <h>MUNKAHELYRE</>, kivéve, ha <h>KÉZMŰVESSÉ</> alakítottad, akkor állandóan otthon dolgoznak. A család férfitagjai (férjek és fiúk) a <h>MILÍCIA</> tagjai lehetnek.",
        "uk_UA": "Сім'ї – основні мешканці й фундамент гри. Кожна сім'я складається з декількох членів, споживає 1 од. <img id=\"Food\"/> <h>ЇЖІ</> на місяць, і до 2 од.<img id=\"Fuel\"/> <h>ПАЛЬНОГО</> на місяць (<h>СПОЖИВАННЯ ПАЛЬНОГО</>). Сім'ї живуть у <h>ЖИТЛОВИХ БУДІВЛЯХ</>, а <h>РІВЕНЬ СІМ'Ї</> дорівнює рівню житла. {br}{br}Кожну сім'ю можна призначити на конкретне <h>МІСЦЕ РОБОТИ</>, допоки вони не стануть <h>РЕМІСНИКАМИ</> й постійно працюватимуть вдома. Члени сім'ї чоловічої статі (чоловіки й сини) можуть стати <h>ОПОЛЧЕНЦЯМИ</>.",
        "da_DK": "Familier er den grundlæggende enhed og fundamentet for hele spillet. Hver familie består af flere familiemedlemmer. Hver familie forbruger 1 <img id=\"Food\"/> <h>MAD</> om måneden og op til 2 <img id=\"Fuel\"/> <h>BRÆNDSEL</> om måneden (<h>BRÆNDSELSFORBRUG</>). Familier bor i <h>BEBOELSESBYGNINGER</>, og <h>FAMILIENIVEAUET</> er lige med dens beboelsesniveau. {br}{br} Hver familie kan tildeles en bestemt <h>ARBEJDSPLADS</>, med mindre de er konverteret til <h>HÅNDVÆRKERE</>, der permanent arbejder i deres hjem. Mandlige familiemedlemmer (husbonde og sønner) kan blive medlemmer af <h>MILITSEN</>.",
        "nl_NL": "Gezinnen zijn de basiseenheid en het fundament van het hele spel. Elk gezin bestaat uit meerdere gezinsleden. Elk gezin consumeert 1 <img id=\"Food\"/> <h>VOEDSEL</> per maand en tot 2 <img id=\"Fuel\"/> <h>BRANDSTOF</> per maand (<h>BRANDSTOFVERBRUIK</>). Gezinnen wonen in <h>WONINGEN</> en het <h>GEZINSNIVEAU</> is gelijk aan het niveau van hun woning. {br}{br}Elk gezin kan worden toegewezen aan een specifieke <h>WERKPLEK</>, tenzij ze zijn veranderd in <h>AMBACHTSLIEDEN</>, dan werken ze permanent vanuit hun huis. Mannelijke gezinsleden (echtgenoten en zonen) kunnen lid worden van een <h>MILITIE</>.",
        "sv_SE": "Familjer är spelets grundenhet och fundament. Varje familj består av flera medlemmar. Varje familj förbrukar 1 <img id=\"Food\"/> <h>MAT</> och upp till 2<img id=\"Fuel\"/> <h>BRÄNSLE</> i månaden (<h>BRÄNSLEKONSUMTION</>). Familjer bor i <h>BOSTÄDER</>, och <h>FAMILJENIVÅN</> är samma som bostadsnivån.{br}{br}Du kan tilldela alla familjer en viss <h>ARBETSPLATS</>, såvida de inte har omvandlats till <h>HANTVERKARE</>. Då arbetar de permanent från hemmet. De manliga medlemmarna (makarna och sönerna) kan gå med i <h>MILISEN</>."
      },
      "weather_damage": {
        "en_US": "Weather damage",
        "zh_CN": "天灾",
        "zh_TW": "天氣傷害",
        "ja_JA": "天気による被害",
        "ko_KR": "기후 피해",
        "de_DE": "Wetterschaden",
        "es_ES": "Inclemencias meteorológicas",
        "fr_FR": "Dégâts causés par les intempéries",
        "pt_BR": "Intempéries",
        "pl_PL": "Uszkodzenia od pogody",
        "ru_RU": "Ущерб от непогоды",
        "it_IT": "Danni delle intemperie",
        "tr_TR": "Hava koşullarından kaynaklı hasar",
        "cs_CZ": "Poškození počasím",
        "hu_HU": "Időjárási károk",
        "uk_UA": "Шкода від негоди",
        "da_DK": "Vejrskade",
        "nl_NL": "Weerschade",
        "sv_SE": "Väderskador"
      },
      "weather_damage_descr": {
        "en_US": "Rain and snowfall may irreversibly destroy resources that are exposed. To avoid exposure, resources need to be placed in appropriate <h>STORAGE</> with respects to the building's <h>STORAGE LIMITS</>. {br}{br}On easy and normal <h>DIFFICULTY SETTINGS</>, the destruction happens only every second weather event and the player gets a warning.",
        "zh_CN": "降雨和降雪可能会对暴露在外的资源造成不可逆的破坏。为了避免暴露在外，资源需要放置在与建筑 <h>储藏上限</> 相符的、合适的 <h>储藏室</> 中。{br}{br}在简单和正常的 <h>难度设置</> 中，每隔一个天气事件仅会发生一次破坏，玩家也会受到警告。",
        "zh_TW": "下雨和下雪可能會永久摧毀暴露在外的資源。要避免暴露在外，必須將資源放置在適當的<h>倉庫</>中，並遵守該建築的<h>容量限制</>。{br}{br}在簡單和正常的<h>難易度設定</>中，每兩次天氣事件才會發生一次這樣的破壞，而且玩家會收到警訊。",
        "ja_JA": "雨や雪が降ると、外部に出された資源は復旧できないほど傷んでしまいます。 {br}このような被害を防ぐには施設の<h>保管限度</>を考慮して、{br}適切な<h>保管施設</>に資源を配置する必要があります。 {br}{br}イージーとノーマル<h>難易度</>では、2回に1回の頻度で資源が被害を受けます。 {br}このとき、プレイヤーに警告メッセージが表示されます。",
        "ko_KR": "자원이 외부 환경에 노출되어 있는 경우, 비와 눈이 내렸을 때 복구할 수 없을 정도로 파괴될 수 있습니다. 노출을 피하려면 건물의 <h>저장 한도</> 를 고려하여 적절한 <h>저장 건물</> 에 자원을 저장해두어야 합니다. {br}{br}쉬움과 보통 <h>난이도 설정</> 에서는 기후 이벤트가 2회 발생할 때 한 번씩만 물자가 파괴됩니다. 이때 플레이어는 경고 메시지를 받아볼 수 있습니다.",
        "de_DE": "Regen und Schneefall können ungeschützte Ressourcen beschädigen. Um Ressourcen zu schützen, müssen diese in entsprechenden <h>LAGERN</> und unter Berücksichtigung der jeweiligen <h>LAGERKAPAZITÄTEN</> eines Gebäudes verwahrt werden. {br}{br}Auf den <h>SCHWIERIGKEITSGRADEN</> Leicht oder Normal kommt es nur bei jedem zweiten Wetterereignis zu Schäden und der Spieler wird zuvor entsprechend gewarnt.",
        "es_ES": "La lluvia y la nieve pueden destruir los recursos que tengas expuestos. Para protegerlos, usa el <h>ALMACENAMIENTO</> apropiado y recuerda vigilar el <h>LÍMITE DE ALMACENAMIENTO</> de tus construcciones. {br}{br}En <h>DIFICULTAD</> fácil y normal, solo se destruyen los recursos al segundo evento meteorológico y se emite una advertencia antes de que esto suceda.",
        "fr_FR": "La pluie et la neige risquent de détruire les ressources exposées. Pour éviter ces pertes, vous devrez stocker ces ressources dans les <h>LIEUX DE STOCKAGE</> adéquats et selon les <h>LIMITES DE STOCKAGE</> définies. {br}{br}Dans les <h>MODES DE DIFFICULTÉ</> facile et normal, la destruction de ressources ne survient qu’à la deuxième intempérie et vous recevrez un avertissement à ce sujet.",
        "pt_BR": "A chuva e as nevascas podem estragar recursos que estejam expostos. Para evitar a exposição, os recursos precisam ser guardados em locais de <h>ARMAZENAMENTO</> adequados, respeitando os <h>LIMITES DE ARMAZENAMENTO</> dos edifícios. {br}{br}Nos níveis fácil e normal de dificuldade, a perda de recursos expostos só ocorre com a segunda ocorrência de uma intempérie e o jogador receberá um aviso.",
        "pl_PL": "Deszcz i śnieg mogą nieodwracalnie uszkodzić nieosłonięte zasoby. Aby tego uniknąć, trzeba umieścić zasoby w odpowiednich <h>MAGAZYNACH</>, zwracając uwagę na <h>LIMITY POJEMNOŚCI</> tych budynków. {br}{br}Na niskim i normalnym <h>POZIOMIE TRUDNOŚCI</> zniszczenie zasobów ma miejsce tylko po co drugich opadach i gracz otrzymuje ostrzeżenie.",
        "ru_RU": "Дождь и снегопад могут испортить ресурсы, хранящиеся под открытым небом. Во избежание этого ресурсы следует держать в <h>КЛАДОВОЙ</> соответствующего типа, но имейте в виду, что <h>ВМЕСТИМОСТЬ</> кладовых ограничена. {br}{br}На низком и среднем <h>УРОВНЯХ СЛОЖНОСТИ</> порча ресурсов происходит только при повторном воздействии непогоды, и игрок заблаговременно получает предупреждение.",
        "it_IT": "Pioggia e nevicate possono distruggere irreversibilmente le risorse esposte. Per evitare che ciò accada, le risorse devono essere conservate all'interno di <h>DEPOSITI</> adeguati, rispettando i <h>LIMITI DI STOCCAGGIO</> dell'edificio. {br}{br}A <h>DIFFICOLTÀ</> facile e normale, la distruzione avviene solo durante ogni seconda istanza di un evento meteorologico e il giocatore riceverà un avviso.",
        "tr_TR": "Yağmur ve kar yağışı açıkta kalan kaynakları geri döndürülemeyecek şekilde yok edebilir. Açıkta kalmayı önlemek için kaynakların, yapının <h>DEPOLAMA SINIRINA</> bağlı olarak uygun <h>DEPOYA</> yerleştirilmesi gerekir. {br}{br}Kolay ve normal <h>ZORLUK AYARLARINDA</> tahribat yalnızca iki hava olayında bir gerçekleşir ve oyuncu bir uyarı alır.",
        "cs_CZ": "Déšť a sníh může nenávratně zničit nechráněné suroviny. Vystavení surovin vlivům počasí se vyhneš tak, že je umístíš do příslušných <h>SKLADŮ</> s ohledem na <h>SKLADOVACÍ LIMITY</> budovy. {br}{br}Na nízké a normální <h>OBTÍŽNOSTI</> dochází ke zničení surovin pouze s každou druhou událostí počasí a hráčům se zobrazuje varování.",
        "hu_HU": "Az eső és a havazás visszafordíthatatlanul tönkreteheti a kiszolgáltatott nyersanyagokat. A kiszolgáltatottság elkerülése érdekében a nyersanyagokat megfelelő <h>RAKTÁRBAN</> kell elhelyezni a <h>TÁROLÁSI KORLÁT</> figyelembe vételével. {br}{br}Könnyű és normál <h>NEHÉZSÉGI BEÁLLÍTÁSON</> a pusztulás csak minden második időjárási eseménykor történik meg, és a játékos figyelmeztetést kap.",
        "uk_UA": "Дощ і снігопад можуть безповоротно знищити ресурси під відкритим небом. Щоб цього уникнути, їх потрібно перевозити у відповідні <h>СХОВИЩА</> з урахуванням <h>ОБМЕЖЕНЬ НА ЗБЕРІГАННЯ</>. {br}{br}На простому й нормальному <h>РІВНЯХ СКЛАДНОСТІ</> ресурси знищуються лише при кожному другому погодному явищі, а гравець отримує попередження.",
        "da_DK": "Regn og sne kan uopretteligt beskadige ressourcer, der er udsatte. For at undgå det skal ressourcer placeres i passende <h>OPBEVARINGSBYGNINGER</>, der har den nødvendige <h>LAGERKAPACITET</>. {br}{br}På lette og normale <h>SVÆRHEDSGRADER</> bliver ressourcer kun ødelagt af hver anden vejrbegivenhed, og spilleren får en advarsel.",
        "nl_NL": "Regen en sneeuw kunnen blootgestelde materialen permanent verwoesten. Om blootstelling te voorkomen, moeten materialen in een geschikte <h>OPSLAG</> worden bewaard, rekening houdend met de <h>OPSLAGLIMIET</> van het gebouw. {br}{br}Op de <h>MOEILIJKHEIDSGRADEN</> 'makkelijk' en 'normaal' wordt materiaal alleen verwoest als het twee keer aan het weer wordt blootgesteld. De eerste keer krijgt de speler een waarschuwing.",
        "sv_SE": "Regn och snöfall kan förstöra utsatta resurser permanent. För att skydda resurserna ska du placera dem i lämpliga <h>LAGER</>, men tänk på att byggnaderna har <h>GRÄNSER FÖR LAGERUTRYMME</>. {br}{br}Förödelsen sker bara under vissa väderfenomen om du ställer in <h>SVÅRIGHETSGRADEN</> på lätt eller normal, och du får dessutom en varning."
      },
      "storage": {
        "en_US": "Storage",
        "zh_CN": "储藏室",
        "zh_TW": "倉庫",
        "ja_JA": "保管",
        "ko_KR": "저장",
        "de_DE": "Lagerung",
        "es_ES": "Almacenamiento",
        "fr_FR": "Stockage",
        "pt_BR": "Armazenamento",
        "pl_PL": "Magazyn",
        "ru_RU": "Хранение",
        "it_IT": "Deposito",
        "tr_TR": "Depolama",
        "cs_CZ": "Sklad",
        "hu_HU": "Raktár",
        "uk_UA": "Сховище",
        "da_DK": "Opbevaring",
        "nl_NL": "Opslag",
        "sv_SE": "Lager"
      },
      "storage_descr": {
        "en_US": "There are 3 types of storage in the game currently: <h>GENERIC STORAGE</>, <h>PANTRY</>, and <h>LOG STORAGE</>. Different buildings have different <h>STORAGE LIMITS</> for each category. Each resource belongs to a specific storage category, for example <h>FIREWOOD</> belongs to <h>GENERIC STORAGE</> while <h>BREAD</> belongs in a <h>PANTRY</>. When storage reaches its limits in <h>PRODUCTION BUILDINGS</>, labor stops. When storage exceeds limits, <h>WEATHER DAMAGE</> might destroy resources. To avoid reaching or exceeding <h>STORAGE LIMITS</>, make sure you have enough <h>STORAGE BUILDINGS</> with enough <h>ASSIGNED FAMILIES</>.",
        "zh_CN": "游戏中目前有3种类型的储藏室：<h>通用储藏</>，<h>食物储藏</> 和 <h>木材储藏</>。不同的建筑对于每个类别有不同的 <h>储藏上限</>。每种资源都属于某种特定的储藏类别，例如 <h>木柴</> 属于 <h>通用储藏</>，而 <h>面包</> 属于 <h>食物储藏</>。当储藏室在 <h>生产建筑</> 中到达上限时，劳动将会停止。当储藏超过上限时，<h>天气事件</> 可能会破坏资源。为了避免到达或超出 <h>储藏上限</>，请确保有足够的 <h>储藏建筑</> 和足够的 <h>指派家庭</>。",
        "zh_TW": "目前遊戲中有 3 種倉庫：<h>通用倉庫</>、<h>糧倉</>以及<h>木材倉庫</>。在每種類別中，不同的建築物會有不同的<h>容量限制</>。每種資源都隸屬於一種特定的倉庫類別，例如<h>木柴</>屬於<h>通用倉庫</>，而<h>麵包</>則屬於<h>糧倉</>。當<h>生產建築</>中的貨物達到其容量限制時，勞工會停止工作。當倉庫超過容量限制時，<h>天氣傷害</>可能會摧毀資源。為了避免到達或超過<h>容量限制</>，請確定你擁有足夠的<h>倉庫建築</>，並有足夠的<h>指定家庭</>。",
        "ja_JA": "現在、ゲームには3つのタイプの保管施設（<h>一般保管庫</>、<h>食料貯蔵庫</>、<h>丸太保管庫</>）が存在します。 {br}<h>保管できる資源</>は、施設によって異なります。 {br}例えば、<h>薪</>は<h>一般保管庫</>に、<h>パン</>は<h>食料貯蔵庫</>に保管されます。 {br}<h>生産施設</>の保管枠が限界に達すると生産が中断されます。 {br}また、保管限度以上に生産された物資は<h>天気により被害</>を受ける可能性もあります。 {br}<h>保管限度</>に関するトラブルを事前に防ぐには {br}<h>保管施設</>と<h>配置された家族</>の状況をこまめに確認しましょう。",
        "ko_KR": "게임에는 현재 3가지 유형의 저장 건물이 존재합니다. 각각 <h>일반 저장실</> , <h>식량 저장실</> 그리고 <h>통나무 저장실</> 입니다. 건물의 종류에 따라 각 범주에 대해 서로 다른 <h>저장 한도</> 를 보유합니다. 각 자원에는 특정한 저장 범주가 지정되어 있습니다. 예를 들어 <h>장작</> 은 <h>일반 저장실</> 에 저장되지만, <h>빵</> 은 <h>식량 저장실</> 에 저장됩니다. <h>생산 건물</> 의 저장 공간이 한계에 도달하면 업무가 중단됩니다. 저장 한도 이상으로 생산된 물자는 <h>기후 피해</> 로 인해 파괴될 수 있습니다. <h>저장 한도</> 에 도달하거나 초과하는 상황을 방지하려면 <h>저장 건물</> 과 <h>배치된 가족</> 이 충분한지 사전에 확인하십시오.",
        "de_DE": "Aktuell gibt es im Spiel drei verschiedene Lagerungsarten: <h>ALLGEMEINES LAGER</>, <h>LEBENSMITTELLAGER</> und <h>HOLZLAGER</>. Die unterschiedlichen Gebäude haben verschiedene <h>LAGERKAPAZITÄTEN</> für jede Kategorie. Jede Ressource gehört einer bestimmten Lagerkategorie an. <h>BRENNHOLZ</> etwa muss im <h>ALLGEMEINEN LAGER</> verwahrt werden, während <h>BROT</> in ein <h>LEBENSMITTELLAGER</> gehört. Wenn die Lagerkapazitätsgrenze von <h>PRODUKTIONSGEBÄUDEN</> erreicht ist, wird die Arbeit eingestellt. Wenn die Lagerkapazitätsgrenze überschritten wird, können Ressource <h>WETTERSCHÄDEN</> zum Opfer fallen. Sorgt dafür, dass Ihr ausreichend <h>LAGERGEBÄUDE</> mit genügend <h>ZUGEWIESENEN FAMILIEN</> habt, damit <h>LAGERKAPAZITÄTEN</> nicht erschöpft oder überschritten werden.",
        "es_ES": "Hay 3 tipos de almacenamiento en el juego: <h>GENERAL</>, <h>DESPENSA</> y <h>LEÑOS</>. Cada construcción tiene sus propios <h>LÍMITES DE ALMACENAMIENTO</> para cada una de las categorías. Los recursos pertenecen a categorías concretas. Por ejemplo, la <h>LEÑA</> pertenece al almacenamiento <h>GENERAL</> y el <h>PAN</>, a la <h>DESPENSA</>. Cuando se acaba el espacio de almacenamiento en las <h>CONSTRUCCIONES DE PRODUCCIÓN</>, se detiene el trabajo. Las <h>INCLEMENCIAS METEOROLÓGICAS</> pueden destruir los recursos que excedan los límites de almacenamiento. Para evitar que ocurra, asegúrate de que tienes <h>CONSTRUCCIONES DE ALMACENAMIENTO</> suficientes, así como <h>FAMILIAS ASIGNADAS</>.",
        "fr_FR": "Le jeu propose actuellement trois types de stockage : le <h>STOCKAGE GÉNÉRAL</>, le <h>GARDE-MANGER</> et le <h>STOCKAGE DE BOIS</>. Chaque bâtiment dispose de ses propres <h>LIMITES DE STOCKAGE</> pour chaque catégorie. Chaque ressource appartient à une catégorie spécifique, par exemple les <h>BÛCHES</> se rattachent au <h>STOCKAGE GÉNÉRAL</> tandis que le <h>PAIN</> ira dans un <h>GARDE-MANGER</>. Lorsque la limite d’un stockage est atteinte dans les <h>BÂTIMENTS DE PRODUCTION</>, le travail y est interrompu. Lorsque les ressources stockées dépassent la limite, elles seront exposées aux <h>INTEMPÉRIES</> et risquent d’être détruites. Pour éviter d’atteindre ou de dépasser les <h>LIMITES DE STOCKAGE</>, assurez-vous de disposer d’assez de <h>BÂTIMENTS DE STOCKAGE</> et d’y affecter suffisamment de <h>FAMILLES</>.",
        "pt_BR": "Há três categorias de armazenamento no momento: <h>RESERVA GERAL</>, <h>DESPENSA</> e <h>RESERVA DE TRONCOS</>. Edifícios diferentes têm <h>LIMITES DE ARMAZENAMENTO</> diferentes para cada categoria. Cada recurso pertence a uma categoria específica: por exemplo, a <h>LENHA</> pertence à <h>RESERVA GERAL</>, enquanto que <h>PÃES</> pertencem à <h>DESPENSA</>. Quando o armazenamento fica cheio em um <h>LOCAL DE TRABALHO</>, o trabalho é interrompido. Quando o limite do armazenamento é ultrapassado, os recursos correm o risco de serem destruídos por <h>INTEMPÉRIES</>. Para evitar que isso aconteça, tenha sempre <h>EDIFÍCIOS DE ARMAZENAMENTO</> suficientes com <h>FAMÍLIAS DESIGNADAS</> a eles.",
        "pl_PL": "Obecnie w grze istnieją 3 typy magazynu: <h>MAGAZYN OGÓLNY</>, <h>SPIŻARNIA</> i <h>MAGAZYN KŁÓD</>. Poszczególne budynki mają różne <h>LIMITY POJEMNOŚCI</>. Każdy zasób należy do określonej kategorii składowania, na przykład <h>DREWNO OPAŁOWE</> należy do <h>MAGAZYNU OGÓLNEGO</>, podczas gdy <h>CHLEB</> – do <h>SPIŻARNI</>. Gdy cały magazyn <h>BUDYNKU PRODUKCYJNEGO</> zostanie zapełniony, praca ustaje. Gdy ilość składowanego zasobu przekracza limit, <h>USZKODZENIA OD POGODY</> mogą niszczyć zasoby. Aby uniknąć osiągania lub przekraczania <h>LIMITÓW POJEMNOŚCI</>, zadbaj o posiadanie odpowiednich <h>BUDYNKÓW MAGAZYNOWYCH</> z wymaganą liczbą <h>PRZYDZIELONYCH RODZIN</>.",
        "ru_RU": "На данный момент в игре есть 3 типа хранилищ: <h>КЛАДОВАЯ ДЛЯ МАТЕРИАЛОВ</>, <h>КЛАДОВАЯ ДЛЯ ПРОДУКТОВ</> и <h>КЛАДОВАЯ ДЛЯ БРЕВЕН</>. У разных построек <h>ВМЕСТИМОСТЬ</> этих кладовых различается. Каждому типу ресурсов соответствует своя категория хранилищ: например, <h>ДРОВА</> можно держать только в <h>КЛАДОВОЙ ДЛЯ МАТЕРИАЛОВ</>, а <h>ХЛЕБ</> – только в <h>КЛАДОВОЙ ДЛЯ ПРОДУКТОВ</>. Если в хранилище <h>ПРОИЗВОДСТВЕННОЙ ПОСТРОЙКИ</> больше нет свободного места, производство останавливается. Если лимит вместимости превышен, ресурсы могут испортиться из-за <h>НЕПОГОДЫ</>. Чтобы избежать превышения <h>ВМЕСТИМОСТИ</>, убедитесь, что у вас достаточно <h>ХРАНИЛИЩ</> и их обслуживает достаточное число <h>СЕМЕЙ</>.",
        "it_IT": "Esistono attualmente 3 tipi di deposito all'interno del gioco: il <h>DEPOSITO GENERICO</>, la <h>DISPENSA</> e il <h>DEPOSITO DI LEGNAME</>. Ogni edificio dispone di <h>LIMITI DI STOCCAGGIO</> diversi per ciascuna categoria. Ogni risorsa appartiene a una categoria specifica di deposito: ad esempio, la <h>LEGNA DA ARDERE</> viene conservata nel <h>DEPOSITO GENERICO</>, mentre il <h>PANE</> va nella <h>DISPENSA</>. Quando un deposito raggiunge il suo limite negli <h>EDIFICI DI PRODUZIONE</>, l'attività lavorativa connessa viene interrotta. Qualora invece questo limite venisse superato, le risorse potrebbero venire distrutte dai <h>DANNI DELLE INTEMPERIE</>. Per evitare di raggiungere o superare i <h>LIMITI DI STOCCAGGIO</>, assicurati di avere <h>DEPOSITI</> a sufficienza con abbastanza <h>FAMIGLIE INCARICATE</>.",
        "tr_TR": "Oyunda şu anda <h>GENEL DEPO</>, <h>KİLER</> ve <h>ODUN DEPOSU</> olmak üzere 3 tür depo bulunmaktadır. Farklı yapılar her kategori için farklı <h>DEPOLAMA SINIRLARINA</> sahiptir. Her kaynak belirli bir depolama kategorisine dâhildir. Örneğin, <h>YAKACAK ODUN</> <h>GENEL DEPOYA</> dâhilken <h>EKMEK</> <h>KİLERE</> dâhildir. Bir depo, <h>ÜRETİM YAPILARINDA</> sınırına ulaştığında işçilik durur. Depolama sınırları aşıldığında <h>HAVA KOŞULLARINDAN KAYNAKLI HASAR</> kaynakları yok edebilir. <h>DEPOLAMA SINIRLARINA</> ulaşmaktan ve onları aşmaktan kaçınmak için yeterli <h>ATANMIŞ AİLEYE</> ve yeterli <h>DEPOLAMA YAPILARINA</> sahip olduğundan emin ol.",
        "cs_CZ": "Ve hře momentálně existují 3 druhy skladů: <h>OBECNÝ SKLAD</>, <h>SPIŽÍRNA</> a <h>SKLAD KLÁD</>. Různé budovy mají různý <h>SKLADOVACÍ LIMIT</> pro každou kategorii. Každá surovina patří ke konkrétní kategorii skladu, například <h>PALIVOVÉ DŘÍVÍ</> patří do <h>OBECNÉHO SKLADU</>, zatímco <h>CHLÉB</> patří do <h>SPIŽÍRNY</>. Když sklad dosáhne svého limitu ve <h>VÝROBNÍCH BUDOVÁCH</>, práce se zastaví. Když sklad překročí limit, může <h>POŠKOZENÍ POČASÍM</> přebytečné suroviny zničit. Dosažení či překročení <h>SKLADOVACÍCH LIMITŮ</> zabráníš tak, že budeš mít dostatek <h>SKLADOVACÍCH BUDOV</> s dostatečným počtem <h>PŘIŘAZENÝCH RODIN</>.",
        "hu_HU": "A játékban jelenleg 3 típusú tároló van: <h>ÁLTALÁNOS RAKTÁR</>, <h>ÉLÉSKAMRA</> és <h>RÖNKRAKTÁR</>. A különböző épületek kategóriánként eltérő <h>TÁROLÁSI KORLÁTTAL</> rendelkeznek. Minden nyersanyag egy adott tárolási kategóriába tartozik, például a <h>TŰZIFA</> az <h>ÁLTALÁNOS RAKTÁRBA</> tartozik, míg a <h>KENYÉR</> az <h>ÉLÉSKAMRÁBA</>. Amikor a <h>TERMELÉSI ÉPÜLETEKBEN</> a raktározás eléri a korlátot, a munka leáll. Ha a tárolás túllépi a korlátot, az <h>IDŐJÁRÁSI KÁROK</> tönkretehetik a nyersanyagokat. A <h>TÁROLÁSI KORLÁT</> elérésének vagy túllépésének elkerülése érdekében figyelj, hogy legyen elegendő <h>RAKTÁRÉPÜLET</> és elegendő <h>KIRENDELT CSALÁD</>.",
        "uk_UA": "Зараз у грі є 3 типи сховищ: <h>СХОВ</>, <h>КОМОРА</> й <h>ДРОВНИК</>. Різні будівлі мають різні <h>ОБМЕЖЕННЯ НА ЗБЕРІГАННЯ</> для кожної категорії. Кожен ресурс належить до конкретної категорії зберігання. Наприклад, <h>ДРОВА</> зберігаються у <h>СХОВІ</>, а <h>ХЛІБ</> – у <h>КОМОРІ</>. Праця припиняється, коли сховище <h>ВИРОБНИЧИХ БУДІВЕЛЬ</> досягає ліміту. Якщо сховище переповнене, <h>ШКОДА ВІД НЕГОДИ</> може знищити ресурси. Переконайтеся, що у вас вдосталь <h>СПОРУД-СХОВИЩ</>, де достатньо <h>ПРИЗНАЧЕНИХ СІМЕЙ</>, щоб уникнути досягнення чи перевищення <h>ЛІМІТУ ЗБЕРІГАННЯ</>.",
        "da_DK": "Der er tre typer opbevaring i spillet lige nu: <h>GENEREL OPBEVARING</>, <h>FADEBUR</> og <h>TØMMEROPBEVARING</>. Forskellige bygninger har forskellig <h>LAGERKAPACITET</> for hver kategori. Hver ressource tilhører en bestemt lagerkategori. <h>BRÆNDSEL</> hører for eksempel til i <h>GENEREL OPBEVARING</>, mens <h>BRØD</> hører til i <h>FADEBURE</>. Når der ikke er mere lagerplads i <h>PRODUKTIONSBYGNINGER</>, stopper arbejdet. Når der ikke er mere lagerplads, kan <h>VEJRSKADE</> ødelægge ressourcer. For at undgå at nå <h>LAGERKAPACITETERNE</> skal du sørge for at have <h>OPBEVARINGSBYGNINGER</> nok med <h>TILDELTE FAMILIER</> nok.",
        "nl_NL": "Er zijn op dit moment 3 soorten opslag in het spel: de <h>ALGEMENE OPSLAG</>, de <h>PROVISIEKAST</> en de <h>HOUTOPSLAG</>. Verschillende gebouwen hebben verschillende <h>OPSLAGLIMIETEN</> voor elke categorie. Elke soort materiaal hoort bij een specifieke opslagcategorie, bijvoorbeeld: <h>BRANDHOUT</> hoort bij de <h>ALGEMENE OPSLAG</>, terwijl <h>BROOD</> in de <h>PROVISIEKAST</> hoort. Als de opslag in <h>PRODUCTIEGEBOUWEN</> aan zijn limiet zit, wordt er niet meer gewerkt. Als er meer materiaal is dan kan worden opgeslagen, wordt het mogelijk verwoest door <h>WEERSCHADE</>. Om te voorkomen dat je de <h>OPSLAGLIMIETEN</> bereikt of overschrijdt, moet je <h>OPSLAGGEBOUWEN</> bouwen met genoeg <h>TOEGEWEZEN GEZINNEN</>.",
        "sv_SE": "Det finns just nu 3 sorters lager i spelet: <h>VANLIGT LAGER</>, <h>SKAFFERI</> och <h>TIMMERLAGER</>. <h>GRÄNSEN FÖR LAGERUTRYMME</> för respektive kategori ser olika ut beroende på byggnad. Varje resurs tillhör en viss lagerkategori – <h>VEDKLABBAR</> tillhör till exempel det <h>VANLIGA LAGRET</> medan <h>BRÖD</> ska in i <h>SKAFFERIET</>. När lagret når sin gräns i <h>PRODUKTIONSBYGGNADER</> upphör arbetet, och om lagret överskrider gränsen kan <h>VÄDERSKADOR</> förstöra resurserna. För att slippa nå eller överskrida <h>LAGERUTRYMMESGRÄNSERNA</> ska du se till att ha tillräckligt många <h>LAGERBYGGNADER</> som har nog med <h>TILLDELADE FAMILJER</>."
      },
      "storage_buildings": {
        "en_US": "Storage buildings",
        "zh_CN": "储藏建筑",
        "zh_TW": "倉庫建築",
        "ja_JA": "保管施設",
        "ko_KR": "저장 건물",
        "de_DE": "Lagergebäude",
        "es_ES": "Constr. de almacenamiento",
        "fr_FR": "Bâtiments de stockage",
        "pt_BR": "Edifícios de armazenamento",
        "pl_PL": "Budynki magazynowe",
        "ru_RU": "Хранилища",
        "it_IT": "Edifici di deposito",
        "tr_TR": "Depolama yapıları",
        "cs_CZ": "Skladovací budovy",
        "hu_HU": "Raktárépületek",
        "uk_UA": "Споруди-сховища",
        "da_DK": "Opbevaringsbygninger",
        "nl_NL": "Opslaggebouwen",
        "sv_SE": "Lagerbyggnader"
      },
      "storage_buildings_descr": {
        "en_US": "These buildings are used primarily to store and distribute <h>SURPLUS</> resources : <h>STOREHOUSE</>, <h>LARGE STOREHOUSE</>, <h>SMALL GRANARY</>, <h>LARGE GRANARY</>. Storehouses use <h>GENERIC STORAGE</>, while granaries have <h>PANTRY</> space for <h>FOOD</>.",
        "zh_CN": "这些建筑将用于储藏和分发 <h>剩余</> 资源：<h>仓库</>，<h>大型仓库</>，<h>小型仓库</>，<h>大型粮仓</>。仓库使用 <h>通用储存</>，而 <h>食物储藏室</> 则用于储藏 <h>食物</>。",
        "zh_TW": "這類建築主要用來儲存及分發<h>剩餘</>的資源：<h>倉庫</>、<h>大倉庫</>、<h>小穀倉</>、<h>大穀倉</>。倉庫使用<h>通用倉庫</>，而穀倉則有<h>糧倉</>空間用於儲存<h>食物</>。",
        "ja_JA": "保管施設は<h>余剰物資</>を保管し、流通するために使われます。 {br}ここには<h>倉庫</>、<h>大きい倉庫</>、<h>小さい食料庫</>、<h>大きい穀倉</>があります。 {br}倉庫は<h>一般保管庫</>として使われ、{br}食料庫は<h>食料貯蔵庫</>として使われて<h>食糧</>を保管します。",
        "ko_KR": "저장 건물은 자원 <h>여유분</> 을 저장하고 유통하는 용도로 사용됩니다. 여기에는 <h>창고</> , <h>대형 창고</> , <h>소형 식량 비축고</> , <h>대형 식량 비축고</> 가 존재합니다. 창고는 <h>일반 저장실</> 을 사용하며, 식량 비축고는 <h>식량 저장실</> 을 사용하여 <h>식량</> 을 저장합니다.",
        "de_DE": "Diese Gebäude werden in erster Linie zur Lagerung und Verteilung von <h>ÜBERSCHÜSSIGEN</> Ressourcen benutzt: <h>LAGERHAUS</>, <h>GROSSES LAGERHAUS</>, <h>KLEINER SPEICHER</>, <h>GROSSER SPEICHER</>. Lagerhäuser nutzen <h>ALLGEMEINES LAGER</>, während Speicher über ein <h>LEBENSMITTELLAGER</> für <h>NAHRUNG</> verfügen.",
        "es_ES": "La función principal de los <h>ALMACENES</> y los <h>GRANEROS</> es la de almacenar y distribuir <h>EXCEDENTES</> de recursos. Los almacenes usan <h>ALMACENAMIENTO GENERAL</>, y los graneros tienen un espacio de <h>DESPENSA</> para guardar <h>ALIMENTOS</>.",
        "fr_FR": "Les <h>ENTREPÔTS</>, <h>ENTREPÔTS SPACIEUX</>, <h>GRENIERS</> et <h>GRENIERS SPACIEUX</> servent essentiellement à stocker et distribuer le <h>SURPLUS</> de ressources. Les entrepôts disposent d’emplacements de <h>STOCKAGE GÉNÉRAL</>, tandis que les greniers ont des <h>GARDE-MANGER</> pour la <h>NOURRITURE</>.",
        "pt_BR": "Os seguintes edifícios são usados para armazenar e distribuir recursos <h>EXCEDENTES</>: <h>ARMAZÉM</>, <h>ARMAZÉM GRANDE</>, <h>CELEIRO</> e <h>CELEIRO GRANDE</>. Os armazéns são compostos por espaços de <h>RESERVA GERAL</>, enquanto que os celeiros são compostos por espaço de <h>DESPENSA</> para a <h>COMIDA</>.",
        "pl_PL": "Te budynki służą głównie do przechowywania i rozprowadzania <h>NADWYŻKI</> zasobów: <h>SKŁAD</>, <h>DUŻY SKŁAD</>, <h>SPICHLERZ</>, <h>DUŻY SPICHLERZ</>. Składy zapewniają przestrzeń <h>MAGAZYNU OGÓLNEGO</>, natomiast spichlerze – przestrzeń <h>SPIŻARNI</> do przechowywania <h>JEDZENIA</>.",
        "ru_RU": "Эти постройки используются в первую очередь для хранения и распространения <h>ИЗБЫТОЧНЫХ ТОВАРОВ</>: <h>СКЛАД</>, <h>БОЛЬШОЙ СКЛАД</>, <h>МАЛЫЙ АМБАР</>, <h>БОЛЬШОЙ АМБАР</>. Склад заменяет собой <h>КЛАДОВУЮ ДЛЯ МАТЕРИАЛОВ</>, а амбар служит для хранения <h>ПРОДУКТОВ</>.",
        "it_IT": "Questi edifici sono utilizzati principalmente per immagazzinare e distribuire le risorse in <h>ECCEDENZA</>: <h>MAGAZZINO</>, <h>MAGAZZINO GRANDE</>, <h>GRANAIO PICCOLO</> e <h>GRANAIO GRANDE</>. I magazzini sono forniti di un <h>DEPOSITO GENERICO</>, mentre i granai dispongono di una <h>DISPENSA</> per il <h>CIBO</>.",
        "tr_TR": "<h>AMBAR</>, <h>BÜYÜK AMBAR</>, <h>KÜÇÜK TAHIL AMBARI</>, <h>BÜYÜK TAHIL AMBARI</> öncelikli olarak <h>FAZLADAN</> kaynakları depolayıp dağıtmak için kullanılır. Ambarlar <h>GENEL DEPOYU</> kullanırken tahıl ambarları <h>YİYECEK</> için <h>KİLER</> alanına sahiptir.",
        "cs_CZ": "Tyto budovy primárně slouží ke skladování a distribuci <h>PŘEBYTKOVÝCH</> surovin: <h>SKLAD</>, <h>VELKÝ SKLAD</>, <h>MALÁ SÝPKA</>, <h>VELKÁ SÝPKA</>. Sklady používají <h>OBECNÝ SKLAD</>, zatímco sýpky mají prostor ve <h>SPIŽÍRNĚ</> na skladování <h>JÍDLA</>.",
        "hu_HU": "Ezeket az épületeket elsősorban a <h>TÖBBLET</>nyersanyagok tárolására és elosztására használják: <h>RAKTÁR</>, <h>NAGY RAKTÁR</>, <h>KIS MAGTÁR</>, <h>NAGY MAGTÁR</>. A raktárépületek <h>ÁLTALÁNOS RAKTÁRAK</>, míg a magtárak <h>ÉLÉSKAMRA</>helyet biztosítanak az <h>ÉLELEMNEK</>.",
        "uk_UA": "Ці будівлі використовуються переважно для зберігання й розповсюдження <h>НАДЛИШКОВИХ</> ресурсів: <h>СКЛАД</>, <h>ВЕЛИКИЙ СКЛАД</>, <h>МАЛЕНЬКИЙ АМБАР</>, <h>ВЕЛИКИЙ АМБАР</>. Склади мають простір <h>СХОВУ</>, так само як амбари мають простір <h>КОМОРИ</> для <h>ЇЖІ</>.",
        "da_DK": "Disse bygninger bruges primært til at opbevare og distribuere <h>OVERSKYDENDE</> ressourcer: <h>LAGERBYGNING</>, <h>STOR LAGERBYGNING</>, <h>LILLE KORNKAMMER</>, <h>STORT KORNKAMMER</>. Lagerbygninger har <h>GENEREL OPBEVARING</>, og kornkamre har plads til <h>MAD</> i <h>FADEBURET</>.",
        "nl_NL": "Deze gebouwen worden vooral gebruikt om een <h>OVERSCHOT</> aan materialen op te slaan en te distribueren: <h>MAGAZIJN</>, <h>GROOT MAGAZIJN</>, <h>KLEINE GRAANSCHUUR</>, <h>GROTE GRAANSCHUUR</>. Magazijnen gebruiken <h>ALGEMENE OPSLAG</>, terwijl graanschuren een <h>PROVISIEKAST</> hebben met ruimte voor <h>VOEDSEL</>.",
        "sv_SE": "Följande byggnader används främst för att lagra och distribuera <h>ÖVERSKOTTSRESURSER</>: <h>MAGASIN</>, <h>STORT MAGASIN</>, <h>LITET SPANNMÅLSMAGASIN</>, <h>STORT SPANNMÅLSMAGASIN</>. Magasin använder <h>VANLIGA LAGER</>, medan spannmålsmagasin har <h>SKAFFERIER</> för <h>MAT</>."
      },
      "surplus": {
        "en_US": "Surplus",
        "zh_CN": "剩余资源",
        "zh_TW": "剩餘資源",
        "ja_JA": "余剰物資",
        "ko_KR": "여유분",
        "de_DE": "Überschuss",
        "es_ES": "Excedente",
        "fr_FR": "Surplus",
        "pt_BR": "Excedente",
        "pl_PL": "Nadwyżka",
        "ru_RU": "Избыточные товары",
        "it_IT": "Eccedenza",
        "tr_TR": "Mal fazlası",
        "cs_CZ": "Přebytek",
        "hu_HU": "Többlet",
        "uk_UA": "Надлишок",
        "da_DK": "Overskud",
        "nl_NL": "Overschot",
        "sv_SE": "Överskott"
      },
      "surplus_descr": {
        "en_US": "Surplus equals <h>STOCK</> minus <h>RESERVED</>. For example if you store 5 <h>PLANKS</>, but place a building that costs 3 <h>PLANKS</>, you still have 5 Stock, but only 2 Surplus.",
        "zh_CN": "剩余资源等于 <h>库存</> 减去 <h>保留资源</>。例如，你存储了5块 <h>木板</>，但建造一个建筑需要花费3块 <h>木板</>，你的库存仍是5木板，但剩余资源变成了2木板。",
        "zh_TW": "剩餘資源等於<h>庫存資源</>減去<h>保留資源</>。舉例來說，如果你儲存了 5 單位<h>木板</>，但是放置了一棟需花費 3 單位<h>木板</>的建築，你的庫存資源仍然有 5 單位，但是只有 2 單位剩餘資源。",
        "ja_JA": "余剰物資は<h>在庫</>から<h>予備量</>を引いた数値です。 {br}例えば、<h>板材</>を5個持っているときに{br}建設に<h>板材</>が3個必要な施設を配置するとしましょう。 {br}在庫は5個であるものの、もうすぐ3個が使われる予定ですので{br}余剰物資は2になります。",
        "ko_KR": "여유분은 <h>재고</> 에서 <h>예비량</> 을 뺀 수치입니다. 예를 들어 <h>판자</> 5개가 보관되어 있다고 가정하겠습니다. 그리고 건설 비용이 <h>판자</> 3개인 건물을 설치한다면, 이때 재고는 5개, 여유분은 2개가 됩니다.",
        "de_DE": "Der Überschuss errechnet sich aus dem <h>BESTAND</> abzüglich der <h>RESERVIERTEN</> Waren. Wenn Ihr beispielsweise 5 <h>BRETTER</> lagert und ein Gebäude errichtet, für dessen Bau 3 <h>BRETTER</> benötigt werden, verbleibt der Bestand auf 5, der Überschuss fällt jedoch auf 2.",
        "es_ES": "El excedente es la resta de las <h>EXISTENCIAS</> menos las <h>RESERVAS</>. Por ejemplo, si almacenas 5 <h>TABLONES</> pero colocas una construcción que solo cuesta 3, tendrás 5 de existencias, pero solo 2 de excedente.",
        "fr_FR": "Le surplus correspond au <h>STOCK</> moins la quantité de biens <h>RÉSERVÉS</>. Par exemple, si vous stockez 5 <h>PLANCHES</>, mais vous placez un bâtiment dont le coût de construction est de 3 <h>PLANCHES</>, votre stock sera de 5, mais votre surplus sera de 2.",
        "pt_BR": "O valor excedente dos recursos representa o seu <h>ESTOQUE</> menos a quantidade <h>RESERVADA</>. Por exemplo, se você tiver 5 <h>TÁBUAS</> no estoque, mas iniciar uma construção que custe 3 <h>TÁBUAS</>, você ainda terá as 5 no estoque, mas apenas 2 como excedente.",
        "pl_PL": "Nadwyżka to różnica między <h>ZAPASEM</> a <h>ZAREZERWOWANYMI</> zasobami. Jeśli na przykład masz 5 <h>DESEK</> i umieścisz budynek wymagający 3 <h>DESEK</>, początkowo masz nadal 5 w zapasie, ale tylko 2 deski nadwyżki.",
        "ru_RU": "Избыточные товары – это <h>ВАШИ ЗАПАСЫ</> за вычетом <h>ЗАРЕЗЕРВИРОВАННЫХ ТОВАРОВ</>. Например, если у вас есть 5 <h>ДОСОК</> и вы размещаете постройку, на возведение которой нужно 3 <h>ДОСКИ</>, у вас совокупно останется 5 досок, но в избыточных товарах будут числиться только 2.",
        "it_IT": "L'eccedenza è uguale alla quantità di <h>SCORTE</> meno quelle <h>RISERVATE</> a vari impieghi. Ad esempio, se hai in magazzino 5 <h>ASSI</>, ma costruisci un edificio che ne costa <h>3</>, hai ancora 5 assi di scorta, ma solo 2 in eccedenza.",
        "tr_TR": "Mal fazlası, <h>STOK</> eksi <h>AYRILAN MALA</> eşittir. Örneğin, 5 <h>KALAS</> depolarsan ve maliyeti 3 <h>KALAS</> olan bir yapı yerleştirirsen Stok hâlâ 5 olurken Mal Fazlası yalnızca 2 olur.",
        "cs_CZ": "Přebytek je roven <h>ULOŽENÉMU ZBOŽÍ</> mínus <h>REZERVY</>. Pokud například uskladníš 5 <h>PRKEN</>, ale umístíš budovu, která stojí 3 <h>PRKNA</>, pak budeš mít pořád 5 uložených prken, ale přebytek pouze 2.",
        "hu_HU": "A többlet egyenlő a <h>KÉSZLET</>ből kivont <h>TARTALÉK</>kal. Például ha 5 <h>DESZKÁT</> tárolsz, de elhelyezel egy épületet, ami 3 <h>DESZKÁBA</> kerül, akkor még mindig 5 a készleted, de csak 2 a többleted.",
        "uk_UA": "Надлишок – кількість <h>ЗАПАСІВ</> за вирахуванням <h>ЗАРЕЗЕРВОВАНИХ</> ресурсів. Наприклад, якщо в запасі 5 <h>ДОШОК</>, а ви розміщуєте будівлю за 3 <h>ДОШКИ</>, то в запасі їх все ще буде 5, але тільки 2 – у надлишку.",
        "da_DK": "Overskud er lig med <h>BEHOLDNING</> minus <h>RESERVERING</>. Hvis du for eksempel har fem <h>PLANKER</> på lager og placerer en bygning, der koster tre <h>PLANKER</>, har du stadig fem i beholdning, men kun to i overskud.",
        "nl_NL": "Overschot staat gelijk aan <h>VOORRAAD</> min <h>GERESERVEERD</>. Als je bijvoorbeeld 5 <h>PLANKEN</> opslaat, maar een gebouw plaatst dat 3 <h>PLANKEN</> kost, is je voorraad nog steeds 5 planken, maar je overschot maar 2.",
        "sv_SE": "Överskottet är det du har <h>PÅ LAGER</> minus <h>RESERVER</>. Om du till exempel har 5 <h>PLANKOR</> på lager men placerar en byggnad som kostar 3 <h>PLANKOR</> har du fortfarande 5 på lager men bara 2 i överskott."
      },
      "stock": {
        "en_US": "Stock",
        "zh_CN": "库存",
        "zh_TW": "庫存資源",
        "ja_JA": "在庫",
        "ko_KR": "재고",
        "de_DE": "Bestand",
        "es_ES": "Existencias",
        "fr_FR": "Stock",
        "pt_BR": "Estoque",
        "pl_PL": "Zapas",
        "ru_RU": "Запасы",
        "it_IT": "Scorta",
        "tr_TR": "Stok",
        "cs_CZ": "Uložené zboží",
        "hu_HU": "Készlet",
        "uk_UA": "Запас",
        "da_DK": "Beholdning",
        "nl_NL": "Voorraad",
        "sv_SE": "Varor på lager"
      },
      "stock_descr": {
        "en_US": "Number of goods physically stored in one of the buildings and taking up <h>STORAGE</>.",
        "zh_CN": "指实际存放在建筑中，并占用 <h>储藏室</> 的货物数量。",
        "zh_TW": "實際存放在其中一棟建築中的貨物數量，它會佔用<h>倉庫</>。",
        "ja_JA": "実際に施設に保管されて、<h>保管枠</>を取っている物資の数です。",
        "ko_KR": "건물에 실제로 저장되어 <h>저장 공간</> 을 차지하는 물자 수량입니다.",
        "de_DE": "Die Gesamtheit aller im <h>LAGER</> eines Gebäudes aufbewahrten Waren.",
        "es_ES": "Las existencias conforman la cantidad de bienes guardados en uno de los construcción y ocupando <h>ALMACENAMIENTO</>.",
        "fr_FR": "La quantité de biens stockée physiquement dans l’un de vos bâtiments, occupant donc de l’espace de <h>STOCKAGE</>.",
        "pt_BR": "Quantidade de produtos guardados fisicamente em um de seus edifícios, ocupa espaço de <h>ARMAZENAMENTO</>.",
        "pl_PL": "Liczba dóbr fizycznie znajdujących się w jednym z budynków i zajmujących <h>PRZESTRZEŃ MAGAZYNOWĄ</>.",
        "ru_RU": "Товары, размещенные в одной из построек и занимающие <h>МЕСТО В ХРАНИЛИЩЕ</>.",
        "it_IT": "Numero di risorse fisicamente immagazzinate in uno degli edifici e che occupano spazio in un <h>DEPOSITO</>.",
        "tr_TR": "Yapıların birinde fiziksel olarak depolanan ve <h>DEPOLAMA</> kaplayan mal sayısı.",
        "cs_CZ": "Množství zboží, které je fyzicky uloženo v jedné z budov a zabírá místo ve <h>SKLADU</>.",
        "hu_HU": "Egy épületben fizikailag tárolt és <h>RAKTÁR</>helyet foglaló áruk száma.",
        "uk_UA": "Кількість товарів, які фізично зберігаються в одній із будівель і займають <h>СХОВИЩЕ</>.",
        "da_DK": "Antallet af varer, der findes fysisk og optager <h>OPBEVARINGS</>-plads i bygninger.",
        "nl_NL": "Het aantal goederen dat fysiek is opgeslagen in een van de gebouwen en ruimte inneemt in de <h>OPSLAG</>.",
        "sv_SE": "Antalet varor som lagras fysiskt i en av byggnaderna och tar upp en del av <h>LAGRET</>."
      },
      "reserved_resources": {
        "en_US": "Reserved",
        "zh_CN": "保留资源",
        "zh_TW": "保留資源",
        "ja_JA": "予備量",
        "ko_KR": "예비량",
        "de_DE": "Reserviert",
        "es_ES": "Reservas",
        "fr_FR": "Réserve",
        "pt_BR": "Recurso reservado",
        "pl_PL": "Zarezerwowane",
        "ru_RU": "Резерв",
        "it_IT": "Riservate",
        "tr_TR": "Ayrılan mal",
        "cs_CZ": "Rezerva",
        "hu_HU": "Tartalék",
        "uk_UA": "Резерв",
        "da_DK": "Reservering",
        "nl_NL": "Gereserveerd",
        "sv_SE": "Reserver"
      },
      "reserved_resources_descr": {
        "en_US": "<h>STOCK</> which is dedicated for <h>CRAFTING</> or <h>CONSTRUCTION</> and therefore no longer accounts as <h>SURPLUS</>.",
        "zh_CN": "专用于 <h>制作</> 或 <h>建造</> 的 <h>库存资源</>，因此不再被算入 <h>剩余资源</> 中。",
        "zh_TW": "投入於<h>製造</>或<h>建設</>的<h>庫存資源</>，因此不再納入<h>剩餘資源</>計算。",
        "ja_JA": "<h>製作</>および<h>建設</>に使用される予定の物資の数です。この<h>在庫</>は<h>余剰物資</>としてカウントされません。",
        "ko_KR": "<h>제작</> 또는 <h>건설</> 에 사용이 예정된 <h>재고</> 는 더 이상 <h>여유분</> 으로 집계되지 않습니다.",
        "de_DE": "<h>BESTAND</> der für die <h>PRODUKTION</> oder <h>GEBÄUDEERRICHTUNG</> reserviert ist und deshalb nicht länger Teil des <h>ÜBERSCHUSSES</> ist.",
        "es_ES": "Las reservas constituyen las <h>EXISTENCIAS</> que se dedican a la <h>FABRICACIÓN</> o la <h>CONSTRUCCIÓN</> y por tanto no cuentan como <h>EXCEDENTE</>.",
        "fr_FR": "Le <h>STOCK</> destiné à l’<h>ARTISANAT</> ou à la <h>CONSTRUCTION</>, qui est donc exclu du <h>SURPLUS</>.",
        "pt_BR": "Parte do seu <h>ESTOQUE</> já sendo utilizada em <h>PRODUÇÃO</> ou <h>CONSTRUÇÃO</> e que, portanto, não conta como <h>EXCEDENTE</>.",
        "pl_PL": "Część <h>ZAPASU</> przeznaczona do <h>WYTWÓRSTWA</> lub <h>BUDOWY</>, a przez to niewliczana już do <h>NADWYŻKI</>.",
        "ru_RU": "<h>МАТЕРИАЛЫ</>, выделенные на нужды <h>ПРОИЗВОДСТВА</> или <h>СТРОИТЕЛЬСТВА</>. Они больше не учитываются в списке <h>ИЗБЫТОЧНЫХ ТОВАРОВ</>.",
        "it_IT": "<h>SCORTE</> dedicate alla <h>CREAZIONE</> o <h>COSTRUZIONE</> e pertanto non considerate come <h>ECCEDENZA</>.",
        "tr_TR": "<h>ÜRETİM</> veya <h>İNŞAAT</> için ayrılmış <h>STOK</>. Bundan dolayı <h>MAL FAZLASI</> olarak hesaba katılmaz.",
        "cs_CZ": "<h>ULOŽENÉ ZBOŽÍ</>, které je vyhrazeno k <h>VÝROBĚ</> či <h>STAVBĚ</>, a tudíž už se nepočítá jako <h>PŘEBYTEK</>.",
        "hu_HU": "Olyan <h>KÉSZLET</>, amely <h>KÉZMŰVESSÉG</> vagy <h>ÉPÍTKEZÉS</> céljára van elkülönítve, és ezért már nem számít <h>TÖBBLETNEK</>.",
        "uk_UA": "<h>ЗАПАС</>, який призначений для <h>ВИГОТОВЛЕННЯ РЕЧЕЙ</> або <h>БУДІВНИЦТВА</> й більше не враховується як <h>НАДЛИШОК</>.",
        "da_DK": "<h>BEHOLDNING</>, der er dedikeret til <h>HÅNDVÆRK</> eller <h>BYGGERI</>, og som derfor ikke længere tæller som <h>OVERSKUD</>.",
        "nl_NL": "<h>VOORRAAD</> die opzij is gezet voor <h>VERVAARDIGEN</> of <h>BOUW</> en daarom niet meer telt als <h>OVERSCHOT</>.",
        "sv_SE": "<h>VAROR PÅ LAGER</> som är reserverade för <h>TILLVERKNING</> eller <h>BYGGNATION</> och därför inte längre räknas som <h>ÖVERSKOTT</>."
      },
      "population_growth": {
        "en_US": "Population growth",
        "zh_CN": "人口增长",
        "zh_TW": "人口成長",
        "ja_JA": "人口増加",
        "ko_KR": "인구 성장",
        "de_DE": "Bevölkerungswachstum",
        "es_ES": "Crecimiento demográfico",
        "fr_FR": "Croissance démographique",
        "pt_BR": "Crescimento populacional",
        "pl_PL": "Przyrost ludności",
        "ru_RU": "Прирост населения",
        "it_IT": "Crescita demografica",
        "tr_TR": "Nüfus artışı",
        "cs_CZ": "Růst obyvatelstva",
        "hu_HU": "Népességnövekedés",
        "uk_UA": "Приріст населення",
        "da_DK": "Befolkningstilvækst",
        "nl_NL": "Bevolkingsgroei",
        "sv_SE": "Befolkningstillväxt"
      },
      "population_growth_descr": {
        "en_US": "New <h>FAMILIES</> may join the settlement only if there is enough <h>LIVING SPACE</> and <h>APPROVAL</> is high enough. If <h>APPROVAL</> is 75% or higher the growth rate is 2 families per month. 50% or higher is 1 family per month. If <h>APPROVAL</> drops below 25%, it will cause <h>EMIGRATION</>. Families may also turn to <h>BANDITRY</> if <h>PUBLIC ORDER</> is low.",
        "zh_CN": "新的 <h>家庭</> 只能在有足够的 <h>居住空间</> 和足够高的 <h>民意</> 时才能入住定居点。如果 <h>民意</> 高于或等于75%，增长率为每月2户家庭。如果高于或等于50%，增长率则为每月1户家庭。如果 <h>民意</> 降至25%以下，将会导致 <h>移民</>。如果 <h>公共秩序</> 降低，家庭也有可能变为 <h>强盗</>。",
        "zh_TW": "只有在<h>生活空間</>夠大，而且<h>民意</>夠高時，才會有新的<h>家庭</>加入聚落。如果<h>民意</>在 75% 以上，成長率為每個月 2 個家庭。在 50% 以上則為每個月 1 個家庭。如果<h>民意</>掉落到 25% 以下，會導致居民<h>遷出</>。如果<h>公共秩序</>太差，家庭也可能轉變為<h>盜匪</>。",
        "ja_JA": "十分な<h>住居空間</>と高い<h>好感度</>がないと、新たな家族が<h>居留地</>にやってきません。<h>好感度</>が75%以上の場合、毎月1つの家族がやってきます。<h>好感度</>が50%以上の場合、毎月1つの家族がやってきます。<h>好感度</>が25%未満の場合、家族が<h>移住</>する可能性があります。<h>公の秩序</>が低い場合、家族が<h>盗賊</>になる可能性があります。",
        "ko_KR": "새로운 가족이 <h>정착지</> 에 합류하려면 <h>주거 공간</> 을 충분히 갖추어야 하고, <h>자격</> 이 높아야 합니다. <h>자격</> 이 75% 이상일 경우 매월 2개 가족이 합류합니다. 50% 이상일 경우 매월 1개 가족이 합류합니다. <h>자격</> 이 25% 미만일 경우 <h>이주</> 민이 발생할 수 있습니다. <h>공공질서</> 가 낮을 경우 가족이 <h>도적</> 으로 변할 수도 있습니다.",
        "de_DE": "Neue <h>FAMILIEN</> können sich in der Siedlung niederlassen, wenn es genügend <h>WOHNRAUM</> gibt und die <h>ZUFRIEDENHEIT</> hoch genug ist. Wenn die <h>ZUFRIEDENHEIT</> 75 % oder mehr beträgt, wächst die Siedlung monatlich um 2 Familien, bei 50 % oder mehr um 1. Wenn die <h>ZUFRIEDENHEIT</> unter 25 % fällt, beginnt die <h>ABWANDERUNG</>. Familien können auch zu <h>BANDITEN</> werden, wenn die <h>ÖFFENTLICHE ORDNUNG</> niedrig ist.",
        "es_ES": "Con el <h>ESPACIO HABITABLE</> suficiente y la <h>APROBACIÓN</> lo bastante alta, pueden llegar nuevas <h>FAMILIAS</> al asentamiento. Si la <h>APROBACIÓN</> está al 75 % o más, la tasa de crecimiento es de 2 familias al mes, pero si está entre el 50 y el 74 %, el crecimiento será de 1 familia al mes. Sin embargo, si la <h>APROBACIÓN</> cae por debajo del 25 %, los habitantes comenzarán a <h>EMIGRAR</>. Las familias podrían llegar a dedicarse al <h>BANDIDAJE</> si el <h>ORDEN PÚBLICO</> baja demasiado.",
        "fr_FR": "De nouvelles <h>FAMILLES</> pourront rejoindre votre colonie si vous disposez de l’<h>HÉBERGEMENT</> nécessaire et si votre <h>POPULARITÉ</> est suffisamment élevée. Le taux de croissance sera d’une famille par mois pour un niveau de <h>POPULARITÉ</> de 50 à 75 % et de deux familles par mois pour un niveau de 75 % et au-delà. Si votre niveau de <h>POPULARITÉ</> tombe sous les 25 %, votre population commencera à <h>ÉMIGRER</>. Les familles pourront également tomber dans le <h>BANDITISME</> si l’<h>ORDRE PUBLIC</> est trop bas.",
        "pt_BR": "Novas <h>FAMÍLIAS</> só podem se juntar à sua cidade se houver <h>ESPAÇO DE MORADIA</> disponível e a <h>APROVAÇÃO</> for alta o suficiente. Se a <h>APROVAÇÃO</> for de 75% ou mais, o crescimento populacional será de 2 famílias por mês. Se for de 50% ou mais, de 1 família por mês. Valores de <h>APROVAÇÃO</> abaixo de 25% provocarão <h>EMIGRAÇÕES</>. As famílias também podem acabar recorrendo ao <h>BANDITISMO</> se a <h>ORDEM PÚBLICA</> for baixa.",
        "pl_PL": "Nowe <h>RODZINY</> mogą dołączać do osady tylko wtedy, gdy jest w niej wystarczająca ilość <h>PRZESTRZENI MIESZKALNEJ</>, a twoja <h>APROBATA</> jest odpowiednio wysoka. Jeśli <h>APROBATA</> wynosi co najmniej 75%, szybkość przyrostu to 2 rodziny na miesiąc. Przedział 50–75% oznacza przyrost w wysokości 1 rodziny na miesiąc. Jeśli <h>APROBATA</> spadnie poniżej 25%, spowoduje to <h>EMIGRACJĘ</>. Przy zbyt niskim poziomie <h>PRAWORZĄDNOŚCI</> rodziny mogą też zwracać się ku <h>ZBÓJNICTWU</>.",
        "ru_RU": "Новые <h>СЕМЬИ</> прибудут только при условии, что в поселении хватает <h>ЖИЛЬЯ</> и <h>УРОВЕНЬ ОДОБРЕНИЯ</> достаточно высок. При <h>УРОВНЕ ОДОБРЕНИЯ</> 75% и выше прирост составит 2 семьи в месяц; при уровне 50% и выше – 1 семью в месяц. Если <h>УРОВЕНЬ ОДОБРЕНИЯ</> упадет ниже 25%, это вызовет волну <h>ЭМИГРАЦИИ</>. Кроме того, жители могут податься в <h>РАЗБОЙНИКИ</>, если показатель <h>ОБЩЕСТВЕННОГО ПОРЯДКА</> слишком низок.",
        "it_IT": "Nuove <h>FAMIGLIE</> possono unirsi all'insediamento solo se c'è abbastanza <h>SPAZIO ABITATIVO</> e il tasso di <h>APPROVAZIONE</> è sufficientemente alto. Se l'<h>APPROVAZIONE</> è pari o superiore al 75%, il tasso di crescita è di 2 famiglie al mese. Tra il 50% e il 74%, è di 1 famiglia al mese. Se l'<h>APPROVAZIONE</> scende al di sotto del 25%, si verificherà un'<h>EMIGRAZIONE</>. Le famiglie potrebbero anche ricorrere al <h>BRIGANTAGGIO</> se il livello di <h>ORDINE PUBBLICO</> è basso.",
        "tr_TR": "Yeni <h>AİLELER</>, yerleşime yalnızca yeterli <h>YAŞAM ALANI</> varsa ve <h>MEMNUNİYET</> yeterince yüksekse katılabilir. <h>MEMNUNİYET</> %75 veya daha yüksek bir orandaysa büyüme hızı ayda 2 ailedir. %50 veya daha yüksek bir orandaysa ayda 1 aile olur. <h>MEMNUNİYET</> %25 oranının altına düşerse bu <h>GÖÇE</> sebep olur. <h>TOPLUM DÜZENİ</> düşükse aileler <h>HAYDUTLUĞA</> da yönelebilir.",
        "cs_CZ": "Nové <h>RODINY</> se mohou připojit k osadě pouze tehdy, pokud máš dost <h>OBYTNÉHO PROSTORU</> a dostatečně vysokou <h>OBLIBU</>. Pokud je <h>OBLIBA</> alespoň na 75 %, bude růst ve výši 2 rodin za měsíc. Na 50 % a výše je to 1 rodina za měsíc. Pokud <h>OBLIBA</> klesne pod 25 %, vyvolá vlnu <h>EMIGRACE</>. Rodiny se také mohou dát na <h>ZBOJNICTVÍ</>, pokud bude nízký <h>VEŘEJNÝ POŘÁDEK</>.",
        "hu_HU": "Új <h>CSALÁDOK</> csak akkor csatlakozhatnak a településhez, ha van elég <h>LAKHELY</> és az <h>ELISMERTSÉG</> elég magas. Ha az <h>ELISMERTSÉG</> 75% vagy magasabb, a növekedés mértéke 2 család havonta. 50% vagy magasabb érték: 1 család havonta. Ha az <h>ELISMERTSÉG</> 25% alá csökken, az <h>ELVÁNDORLÁST</> okoz. A családok <h>BANDITÁNAK</> is állhatnak, ha a <h>KÖZREND</> alacsony.",
        "uk_UA": "Нові <h>СІМ'Ї</> можуть долучитися до поселення лише за наявності достатньої кількості <h>ЖИТЛА</> й високого <h>РІВНЯ СХВАЛЕННЯ</>. Якщо <h>СХВАЛЕННЯ</> становить 75% або вище, швидкість приросту – 2 сім'ї на місяць. Якщо 50% або вище – 1 сім'я на місяць. Якщо <h>СХВАЛЕННЯ</> впаде нижче 25%, це спричинить <h>ЕМІГРАЦІЮ</>. Сім'ї також можуть податися в <h>РОЗБІЙНИКИ</>, якщо <h>ГРОМАДСЬКИЙ ПОРЯДОК</> занизький.",
        "da_DK": "Nye <h>FAMILIER</> kan kun slutte sig til bosættelsen, hvis der er <h>BOLIGER</> nok og din <h>TILSLUTNING</> er høj nok. Hvis din <h>TILSLUTNING</> er mindst 75 %, er befolkningstilvæksten to familier om måneden. Mindst 50 % er en familie om måneden. Hvis din <h>TILSLUTNING</> falder under 25 %, vil det forårsage <h>UDVANDRING</>. Familier kan også forfalde til <h>KRIMINALITET</>, hvis den <h>OFFENTLIGE ORDEN</> er lav.",
        "nl_NL": "Nieuwe <h>GEZINNEN</> kunnen zich aansluiten bij de nederzetting als er genoeg <h>LEEFRUIMTE</> is en je <h>POPULARITEIT</> hoog genoeg is. Als de <h>POPULARITEIT</> 75% of hoger is, groeit je nederzetting met 2 gezinnen per maand. 50% of hoger is 1 gezin per maand. Als je <h>POPULARITEIT</> onder de 25% komt, zullen gezinnen <h>EMIGREREN</>. Gezinnen kunnen ook veranderen in <h>BANDIETEN</> als de <h>OPENBARE ORDE</> laag is.",
        "sv_SE": "Nya <h>FAMILJER</> flyttar bara till bosättningen om det finns nog med <h>BOENDEN</> och <h>ANSEENDET</> är tillräckligt högt. Om <h>ANSEENDET</> är minst 75 % ligger tillväxttakten på 2 familjer i månaden. 50 % eller högre är 1 familj per månad. Om <h>ANSEENDET</> sjunker lägre än 25 % startar en <h>EMIGRATION</>. Vissa familjer kan även bli <h>BANDITER</> om den <h>ALLMÄNNA ORDNINGEN</> är låg."
      },
      "settlement_level": {
        "en_US": "Settlement level",
        "zh_CN": "定居点等级",
        "zh_TW": "聚落等級",
        "ja_JA": "居留地レベル",
        "ko_KR": "정착지 레벨",
        "de_DE": "Siedlungsstufe",
        "es_ES": "Nivel del asentamiento",
        "fr_FR": "Niveau de colonie",
        "pt_BR": "Nível de assentamento",
        "pl_PL": "Poziom osady",
        "ru_RU": "Уровень поселения",
        "it_IT": "Livello di insediamento",
        "tr_TR": "Yerleşim seviyesi",
        "cs_CZ": "Úroveň osady",
        "hu_HU": "Településszint",
        "uk_UA": "Рівень поселення",
        "da_DK": "Bosættelsesniveau",
        "nl_NL": "Nederzettingsniveau",
        "sv_SE": "Bosättningsnivå"
      },
      "settlement_level_descr": {
        "en_US": "Every <h>REGION</> has a settlement level. To reach the next level, players must fulfill all requirements. When the next level is reached, <h>REGION</> gets a new <h>DEVELOPMENT POINT</> and unlocks new buildings and upgrades. To see what is required for the next settlement level, hover the settlement name in the <h>REGION PANEL</> on the top of the screen.",
        "zh_CN": "每个 <h>区域</> 都有一个定居点等级。为了达到下一等级，玩家必须满足所有条件。当达到下一级时，<h>区域</> 将获得一个新的 <h>发展点数</> 并解锁新的建筑和升级。要查看达到下一级定居点的条件，可以将鼠标悬停在屏幕顶部的 <h>区域面板</> 中的定居点名称上。",
        "zh_TW": "每個 <h>地區</> 都有聚落等級。要到達下一個等級，玩家必須滿足所有需求。到達下一個等級時，<h>地區</> 會獲得一個新的 <h>發展點數</>，並且解鎖新的建築和升級。要了解到達下一個聚落等級的條件，請將游標停放在畫面頂端 <h>地區控制台</> 中的聚落名稱上。",
        "ja_JA": "すべての<h>地域</>には居留地レベルが存在します。 {br}次のレベルへ進むためにはすべての要件を満たす必要があります。 {br}次のレベルに進むと、<h>地域</>の<h>開発ポイント</>を獲得し、{br}新たな施設やアップグレードが解禁されます。 {br}居留地レベルの上昇に必要な要素を確認するには{br}上部の<h>地域パネル</>の居留地名にカーソルを合わせてみましょう。",
        "ko_KR": "모든 <h>지역</> 에는 정착지 레벨이 존재합니다. 다음 레벨에 도달하려면 플레이어가 모든 요건을 만족시켜야 합니다. 다음 레벨에 도달할 경우, <h>지역</> 이 새로운 <h>개발 점수</> 를 획득하며 새로운 건물과 업그레이드가 잠금 해제됩니다. 정착지 레벨 상승에 필요한 요소를 확인하려면 화면 위쪽의 <h>지역 패널</> 에서 정착지 이름 위에 커서를 올려보십시오.",
        "de_DE": "Jede <h>REGION</> hat eine Siedlungsstufe. Spieler müssen alle Bedürfnisse decken, wenn die nächste Stufe erreicht werden soll. Wenn es so weit ist, erhält die <h>REGION</> einen neuen <h>ENTWICKLUNGSPUNKT</> und neue Gebäude und Erweiterungen werden freigeschaltet. Bewegt den Cursor auf den Siedlungsnamen im <h>REGIONSMENÜ</> in der oberen Bildschirmmitte, um zu sehen, welche Anforderungen für die nächste Siedlungsstufe erfüllt werden müssen.",
        "es_ES": "Cada <h>REGIÓN</> tiene su propio nivel de asentamiento, y para subirlo, hay que cumplir todos los requisitos. Cuando se alcanza un nivel nuevo, la <h>REGIÓN</> obtiene un <h>PUNTO DE DESARROLLO</> y desbloquea construcciones y mejoras. Para ver los requisitos del siguiente nivel, pasa el cursor por encima del nombre del asentamiento en el <h>PANEL DE REGIONES</>, en la parte superior de la pantalla.",
        "fr_FR": "Chaque <h>RÉGION</> dispose de son niveau de colonie. Pour atteindre le niveau suivant, vous devrez remplir toutes les conditions. Lorsque vous atteindrez un niveau supérieur, la <h>RÉGION</> obtiendra un nouveau <h>POINT DE DÉVELOPPEMENT</> et de nouveaux bâtiments et de nouvelles améliorations seront disponibles. Pour consulter les conditions d'obtention du niveau de ville suivant, passez votre curseur sur le nom de votre ville au centre de la <h>BARRE DE RÉGION</> située en haut de l’écran.",
        "pt_BR": "Cada <h>REGIÃO</> tem um nível de assentamento. Para passar de nível, todas as demandas daquele nível devem ser atendidas. Ao alcançar um novo nível, a <h>REGIÃO</> recebe um <h>PONTO DE DESENVOLVIMENTO</> e novos edifícios e melhorias são desbloqueados. Para ver as demandas necessárias para passar ao nível seguinte, passe o cursor sobre o nome da cidade no <h>PAINEL DA REGIÃO</> no topo da tela.",
        "pl_PL": "Każdy <h>REGION</> ma swój poziom osady. By awansować na wyższy poziom, gracz musi spełnić wszystkie wymagania. Po osiągnięciu wyższego poziomu <h>REGION</> otrzymuje nowy <h>PUNKT ROZWOJU</>, a ponadto odblokowane zostają nowe budynki i ulepszenia. Aby sprawdzić wymagania awansu na wyższy poziom osady, przytrzymaj kursor nad nazwą osady w <h>PANELU REGIONU</> u góry ekranu.",
        "ru_RU": "У каждого <h>РЕГИОНА</> есть уровень поселения. Чтобы достигнуть следующего уровня, нужно выполнить все необходимые требования. По достижении нового уровня <h>РЕГИОН</> получит еще одно <h>ОЧКО РАЗВИТИЯ</>, и вам станут доступны новые здания и усовершенствования. Чтобы просмотреть список требований, наведите курсор на название поселения, которое отображается на <h>ПАНЕЛИ С ИНФОРМАЦИЕЙ О РЕГИОНЕ</> в верхней части экрана.",
        "it_IT": "Ogni <h>REGIONE</> ha un livello di insediamento. Per raggiungere il livello successivo, i giocatori devono soddisfare tutti i requisiti necessari. Una volta passati al livello successivo, la <h>REGIONE</> ottiene un nuovo <h>PUNTO SVILUPPO</> e sblocca nuovi edifici e potenziamenti. Per visualizzare i requisiti per il prossimo livello di insediamento, posiziona il cursore sul nome dell'insediamento nel <h>PANNELLO DELLA REGIONE</> che si trova nella parte superiore dello schermo.",
        "tr_TR": "Her <h>BÖLGENİN</> bir yerleşim seviyesi vardır. Sonraki seviyeye ulaşmak için oyuncuların tüm gereksinimleri karşılaması gerekir. Sonraki seviyeye ulaşıldığında <h>BÖLGE</> yeni bir <h>GELİŞTİRME PUANI</> kazanıp yeni yapıların ve yükseltmelerin kilidini açar. Sonraki yerleşim seviyesinin gereksinimlerini görmek için imleci ekranın üst kısmında yer alan <h>BÖLGE PANELİNDEKİ</> yerleşim isminin üzerine götür.",
        "cs_CZ": "Každý <h>REGION</> má úroveň osady. Na vyšší úroveň se dostaneš tak, že splníš všechny požadavky. Po dosažení vyšší úrovně <h>REGION</> dostane nový <h>VÝVOJOVÝ BOD</> a odemkne si nové budovy a vylepšení. Pokud se chceš podívat na požadavky na další úroveň osady, najeď kurzorem na název osady na <h>PANELU REGIONU</> v horní části obrazovky.",
        "hu_HU": "Minden <h>RÉGIÓNAK</> van településszintje. A következő szint eléréséhez a játékosnak teljesítenie kell az összes követelményt. A következő szint elérésekor a <h>RÉGIÓ</> egy új <h>FEJLESZTÉSI PONTOT</> kap, és új épületeket és fejlesztéseket old fel. A következő településszinthez szükséges követelmények megtekintéséhez vidd az egeret a település neve fölé a képernyő tetején található <h>RÉGIÓ PANELEN</>.",
        "uk_UA": "У кожного <h>РЕГІОНУ</> є рівень поселення. Гравці повинні виконати всі умови, щоб досягти наступного рівня. Коли це станеться, <h>РЕГІОН</> отримає нове <h>ОЧКО РОЗВИТКУ</>, а також розблокуються нові будівлі й поліпшення. Щоб переглянути умови досягнення наступного рівня поселення, наведіть курсор на назву поселення на <h>ПАНЕЛІ РЕГІОНУ</> у верхній частині екрану.",
        "da_DK": "Hver <h>REGION</> har et bosættelsesniveau. For at nå det næste niveau skal spilleren leve op til alle forudsætninger. Når det næste niveau nås, får <h>REGIONEN</> et nyt <h>UDVIKLINGSPOINT</>, og den låser op for nye bygninger og opgraderinger. Du kan se, hvad det næste bosættelsesniveau kræver, ved at holde markøren på bosættelsens navn i <h>REGIONSPANELET</> øverst på skærmen.",
        "nl_NL": "Elk <h>GEBIED</> heeft een nederzettingsniveau. Om het volgende niveau te bereiken, moet je aan alle vereisten voldoen. Als je het volgende niveau bereikt, krijgt het <h>GEBIED</> een nieuw <h>ONTWIKKELINGSPUNT</> en ontgrendelen er nieuwe gebouwen en upgrades. De vereisten voor het volgende nederzettingsniveau zie je door de cursor boven de naam van de nederzetting te houden in het <h>GEBIEDSVENSTER</> aan de bovenkant van het scherm.",
        "sv_SE": "Alla <h>REGIONER</> har en viss bosättningsnivå, och för att komma till nästa måste du uppfylla alla krav. När nivån höjs får <h>REGIONEN</> en ny <h>UTVECKLINGSPOÄNG</> och låser upp nya byggnader och uppgraderingar. Hovra över bosättningens namn i <h>REGIONSPANELEN</> längst upp på skärmen för att se nästa nivås krav."
      },
      "development_point": {
        "en_US": "Development point",
        "zh_CN": "发展点数",
        "zh_TW": "發展點數",
        "ja_JA": "開発ポイント",
        "ko_KR": "개발 점수",
        "de_DE": "Entwicklungspunkt",
        "es_ES": "Puntos de desarrollo",
        "fr_FR": "Points de développement",
        "pt_BR": "Ponto de desenvolvimento",
        "pl_PL": "Punkt rozwoju",
        "ru_RU": "Очки развития",
        "it_IT": "Punto sviluppo",
        "tr_TR": "Geliştirme puanı",
        "cs_CZ": "Vývojový bod",
        "hu_HU": "Fejlesztési pont",
        "uk_UA": "Очко розвитку",
        "da_DK": "Udviklingspoint",
        "nl_NL": "Ontwikkelingspunt",
        "sv_SE": "Utvecklingspoäng"
      },
      "development_point_descr": {
        "en_US": "Development points are gained by increasing the <h>SETTLEMENT LEVEL</>",
        "zh_CN": "发展点数通过提升 <h>定居点等级</> 获得",
        "zh_TW": "提高<h>聚落等級</>即可獲得發展點數。",
        "ja_JA": "<h>居留地レベル</>が上がると、開発ポイントを獲得します。",
        "ko_KR": "<h>정착지 레벨</> 을 높이면 개발 점수를 획득합니다.",
        "de_DE": "Beim Erreichen einer neuen <h>SIEDLUNGSSTUFE</> erhaltet Ihr Entwicklungspunkte.",
        "es_ES": "Se obtienen puntos de desarrollo al subir el <h>NIVEL DEL ASENTAMIENTO</>.",
        "fr_FR": "Vous obtenez des points de développement en augmentant votre <h>NIVEAU DE COLONIE</>.",
        "pt_BR": "Os pontos de desenvolvimento são recebidos ao subir o <h>NÍVEL DE ASSENTAMENTO</>.",
        "pl_PL": "Punkty rozwoju zdobywa się dzięki zwiększaniu <h>POZIOMU OSADY</>.",
        "ru_RU": "Очки развития присуждаются, когда вы повышаете <h>УРОВЕНЬ ПОСЕЛЕНИЯ</>.",
        "it_IT": "È possibile guadagnare punti sviluppo aumentando il <h>LIVELLO DI INSEDIAMENTO</>.",
        "tr_TR": "Geliştirme puanları <h>YERLEŞİM SEVİYESİNİ</> yükselterek kazanılır.",
        "cs_CZ": "Vývojové body se získávají za zvyšování <h>ÚROVNĚ OSADY</>.",
        "hu_HU": "Fejlesztési pontokat a <h>TELEPÜLÉSSZINT</> növelésével szerezhetsz",
        "uk_UA": "Очки розвитку отримуються шляхом збільшення <h>РІВНЯ ПОСЕЛЕННЯ</>",
        "da_DK": "Du får udviklingspoint ved at øge <h>BOSÆTTELSESNIVEAUET</>.",
        "nl_NL": "Je verdient ontwikkelingspunten door het <h>NEDERZETTINGSNIVEAU</> te laten stijgen.",
        "sv_SE": "Du får utvecklingspoäng genom att höja <h>BOSÄTTNINGSNIVÅN</>."
      },
      "region": {
        "en_US": "Region",
        "zh_CN": "区域",
        "zh_TW": "地區",
        "ja_JA": "地域",
        "ko_KR": "지역",
        "de_DE": "Region",
        "es_ES": "Región",
        "fr_FR": "Région",
        "pt_BR": "Região",
        "pl_PL": "Region",
        "ru_RU": "Регион",
        "it_IT": "Regione",
        "tr_TR": "Bölge",
        "cs_CZ": "Region",
        "hu_HU": "Régió",
        "uk_UA": "Регіон",
        "da_DK": "Region",
        "nl_NL": "Gebied",
        "sv_SE": "Regioner"
      },
      "region_descr": {
        "en_US": "The game map is divided into multiple Regions. Each region is a separate economic entity that has it's own <h>REGIONAL WEALTH</>, <h>STOCK</>, buildings, taxes and families (<h>FAMILY</>). Regions can only exchange goods by <h>TRADE</>. Each Region may be owned by a single <h>RULER</>.",
        "zh_CN": "游戏地图分为多个区域。每个区域都是一个独立的经济体，拥有独立的<h>地区财富</>，<h>库存</>，建筑，税收和家庭（<h>家庭</>）。区域之间只能通过 <h>贸易</> 流通货物。每个区域可能由一个单独的 <h>统治者</> 所拥有。",
        "zh_TW": "遊戲地圖區分成多個地區。每個地區都是一個獨立的經濟體，擁有自己的<h>地區財富</>、<h>庫存</>、建築物、稅金及家庭（<h>家庭</>）。地區間只能透過<h>貿易</>來交換貨物。各地區可能由一位<h>統治者</>統治。",
        "ja_JA": "地図は複数の地域に分かれています。 {br}地域とは、独自の<h>地域資産</>、<h>在庫</>、施設、税金、{br}そして<h>家族</>を持つ独立した経済単位です。 {br}各地域は<h>交易</>を通じてのみ物資が交換できます。 {br}また、個別の地域が支配できるのは一人の<h>領主</>だけです。",
        "ko_KR": "게임 지도는 여러 지역으로 나뉘어져 있습니다. 지역은 독자적인 <h>지역 자산</> , <h>재고</> , 건물, 세금, 그리고 <h>가족</> 을 지닌 별도의 경제 단위입니다. 각 지역은 <h>교역</> 을 통해서만 물자를 교환할 수 있습니다. 하나의 지역은 한 명의 <h>영주</> 에 의해 지배됩니다.",
        "de_DE": "Die Karte des Spiels ist in verschiedene Regionen unterteilt. Jede Region ist ein eigenständiger Wirtschaftsraum, der über einen eigenen <h>REGIONSVERMÖGEN</>, <h>BESTAND</>, Gebäude, Steuern und Familien (<h>FAMILIE</>) verfügt. Regionen können <h>HANDEL</> treiben, um Waren auszutauschen. Jede Region kann von einem einzelnen <h>HERRSCHER</> kontrolliert werden.",
        "es_ES": "El mapa del juego se divide en varias regiones. Cada una de ellas está bajo el mando de un <h>GOBERNANTE</> y representa una entidad económica independiente que cuenta con sus propias <h>RIQUEZAS REGIONALES</>, <h>EXISTENCIAS</> de recursos, impuestos y <h>FAMILIAS</>. Las regiones solo pueden intercambiar recursos mediante el <h>COMERCIO</>.",
        "fr_FR": "La carte du jeu est divisée en plusieurs régions. Chacune d’elles représente une entité économique distincte, avec sa propre <h>RICHESSE RÉGIONALE</>, ses propres <h>STOCKS</>, bâtiments, impôts et familles (<h>FAMILLES</>). Les régions ne peuvent s’échanger des biens qu’en <h>COMMERÇANT</>. Chaque région pourra être assujettie à un <h>SOUVERAIN</> différent.",
        "pt_BR": "O mapa é dividido em várias regiões. Cada região é uma entidade econômica separada que possui seus próprios <h>PATRIMÔNIO REGIONAL</>, <h>ESTOQUE</>, edifícios, impostos e famílias. Produtos só podem ser enviados entre regiões através da realização de <h>COMÉRCIO</>. Cada região só pode pertencer a um único <h>SENHOR</>.",
        "pl_PL": "Mapa rozgrywki jest podzielona na wiele regionów. Każdy z nich jest osobną jednostką gospodarczą, która ma swoją <h>ZAMOŻNOŚĆ REGIONU</>, <h>ZAPASY</>, budynki, podatki i rodziny (<h>RODZINA</>). Regiony mogą wymieniać dobra tylko za pośrednictwem <h>HANDLU</>. Każdy region może należeć do jednego <h>WŁADCY</>.",
        "ru_RU": "Игровая карта поделена на несколько регионов. Каждый регион – это самостоятельная экономическая единица со своим <h>ДОСТАТКОМ</>, <h>ЗАПАСАМИ</>, постройками, налогами и семьями (<h>СЕМЬЯ</>). Обмениваться припасами регионы могут только за счет <h>ТОРГОВЛИ</>. У каждого региона может быть только один <h>ПРАВИТЕЛЬ</>.",
        "it_IT": "La mappa di gioco è suddivisa in diverse regioni. Ogni regione è un apparato economico a sé stante che dispone di <h>RICCHEZZA REGIONALE</>, <h>SCORTE</>, edifici, tasse e famiglie (<h>FAMIGLIA</>). Le regioni possono scambiare merci solo tramite il <h>COMMERCIO</>. Ciascuna regione può essere controllata da un unico <h>SOVRANO</>.",
        "tr_TR": "Oyun haritası birden fazla bölgeye bölünmüştür. Her bölge kendi <h>BÖLGESEL ZENGİNLİĞİNE</>, <h>STOKUNA</>, yapılarına, vergilerine ve ailelerine (<h>AİLE</>) sahip olan ayrı bir ekonomik birimdir. Bölgeler yalnızca <h>TİCARET</> aracılığıyla mal değiş tokuşu yapabilir. Her bölgenin başında yalnızca bir <h>HÜKÜMDAR</> olabilir.",
        "cs_CZ": "Herní mapa je rozdělena na několik regionů. Každý region představuje samostatnou hospodářskou oblast, která má vlastní <h>BOHATSTVÍ REGIONU</>, <h>ULOŽENÉ ZBOŽÍ</>, budovy, daně a rodiny (<h>RODINA</>). Regiony si mohou vyměňovat zboží pouze prostřednictvím <h>OBCHODU</>. Každý region může patřit jednomu <h>VLÁDCI</>.",
        "hu_HU": "A játék térképe több régióra van felosztva. Minden régió önálló gazdasági egység, amely saját <h>REGIONÁLIS VAGYONNAL</>, <h>KÉSZLETTEL</>, épületekkel, adókkal és családokkal (<h>CSALÁD</>) rendelkezik. A régiók csak <h>KERESKEDELEMMEL</> tudnak árut cserélni. Minden régiót egyetlen <h>URALKODÓ</> birtokolhat.",
        "uk_UA": "Ігрова мапа розділена на кілька регіонів. Кожен регіон – окремий економічний суб'єкт, який має власний <h>ДОСТАТОК</>, <h>ЗАПАСИ</>, будівлі, податки й сім'ї (<h>СІМ'Я</>). Обмін товарами між регіонами можливий лише через <h>ТОРГІВЛЮ</>. Кожен регіон може належати одному <h>ПРАВИТЕЛЮ</>.",
        "da_DK": "Spillets kort er inddelt i flere regioner. Hver region er en separat økonomisk entitet, som har sin egen <h>REGIONALE RIGDOM</>, sin egen <h>BEHOLDNING</> og sine egne bygninger, skatter og familier (<h>FAMILIE</>). Regioner kan kun udveksle varer gennem <h>HANDEL</>. Hver region kan være ejet af en enkelt <h>HERSKER</>.",
        "nl_NL": "De kaart is verdeeld in meerdere gebieden. Elk gebied is een afzonderlijke economische entiteit met een eigen <h>LOKALE WELVAART</> en <h>VOORRAAD</>, eigen gebouwen, belasting en <h>GEZINNEN</>. Gebieden kunnen alleen goederen ruilen door te <h>HANDELEN</>. Elk gebied kan het eigendom zijn van een enkele <h>HEERSER</>.",
        "sv_SE": "Spelkartan är indelad i olika regioner. Varje region är sin egen separata ekonomi, som har sina egna <h>REGIONALA RIKEDOMAR</> sin egen <h>RESURSLAGRING</> samt sina egna byggnader, skatter och <h>FAMILJER</>. Regionerna kan bara byta varor via <h>HANDEL</>, och varje region kan styras av sin egen unika <h>HÄRSKARE</>."
      },
      "artisans": {
        "en_US": "Artisans",
        "zh_CN": "工匠",
        "zh_TW": "工匠",
        "ja_JA": "職人",
        "ko_KR": "기능공",
        "de_DE": "Handwerker",
        "es_ES": "Artesanos",
        "fr_FR": "Artisans",
        "pt_BR": "Artesãos",
        "pl_PL": "Rzemieślnicy",
        "ru_RU": "Ремесленники",
        "it_IT": "Artigiani",
        "tr_TR": "Zanaatkârlar",
        "cs_CZ": "Řemeslníci",
        "hu_HU": "Kézművesek",
        "uk_UA": "Ремісники",
        "da_DK": "Håndværkere",
        "nl_NL": "Ambachtslieden",
        "sv_SE": "Hantverkare"
      },
      "artisans_descr": {
        "en_US": "Artisans are family members (<h>FAMILY</>) who have been permanently assigned to work at their home by building a <h>WORKSHOP</> in the <h>EXTENSION SLOT</>.",
        "zh_CN": "工匠是被永久指派到家中工作的家庭成员（<h>家庭</>），通过在 <h>扩建区</> 中建造 <h>作坊</> 实现。",
        "zh_TW": "工匠是被永久指定在家中工作的家庭成員（<h>家庭</>），方法是在<h>擴建欄位</>中建造一座<h>工作坊</>。",
        "ja_JA": "職人は家で働けるように永久に割り当てられた家族構成員（<h>家族</>）です。 {br}<h>拡張スロット</>に<h>作業場</>を建設すると、職人が生成されます。",
        "ko_KR": "기능공은 집에서 일하도록 영구적으로 배치된 가족 구성원( <h>가족</> )입니다. <h>확장 슬롯</> 에 <h>작업장</> 을 건설하면 기능공이 생성됩니다.",
        "de_DE": "Handwerker sind Familienmitglieder (<h>FAMILIE</>), denen dauerhaft eine Arbeit in ihrem Haus zugewiesen wurde, nachdem Ihr zuvor eine <h>WERKSTATT</> im <h>ERWEITERUNGSSLOT</> gebaut habt.",
        "es_ES": "Los artesanos son miembros de <h>FAMILIA</> que trabajan en el <h>TALLER</> de su casa, que se puede construir en el espacio de <h>AMPLIACIÓN</>.",
        "fr_FR": "Les artisans sont des membres d’une famille (<h>FAMILLES</>) que vous aurez affectés à un travail chez eux de manière permanente, en construisant un <h>ATELIER</> dans l’<h>EMPLACEMENT D’EXTENSION</> de leur habitation.",
        "pt_BR": "Os artesãos são famílias designadas a trabalhar permanentemente em suas respectivas casas através da construção de <h>OFICINAS DE MANUFATURA</> nas <h>EXTENSÕES DE LOTE</> das casas.",
        "pl_PL": "Rzemieślnicy są członkami <h>RODZINY</> przydzielonymi na stałe do pracy w domu dzięki zbudowaniu <h>WARSZTATU</> w <h>MIEJSCU NA PRZYBUDÓWKĘ</>.",
        "ru_RU": "Ремесленники – это члены семей (<h>СЕМЬЯ</>), которым поручено трудиться на дому. Чтобы выдать такое назначение, постройте <h>МАСТЕРСКУЮ</> в <h>МЕСТЕ ДЛЯ ПРИСТРОЙКИ</>.",
        "it_IT": "Gli artigiani sono i membri di una famiglia (<h>FAMIGLIA</>) che hanno l'incarico permanente di lavorare nella propria casa costruendo una <h>BOTTEGA</> nello <h>SLOT ESTENSIONE</>.",
        "tr_TR": "Zanaatkârlar, <h>EK YAPI YUVASINDA</> bir <h>ATÖLYE</> inşa edilerek kalıcı olarak evlerinde çalışmaya atanmış aile (<h>AİLE</>) üyeleridir.",
        "cs_CZ": "Řemeslníci jsou členové rodiny (<h>RODINA</>), kteří byli natrvalo přiřazeni k práci u sebe doma po postavení <h>DÍLNY</> na <h>MÍSTĚ ROZŠÍŘENÍ</>.",
        "hu_HU": "A kézművesek a <h>CSALÁD</> olyan tagjai, akik állandóan otthonukban dolgoznak, <h>MŰHELYT</> építve a <h>BŐVÍTŐHELYEN</>.",
        "uk_UA": "Ремісники – члени сімей (<h>СІМ'Я</>), які отримали постійне призначення на роботу вдома після зведення <h>МАЙСТЕРНІ</> на <h>МІСЦІ ДЛЯ ПРИБУДОВИ</>.",
        "da_DK": "Håndværkere er familiemedlemmer (<h>FAMILIE</>), der er tildelt permanent arbejde i deres hjem ved at bygge et <h>VÆRKSTED</> på <h>TILBYGNINGSPLADSEN</>.",
        "nl_NL": "Ambachtslieden zijn gezinsleden (<h>GEZINNEN</>) die permanent zijn toegewezen om vanuit hun huis te werken door een <h>WERKPLAATS</> te bouwen in het <h>UITBREIDINGSVAK</>.",
        "sv_SE": "Hantverkare är medlemmar i en <h>FAMILJ</> som du låtit arbeta permanent hemifrån genom att bygga en <h>VERKSTAD</> på bostadens <h>TILLÄGGSPLATS</>."
      },
      "extension_slot": {
        "en_US": "Extension slot",
        "zh_CN": "扩建区",
        "zh_TW": "擴建欄位",
        "ja_JA": "拡張スロット",
        "ko_KR": "확장 슬롯",
        "de_DE": "Erweiterungsplatz",
        "es_ES": "Ampliación",
        "fr_FR": "Emplacement d’extension",
        "pt_BR": "Extensão de lote",
        "pl_PL": "Miejsce na przybudówkę",
        "ru_RU": "Место для пристройки",
        "it_IT": "Slot estensione",
        "tr_TR": "Ek yapı yuvası",
        "cs_CZ": "Místo rozšíření",
        "hu_HU": "Bővítőhely",
        "uk_UA": "Місце для прибудови",
        "da_DK": "Tilbygningsplads",
        "nl_NL": "Uitbreidingsvak",
        "sv_SE": "Tilläggsplatser"
      },
      "extension_slot_descr": {
        "en_US": "Space in the backyard of any large <h>BURGAGE PLOT</> which can be used to build an <h>EXTENSION</> or a <h>WORKSHOP</>.",
        "zh_CN": "在任何大型 <h>堡地</> 后院中存在的区域，可被用于建造 <h>扩建区</> 或 <h>作坊</>。",
        "zh_TW": "任何大型<h>城鎮區</>的後院都擁有的空間，可以用來建造<h>擴建</>或<h>工作坊</>。",
        "ja_JA": "大きな<h>生活区画</>の裏庭は<h>拡張</>または<h>作業場</>として活用できます。",
        "ko_KR": "커다란 <h>거주 구획</> 뒤뜰은 <h>확장</> 또는 <h>작업장</> 을 건설할 수 있는 공간입니다.",
        "de_DE": "Platz im Hinterhof einer beliebigen großen <h>HOFSTÄTTE</>, auf dem eine <h>ERWEITERUNG</> oder eine <h>WERKSTATT</> errichtet werden kann.",
        "es_ES": "El espacio en la parte trasera de los <h>SEÑORÍOS</> grandes se puede usar para construir una <h>AMPLIACIÓN</> o un <h>TALLER</>.",
        "fr_FR": "Un espace dans l’arrière-cour d’une <h>CENSIVE</> de grande taille, permettant de construire une <h>EXTENSION</> ou un <h>ATELIER</>.",
        "pt_BR": "Espaço no quintal de um <h>LOTE SENHORIAL</> grande o suficiente para ser usado para construir uma <h>EXTENSÃO</> ou uma <h>OFICINA DE MANUFATURA</>.",
        "pl_PL": "Miejsce na podwórku każdej dużej <h>PARCELI MIESZKALNEJ</>, które można wykorzystać do postawienia <h>PRZYBUDÓWKI</> albo <h>WARSZTATU</>.",
        "ru_RU": "Пространство на заднем дворе любого крупного <h>ХОЗЯЙСТВА</>, предназначенное для возведения <h>ПРИСТРОЙКИ</> или <h>МАСТЕРСКОЙ</>.",
        "it_IT": "Lo spazio sul retro di un <h>BURGAGE</> di grandi dimensioni che può essere usato per costruire un'<h>ESTENSIONE</> o una <h>BOTTEGA</>.",
        "tr_TR": "Herhangi bir <h>TIMAR ARAZİSİNİN</> arka bahçesinde bir <h>EK YAPI</> veya bir <h>ATÖLYE</> inşa etmek için kullanılabilecek alan.",
        "cs_CZ": "Prostor na dvorku každého velkého <h>DRŽEBNÍHO DOMU</>, na kterém lze postavit <h>ROZŠÍŘENÍ</> či <h>DÍLNU</>.",
        "hu_HU": "Bármely nagy méretű <h>POLGÁRI PARCELLA</> hátsó udvarán lévő hely, amely <h>BŐVÍTÉS</> vagy <h>MŰHELY</> építésére használható.",
        "uk_UA": "Місце на подвір'ї будь-якого великого <h>ГОСПОДАРСТВА</>, де можна звести <h>ПРИБУДОВУ</> чи <h>МАЙСТЕРНЮ</>.",
        "da_DK": "Plads i baghaven på store <h>BORGERLODDER</>, der kan bruges til at bygge en <h>TILBYGNING</> eller et <h>VÆRKSTED</>.",
        "nl_NL": "Ruimte in de achtertuin van een grote <h>PACHTKAVEL</> waar je een <h>UITBREIDING</> of een <h>WERKPLAATS</> kunt bouwen.",
        "sv_SE": "Utrymme på stora <h>HYRESTOMTERS</> bakgård som kan användas för att bygga <h>TILLÄGG</> eller <h>VERKSTÄDER</>."
      },
      "retinue": {
        "en_US": "Retinue",
        "zh_CN": "随从",
        "zh_TW": "隨扈",
        "ja_JA": "従者",
        "ko_KR": "수행원",
        "de_DE": "Gefolge",
        "es_ES": "Hueste",
        "fr_FR": "Retenue",
        "pt_BR": "Séquito",
        "pl_PL": "Świta",
        "ru_RU": "Дружина",
        "it_IT": "Comitatus",
        "tr_TR": "Maiyet",
        "cs_CZ": "Družina",
        "hu_HU": "Háznép",
        "uk_UA": "Дружина",
        "da_DK": "Følge",
        "nl_NL": "Entourage",
        "sv_SE": "Garden"
      },
      "retinue_descr": {
        "en_US": "Professional soldiers in service of the <h>RULER</> and bound to the region's <h>MANOR</>. Usually lower nobles, Lord's family members or other member of the court. As long as the Manor has enough space (check <h>MANOR MODULES</>), you can hire new retainers using either <h>TREASURY</>, or buy required equipment from your settlement at a large discount.",
        "zh_CN": "为 <h>统治者</> 服务的专业士兵，受到领该区域 <h>庄园</> 的约束。通常是低级贵族、领主的家庭成员或其他皇室成员。只要庄园有足够的空间（查看 <h>庄园模块</>），你可以雇佣新的家仆使用 <h>金库</> 或以大幅折扣从你的定居点购买装备。",
        "zh_TW": "職業軍人，為<h>統治者</>服務，並且綁定於該地區的<h>莊園</>。通常是低階貴族、領主的家庭成員，或宮廷中的其他成員。只要莊園有足夠的空間（請查閱<h>莊園模組</>），你就可以使用<h>金庫</>雇用新家僕，或是以巨大折扣從你的聚落中購買必要的裝備。",
        "ja_JA": "地域の<h>邸宅</>に所属され、<h>領主</>のために働くベテラン軍人です。主に下級貴族、領主の家族構成員などで構成されています。邸宅に十分な空間があるなら（<h>邸宅モジュール</>を確認）、<h>国庫</>を使って従者を雇ったり、必要な装備を居留地から安い価格で買い取ることができます。",
        "ko_KR": "지역의 <h>저택</> 에 소속되어 <h>영주</> 를 위해 복무하는 전문 군인입니다. 하급 귀족, 영주의 가족 구성원, 또는 궁정의 기타 구성원으로 이루어지는 경우가 흔합니다. 저택에 충분한 공간이 있다면( <h>저택 모듈</> 확인), <h>국고</> 를 사용해서 수행원을 고용하거나 필요한 장비를 정착지에서 크게 할인된 가격으로 구매할 수 있습니다.",
        "de_DE": "Professionelle Soldaten im Dienste des <h>LEHENSHERREN</>, die an das <h>HERRENHAUS</> der Region gebunden sind. Ihre Reihen bestehen üblicherweise aus niederen Adeligen, Familienmitgliedern des Lehensherren oder anderen Gefolgsmitgliedern. Solange im Herrenhaus genügend Platz ist (siehe <h>HERRENHAUS-MODULE</>), könnt Ihr neue Vasallen entweder aus der <h>SCHATZKAMMER</> finanzieren oder die nötige Ausrüstung zu einem deutlich geringeren Preis in Eurer eigenen Siedlung kaufen.",
        "es_ES": "Soldados profesionales al servicio de un <h>GOBERNANTE</> y ligados a una <h>CASA SEÑORIAL</>. Por lo general, se trata de nobles de baja casta, familiares del gobernante y otros miembros de la corte. Siempre que la <h>CASA SEÑORIAL</> cuente con el espacio suficiente (ver <h>MÓDULOS DE LA CASA SEÑORIAL</>), puedes usar las <h>ARCAS</> para engrosar las filas de tus huestes, pero también puedes comprar el equipo necesario a tu asentamiento a un precio muy reducido.",
        "fr_FR": "Des soldats professionnels au service du <h>SOUVERAIN</> et rattachés au <h>MANOIR</> de la région. Ce sont généralement des membres de la basse noblesse, des membres de la famille du seigneur ou d’autres membres de la cour. Tant que le manoir peut les accueillir (voir <h>ÉLÉMENTS DU MANOIR</>), vous pouvez engager de nouveaux gardes à l’aide de votre <h>TRÉSORERIE</> ou en achetant l’équipement requis dans votre colonie à moindre prix.",
        "pt_BR": "Soldados profissionais a serviço do <h>SENHOR</> das terras, associados ao <h>CASARÃO</> da região. Normalmente eles são nobres mais baixos, familiares do senhor ou outros membros da corte. Contanto que o casarão tenha espaço suficiente (verifique os <h>MÓDULOS DO CASARÃO</>), é possível contratar novos vassalos usando o <h>TESOURO</> ou comprar equipamentos necessários da sua cidade com um bom desconto.",
        "pl_PL": "Zawodowi żołnierze w służbie <h>WŁADCY</>, przypisani do <h>POSIADŁOŚCI</> w danym regionie. Jest to zwykle pomniejsza szlachta, członkowie rodziny władcy lub inni dworacy. Jeśli tylko w posiadłości jest wystarczające miejsce (zerknij na <h>MODUŁY POSIADŁOŚCI</>), możesz nająć nowych dworzan, płacąc <h>GRZYWNAMI</> albo kupując wymagany sprzęt w swojej osadzie z dużą zniżką.",
        "ru_RU": "Профессиональные воины, служащие <h>ПРАВИТЕЛЮ</> региона и расквартированные в его <h>УСАДЬБЕ</>. Как правило, дружина состоит из худородных аристократов, родственников правителя и других придворных лиц. Пока в усадьбе хватает свободного места (см. <h>МОДУЛИ УСАДЬБЫ</>), вы можете нанимать новых дружинников либо за счет <h>КАЗНЫ</>, либо покупая с большой скидкой необходимое снаряжение у своих мастеров.",
        "it_IT": "Soldati di professione al servizio del <h>SOVRANO</> e legati al <h>MANIERO</> della regione. Solitamente si tratta di nobili di basso rango, familiari del sovrano o altri membri della corte. Finché il maniero ha abbastanza spazio (controlla i <h>MODULI DEL MANIERO</>), puoi assumere nuovi gregari utilizzando il <h>TESORO</> o acquistare l'equipaggiamento necessario dal tuo insediamento a un prezzo molto scontato.",
        "tr_TR": "<h>HÜKÜMDARA</> hizmet eden ve bölgenin <h>KÖŞKÜNE</> bağlı profesyonel askerler. Genellikle alt düzey soylular, Lord'un aile bireyleri veya saray halkının diğer üyelerinden oluşur. Köşkte yeterli yer olduğu sürece (<h>KÖŞK PARÇALARINI</> kontrol et) <h>HAZİNE</> kullanarak yeni vasallar alabilir veya gerekli ekipmanı yerleşiminden büyük bir indirimle satın alabilirsin.",
        "cs_CZ": "Profesionální vojáci ve službách <h>VLÁDCE</> spojení se <h>SÍDLEM</> regionu. Obvykle jsou to nižší šlechtici, členové pánovy rodiny či další dvořané. Dokud bude v sídle dostatek místa (viz <h>MODULY SÍDLA</>), budeš moct najímat nové členy družiny buď pomocí <h>POKLADNICE</>, nebo zakoupením vybavení ze své osady s velkou slevou.",
        "hu_HU": "Hivatásos katonák az <h>URALKODÓ</> szolgálatában és a régió <h>URADALMÁNAK</> kötelékében. Általában alacsonyabb rangú nemesek, a Lord családtagjai vagy az udvar más tagjai. Amíg az uradalomban elegendő hely van (nézd meg a <h>URADALOMMODULOKAT</>), addig felvehetsz új csatlósokat a <h>KINCSTÁR</> segítségével vagy megvásárolhatod a szükséges felszerelést a településedről nagy kedvezménnyel.",
        "uk_UA": "Професійні воїни на службі <h>ПРАВИТЕЛЯ</>, які приписані до <h>САДИБИ</> регіону. Зазвичай це дрібні дворяни, члени сім'ї володаря або інші члени двору. Поки в садибі вдосталь місця (дивіться <h>МОДУЛІ САДИБИ</>), ви можете наймати нових дружинників за кошти зі <h>СКАРБНИЦІ</> або купувати необхідне спорядження у своєму поселенні з великою знижкою.",
        "da_DK": "Professionelle soldater, der tjener <h>HERSKEREN</> og er knyttet til regionens <h>GODS</>. De er som regel lavadel, herremandens familie eller andre medlemmer af hoffet. Så længe godset har plads nok (se også <h>GODSMODULER</>), kan du hyre nyt følge enten gennem <h>SKATKAMMERET</> eller ved at købe det nødvendige udstyr fra din bosættelse med en stor rabat.",
        "nl_NL": "Professionele soldaten in dienst van de <h>HEERSER</>, die zijn verbonden aan het <h>LANDHUIS</> in het gebied. Meestal lagere edellieden, familieleden van een heer of andere leden van het hof. Zolang er genoeg ruimte is in het landhuis (zie: <h>LANDHUISMODULES</>), kun je nieuwe volgelingen huren met geld uit de <h>SCHATKIST</> of door de vereiste uitrusting in je nederzetting tegen een lagere prijs te kopen.",
        "sv_SE": "Yrkessoldater som tjänar <h>HÄRSKAREN</> och är bundna till regionens <h>HERRGÅRD</>. Det handlar vanligtvis om lägre adelsmän, släktingar till härskaren eller på annat sätt medlemmar i hovet. Så länge herrgården har tillräckligt med utrymme (se <h>HERRGÅRDSMODULER</>) kan du anlita nya gardister med hjälp av <h>STADSKASSAN</>, eller köpa den nödvändiga utrustningen från bosättningen till kraftig rabatt."
      },
      "free_merchants": {
        "en_US": "Free merchants",
        "zh_CN": "自由商人",
        "zh_TW": "自由商人",
        "ja_JA": "放浪商人",
        "ko_KR": "자유 상인",
        "de_DE": "Wanderhändler",
        "es_ES": "Mercaderes libres",
        "fr_FR": "Marchands itinérants",
        "pt_BR": "Mercador ambulante",
        "pl_PL": "Wolni kupcy",
        "ru_RU": "Вольные купцы",
        "it_IT": "Mercanti autonomi",
        "tr_TR": "Seyyah tüccarlar",
        "cs_CZ": "Svobodní kupci",
        "hu_HU": "Szabad kereskedők",
        "uk_UA": "Вільні купці",
        "da_DK": "Handelsrejsende",
        "nl_NL": "Reizende kooplieden",
        "sv_SE": "Kringresande handelsmän"
      },
      "free_merchants_descr": {
        "en_US": "Free merchants travel between <h>TRADEPOINTS</>, visiting the player's <h>TRADING POST</> buildings if they are on the way. When visiting the Trading Post, they commence <h>TRADE</> with the <h>REGION</>.",
        "zh_CN": "自由商人在 <h>贸易点</> 之间流动，如果他们沿途经过，则会拜访玩家的 <h>交易所</> 建筑。访问交易所时，他们会与 <h>区域</> 进行 <h>贸易</> 活动。",
        "zh_TW": "自由商人在<h>貿易點</>之間旅行，並在順路時拜訪玩家的<h>貿易站</>建築。在拜訪貿易站時，他們會和該<h>地區</>進行<h>貿易</>。",
        "ja_JA": "放浪商人は複数の<h>交易拠点</>を放浪しています。プレイヤーの<h>交易所</>が道路と繋がっていると、放浪商人はプレイヤーの交易所に訪れます。交易所に訪れた放浪商人はプレイヤーの<h>地域</>と<h>交易</>を開始します。",
        "ko_KR": "자유 상인은 여러 <h>교역 거점</> 을 돌아다닙니다. 플레이어의 <h>교역소</> 가 도로에 연결되어 있다면 이동 중 해당 교역소에 방문합니다. 교역소에 들어온 자유 상인은 해당 <h>지역</> 과 <h>교역</> 을 시행합니다.",
        "de_DE": "Wanderhändler reisen zwischen <h>HANDELSPUNKTEN</> hin und her und besuchen unterwegs den <h>HANDELSPOSTEN</> des Spielers. Wenn sie den Handelsposten erreicht haben, beginnen sie den <h>HANDEL</> mit der <h>REGION</>.",
        "es_ES": "Los mercaderes libres viajan entre <h>PUNTOS DE RUTA</> y visitan tus <h>FACTORÍAS DE COMERCIO</>, si están de paso. Cuando visitan una, comienzan a <h>COMERCIAR</> con la <h>REGIÓN</>.",
        "fr_FR": "Les marchands itinérants voyagent d’une <h>MAISON DE COMMERCE</> à une autre. Ils passeront par vos <h>COMPTOIRS COMMERCIAUX</> s’ils sont sur leur chemin et commenceront alors leurs <h>ÉCHANGES</> avec votre <h>RÉGION</>.",
        "pt_BR": "Os mercadores ambulantes viajam entre <h>ZONAS MERCANTIS</> e visitarão os <h>POSTOS COMERCIAIS</> do jogador se houver algum no trajeto deles. Ao visitar um posto comercial, eles realizarão <h>COMÉRCIO</> com a <h>REGIÃO</>.",
        "pl_PL": "Wolni kupcy podróżują między <h>PUNKTAMI HANDLOWYMI</>, odwiedzając <h>FAKTORIE</> gracza, jeśli trafią na nie po drodze. Podczas wizyty w faktorii kupcy mogą <h>HANDLOWAĆ</> z <h>REGIONEM</>.",
        "ru_RU": "Вольные купцы путешествуют между <h>ТОРГОВЫМИ ПУНКТАМИ</>, посещая <h>ФАКТОРИИ</> игрока, если те находятся по пути. При заезде в факторию купец заключает <h>ТОРГОВЫЕ СДЕЛКИ</> с соответствующим <h>РЕГИОНОМ</>.",
        "it_IT": "I mercanti autonomi viaggiano tra i <h>PUNTI DI SCAMBIO</>, visitando gli edifici utilizzati come <h>STAZIONI COMMERCIALI</> del giocatore se si trovano sul loro percorso. Quando visitano la stazione commerciale, danno il via ad attività di <h>COMMERCIO</> con la <h>REGIONE</>.",
        "tr_TR": "Seyyah tüccarlar <h>TİCARET NOKTALARI</> arasında seyahat edip yol üstündelerse oyuncunun <h>TİCARET MERKEZİ</> yapılarını ziyaret ederler. Ticaret Merkezini ziyaret ederken <h>BÖLGE</> ile <h>TİCARET</> yaparlar.",
        "cs_CZ": "Svobodní kupci cestují mezi <h>OBCHODNÍMI MÍSTY</> a navštíví hráčovu <h>OBCHODNÍ STANICI</>, pokud ji mají po cestě. Během návštěvy obchodní stanice se mohou věnovat <h>OBCHODU</> s <h>REGIONEM</>.",
        "hu_HU": "A szabad kereskedők <h>KERESKEDŐPONTOK</> között utaznak, és meglátogatják a játékos <h>KERESKEDŐÁLLOMÁSAIT</>, ha azok útba esnek. A Kereskedőállomás meglátogatásakor megkezdik a <h>KERESKEDÉST</> a <h>RÉGIÓVAL</>.",
        "uk_UA": "Вільні купці подорожують між <h>ТОРГОВИМИ ПУНКТАМИ</>, відвідуючи <h>ФАКТОРІЇ</> гравця, якщо ті трапляються на шляху. Коли вони їх відвідують, то ведуть <h>ТОРГІВЛЮ</> з <h>РЕГІОНОМ</>.",
        "da_DK": "Handelsrejsende rejser mellem <h>HANDELSPUNKTER</> og besøger spillerens <h>HANDELSSTATIONER</>, hvis de er på vejen. Når de besøger handelsstationen, <h>HANDLER</> de med <h>REGIONEN</>.",
        "nl_NL": "Reizende kooplieden reizen tussen <h>HANDELSPUNTEN</> en bezoeken onderweg de <h>HANDELSPOST</> van de speler. Als ze de handelspost bezoeken, zullen ze <h>HANDELEN</> met het <h>GEBIED</>.",
        "sv_SE": "Kringresande handelsmän färdas mellan <h>HANDELSPLATSER</> och besöker din <h>HANDELSBOD</> om de passerar den. Under besöket <h>BEDRIVER DE HANDEL</> med <h>REGIONEN</>."
      },
      "travelling_merchants": {
        "en_US": "Free merchants",
        "zh_CN": "自由商人",
        "zh_TW": "自由商人",
        "ja_JA": "放浪商人",
        "ko_KR": "자유 상인",
        "de_DE": "Wanderhändler",
        "es_ES": "Mercaderes libres",
        "fr_FR": "Marchands itinérants",
        "pt_BR": "Mercador ambulante",
        "pl_PL": "Wolni kupcy",
        "ru_RU": "Вольные купцы",
        "it_IT": "Mercanti autonomi",
        "tr_TR": "Seyyah tüccarlar",
        "cs_CZ": "Svobodní kupci",
        "hu_HU": "Szabad kereskedők",
        "uk_UA": "Вільні купці",
        "da_DK": "Handelsrejsende",
        "nl_NL": "Reizende kooplieden",
        "sv_SE": "Kringresande handelsmän"
      },
      "travelling_merchants_descr": {
        "en_US": "Free merchants travel between <h>TRADEPOINTS</>, visiting the player's <h>TRADING POST</> buildings if they are on the way. When visiting the Trading Post, they commence <h>TRADE</> with the <h>REGION</>.",
        "zh_CN": "自由商人在 <h>贸易点</> 之间流动，如果他们沿途经过，则会拜访玩家的 <h>交易所</> 建筑。访问交易所时，他们会与 <h>区域</> 进行 <h>贸易</> 活动。",
        "zh_TW": "自由商人在<h>貿易點</>之間旅行，並在順路時拜訪玩家的<h>貿易站</>建築。在拜訪貿易站時，他們會和該<h>地區</>進行<h>貿易</>。",
        "ja_JA": "放浪商人は複数の<h>交易拠点</>を放浪しています。プレイヤーの<h>交易所</>が道路と繋がっていると、放浪商人はプレイヤーの交易所に訪れます。交易所に訪れた放浪商人はプレイヤーの<h>地域</>と<h>交易</>を開始します。",
        "ko_KR": "자유 상인은 여러 <h>교역 거점</> 을 돌아다닙니다. 플레이어의 <h>교역소</> 가 도로에 연결되어 있다면 이동 중 해당 교역소에 방문합니다. 교역소에 들어온 자유 상인은 해당 <h>지역</> 과 <h>교역</> 을 시행합니다.",
        "de_DE": "Wanderhändler reisen zwischen <h>HANDELSPUNKTEN</> hin und her und besuchen unterwegs den <h>HANDELSPOSTEN</> des Spielers. Wenn sie den Handelsposten erreicht haben, beginnen sie den <h>HANDEL</> mit der <h>REGION</>.",
        "es_ES": "Los mercaderes libres viajan entre <h>PUNTOS DE RUTA</> y visitan tus <h>FACTORÍAS DE COMERCIO</>, si están de paso. Cuando visitan una, comienzan a <h>COMERCIAR</> con la <h>REGIÓN</>.",
        "fr_FR": "Les marchands itinérants voyagent d’une <h>MAISON DE COMMERCE</> à une autre. Ils passeront par vos <h>COMPTOIRS COMMERCIAUX</> s’ils sont sur leur chemin et commenceront alors leurs <h>ÉCHANGES</> avec votre <h>RÉGION</>.",
        "pt_BR": "Os mercadores ambulantes viajam entre <h>ZONAS MERCANTIS</> e visitarão os <h>POSTOS COMERCIAIS</> do jogador se houver algum no trajeto deles. Ao visitar um posto comercial, eles realizarão <h>COMÉRCIO</> com a <h>REGIÃO</>.",
        "pl_PL": "Wolni kupcy podróżują między <h>PUNKTAMI HANDLOWYMI</>, odwiedzając <h>FAKTORIE</> gracza, jeśli trafią na nie po drodze. Podczas wizyty w faktorii kupcy mogą <h>HANDLOWAĆ</> z <h>REGIONEM</>.",
        "ru_RU": "Вольные купцы путешествуют между <h>ТОРГОВЫМИ ПУНКТАМИ</>, посещая <h>ФАКТОРИИ</> игрока, если те находятся по пути. При заезде в факторию купец заключает <h>ТОРГОВЫЕ СДЕЛКИ</> с соответствующим <h>РЕГИОНОМ</>.",
        "it_IT": "I mercanti autonomi viaggiano tra i <h>PUNTI DI SCAMBIO</>, visitando gli edifici utilizzati come <h>STAZIONI COMMERCIALI</> del giocatore se si trovano sul loro percorso. Quando visitano la stazione commerciale, danno il via ad attività di <h>COMMERCIO</> con la <h>REGIONE</>.",
        "tr_TR": "Seyyah tüccarlar <h>TİCARET NOKTALARI</> arasında seyahat edip yol üstündelerse oyuncunun <h>TİCARET MERKEZİ</> yapılarını ziyaret ederler. Ticaret Merkezini ziyaret ederken <h>BÖLGE</> ile <h>TİCARET</> yaparlar.",
        "cs_CZ": "Svobodní kupci cestují mezi <h>OBCHODNÍMI MÍSTY</> a navštíví hráčovu <h>OBCHODNÍ STANICI</>, pokud ji mají po cestě. Během návštěvy obchodní stanice se mohou věnovat <h>OBCHODU</> s <h>REGIONEM</>.",
        "hu_HU": "A szabad kereskedők <h>KERESKEDŐPONTOK</> között utaznak, és meglátogatják a játékos <h>KERESKEDŐÁLLOMÁSAIT</>, ha azok útba esnek. A Kereskedőállomás meglátogatásakor megkezdik a <h>KERESKEDÉST</> a <h>RÉGIÓVAL</>.",
        "uk_UA": "Вільні купці подорожують між <h>ТОРГОВИМИ ПУНКТАМИ</> й відвідують <h>ФАКТОРІЇ</> гравця, якщо ті трапляються на шляху. Коли вони їх відвідують, то ведуть <h>ТОРГІВЛЮ</> з <h>РЕГІОНОМ</>.",
        "da_DK": "Handelsrejsende rejser mellem <h>HANDELSPUNKTER</> og besøger spillerens <h>HANDELSSTATIONER</>, hvis de er på vejen. Når de besøger handelsstationen, <h>HANDLER</> de med <h>REGIONEN</>.",
        "nl_NL": "Reizende kooplieden reizen tussen <h>HANDELSPUNTEN</> en bezoeken onderweg de <h>HANDELSPOST</> van de speler. Als ze de handelspost bezoeken, zullen ze <h>HANDELEN</> met het <h>GEBIED</>.",
        "sv_SE": "Kringresande handelsmän färdas mellan <h>HANDELSPLATSER</> och besöker din <h>HANDELSBOD</> om de passerar den. Under besöket <h>BEDRIVER DE HANDEL</> med <h>REGIONEN</>."
      },
      "storage_type": {
        "en_US": "Storage type",
        "zh_CN": "储藏室种类",
        "zh_TW": "倉庫種類",
        "ja_JA": "保管先",
        "ko_KR": "저장 유형",
        "de_DE": "Lagerart",
        "es_ES": "Tipo de almacenamiento",
        "fr_FR": "Type de stockage ",
        "pt_BR": "Tipo de armazenamento",
        "pl_PL": "Typ magazynu",
        "ru_RU": "Тип хранилища",
        "it_IT": "Tipo di deposito",
        "tr_TR": "Depo türü",
        "cs_CZ": "Typ skladu",
        "hu_HU": "Raktár típusa",
        "uk_UA": "Тип сховища",
        "da_DK": "Opbevaringstype",
        "nl_NL": "Opslagsoort",
        "sv_SE": "Lagertyp"
      },
      "crafting_resources_required": {
        "en_US": "Required for crafting",
        "zh_CN": "制作所需",
        "zh_TW": "製造需要",
        "ja_JA": "製作に必要なもの",
        "ko_KR": "제작에 필요",
        "de_DE": "Für Produktion benötigt",
        "es_ES": "Requisito de fabricación",
        "fr_FR": "Ressources nécessaires ",
        "pt_BR": "Necessário para a produção",
        "pl_PL": "Wymagane zasoby",
        "ru_RU": "Необходимо для производства",
        "it_IT": "Necessarie per la creazione",
        "tr_TR": "Üretimi için gerekenler",
        "cs_CZ": "Potřebuje k výrobě",
        "hu_HU": "Előállításhoz szükséges",
        "uk_UA": "Необхідно для виготовлення",
        "da_DK": "Nødvendig for håndværk",
        "nl_NL": "Vereist voor vervaardiging van",
        "sv_SE": "Krävs för tillverkning"
      },
      "buildings_producing_good": {
        "en_US": "Buildings producing this resource",
        "zh_CN": "生产该资源的建筑",
        "zh_TW": "生產這項資源的建築",
        "ja_JA": "この資源が入手できる施設",
        "ko_KR": "해당 자원을 생산하는 건물",
        "de_DE": "Gebäude, die diese Ressource produzieren",
        "es_ES": "Construcciones que producen este recurso",
        "fr_FR": "Bâtiments produisant cette ressource ",
        "pt_BR": "Edifícios que produzem este recurso",
        "pl_PL": "Budynki wytwarzające ten zasób",
        "ru_RU": "Постройки, производящие этот ресурс",
        "it_IT": "Edifici che producono questa risorsa",
        "tr_TR": "Bu kaynağı üreten yapılar",
        "cs_CZ": "Budovy vyrábějící tuto surovinu",
        "hu_HU": "Ilyen nyersanyagot előállító épületek",
        "uk_UA": "Будівлі, де виготовляють ресурс",
        "da_DK": "Bygninger, der producerer denne ressource",
        "nl_NL": "Gebouwen die dit materiaal produceren",
        "sv_SE": "Byggnader som producerar resursen"
      },
      "upgrades_required": {
        "en_US": "Upgrades enabling production",
        "zh_CN": "升级启用生产",
        "zh_TW": "許可生產的升級",
        "ja_JA": "生産に必要なアップグレード",
        "ko_KR": "생산에 필요한 업그레이드",
        "de_DE": "Kann zu Produktionsstätte ausgebaut werden",
        "es_ES": "Mejoras que permiten la producción",
        "fr_FR": "Améliorations permettant la production ",
        "pt_BR": "Melhorias que permitem a produção",
        "pl_PL": "Wymagane ulepszenia",
        "ru_RU": "Улучшения, необходимые для производства",
        "it_IT": "Miglioramenti che consentono la produzione",
        "tr_TR": "Üretimi mümkün kılan yükseltmeler",
        "cs_CZ": "Vylepšení umožňující výrobu",
        "hu_HU": "A termelést lehetővé tevő fejlesztések",
        "uk_UA": "Поліпшення, що дозволяє виробництво",
        "da_DK": "Opgraderinger muliggør produktion",
        "nl_NL": "Upgrades die productie mogelijk maken",
        "sv_SE": "Uppgraderingar för produktion"
      },
      "upgrade_available_for": {
        "en_US": "Available for",
        "zh_CN": "可用于",
        "zh_TW": "可使用",
        "ja_JA": "必要",
        "ko_KR": "필요:",
        "de_DE": "Verfügbar für",
        "es_ES": "Disponible para",
        "fr_FR": "Disponible pour ",
        "pt_BR": "Disponível para",
        "pl_PL": "Dostępne dla",
        "ru_RU": "Подходящие объекты",
        "it_IT": "Disponibile per",
        "tr_TR": "Şunun için mevcut",
        "cs_CZ": "Dostupné pro",
        "hu_HU": "Elérhető",
        "uk_UA": "Доступно для",
        "da_DK": "Tilgængelig for",
        "nl_NL": "Beschikbaar voor",
        "sv_SE": "Tillgänglig för"
      },
      "essential_commodities": {
        "en_US": "Essential commodities",
        "zh_CN": "必需品",
        "zh_TW": "基本商品",
        "ja_JA": "生活必需品",
        "ko_KR": "필수 일용품",
        "de_DE": "Wichtige Gebrauchsgüter",
        "es_ES": "Artículos de consumo básicos",
        "fr_FR": "Marchandises essentielles",
        "pt_BR": "Mercadorias essenciais",
        "pl_PL": "Towary podstawowe",
        "ru_RU": "Предметы первой необходимости",
        "it_IT": "Prodotti essenziali",
        "tr_TR": "Gerekli temel ürünler",
        "cs_CZ": "Nezbytné zboží",
        "hu_HU": "Alapvető árucikkek",
        "uk_UA": "Товари першої необхідності",
        "da_DK": "Essentielle handelsvarer",
        "nl_NL": "Essentiële handelsartikelen",
        "sv_SE": "Basvaror"
      },
      "essential_commodities_descr": {
        "en_US": "Resources that are consumed 1 per <h>FAMILY</> per year. If they aren't supplied, it can cause negative effects. Lack of <h>TOOLS</> leads to 30% chance of failure during crafting. Effects for other goods are still work in progress.",
        "zh_CN": "每年每户 <h>家庭</> 消耗1单位的资源。如果没有为家庭提供足够的资源，则会导致负面影响。缺少 <h>工具</> 会导致制作出现30%的失败几率。其他货物的效果仍在制作中。",
        "zh_TW": "每年每個 <h>家庭</> 消耗 1 單位消耗性資源。如果沒有供應這類資源，可能導致負面效果。缺少 <h>工具</> 會導致在製造時有 30% 的機會失敗。對其他貨物的效果尚在開發中。",
        "ja_JA": "毎年、<h>1家族</>ごとに1個消費する資源です。生活必需品が与えられないと、悪影響が出るおそれがあります。<h>道具</>が不足していると、30%の確率で生成に失敗します。（他の資源に与える影響については鋭意開発中）",
        "ko_KR": "각 <h>가족</> 이 매년 1개씩 소모하는 자원입니다. 필수 일용품이 공급되지 않을 경우 부정적인 영향이 발생할 수 있습니다. <h>도구</> 가 부족하면 제작 과정에서 30% 확률로 실패합니다. 다른 물자에 관한 영향은 현재 개발 중입니다.",
        "de_DE": "Ressourcen, von denen pro Jahr 1 Einheit je <h>FAMILIE</> verbraucht wird. Wenn diese Ressourcen nicht bereitgestellt werden können, kann dies negative Auswirkungen haben. Ein Mangelt es an <h>WERKZEUGEN</> scheitern Produktionsprozesse mit einer Wahrscheinlichkeit von 30 %. Auswirkungen auf andere Waren sind noch in Arbeit.",
        "es_ES": "Las <h>FAMILIAS</> consumen 1 de estos recursos cada año. De no hacerlo, puede haber efectos negativos. Habrá un 30 % de probabilidades de fallo en la fabricación si no se tienen <h>HERRAMIENTAS</>. Los efectos de los demás recursos siguen en proceso de desarrollo.",
        "fr_FR": "Les ressources consommées par <h>FAMILLE</> et par an. En manquer pourra avoir des effets négatifs. Si vous manquez d’<h>OUTILS</>, les chances de réussite des artisans tomberont à 70 %. Les effets pour les autres biens sont encore en développement.",
        "pt_BR": "São os recursos consumidos anualmente pelas <h>FAMÍLIAS</>, ao menos 1 de cada. A falta de abastecimento desses recursos pode provocar efeitos negativos. A falta de <h>FERRAMENTAS</>, por exemplo, leva a até 30% de chance de falhas durante a produção. Efeitos para outros produtos ainda estão em desenvolvimento.",
        "pl_PL": "Zasoby zużywane po 1 jednostce na <h>RODZINĘ</> co roku. Ich brak może pociągać za sobą negatywne skutki. Brak <h>NARZĘDZI</> powoduje 30-procentową szansę niepowodzenia podczas wytwarzania. Skutki innych niedoborów są nadal opracowywane.",
        "ru_RU": "Ресурсы, 1 меру которых <h>СЕМЬЯ</> потребляет в год. Нехватка такого ресурса может привести к негативным эффектам. Недостаток <h>ИНСТРУМЕНТОВ</> влечет за собой 30%-ную вероятность получить брак при производстве. Эффекты, касающиеся других товаров, пока находятся на стадии разработки.",
        "it_IT": "Ogni <h>FAMIGLIA</> consuma 1 di queste risorse all'anno. Se non vengono rifornite, possono produrre effetti negativi. La mancanza di <h>ATTREZZI</> comporta una probabilità di fallimento del 30% durante la creazione di oggetti. Gli effetti relativi ad altre risorse sono ancora in fase di sviluppo.",
        "tr_TR": "Senede <h>AİLE</> başına 1 adet tüketilen kaynaklar. Tedarik edilmezlerse olumsuz etkilere sebep olabilir. <h>ALET</> eksikliği üretim sırasında %30 başarısızlık ihtimaline yol açar. Diğer malların etkileri hâlâ geliştirme aşamasındadır.",
        "cs_CZ": "Suroviny, které spotřebuje 1 <h>RODINA</> za rok. Když jich nebudeš mít dost, může to mít negativní dopad. Nedostatek <h>NÁŘADÍ</> vede ke 30% šanci na neúspěšnou výrobu. Na efektech pro další zboží se stále pracuje.",
        "hu_HU": "A nyersanyagokból 1 fogy évente és <h>CSALÁDONKÉNT</>. Ha nincs meg az ellátás, az negatív hatásokat okozhat. A <h>SZERSZÁMOK</> hiánya 30% esélyt ad hibára a kézművesség során. A többi árura vonatkozó hatások még kidolgozás alatt állnak.",
        "uk_UA": "Ресурси, які <h>СІМ'Ї</> споживають по 1 од. на рік. Якщо їх не постачати, це може мати негативні наслідки. Відсутність <h>ІНСТРУМЕНТІВ</> призведе до невдачі під час виготовлення з імовірністю 30%. Ефекти для інших товарів ще в розробці.",
        "da_DK": "Ressourcer, som <h>FAMILIER</> forbruger 1 af om året. Hvis den ikke er til rådighed, kan det få negative følger. Mangel på <h>VÆRKTØJ</> giver 30 % risiko for, at håndværk mislykkes. Der bliver stadig arbejdet på effekterne for andre varer.",
        "nl_NL": "Materialen die worden verbruikt, 1 per <h>GEZIN</> per jaar. Als ze niet op voorraad zijn, kan dat negatieve effecten hebben. Een gebrek aan <h>GEREEDSCHAPPEN</> leidt tot een kans van 30% dat het vervaardigen mislukt. Effecten voor andere goederen zijn nog in ontwikkeling.",
        "sv_SE": "Resurser som varje <h>FAMILJ</> förbrukar 1 av om året. Uteblivna varor kan leda till negativa effekter. Brist på <h>VERKTYG</> leder till 30 % risk för misslyckad tillverkning. Andra varors negativa effekter är fortfarande under utveckling."
      },
      "tradepoints": {
        "en_US": "Tradepoints",
        "zh_CN": "贸易点",
        "zh_TW": "貿易點",
        "ja_JA": "交易地",
        "ko_KR": "교역 지점",
        "de_DE": "Handelspunkte",
        "es_ES": "Puntos de ruta",
        "fr_FR": "Maisons de commerce",
        "pt_BR": "Zonas mercantis",
        "pl_PL": "Punkty handlowe",
        "ru_RU": "Торговые пункты",
        "it_IT": "Punti di scambio",
        "tr_TR": "Ticaret noktaları",
        "cs_CZ": "Obchodní místa",
        "hu_HU": "Kereskedőpontok",
        "uk_UA": "Торгові пункти",
        "da_DK": "Handelspunkter",
        "nl_NL": "Handelspunten",
        "sv_SE": "Handelsplatser"
      },
      "tradepoints_descr": {
        "en_US": "Points on the edge of the playable game area that may become a destination of <h>TRADE</>. They represent trade that flows to and from lands far away, and imports going through them cost extra 10 <img id=\"ItemID_0\"/> <h>REGIONAL WEALTH</>.",
        "zh_CN": "游玩区域边缘的地点，可能会成为 <h>贸易</> 目的地，代表着远方的贸易活动。在这些地点进口的货物将额外消耗10单位的 <img id=\"ItemID_0\"/> <h>地区财富</>。",
        "zh_TW": "貿易點位於可遊玩遊戲區域的邊緣上，可以成為 <h>貿易</> 的目的地。它們代表來回於遠方土地的貿易，而經由它們進口的物品需要支付額外 10 單位 <img id=\"ItemID_0\"/> <h>地區財富</>。",
        "ja_JA": "プレイできるゲーム領域の端にある場所は<h>交易</>の対象になります。 {br}このように遠く離れた場所は交易地と呼ばれ、ここから輸入される輸入品には{br}10の <img id=ItemID_0\"/> <h>地域資産</>が追加されます。",
        "ko_KR": "교역 지점은 플레이 가능한 게임 영역의 가장자리에 있는 지점들입니다. 이곳이 <h>교역</> 목적지가 될 수 있습니다. 교역 지점은 멀리 떨어진 땅을 오가는 교역을 나타내며, 교역 지점을 통해 들어오는 수입품 비용에는 10의 <img id=\"ItemID_0\"/> <h>지역 자산</> 이 추가됩니다.",
        "de_DE": "Punkte am Rande des Spielbereichs, mit denen <h>HANDEL</> getrieben werden kann. Sie repräsentieren den Handel von und mit fernen Ländern. Importe über diese Punkte kosten zusätzlich 10 <img id=\"ItemID_0\"/> <h>REGIONSVERMÖGEN</>.",
        "es_ES": "Son puntos en los límites de la zona jugable del mapa que se pueden convertir en destinos para el <h>COMERCIO</>. Representan el flujo de importación y exportación con tierras lejanas y las importaciones que traen cuestan 10 de <img id=\"ItemID_0\"/> <h>RIQUEZAS DE LA REGIÓN</> adicionales.",
        "fr_FR": "Il s’agit de lieux situés en bordure de la zone de jeu, vers lesquels vous pourrez ouvrir des routes pour le <h>COMMERCE</>. Ces lieux représentent les flux commerciaux provenant de contrées lointaines. Les importations qui passent par les maisons de commerce coûteront dix unités de <img id=\"ItemID_0\"/> <h>RICHESSE RÉGIONALE</> supplémentaires.",
        "pt_BR": "Pontos nas fronteiras da área jogável que podem se tornar destinos de <h>COMÉRCIO</>. Elas representam o fluxo de comércio com terras distantes, e importar itens através delas custa 10 moedas do  <h>PATRIMÔNIO REGIONAL</> adicionais.",
        "pl_PL": "Punkty przy krawędzi obszaru rozgrywki, które mogą pełnić rolę miejsc docelowych <h>HANDLU</>. Oznaczają miejsca wwozu i wywozu towarów, a importowanie dóbr za ich pośrednictwem kosztuje dodatkowe 10 jednostek <img id=\"ItemID_0\"/> <h>ZAMOŻNOŚCI REGIONU</>.",
        "ru_RU": "Точки на границах игровой зоны, позволяющие вести <h>ТОРГОВЛЮ</>. Они обозначают товарообмен с далекими странами, и товары, ввезенные через эти пункты, стоят на 10 мер <img id=\"ItemID_0\"/> <h>ДОСТАТКА</> больше.",
        "it_IT": "Punti situati sul bordo dell'area di gioco che possono diventare destinazioni di <h>COMMERCIO</>. Rappresentano le attività commerciali provenienti da terre lontane, e i prodotti importati che passano per questi punti costano 10 di <img id=\"ItemID_0\"/> <h>RICCHEZZA REGIONALE</> aggiuntiva.",
        "tr_TR": "Oynanabilir oyun alanının kenarındaki, bir <h>TİCARET</> varış noktası hâline gelebilecek noktalar. Uzaklardaki topraklardan gelen ve giden ticareti temsil ederler. Buralardan yapılan ithalat fazladan 10 <img id=\"ItemID_0\"/> <h>BÖLGESEL ZENGİNLİĞE</> mal olur.",
        "cs_CZ": "Místa na kraji hratelné oblasti, která se mohou stát cílem <h>OBCHODU</>. Představují obchod se vzdálenými zeměmi a dovezené zboží skrz ně stojí o 10 jednotek <img id=\"ItemID_0\"/> <h>BOHATSTVÍ REGIONU</> navíc.",
        "hu_HU": "A játszható játékterület szélén lévő pontok, amelyek a <h>KERESKEDELEM</> célpontjává válhatnak. Ezek olyan kereskedelmet jelképeznek, amely távoli országokkal folyik, és ezeken keresztül az import plusz 10 <img id=\"ItemID_0\"/> <h>REGIONÁLIS VAGYONBA</> kerül.",
        "uk_UA": "Пункти на межі ігрової зони, які можуть стати місцем призначення для <h>ТОРГІВЛІ</>. Вони показують торговий потік в далекі країни й назад, а вартість імпорту товарів через них становить додаткові 10 од. <img id=\"ItemID_0\"/> <h>ДОСТАТКУ РЕГІОНУ</>.",
        "da_DK": "Punkter på kanten af spilområdet, der kan blive en destination for <h>HANDEL</>. De repræsenterer handel, der flyder til og fra fjerne lande, og import gennem dem koster 10 <img id=\"ItemID_0\"/> <h>REGIONAL RIGDOM</> ekstra.",
        "nl_NL": "Punten aan de randen van het spelgebied die een bestemming voor <h>HANDEL</> kunnen worden. Ze staan voor handel met verre landen, en importproducten die hier langskomen kosten een extra 10 <img id=\"ItemID_0\"/> <h>LOKALE WELVAART</>.",
        "sv_SE": "Platser längs det spelbara områdets ytterkanter som kan bli destination för <h>HANDEL</>. De representerar handel från och till länder långt, långt borta och import via platserna kostar 10 extra i <img id=\"ItemID_0\"/> <h>REGIONALA RIKEDOMAR</>."
      }
    }
  }
]