#ifndef UE4SS_SDK_ALS_AnimBP_HPP
#define UE4SS_SDK_ALS_AnimBP_HPP

class UALS_AnimBP_C : public UAnimInstance
{
    FPointerToUberGraphFrame UberGraphFrame;                                          // 0x02C0 (size: 0x8)
    FAnimNode_ModifyBone AnimGraphNode_ModifyBone_12;                                 // 0x02C8 (size: 0x108)
    FAnimNode_TwoBoneIK AnimGraphNode_TwoBoneIK_1;                                    // 0x03D0 (size: 0x1E0)
    FAnimNode_TwoBoneIK AnimGraphNode_TwoBoneIK;                                      // 0x05B0 (size: 0x1E0)
    FAnimNode_ModifyBone AnimGraphNode_ModifyBone_11;                                 // 0x0790 (size: 0x108)
    FAnimNode_ModifyBone AnimGraphNode_ModifyBone_10;                                 // 0x0898 (size: 0x108)
    FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_3;     // 0x09A0 (size: 0x20)
    FAnimNode_ModifyBone AnimGraphNode_ModifyBone_9;                                  // 0x09C0 (size: 0x108)
    FAnimNode_ModifyBone AnimGraphNode_ModifyBone_8;                                  // 0x0AC8 (size: 0x108)
    FAnimNode_ModifyBone AnimGraphNode_ModifyBone_7;                                  // 0x0BD0 (size: 0x108)
    FAnimNode_Root AnimGraphNode_Root_8;                                              // 0x0CD8 (size: 0x30)
    FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose_16;                       // 0x0D08 (size: 0x118)
    FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose_15;                       // 0x0E20 (size: 0x118)
    FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose_14;                       // 0x0F38 (size: 0x118)
    FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose_13;                       // 0x1050 (size: 0x118)
    FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose_12;                       // 0x1168 (size: 0x118)
    FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose_11;                       // 0x1280 (size: 0x118)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_154;                    // 0x1398 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_153;                    // 0x13C0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_152;                    // 0x13E8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_151;                    // 0x1410 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_150;                    // 0x1438 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_149;                    // 0x1460 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_148;                    // 0x1488 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_147;                    // 0x14B0 (size: 0x28)
    FAnimNode_ModifyCurve AnimGraphNode_ModifyCurve_36;                               // 0x14D8 (size: 0x58)
    FAnimNode_MultiWayBlend AnimGraphNode_MultiWayBlend_42;                           // 0x1530 (size: 0x50)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_104;                          // 0x1580 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_103;                          // 0x15A8 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_102;                          // 0x15D0 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_101;                          // 0x15F8 (size: 0x28)
    FAnimNode_StateResult AnimGraphNode_StateResult_84;                               // 0x1620 (size: 0x30)
    FAnimNode_ModifyCurve AnimGraphNode_ModifyCurve_35;                               // 0x1650 (size: 0x58)
    FAnimNode_MultiWayBlend AnimGraphNode_MultiWayBlend_41;                           // 0x16A8 (size: 0x50)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_100;                          // 0x16F8 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_99;                           // 0x1720 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_98;                           // 0x1748 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_97;                           // 0x1770 (size: 0x28)
    FAnimNode_StateResult AnimGraphNode_StateResult_83;                               // 0x1798 (size: 0x30)
    FAnimNode_ModifyCurve AnimGraphNode_ModifyCurve_34;                               // 0x17C8 (size: 0x58)
    FAnimNode_MultiWayBlend AnimGraphNode_MultiWayBlend_40;                           // 0x1820 (size: 0x50)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_96;                           // 0x1870 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_95;                           // 0x1898 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_94;                           // 0x18C0 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_93;                           // 0x18E8 (size: 0x28)
    FAnimNode_StateResult AnimGraphNode_StateResult_82;                               // 0x1910 (size: 0x30)
    FAnimNode_ModifyCurve AnimGraphNode_ModifyCurve_33;                               // 0x1940 (size: 0x58)
    FAnimNode_MultiWayBlend AnimGraphNode_MultiWayBlend_39;                           // 0x1998 (size: 0x50)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_92;                           // 0x19E8 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_91;                           // 0x1A10 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_90;                           // 0x1A38 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_89;                           // 0x1A60 (size: 0x28)
    FAnimNode_StateResult AnimGraphNode_StateResult_81;                               // 0x1A88 (size: 0x30)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_88;                           // 0x1AB8 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_87;                           // 0x1AE0 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_86;                           // 0x1B08 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_85;                           // 0x1B30 (size: 0x28)
    FAnimNode_ModifyCurve AnimGraphNode_ModifyCurve_32;                               // 0x1B58 (size: 0x58)
    FAnimNode_MultiWayBlend AnimGraphNode_MultiWayBlend_38;                           // 0x1BB0 (size: 0x50)
    FAnimNode_StateResult AnimGraphNode_StateResult_80;                               // 0x1C00 (size: 0x30)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_84;                           // 0x1C30 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_83;                           // 0x1C58 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_82;                           // 0x1C80 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_81;                           // 0x1CA8 (size: 0x28)
    FAnimNode_ModifyCurve AnimGraphNode_ModifyCurve_31;                               // 0x1CD0 (size: 0x58)
    FAnimNode_MultiWayBlend AnimGraphNode_MultiWayBlend_37;                           // 0x1D28 (size: 0x50)
    FAnimNode_StateResult AnimGraphNode_StateResult_79;                               // 0x1D78 (size: 0x30)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_18;                             // 0x1DA8 (size: 0xB0)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_31;                         // 0x1E58 (size: 0x158)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_30;                         // 0x1FB0 (size: 0x158)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_29;                         // 0x2108 (size: 0x158)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_28;                         // 0x2260 (size: 0x158)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_27;                         // 0x23B8 (size: 0x158)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_26;                         // 0x2510 (size: 0x158)
    FAnimNode_Root AnimGraphNode_Root_7;                                              // 0x2668 (size: 0x30)
    FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose_10;                       // 0x2698 (size: 0x118)
    FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose_9;                        // 0x27B0 (size: 0x118)
    FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose_8;                        // 0x28C8 (size: 0x118)
    FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose_7;                        // 0x29E0 (size: 0x118)
    FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose_6;                        // 0x2AF8 (size: 0x118)
    FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose_5;                        // 0x2C10 (size: 0x118)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_146;                    // 0x2D28 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_145;                    // 0x2D50 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_144;                    // 0x2D78 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_143;                    // 0x2DA0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_142;                    // 0x2DC8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_141;                    // 0x2DF0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_140;                    // 0x2E18 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_139;                    // 0x2E40 (size: 0x28)
    FAnimNode_ModifyCurve AnimGraphNode_ModifyCurve_30;                               // 0x2E68 (size: 0x58)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_80;                           // 0x2EC0 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_79;                           // 0x2EE8 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_78;                           // 0x2F10 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_77;                           // 0x2F38 (size: 0x28)
    FAnimNode_MultiWayBlend AnimGraphNode_MultiWayBlend_36;                           // 0x2F60 (size: 0x50)
    FAnimNode_StateResult AnimGraphNode_StateResult_78;                               // 0x2FB0 (size: 0x30)
    FAnimNode_ModifyCurve AnimGraphNode_ModifyCurve_29;                               // 0x2FE0 (size: 0x58)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_76;                           // 0x3038 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_75;                           // 0x3060 (size: 0x28)
    FAnimNode_MultiWayBlend AnimGraphNode_MultiWayBlend_35;                           // 0x3088 (size: 0x50)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_74;                           // 0x30D8 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_73;                           // 0x3100 (size: 0x28)
    FAnimNode_StateResult AnimGraphNode_StateResult_77;                               // 0x3128 (size: 0x30)
    FAnimNode_ModifyCurve AnimGraphNode_ModifyCurve_28;                               // 0x3158 (size: 0x58)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_72;                           // 0x31B0 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_71;                           // 0x31D8 (size: 0x28)
    FAnimNode_MultiWayBlend AnimGraphNode_MultiWayBlend_34;                           // 0x3200 (size: 0x50)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_70;                           // 0x3250 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_69;                           // 0x3278 (size: 0x28)
    FAnimNode_StateResult AnimGraphNode_StateResult_76;                               // 0x32A0 (size: 0x30)
    FAnimNode_ModifyCurve AnimGraphNode_ModifyCurve_27;                               // 0x32D0 (size: 0x58)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_68;                           // 0x3328 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_67;                           // 0x3350 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_66;                           // 0x3378 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_65;                           // 0x33A0 (size: 0x28)
    FAnimNode_MultiWayBlend AnimGraphNode_MultiWayBlend_33;                           // 0x33C8 (size: 0x50)
    FAnimNode_StateResult AnimGraphNode_StateResult_75;                               // 0x3418 (size: 0x30)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_64;                           // 0x3448 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_63;                           // 0x3470 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_62;                           // 0x3498 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_61;                           // 0x34C0 (size: 0x28)
    FAnimNode_ModifyCurve AnimGraphNode_ModifyCurve_26;                               // 0x34E8 (size: 0x58)
    FAnimNode_MultiWayBlend AnimGraphNode_MultiWayBlend_32;                           // 0x3540 (size: 0x50)
    FAnimNode_StateResult AnimGraphNode_StateResult_74;                               // 0x3590 (size: 0x30)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_60;                           // 0x35C0 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_59;                           // 0x35E8 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_58;                           // 0x3610 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_57;                           // 0x3638 (size: 0x28)
    FAnimNode_ModifyCurve AnimGraphNode_ModifyCurve_25;                               // 0x3660 (size: 0x58)
    FAnimNode_MultiWayBlend AnimGraphNode_MultiWayBlend_31;                           // 0x36B8 (size: 0x50)
    FAnimNode_StateResult AnimGraphNode_StateResult_73;                               // 0x3708 (size: 0x30)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_17;                             // 0x3738 (size: 0xB0)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_25;                         // 0x37E8 (size: 0x158)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_24;                         // 0x3940 (size: 0x158)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_23;                         // 0x3A98 (size: 0x158)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_22;                         // 0x3BF0 (size: 0x158)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_21;                         // 0x3D48 (size: 0x158)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_20;                         // 0x3EA0 (size: 0x158)
    FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose_4;                        // 0x3FF8 (size: 0x118)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_19;                         // 0x4110 (size: 0x158)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_18;                         // 0x4268 (size: 0x158)
    FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_6;                        // 0x43C0 (size: 0xB0)
    FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_62;                               // 0x4470 (size: 0xC8)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_56;                           // 0x4538 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_55;                           // 0x4560 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_54;                           // 0x4588 (size: 0x28)
    FAnimNode_Root AnimGraphNode_Root_6;                                              // 0x45B0 (size: 0x30)
    FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose_3;                        // 0x45E0 (size: 0x118)
    FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose_2;                        // 0x46F8 (size: 0x118)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_17;                         // 0x4810 (size: 0x158)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_16;                         // 0x4968 (size: 0x158)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_15;                         // 0x4AC0 (size: 0x158)
    FAnimNode_MakeDynamicAdditive AnimGraphNode_MakeDynamicAdditive_1;                // 0x4C18 (size: 0x38)
    FAnimNode_MakeDynamicAdditive AnimGraphNode_MakeDynamicAdditive;                  // 0x4C50 (size: 0x38)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_14;                         // 0x4C88 (size: 0x158)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_13;                         // 0x4DE0 (size: 0x158)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_53;                           // 0x4F38 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_52;                           // 0x4F60 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_51;                           // 0x4F88 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_50;                           // 0x4FB0 (size: 0x28)
    FAnimNode_ApplyMeshSpaceAdditive AnimGraphNode_ApplyMeshSpaceAdditive_17;         // 0x4FD8 (size: 0xD0)
    FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_61;                               // 0x50A8 (size: 0xC8)
    FAnimNode_Slot AnimGraphNode_Slot_10;                                             // 0x5170 (size: 0x48)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_12;                         // 0x51B8 (size: 0x158)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_49;                           // 0x5310 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_48;                           // 0x5338 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_47;                           // 0x5360 (size: 0x28)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_12;                     // 0x5388 (size: 0xC0)
    FAnimNode_ApplyMeshSpaceAdditive AnimGraphNode_ApplyMeshSpaceAdditive_16;         // 0x5448 (size: 0xD0)
    FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_60;                               // 0x5518 (size: 0xC8)
    FAnimNode_Slot AnimGraphNode_Slot_9;                                              // 0x55E0 (size: 0x48)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_46;                           // 0x5628 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_45;                           // 0x5650 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_44;                           // 0x5678 (size: 0x28)
    FAnimNode_ApplyMeshSpaceAdditive AnimGraphNode_ApplyMeshSpaceAdditive_15;         // 0x56A0 (size: 0xD0)
    FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_59;                               // 0x5770 (size: 0xC8)
    FAnimNode_Slot AnimGraphNode_Slot_8;                                              // 0x5838 (size: 0x48)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_43;                           // 0x5880 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_42;                           // 0x58A8 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_41;                           // 0x58D0 (size: 0x28)
    FAnimNode_ApplyMeshSpaceAdditive AnimGraphNode_ApplyMeshSpaceAdditive_14;         // 0x58F8 (size: 0xD0)
    FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_58;                               // 0x59C8 (size: 0xC8)
    FAnimNode_Slot AnimGraphNode_Slot_7;                                              // 0x5A90 (size: 0x48)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_40;                           // 0x5AD8 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_39;                           // 0x5B00 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_38;                           // 0x5B28 (size: 0x28)
    FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_57;                               // 0x5B50 (size: 0xC8)
    FAnimNode_Slot AnimGraphNode_Slot_6;                                              // 0x5C18 (size: 0x48)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_37;                           // 0x5C60 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_36;                           // 0x5C88 (size: 0x28)
    FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_56;                               // 0x5CB0 (size: 0xC8)
    FAnimNode_Slot AnimGraphNode_Slot_5;                                              // 0x5D78 (size: 0x48)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_35;                           // 0x5DC0 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_34;                           // 0x5DE8 (size: 0x28)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_11;                         // 0x5E10 (size: 0x158)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_10;                         // 0x5F68 (size: 0x158)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_9;                          // 0x60C0 (size: 0x158)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_8;                          // 0x6218 (size: 0x158)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_7;                          // 0x6370 (size: 0x158)
    FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose_1;                        // 0x64C8 (size: 0x118)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_33;                           // 0x65E0 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_32;                           // 0x6608 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_31;                           // 0x6630 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_30;                           // 0x6658 (size: 0x28)
    FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_32;                           // 0x6680 (size: 0xC8)
    FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_31;                           // 0x6748 (size: 0xC8)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_11;                     // 0x6810 (size: 0xC0)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_10;                     // 0x68D0 (size: 0xC0)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_9;                      // 0x6990 (size: 0xC0)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_29;                           // 0x6A50 (size: 0x28)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_8;                      // 0x6A78 (size: 0xC0)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_7;                      // 0x6B38 (size: 0xC0)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_28;                           // 0x6BF8 (size: 0x28)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_6;                      // 0x6C20 (size: 0xC0)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_5;                      // 0x6CE0 (size: 0xC0)
    FAnimNode_Slot AnimGraphNode_Slot_4;                                              // 0x6DA0 (size: 0x48)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_4;                      // 0x6DE8 (size: 0xC0)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_27;                           // 0x6EA8 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_26;                           // 0x6ED0 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_25;                           // 0x6EF8 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_24;                           // 0x6F20 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_23;                           // 0x6F48 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_22;                           // 0x6F70 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_21;                           // 0x6F98 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_20;                           // 0x6FC0 (size: 0x28)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_3;                      // 0x6FE8 (size: 0xC0)
    FAnimNode_Root AnimGraphNode_Root_5;                                              // 0x70A8 (size: 0x30)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_147;                  // 0x70D8 (size: 0x50)
    FAnimNode_MultiWayBlend AnimGraphNode_MultiWayBlend_30;                           // 0x7128 (size: 0x50)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_146;                  // 0x7178 (size: 0x50)
    FAnimNode_Root AnimGraphNode_Root_4;                                              // 0x71C8 (size: 0x30)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_138;                    // 0x71F8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_137;                    // 0x7220 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_136;                    // 0x7248 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_135;                    // 0x7270 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_134;                    // 0x7298 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_133;                    // 0x72C0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_132;                    // 0x72E8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_131;                    // 0x7310 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_130;                    // 0x7338 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_129;                    // 0x7360 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_128;                    // 0x7388 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_127;                    // 0x73B0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_126;                    // 0x73D8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_125;                    // 0x7400 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_124;                    // 0x7428 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_123;                    // 0x7450 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_122;                    // 0x7478 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_121;                    // 0x74A0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_120;                    // 0x74C8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_119;                    // 0x74F0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_118;                    // 0x7518 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_117;                    // 0x7540 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_116;                    // 0x7568 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_115;                    // 0x7590 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_114;                    // 0x75B8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_113;                    // 0x75E0 (size: 0x28)
    FAnimNode_BlendListByInt AnimGraphNode_BlendListByInt_6;                          // 0x7608 (size: 0xA0)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_145;                  // 0x76A8 (size: 0x50)
    FAnimNode_ModifyCurve AnimGraphNode_ModifyCurve_24;                               // 0x76F8 (size: 0x58)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_144;                  // 0x7750 (size: 0x50)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_143;                  // 0x77A0 (size: 0x50)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_112;                    // 0x77F0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_111;                    // 0x7818 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_110;                    // 0x7840 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_109;                    // 0x7868 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_108;                    // 0x7890 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_107;                    // 0x78B8 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_68;                         // 0x78E0 (size: 0x80)
    FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_30;                           // 0x7960 (size: 0xC8)
    FAnimNode_MultiWayBlend AnimGraphNode_MultiWayBlend_29;                           // 0x7A28 (size: 0x50)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_142;                  // 0x7A78 (size: 0x50)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_141;                  // 0x7AC8 (size: 0x50)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_140;                  // 0x7B18 (size: 0x50)
    FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_55;                               // 0x7B68 (size: 0xC8)
    FAnimNode_StateResult AnimGraphNode_StateResult_72;                               // 0x7C30 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_67;                         // 0x7C60 (size: 0x80)
    FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_29;                           // 0x7CE0 (size: 0xC8)
    FAnimNode_MultiWayBlend AnimGraphNode_MultiWayBlend_28;                           // 0x7DA8 (size: 0x50)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_139;                  // 0x7DF8 (size: 0x50)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_138;                  // 0x7E48 (size: 0x50)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_137;                  // 0x7E98 (size: 0x50)
    FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_54;                               // 0x7EE8 (size: 0xC8)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_136;                  // 0x7FB0 (size: 0x50)
    FAnimNode_ApplyMeshSpaceAdditive AnimGraphNode_ApplyMeshSpaceAdditive_13;         // 0x8000 (size: 0xD0)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_135;                  // 0x80D0 (size: 0x50)
    FAnimNode_ApplyMeshSpaceAdditive AnimGraphNode_ApplyMeshSpaceAdditive_12;         // 0x8120 (size: 0xD0)
    FAnimNode_StateResult AnimGraphNode_StateResult_71;                               // 0x81F0 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_66;                         // 0x8220 (size: 0x80)
    FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_28;                           // 0x82A0 (size: 0xC8)
    FAnimNode_MultiWayBlend AnimGraphNode_MultiWayBlend_27;                           // 0x8368 (size: 0x50)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_134;                  // 0x83B8 (size: 0x50)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_133;                  // 0x8408 (size: 0x50)
    FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_53;                               // 0x8458 (size: 0xC8)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_132;                  // 0x8520 (size: 0x50)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_131;                  // 0x8570 (size: 0x50)
    FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_52;                               // 0x85C0 (size: 0xC8)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_130;                  // 0x8688 (size: 0x50)
    FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_51;                               // 0x86D8 (size: 0xC8)
    FAnimNode_StateResult AnimGraphNode_StateResult_70;                               // 0x87A0 (size: 0x30)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_16;                             // 0x87D0 (size: 0xB0)
    FAnimNode_StateResult AnimGraphNode_StateResult_69;                               // 0x8880 (size: 0x30)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_129;                  // 0x88B0 (size: 0x50)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_128;                  // 0x8900 (size: 0x50)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_127;                  // 0x8950 (size: 0x50)
    FAnimNode_BlendListByInt AnimGraphNode_BlendListByInt_5;                          // 0x89A0 (size: 0xA0)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_106;                    // 0x8A40 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_105;                    // 0x8A68 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_104;                    // 0x8A90 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_103;                    // 0x8AB8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_102;                    // 0x8AE0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_101;                    // 0x8B08 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_65;                         // 0x8B30 (size: 0x80)
    FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_27;                           // 0x8BB0 (size: 0xC8)
    FAnimNode_MultiWayBlend AnimGraphNode_MultiWayBlend_26;                           // 0x8C78 (size: 0x50)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_126;                  // 0x8CC8 (size: 0x50)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_125;                  // 0x8D18 (size: 0x50)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_124;                  // 0x8D68 (size: 0x50)
    FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_50;                               // 0x8DB8 (size: 0xC8)
    FAnimNode_StateResult AnimGraphNode_StateResult_68;                               // 0x8E80 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_64;                         // 0x8EB0 (size: 0x80)
    FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_26;                           // 0x8F30 (size: 0xC8)
    FAnimNode_MultiWayBlend AnimGraphNode_MultiWayBlend_25;                           // 0x8FF8 (size: 0x50)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_123;                  // 0x9048 (size: 0x50)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_122;                  // 0x9098 (size: 0x50)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_121;                  // 0x90E8 (size: 0x50)
    FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_49;                               // 0x9138 (size: 0xC8)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_120;                  // 0x9200 (size: 0x50)
    FAnimNode_ApplyMeshSpaceAdditive AnimGraphNode_ApplyMeshSpaceAdditive_11;         // 0x9250 (size: 0xD0)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_119;                  // 0x9320 (size: 0x50)
    FAnimNode_ApplyMeshSpaceAdditive AnimGraphNode_ApplyMeshSpaceAdditive_10;         // 0x9370 (size: 0xD0)
    FAnimNode_StateResult AnimGraphNode_StateResult_67;                               // 0x9440 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_63;                         // 0x9470 (size: 0x80)
    FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_25;                           // 0x94F0 (size: 0xC8)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_118;                  // 0x95B8 (size: 0x50)
    FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_48;                               // 0x9608 (size: 0xC8)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_117;                  // 0x96D0 (size: 0x50)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_116;                  // 0x9720 (size: 0x50)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_115;                  // 0x9770 (size: 0x50)
    FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_47;                               // 0x97C0 (size: 0xC8)
    FAnimNode_MultiWayBlend AnimGraphNode_MultiWayBlend_24;                           // 0x9888 (size: 0x50)
    FAnimNode_StateResult AnimGraphNode_StateResult_66;                               // 0x98D8 (size: 0x30)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_15;                             // 0x9908 (size: 0xB0)
    FAnimNode_StateResult AnimGraphNode_StateResult_65;                               // 0x99B8 (size: 0x30)
    FAnimNode_BlendListByInt AnimGraphNode_BlendListByInt_4;                          // 0x99E8 (size: 0xA0)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_114;                  // 0x9A88 (size: 0x50)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_113;                  // 0x9AD8 (size: 0x50)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_112;                  // 0x9B28 (size: 0x50)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_100;                    // 0x9B78 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_99;                     // 0x9BA0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_98;                     // 0x9BC8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_97;                     // 0x9BF0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_96;                     // 0x9C18 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_95;                     // 0x9C40 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_62;                         // 0x9C68 (size: 0x80)
    FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_24;                           // 0x9CE8 (size: 0xC8)
    FAnimNode_MultiWayBlend AnimGraphNode_MultiWayBlend_23;                           // 0x9DB0 (size: 0x50)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_111;                  // 0x9E00 (size: 0x50)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_110;                  // 0x9E50 (size: 0x50)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_109;                  // 0x9EA0 (size: 0x50)
    FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_46;                               // 0x9EF0 (size: 0xC8)
    FAnimNode_StateResult AnimGraphNode_StateResult_64;                               // 0x9FB8 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_61;                         // 0x9FE8 (size: 0x80)
    FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_23;                           // 0xA068 (size: 0xC8)
    FAnimNode_MultiWayBlend AnimGraphNode_MultiWayBlend_22;                           // 0xA130 (size: 0x50)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_108;                  // 0xA180 (size: 0x50)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_107;                  // 0xA1D0 (size: 0x50)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_106;                  // 0xA220 (size: 0x50)
    FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_45;                               // 0xA270 (size: 0xC8)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_105;                  // 0xA338 (size: 0x50)
    FAnimNode_ApplyMeshSpaceAdditive AnimGraphNode_ApplyMeshSpaceAdditive_9;          // 0xA388 (size: 0xD0)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_104;                  // 0xA458 (size: 0x50)
    FAnimNode_ApplyMeshSpaceAdditive AnimGraphNode_ApplyMeshSpaceAdditive_8;          // 0xA4A8 (size: 0xD0)
    FAnimNode_StateResult AnimGraphNode_StateResult_63;                               // 0xA578 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_60;                         // 0xA5A8 (size: 0x80)
    FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_22;                           // 0xA628 (size: 0xC8)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_103;                  // 0xA6F0 (size: 0x50)
    FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_44;                               // 0xA740 (size: 0xC8)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_102;                  // 0xA808 (size: 0x50)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_101;                  // 0xA858 (size: 0x50)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_100;                  // 0xA8A8 (size: 0x50)
    FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_43;                               // 0xA8F8 (size: 0xC8)
    FAnimNode_MultiWayBlend AnimGraphNode_MultiWayBlend_21;                           // 0xA9C0 (size: 0x50)
    FAnimNode_StateResult AnimGraphNode_StateResult_62;                               // 0xAA10 (size: 0x30)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_14;                             // 0xAA40 (size: 0xB0)
    FAnimNode_StateResult AnimGraphNode_StateResult_61;                               // 0xAAF0 (size: 0x30)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_99;                   // 0xAB20 (size: 0x50)
    FAnimNode_ModifyCurve AnimGraphNode_ModifyCurve_23;                               // 0xAB70 (size: 0x58)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_98;                   // 0xABC8 (size: 0x50)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_97;                   // 0xAC18 (size: 0x50)
    FAnimNode_BlendListByInt AnimGraphNode_BlendListByInt_3;                          // 0xAC68 (size: 0xA0)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_94;                     // 0xAD08 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_93;                     // 0xAD30 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_92;                     // 0xAD58 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_91;                     // 0xAD80 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_90;                     // 0xADA8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_89;                     // 0xADD0 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_59;                         // 0xADF8 (size: 0x80)
    FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_21;                           // 0xAE78 (size: 0xC8)
    FAnimNode_MultiWayBlend AnimGraphNode_MultiWayBlend_20;                           // 0xAF40 (size: 0x50)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_96;                   // 0xAF90 (size: 0x50)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_95;                   // 0xAFE0 (size: 0x50)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_94;                   // 0xB030 (size: 0x50)
    FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_42;                               // 0xB080 (size: 0xC8)
    FAnimNode_StateResult AnimGraphNode_StateResult_60;                               // 0xB148 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_58;                         // 0xB178 (size: 0x80)
    FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_20;                           // 0xB1F8 (size: 0xC8)
    FAnimNode_MultiWayBlend AnimGraphNode_MultiWayBlend_19;                           // 0xB2C0 (size: 0x50)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_93;                   // 0xB310 (size: 0x50)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_92;                   // 0xB360 (size: 0x50)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_91;                   // 0xB3B0 (size: 0x50)
    FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_41;                               // 0xB400 (size: 0xC8)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_90;                   // 0xB4C8 (size: 0x50)
    FAnimNode_ApplyMeshSpaceAdditive AnimGraphNode_ApplyMeshSpaceAdditive_7;          // 0xB518 (size: 0xD0)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_89;                   // 0xB5E8 (size: 0x50)
    FAnimNode_ApplyMeshSpaceAdditive AnimGraphNode_ApplyMeshSpaceAdditive_6;          // 0xB638 (size: 0xD0)
    FAnimNode_StateResult AnimGraphNode_StateResult_59;                               // 0xB708 (size: 0x30)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_88;                   // 0xB738 (size: 0x50)
    FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_40;                               // 0xB788 (size: 0xC8)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_87;                   // 0xB850 (size: 0x50)
    FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_39;                               // 0xB8A0 (size: 0xC8)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_57;                         // 0xB968 (size: 0x80)
    FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_19;                           // 0xB9E8 (size: 0xC8)
    FAnimNode_MultiWayBlend AnimGraphNode_MultiWayBlend_18;                           // 0xBAB0 (size: 0x50)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_86;                   // 0xBB00 (size: 0x50)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_85;                   // 0xBB50 (size: 0x50)
    FAnimNode_MultiWayBlend AnimGraphNode_MultiWayBlend_17;                           // 0xBBA0 (size: 0x50)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_56;                         // 0xBBF0 (size: 0x80)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_55;                         // 0xBC70 (size: 0x80)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_54;                         // 0xBCF0 (size: 0x80)
    FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_38;                               // 0xBD70 (size: 0xC8)
    FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_37;                               // 0xBE38 (size: 0xC8)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_84;                   // 0xBF00 (size: 0x50)
    FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_36;                               // 0xBF50 (size: 0xC8)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_83;                   // 0xC018 (size: 0x50)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_82;                   // 0xC068 (size: 0x50)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_81;                   // 0xC0B8 (size: 0x50)
    FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_35;                               // 0xC108 (size: 0xC8)
    FAnimNode_StateResult AnimGraphNode_StateResult_58;                               // 0xC1D0 (size: 0x30)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_13;                             // 0xC200 (size: 0xB0)
    FAnimNode_StateResult AnimGraphNode_StateResult_57;                               // 0xC2B0 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_53;                         // 0xC2E0 (size: 0x80)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_80;                   // 0xC360 (size: 0x50)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_79;                   // 0xC3B0 (size: 0x50)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_78;                   // 0xC400 (size: 0x50)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_77;                   // 0xC450 (size: 0x50)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_76;                   // 0xC4A0 (size: 0x50)
    FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_34;                               // 0xC4F0 (size: 0xC8)
    FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_33;                               // 0xC5B8 (size: 0xC8)
    FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_32;                               // 0xC680 (size: 0xC8)
    FAnimNode_MultiWayBlend AnimGraphNode_MultiWayBlend_16;                           // 0xC748 (size: 0x50)
    FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_18;                           // 0xC798 (size: 0xC8)
    FAnimNode_StateResult AnimGraphNode_StateResult_56;                               // 0xC860 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_52;                         // 0xC890 (size: 0x80)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_75;                   // 0xC910 (size: 0x50)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_74;                   // 0xC960 (size: 0x50)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_73;                   // 0xC9B0 (size: 0x50)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_72;                   // 0xCA00 (size: 0x50)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_71;                   // 0xCA50 (size: 0x50)
    FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_31;                               // 0xCAA0 (size: 0xC8)
    FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_30;                               // 0xCB68 (size: 0xC8)
    FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_29;                               // 0xCC30 (size: 0xC8)
    FAnimNode_MultiWayBlend AnimGraphNode_MultiWayBlend_15;                           // 0xCCF8 (size: 0x50)
    FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_17;                           // 0xCD48 (size: 0xC8)
    FAnimNode_StateResult AnimGraphNode_StateResult_55;                               // 0xCE10 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_51;                         // 0xCE40 (size: 0x80)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_70;                   // 0xCEC0 (size: 0x50)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_69;                   // 0xCF10 (size: 0x50)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_68;                   // 0xCF60 (size: 0x50)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_67;                   // 0xCFB0 (size: 0x50)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_66;                   // 0xD000 (size: 0x50)
    FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_28;                               // 0xD050 (size: 0xC8)
    FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_27;                               // 0xD118 (size: 0xC8)
    FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_26;                               // 0xD1E0 (size: 0xC8)
    FAnimNode_MultiWayBlend AnimGraphNode_MultiWayBlend_14;                           // 0xD2A8 (size: 0x50)
    FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_16;                           // 0xD2F8 (size: 0xC8)
    FAnimNode_StateResult AnimGraphNode_StateResult_54;                               // 0xD3C0 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_50;                         // 0xD3F0 (size: 0x80)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_65;                   // 0xD470 (size: 0x50)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_64;                   // 0xD4C0 (size: 0x50)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_63;                   // 0xD510 (size: 0x50)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_62;                   // 0xD560 (size: 0x50)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_61;                   // 0xD5B0 (size: 0x50)
    FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_25;                               // 0xD600 (size: 0xC8)
    FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_24;                               // 0xD6C8 (size: 0xC8)
    FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_23;                               // 0xD790 (size: 0xC8)
    FAnimNode_MultiWayBlend AnimGraphNode_MultiWayBlend_13;                           // 0xD858 (size: 0x50)
    FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_15;                           // 0xD8A8 (size: 0xC8)
    FAnimNode_StateResult AnimGraphNode_StateResult_53;                               // 0xD970 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_49;                         // 0xD9A0 (size: 0x80)
    FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_14;                           // 0xDA20 (size: 0xC8)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_60;                   // 0xDAE8 (size: 0x50)
    FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_22;                               // 0xDB38 (size: 0xC8)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_59;                   // 0xDC00 (size: 0x50)
    FAnimNode_MultiWayBlend AnimGraphNode_MultiWayBlend_12;                           // 0xDC50 (size: 0x50)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_58;                   // 0xDCA0 (size: 0x50)
    FAnimNode_StateResult AnimGraphNode_StateResult_52;                               // 0xDCF0 (size: 0x30)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_57;                   // 0xDD20 (size: 0x50)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_56;                   // 0xDD70 (size: 0x50)
    FAnimNode_ModifyCurve AnimGraphNode_ModifyCurve_22;                               // 0xDDC0 (size: 0x58)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_55;                   // 0xDE18 (size: 0x50)
    FAnimNode_BlendListByInt AnimGraphNode_BlendListByInt_2;                          // 0xDE68 (size: 0xA0)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_48;                         // 0xDF08 (size: 0x80)
    FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_13;                           // 0xDF88 (size: 0xC8)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_54;                   // 0xE050 (size: 0x50)
    FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_21;                               // 0xE0A0 (size: 0xC8)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_53;                   // 0xE168 (size: 0x50)
    FAnimNode_MultiWayBlend AnimGraphNode_MultiWayBlend_11;                           // 0xE1B8 (size: 0x50)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_52;                   // 0xE208 (size: 0x50)
    FAnimNode_StateResult AnimGraphNode_StateResult_51;                               // 0xE258 (size: 0x30)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_51;                   // 0xE288 (size: 0x50)
    FAnimNode_ModifyCurve AnimGraphNode_ModifyCurve_21;                               // 0xE2D8 (size: 0x58)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_50;                   // 0xE330 (size: 0x50)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_49;                   // 0xE380 (size: 0x50)
    FAnimNode_BlendListByInt AnimGraphNode_BlendListByInt_1;                          // 0xE3D0 (size: 0xA0)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_48;                   // 0xE470 (size: 0x50)
    FAnimNode_ApplyMeshSpaceAdditive AnimGraphNode_ApplyMeshSpaceAdditive_5;          // 0xE4C0 (size: 0xD0)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_47;                   // 0xE590 (size: 0x50)
    FAnimNode_ApplyMeshSpaceAdditive AnimGraphNode_ApplyMeshSpaceAdditive_4;          // 0xE5E0 (size: 0xD0)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_47;                         // 0xE6B0 (size: 0x80)
    FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_12;                           // 0xE730 (size: 0xC8)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_46;                   // 0xE7F8 (size: 0x50)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_45;                   // 0xE848 (size: 0x50)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_44;                   // 0xE898 (size: 0x50)
    FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_20;                               // 0xE8E8 (size: 0xC8)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_43;                   // 0xE9B0 (size: 0x50)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_42;                   // 0xEA00 (size: 0x50)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_41;                   // 0xEA50 (size: 0x50)
    FAnimNode_MultiWayBlend AnimGraphNode_MultiWayBlend_10;                           // 0xEAA0 (size: 0x50)
    FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_5;                        // 0xEAF0 (size: 0xB0)
    FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_19;                               // 0xEBA0 (size: 0xC8)
    FAnimNode_MultiWayBlend AnimGraphNode_MultiWayBlend_9;                            // 0xEC68 (size: 0x50)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_46;                         // 0xECB8 (size: 0x80)
    FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_11;                           // 0xED38 (size: 0xC8)
    FAnimNode_StateResult AnimGraphNode_StateResult_50;                               // 0xEE00 (size: 0x30)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_40;                   // 0xEE30 (size: 0x50)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_39;                   // 0xEE80 (size: 0x50)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_38;                   // 0xEED0 (size: 0x50)
    FAnimNode_BlendListByInt AnimGraphNode_BlendListByInt;                            // 0xEF20 (size: 0xA0)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_37;                   // 0xEFC0 (size: 0x50)
    FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_18;                               // 0xF010 (size: 0xC8)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_36;                   // 0xF0D8 (size: 0x50)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_35;                   // 0xF128 (size: 0x50)
    FAnimNode_ApplyMeshSpaceAdditive AnimGraphNode_ApplyMeshSpaceAdditive_3;          // 0xF178 (size: 0xD0)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_34;                   // 0xF248 (size: 0x50)
    FAnimNode_ApplyMeshSpaceAdditive AnimGraphNode_ApplyMeshSpaceAdditive_2;          // 0xF298 (size: 0xD0)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_45;                         // 0xF368 (size: 0x80)
    FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_10;                           // 0xF3E8 (size: 0xC8)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_33;                   // 0xF4B0 (size: 0x50)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_32;                   // 0xF500 (size: 0x50)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_31;                   // 0xF550 (size: 0x50)
    FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_17;                               // 0xF5A0 (size: 0xC8)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_30;                   // 0xF668 (size: 0x50)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_29;                   // 0xF6B8 (size: 0x50)
    FAnimNode_MultiWayBlend AnimGraphNode_MultiWayBlend_8;                            // 0xF708 (size: 0x50)
    FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_4;                        // 0xF758 (size: 0xB0)
    FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_16;                               // 0xF808 (size: 0xC8)
    FAnimNode_MultiWayBlend AnimGraphNode_MultiWayBlend_7;                            // 0xF8D0 (size: 0x50)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_44;                         // 0xF920 (size: 0x80)
    FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_9;                            // 0xF9A0 (size: 0xC8)
    FAnimNode_StateResult AnimGraphNode_StateResult_49;                               // 0xFA68 (size: 0x30)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_88;                     // 0xFA98 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_43;                         // 0xFAC0 (size: 0x80)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_28;                   // 0xFB40 (size: 0x50)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_27;                   // 0xFB90 (size: 0x50)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_26;                   // 0xFBE0 (size: 0x50)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_25;                   // 0xFC30 (size: 0x50)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_24;                   // 0xFC80 (size: 0x50)
    FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_15;                               // 0xFCD0 (size: 0xC8)
    FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_14;                               // 0xFD98 (size: 0xC8)
    FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_13;                               // 0xFE60 (size: 0xC8)
    FAnimNode_MultiWayBlend AnimGraphNode_MultiWayBlend_6;                            // 0xFF28 (size: 0x50)
    FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_8;                            // 0xFF78 (size: 0xC8)
    FAnimNode_StateResult AnimGraphNode_StateResult_48;                               // 0x10040 (size: 0x30)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_12;                             // 0x10070 (size: 0xB0)
    FAnimNode_Inertialization AnimGraphNode_Inertialization_1;                        // 0x10120 (size: 0x70)
    FAnimNode_Root AnimGraphNode_Root_3;                                              // 0x10190 (size: 0x30)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_87;                     // 0x101C0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_86;                     // 0x101E8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_85;                     // 0x10210 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_84;                     // 0x10238 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_83;                     // 0x10260 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_82;                     // 0x10288 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_81;                     // 0x102B0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_80;                     // 0x102D8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_79;                     // 0x10300 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_78;                     // 0x10328 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_77;                     // 0x10350 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_76;                     // 0x10378 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_75;                     // 0x103A0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_74;                     // 0x103C8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_73;                     // 0x103F0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_72;                     // 0x10418 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_71;                     // 0x10440 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_70;                     // 0x10468 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_19;                           // 0x10490 (size: 0x28)
    FAnimNode_ModifyCurve AnimGraphNode_ModifyCurve_20;                               // 0x104B8 (size: 0x58)
    FAnimNode_ApplyMeshSpaceAdditive AnimGraphNode_ApplyMeshSpaceAdditive_1;          // 0x10510 (size: 0xD0)
    FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_12;                               // 0x105E0 (size: 0xC8)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_42;                         // 0x106A8 (size: 0x80)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_41;                         // 0x10728 (size: 0x80)
    FAnimNode_StateResult AnimGraphNode_StateResult_47;                               // 0x107A8 (size: 0x30)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_69;                     // 0x107D8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_68;                     // 0x10800 (size: 0x28)
    FAnimNode_ModifyCurve AnimGraphNode_ModifyCurve_19;                               // 0x10828 (size: 0x58)
    FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_11;                               // 0x10880 (size: 0xC8)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_40;                         // 0x10948 (size: 0x80)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_39;                         // 0x109C8 (size: 0x80)
    FAnimNode_StateResult AnimGraphNode_StateResult_46;                               // 0x10A48 (size: 0x30)
    FAnimNode_ModifyCurve AnimGraphNode_ModifyCurve_18;                               // 0x10A78 (size: 0x58)
    FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_10;                               // 0x10AD0 (size: 0xC8)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_23;                   // 0x10B98 (size: 0x50)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_22;                   // 0x10BE8 (size: 0x50)
    FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_9;                                // 0x10C38 (size: 0xC8)
    FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_7;                            // 0x10D00 (size: 0xC8)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_9;                      // 0x10DC8 (size: 0xE8)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_67;                     // 0x10EB0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_66;                     // 0x10ED8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_65;                     // 0x10F00 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_64;                     // 0x10F28 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_63;                     // 0x10F50 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_38;                         // 0x10F78 (size: 0x80)
    FAnimNode_StateResult AnimGraphNode_StateResult_45;                               // 0x10FF8 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_37;                         // 0x11028 (size: 0x80)
    FAnimNode_StateResult AnimGraphNode_StateResult_44;                               // 0x110A8 (size: 0x30)
    FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_8;                                // 0x110D8 (size: 0xC8)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_36;                         // 0x111A0 (size: 0x80)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_35;                         // 0x11220 (size: 0x80)
    FAnimNode_StateResult AnimGraphNode_StateResult_43;                               // 0x112A0 (size: 0x30)
    FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_7;                                // 0x112D0 (size: 0xC8)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_34;                         // 0x11398 (size: 0x80)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_33;                         // 0x11418 (size: 0x80)
    FAnimNode_StateResult AnimGraphNode_StateResult_42;                               // 0x11498 (size: 0x30)
    FAnimNode_StateResult AnimGraphNode_StateResult_41;                               // 0x114C8 (size: 0x30)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_11;                             // 0x114F8 (size: 0xB0)
    FAnimNode_StateResult AnimGraphNode_StateResult_40;                               // 0x115A8 (size: 0x30)
    FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_6;                            // 0x115D8 (size: 0xC8)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_8;                      // 0x116A0 (size: 0xE8)
    FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_6;                                // 0x11788 (size: 0xC8)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_21;                   // 0x11850 (size: 0x50)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_20;                   // 0x118A0 (size: 0x50)
    FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_5;                                // 0x118F0 (size: 0xC8)
    FAnimNode_ModifyCurve AnimGraphNode_ModifyCurve_17;                               // 0x119B8 (size: 0x58)
    FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_4;                                // 0x11A10 (size: 0xC8)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_32;                         // 0x11AD8 (size: 0x80)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_31;                         // 0x11B58 (size: 0x80)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_30;                         // 0x11BD8 (size: 0x80)
    FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_3;                                // 0x11C58 (size: 0xC8)
    FAnimNode_StateResult AnimGraphNode_StateResult_39;                               // 0x11D20 (size: 0x30)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_18;                           // 0x11D50 (size: 0x28)
    FAnimNode_ModifyCurve AnimGraphNode_ModifyCurve_16;                               // 0x11D78 (size: 0x58)
    FAnimNode_StateResult AnimGraphNode_StateResult_38;                               // 0x11DD0 (size: 0x30)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_10;                             // 0x11E00 (size: 0xB0)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_62;                     // 0x11EB0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_61;                     // 0x11ED8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_60;                     // 0x11F00 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_59;                     // 0x11F28 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_58;                     // 0x11F50 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_57;                     // 0x11F78 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_56;                     // 0x11FA0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_55;                     // 0x11FC8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_54;                     // 0x11FF0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_53;                     // 0x12018 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_52;                     // 0x12040 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_51;                     // 0x12068 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_50;                     // 0x12090 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_49;                     // 0x120B8 (size: 0x28)
    FAnimNode_ModifyCurve AnimGraphNode_ModifyCurve_15;                               // 0x120E0 (size: 0x58)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_19;                   // 0x12138 (size: 0x50)
    FAnimNode_StateResult AnimGraphNode_StateResult_37;                               // 0x12188 (size: 0x30)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_48;                     // 0x121B8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_47;                     // 0x121E0 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_29;                         // 0x12208 (size: 0x80)
    FAnimNode_StateResult AnimGraphNode_StateResult_36;                               // 0x12288 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_28;                         // 0x122B8 (size: 0x80)
    FAnimNode_StateResult AnimGraphNode_StateResult_35;                               // 0x12338 (size: 0x30)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_17;                           // 0x12368 (size: 0x28)
    FAnimNode_ModifyCurve AnimGraphNode_ModifyCurve_14;                               // 0x12390 (size: 0x58)
    FAnimNode_StateResult AnimGraphNode_StateResult_34;                               // 0x123E8 (size: 0x30)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_16;                           // 0x12418 (size: 0x28)
    FAnimNode_ModifyCurve AnimGraphNode_ModifyCurve_13;                               // 0x12440 (size: 0x58)
    FAnimNode_StateResult AnimGraphNode_StateResult_33;                               // 0x12498 (size: 0x30)
    FAnimNode_StateResult AnimGraphNode_StateResult_32;                               // 0x124C8 (size: 0x30)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_9;                              // 0x124F8 (size: 0xB0)
    FAnimNode_LinkedAnimLayer AnimGraphNode_LinkedAnimLayer_7;                        // 0x125A8 (size: 0xB0)
    FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_2;     // 0x12658 (size: 0x20)
    FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_3;     // 0x12678 (size: 0x20)
    FAnimNode_ModifyBone AnimGraphNode_ModifyBone_6;                                  // 0x12698 (size: 0x108)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_7;                      // 0x127A0 (size: 0xE8)
    FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_2;                                // 0x12888 (size: 0xC8)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_27;                         // 0x12950 (size: 0x80)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_26;                         // 0x129D0 (size: 0x80)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_6;                      // 0x12A50 (size: 0xE8)
    FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_5;                            // 0x12B38 (size: 0xC8)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_5;                      // 0x12C00 (size: 0xE8)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_4;                      // 0x12CE8 (size: 0xE8)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_3;                      // 0x12DD0 (size: 0xE8)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_2;                      // 0x12EB8 (size: 0xE8)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_1;                      // 0x12FA0 (size: 0xE8)
    FAnimNode_StateResult AnimGraphNode_StateResult_31;                               // 0x13088 (size: 0x30)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_8;                              // 0x130B8 (size: 0xB0)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_46;                     // 0x13168 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_45;                     // 0x13190 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_44;                     // 0x131B8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_43;                     // 0x131E0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_42;                     // 0x13208 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_41;                     // 0x13230 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_40;                     // 0x13258 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_39;                     // 0x13280 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_38;                     // 0x132A8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_37;                     // 0x132D0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_36;                     // 0x132F8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_35;                     // 0x13320 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_15;                           // 0x13348 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_25;                         // 0x13370 (size: 0x80)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_24;                         // 0x133F0 (size: 0x80)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_23;                         // 0x13470 (size: 0x80)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_22;                         // 0x134F0 (size: 0x80)
    FAnimNode_MultiWayBlend AnimGraphNode_MultiWayBlend_5;                            // 0x13570 (size: 0x50)
    FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_4;                            // 0x135C0 (size: 0xC8)
    FAnimNode_StateResult AnimGraphNode_StateResult_30;                               // 0x13688 (size: 0x30)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_34;                     // 0x136B8 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_14;                           // 0x136E0 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_21;                         // 0x13708 (size: 0x80)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_20;                         // 0x13788 (size: 0x80)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_19;                         // 0x13808 (size: 0x80)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_18;                         // 0x13888 (size: 0x80)
    FAnimNode_MultiWayBlend AnimGraphNode_MultiWayBlend_4;                            // 0x13908 (size: 0x50)
    FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_3;                            // 0x13958 (size: 0xC8)
    FAnimNode_StateResult AnimGraphNode_StateResult_29;                               // 0x13A20 (size: 0x30)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_13;                           // 0x13A50 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_17;                         // 0x13A78 (size: 0x80)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_16;                         // 0x13AF8 (size: 0x80)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_15;                         // 0x13B78 (size: 0x80)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_14;                         // 0x13BF8 (size: 0x80)
    FAnimNode_MultiWayBlend AnimGraphNode_MultiWayBlend_3;                            // 0x13C78 (size: 0x50)
    FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_2;                            // 0x13CC8 (size: 0xC8)
    FAnimNode_StateResult AnimGraphNode_StateResult_28;                               // 0x13D90 (size: 0x30)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_12;                           // 0x13DC0 (size: 0x28)
    FAnimNode_StateResult AnimGraphNode_StateResult_27;                               // 0x13DE8 (size: 0x30)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_11;                           // 0x13E18 (size: 0x28)
    FAnimNode_StateResult AnimGraphNode_StateResult_26;                               // 0x13E40 (size: 0x30)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_10;                           // 0x13E70 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_13;                         // 0x13E98 (size: 0x80)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_12;                         // 0x13F18 (size: 0x80)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_11;                         // 0x13F98 (size: 0x80)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_10;                         // 0x14018 (size: 0x80)
    FAnimNode_MultiWayBlend AnimGraphNode_MultiWayBlend_2;                            // 0x14098 (size: 0x50)
    FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_1;                            // 0x140E8 (size: 0xC8)
    FAnimNode_StateResult AnimGraphNode_StateResult_25;                               // 0x141B0 (size: 0x30)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_7;                              // 0x141E0 (size: 0xB0)
    FAnimNode_LinkedAnimLayer AnimGraphNode_LinkedAnimLayer_6;                        // 0x14290 (size: 0xB0)
    FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_1;     // 0x14340 (size: 0x20)
    FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_2;     // 0x14360 (size: 0x20)
    FAnimNode_ModifyBone AnimGraphNode_ModifyBone_5;                                  // 0x14380 (size: 0x108)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_9;                          // 0x14488 (size: 0x80)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_18;                   // 0x14508 (size: 0x50)
    FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_1;                                // 0x14558 (size: 0xC8)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_8;                          // 0x14620 (size: 0x80)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_7;                          // 0x146A0 (size: 0x80)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_6;                          // 0x14720 (size: 0x80)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_5;                          // 0x147A0 (size: 0x80)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_4;                          // 0x14820 (size: 0x80)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer;                        // 0x148A0 (size: 0xE8)
    FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive;                              // 0x14988 (size: 0xC8)
    FAnimNode_StateResult AnimGraphNode_StateResult_24;                               // 0x14A50 (size: 0x30)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_6;                              // 0x14A80 (size: 0xB0)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_33;                     // 0x14B30 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_32;                     // 0x14B58 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_31;                     // 0x14B80 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_30;                     // 0x14BA8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_29;                     // 0x14BD0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_28;                     // 0x14BF8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_27;                     // 0x14C20 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_26;                     // 0x14C48 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_9;                            // 0x14C70 (size: 0x28)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_17;                   // 0x14C98 (size: 0x50)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_16;                   // 0x14CE8 (size: 0x50)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_2;                      // 0x14D38 (size: 0xC0)
    FAnimNode_ModifyCurve AnimGraphNode_ModifyCurve_12;                               // 0x14DF8 (size: 0x58)
    FAnimNode_StateResult AnimGraphNode_StateResult_23;                               // 0x14E50 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_3;                          // 0x14E80 (size: 0x80)
    FAnimNode_ModifyCurve AnimGraphNode_ModifyCurve_11;                               // 0x14F00 (size: 0x58)
    FAnimNode_StateResult AnimGraphNode_StateResult_22;                               // 0x14F58 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_2;                          // 0x14F88 (size: 0x80)
    FAnimNode_ModifyCurve AnimGraphNode_ModifyCurve_10;                               // 0x15008 (size: 0x58)
    FAnimNode_StateResult AnimGraphNode_StateResult_21;                               // 0x15060 (size: 0x30)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_8;                            // 0x15090 (size: 0x28)
    FAnimNode_StateResult AnimGraphNode_StateResult_20;                               // 0x150B8 (size: 0x30)
    FAnimNode_ModifyCurve AnimGraphNode_ModifyCurve_9;                                // 0x150E8 (size: 0x58)
    FAnimNode_Slot AnimGraphNode_Slot_3;                                              // 0x15140 (size: 0x48)
    FAnimNode_ModifyCurve AnimGraphNode_ModifyCurve_8;                                // 0x15188 (size: 0x58)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_15;                   // 0x151E0 (size: 0x50)
    FAnimNode_StateResult AnimGraphNode_StateResult_19;                               // 0x15230 (size: 0x30)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_5;                              // 0x15260 (size: 0xB0)
    FAnimNode_Slot AnimGraphNode_Slot_2;                                              // 0x15310 (size: 0x48)
    FAnimNode_Slot AnimGraphNode_Slot_1;                                              // 0x15358 (size: 0x48)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_6;                          // 0x153A0 (size: 0x158)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_5;                          // 0x154F8 (size: 0x158)
    FAnimNode_Inertialization AnimGraphNode_Inertialization;                          // 0x15650 (size: 0x70)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_25;                     // 0x156C0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_24;                     // 0x156E8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_23;                     // 0x15710 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_22;                     // 0x15738 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_21;                     // 0x15760 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_20;                     // 0x15788 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_19;                     // 0x157B0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_18;                     // 0x157D8 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_1;                          // 0x15800 (size: 0x80)
    FAnimNode_ModifyCurve AnimGraphNode_ModifyCurve_7;                                // 0x15880 (size: 0x58)
    FAnimNode_StateResult AnimGraphNode_StateResult_18;                               // 0x158D8 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer;                            // 0x15908 (size: 0x80)
    FAnimNode_ModifyCurve AnimGraphNode_ModifyCurve_6;                                // 0x15988 (size: 0x58)
    FAnimNode_StateResult AnimGraphNode_StateResult_17;                               // 0x159E0 (size: 0x30)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_17;                     // 0x15A10 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_16;                     // 0x15A38 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_15;                     // 0x15A60 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_14;                     // 0x15A88 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_7;                            // 0x15AB0 (size: 0x28)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_14;                   // 0x15AD8 (size: 0x50)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_13;                   // 0x15B28 (size: 0x50)
    FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_3;                        // 0x15B78 (size: 0xB0)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_12;                   // 0x15C28 (size: 0x50)
    FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_2;                        // 0x15C78 (size: 0xB0)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_11;                   // 0x15D28 (size: 0x50)
    FAnimNode_MultiWayBlend AnimGraphNode_MultiWayBlend_1;                            // 0x15D78 (size: 0x50)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_10;                   // 0x15DC8 (size: 0x50)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_9;                    // 0x15E18 (size: 0x50)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_1;                      // 0x15E68 (size: 0xC0)
    FAnimNode_ModifyCurve AnimGraphNode_ModifyCurve_5;                                // 0x15F28 (size: 0x58)
    FAnimNode_StateResult AnimGraphNode_StateResult_16;                               // 0x15F80 (size: 0x30)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_6;                            // 0x15FB0 (size: 0x28)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_8;                    // 0x15FD8 (size: 0x50)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_7;                    // 0x16028 (size: 0x50)
    FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_1;                        // 0x16078 (size: 0xB0)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_6;                    // 0x16128 (size: 0x50)
    FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum;                          // 0x16178 (size: 0xB0)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_5;                    // 0x16228 (size: 0x50)
    FAnimNode_MultiWayBlend AnimGraphNode_MultiWayBlend;                              // 0x16278 (size: 0x50)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_4;                    // 0x162C8 (size: 0x50)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_3;                    // 0x16318 (size: 0x50)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend;                        // 0x16368 (size: 0xC0)
    FAnimNode_ModifyCurve AnimGraphNode_ModifyCurve_4;                                // 0x16428 (size: 0x58)
    FAnimNode_StateResult AnimGraphNode_StateResult_15;                               // 0x16480 (size: 0x30)
    FAnimNode_ModifyCurve AnimGraphNode_ModifyCurve_3;                                // 0x164B0 (size: 0x58)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_5;                            // 0x16508 (size: 0x28)
    FAnimNode_StateResult AnimGraphNode_StateResult_14;                               // 0x16530 (size: 0x30)
    FAnimNode_ModifyCurve AnimGraphNode_ModifyCurve_2;                                // 0x16560 (size: 0x58)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_4;                            // 0x165B8 (size: 0x28)
    FAnimNode_StateResult AnimGraphNode_StateResult_13;                               // 0x165E0 (size: 0x30)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_13;                     // 0x16610 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_12;                     // 0x16638 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_3;                            // 0x16660 (size: 0x28)
    FAnimNode_StateResult AnimGraphNode_StateResult_12;                               // 0x16688 (size: 0x30)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_4;                              // 0x166B8 (size: 0xB0)
    FAnimNode_StateResult AnimGraphNode_StateResult_11;                               // 0x16768 (size: 0x30)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_2;                            // 0x16798 (size: 0x28)
    FAnimNode_StateResult AnimGraphNode_StateResult_10;                               // 0x167C0 (size: 0x30)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_2;                    // 0x167F0 (size: 0x50)
    FAnimNode_ModifyCurve AnimGraphNode_ModifyCurve_1;                                // 0x16840 (size: 0x58)
    FAnimNode_Slot AnimGraphNode_Slot;                                                // 0x16898 (size: 0x48)
    FAnimNode_ModifyCurve AnimGraphNode_ModifyCurve;                                  // 0x168E0 (size: 0x58)
    FAnimNode_StateResult AnimGraphNode_StateResult_9;                                // 0x16938 (size: 0x30)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_3;                              // 0x16968 (size: 0xB0)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_4;                          // 0x16A18 (size: 0x158)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_3;                          // 0x16B70 (size: 0x158)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_2;                          // 0x16CC8 (size: 0x158)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_1;                          // 0x16E20 (size: 0x158)
    FAnimNode_Root AnimGraphNode_Root_2;                                              // 0x16F78 (size: 0x30)
    FAnimNode_LinkedAnimLayer AnimGraphNode_LinkedAnimLayer_5;                        // 0x16FA8 (size: 0xB0)
    FAnimNode_ModifyBone AnimGraphNode_ModifyBone_4;                                  // 0x17058 (size: 0x108)
    FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_1;     // 0x17160 (size: 0x20)
    FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose;                          // 0x17180 (size: 0x118)
    FAnimNode_Root AnimGraphNode_Root_1;                                              // 0x17298 (size: 0x30)
    FAnimNode_LinkedAnimLayer AnimGraphNode_LinkedAnimLayer_4;                        // 0x172C8 (size: 0xB0)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose;                            // 0x17378 (size: 0x158)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_11;                     // 0x174D0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_10;                     // 0x174F8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_9;                      // 0x17520 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_8;                      // 0x17548 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_7;                      // 0x17570 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_6;                      // 0x17598 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_5;                      // 0x175C0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_4;                      // 0x175E8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_3;                      // 0x17610 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_2;                      // 0x17638 (size: 0x28)
    FAnimNode_BlendSpaceEvaluator AnimGraphNode_BlendSpaceEvaluator_4;                // 0x17660 (size: 0xF0)
    FAnimNode_StateResult AnimGraphNode_StateResult_8;                                // 0x17750 (size: 0x30)
    FAnimNode_BlendSpaceEvaluator AnimGraphNode_BlendSpaceEvaluator_3;                // 0x17780 (size: 0xF0)
    FAnimNode_StateResult AnimGraphNode_StateResult_7;                                // 0x17870 (size: 0x30)
    FAnimNode_BlendSpaceEvaluator AnimGraphNode_BlendSpaceEvaluator_2;                // 0x178A0 (size: 0xF0)
    FAnimNode_StateResult AnimGraphNode_StateResult_6;                                // 0x17990 (size: 0x30)
    FAnimNode_BlendSpaceEvaluator AnimGraphNode_BlendSpaceEvaluator_1;                // 0x179C0 (size: 0xF0)
    FAnimNode_StateResult AnimGraphNode_StateResult_5;                                // 0x17AB0 (size: 0x30)
    FAnimNode_BlendSpaceEvaluator AnimGraphNode_BlendSpaceEvaluator;                  // 0x17AE0 (size: 0xF0)
    FAnimNode_StateResult AnimGraphNode_StateResult_4;                                // 0x17BD0 (size: 0x30)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_2;                              // 0x17C00 (size: 0xB0)
    FAnimNode_StateResult AnimGraphNode_StateResult_3;                                // 0x17CB0 (size: 0x30)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_1;                      // 0x17CE0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult;                        // 0x17D08 (size: 0x28)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_1;                    // 0x17D30 (size: 0x50)
    FAnimNode_StateResult AnimGraphNode_StateResult_2;                                // 0x17D80 (size: 0x30)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator;                      // 0x17DB0 (size: 0x50)
    FAnimNode_StateResult AnimGraphNode_StateResult_1;                                // 0x17E00 (size: 0x30)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_1;                              // 0x17E30 (size: 0xB0)
    FAnimNode_StateResult AnimGraphNode_StateResult;                                  // 0x17EE0 (size: 0x30)
    FAnimNode_StateMachine AnimGraphNode_StateMachine;                                // 0x17F10 (size: 0xB0)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_1;                            // 0x17FC0 (size: 0x28)
    FAnimNode_Root AnimGraphNode_Root;                                                // 0x17FE8 (size: 0x30)
    FAnimNode_ApplyMeshSpaceAdditive AnimGraphNode_ApplyMeshSpaceAdditive;            // 0x18018 (size: 0xD0)
    FAnimNode_LinkedAnimLayer AnimGraphNode_LinkedAnimLayer_3;                        // 0x180E8 (size: 0xB0)
    FAnimNode_ModifyBone AnimGraphNode_ModifyBone_3;                                  // 0x18198 (size: 0x108)
    FAnimNode_ModifyBone AnimGraphNode_ModifyBone_2;                                  // 0x182A0 (size: 0x108)
    FAnimNode_ModifyBone AnimGraphNode_ModifyBone_1;                                  // 0x183A8 (size: 0x108)
    FAnimNode_ModifyBone AnimGraphNode_ModifyBone;                                    // 0x184B0 (size: 0x108)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose;                              // 0x185B8 (size: 0x28)
    FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;       // 0x185E0 (size: 0x20)
    FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend;                                  // 0x18600 (size: 0xC8)
    FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;       // 0x186C8 (size: 0x20)
    FAnimNode_LinkedAnimLayer AnimGraphNode_LinkedAnimLayer_2;                        // 0x186E8 (size: 0xB0)
    FAnimNode_LinkedAnimLayer AnimGraphNode_LinkedAnimLayer_1;                        // 0x18798 (size: 0xB0)
    FAnimNode_LinkedAnimLayer AnimGraphNode_LinkedAnimLayer;                          // 0x18848 (size: 0xB0)
    FRotator AimingRotation;                                                          // 0x188F8 (size: 0xC)
    FVector Velocity;                                                                 // 0x18904 (size: 0xC)
    FVector RelativeVelocityDirection;                                                // 0x18910 (size: 0xC)
    FVector Acceleration;                                                             // 0x1891C (size: 0xC)
    FVector MovementInput;                                                            // 0x18928 (size: 0xC)
    bool IsMoving;                                                                    // 0x18934 (size: 0x1)
    bool HasMovementInput;                                                            // 0x18935 (size: 0x1)
    float Speed;                                                                      // 0x18938 (size: 0x4)
    float MovementInputAmount;                                                        // 0x1893C (size: 0x4)
    TEnumAsByte<GroundedEntryState::Type> GroundedEntryState;                         // 0x18940 (size: 0x1)
    TEnumAsByte<MovementDirection::Type> MovementDirection;                           // 0x18941 (size: 0x1)
    TEnumAsByte<HipsDirection::Type> TrackedHipsDirection;                            // 0x18942 (size: 0x1)
    FVector RelativeAccelerationAmount;                                               // 0x18944 (size: 0xC)
    bool ShouldMove;                                                                  // 0x18950 (size: 0x1)
    bool Rotate_L;                                                                    // 0x18951 (size: 0x1)
    bool Rotate_R;                                                                    // 0x18952 (size: 0x1)
    bool Pivot;                                                                       // 0x18953 (size: 0x1)
    float RotateRate;                                                                 // 0x18954 (size: 0x4)
    float RotationScale;                                                              // 0x18958 (size: 0x4)
    float DiagonalScaleAmount;                                                        // 0x1895C (size: 0x4)
    float WalkRunBlend;                                                               // 0x18960 (size: 0x4)
    float StandingPlayRate;                                                           // 0x18964 (size: 0x4)
    float CrouchingPlayRate;                                                          // 0x18968 (size: 0x4)
    float StrideBlend;                                                                // 0x1896C (size: 0x4)
    FVelocityBlend VelocityBlend;                                                     // 0x18970 (size: 0x10)
    FLeanAmount LeanAmount;                                                           // 0x18980 (size: 0x8)
    class UCurveFloat* DiagonalScaleAmountCurve;                                      // 0x18988 (size: 0x8)
    class UCurveFloat* StrideBlend_N_Walk;                                            // 0x18990 (size: 0x8)
    class UCurveFloat* StrideBlend_N_Run;                                             // 0x18998 (size: 0x8)
    class UCurveFloat* StrideBlend_C_Walk;                                            // 0x189A0 (size: 0x8)
    FRotator SmoothedAimingRotation;                                                  // 0x189A8 (size: 0xC)
    FRotator SpineRotation;                                                           // 0x189B4 (size: 0xC)
    FVector2D AimingAngle;                                                            // 0x189C0 (size: 0x8)
    FVector2D SmoothedAimingAngle;                                                    // 0x189C8 (size: 0x8)
    float AimSweepTime;                                                               // 0x189D0 (size: 0x4)
    float AimYawRate;                                                                 // 0x189D4 (size: 0x4)
    float ZoomAmount;                                                                 // 0x189D8 (size: 0x4)
    bool Jumped;                                                                      // 0x189DC (size: 0x1)
    float JumpPlayRate;                                                               // 0x189E0 (size: 0x4)
    float FallSpeed;                                                                  // 0x189E4 (size: 0x4)
    float LandPrediction;                                                             // 0x189E8 (size: 0x4)
    class UCurveFloat* LandPredictionCurve;                                           // 0x189F0 (size: 0x8)
    class UCurveFloat* LeanInAirCurve;                                                // 0x189F8 (size: 0x8)
    int32 OverlayOverrideState;                                                       // 0x18A00 (size: 0x4)
    float Enable_AimOffset;                                                           // 0x18A04 (size: 0x4)
    float FootLock_L_Alpha;                                                           // 0x18A08 (size: 0x4)
    float FootLock_R_Alpha;                                                           // 0x18A0C (size: 0x4)
    FVector FootLock_L_Location;                                                      // 0x18A10 (size: 0xC)
    FVector FootLock_R_Location;                                                      // 0x18A1C (size: 0xC)
    FRotator FootLock_L_Rotation;                                                     // 0x18A28 (size: 0xC)
    FRotator FootLock_R_Rotation;                                                     // 0x18A34 (size: 0xC)
    FVector FootOffset_L_Location;                                                    // 0x18A40 (size: 0xC)
    FVector FootOffset_R_Location;                                                    // 0x18A4C (size: 0xC)
    FRotator FootOffset_L_Rotation;                                                   // 0x18A58 (size: 0xC)
    FRotator FootOffset_R_Rotation;                                                   // 0x18A64 (size: 0xC)
    FVector PelvisOffset;                                                             // 0x18A70 (size: 0xC)
    float PelvisAlpha;                                                                // 0x18A7C (size: 0x4)
    class ACharacter* Character;                                                      // 0x18A80 (size: 0x8)
    float DeltaTimeX;                                                                 // 0x18A88 (size: 0x4)
    float TurnCheckMinAngle;                                                          // 0x18A8C (size: 0x4)
    float Turn180Threshold;                                                           // 0x18A90 (size: 0x4)
    float AimYawRateLimit;                                                            // 0x18A94 (size: 0x4)
    float ElapsedDelayTime;                                                           // 0x18A98 (size: 0x4)
    TEnumAsByte<ALS_MovementState::Type> MovementState;                               // 0x18A9C (size: 0x1)
    TEnumAsByte<ALS_MovementState::Type> PrevMovementState;                           // 0x18A9D (size: 0x1)
    TEnumAsByte<ALS_MovementAction::Type> MovementAction;                             // 0x18A9E (size: 0x1)
    TEnumAsByte<ALS_RotationMode::Type> RotationMode;                                 // 0x18A9F (size: 0x1)
    TEnumAsByte<ALS_Gait::Type> Gait;                                                 // 0x18AA0 (size: 0x1)
    TEnumAsByte<ALS_Stance::Type> stance;                                             // 0x18AA1 (size: 0x1)
    TEnumAsByte<ALS_ViewMode::Type> ViewMode;                                         // 0x18AA2 (size: 0x1)
    TEnumAsByte<ALS_OverlayState::Type> OverlayState;                                 // 0x18AA3 (size: 0x1)
    float BasePose_N;                                                                 // 0x18AA4 (size: 0x4)
    float BasePose_CLF;                                                               // 0x18AA8 (size: 0x4)
    float Arm_L;                                                                      // 0x18AAC (size: 0x4)
    float Arm_L_Add;                                                                  // 0x18AB0 (size: 0x4)
    float Arm_L_LS;                                                                   // 0x18AB4 (size: 0x4)
    float Arm_L_MS;                                                                   // 0x18AB8 (size: 0x4)
    float Arm_R;                                                                      // 0x18ABC (size: 0x4)
    float Arm_R_Add;                                                                  // 0x18AC0 (size: 0x4)
    float Arm_R_LS;                                                                   // 0x18AC4 (size: 0x4)
    float Arm_R_MS;                                                                   // 0x18AC8 (size: 0x4)
    float Hand_L;                                                                     // 0x18ACC (size: 0x4)
    float Hand_R;                                                                     // 0x18AD0 (size: 0x4)
    float Legs;                                                                       // 0x18AD4 (size: 0x4)
    float Legs_Add;                                                                   // 0x18AD8 (size: 0x4)
    float pelvis;                                                                     // 0x18ADC (size: 0x4)
    float Pelvis_Add;                                                                 // 0x18AE0 (size: 0x4)
    float Spine;                                                                      // 0x18AE4 (size: 0x4)
    float Spine_Add;                                                                  // 0x18AE8 (size: 0x4)
    float Head;                                                                       // 0x18AEC (size: 0x4)
    float Head_Add;                                                                   // 0x18AF0 (size: 0x4)
    class UCurveVector* YawOffset_FB;                                                 // 0x18AF8 (size: 0x8)
    class UCurveVector* YawOffset_LR;                                                 // 0x18B00 (size: 0x8)
    float FYaw;                                                                       // 0x18B08 (size: 0x4)
    float BYaw;                                                                       // 0x18B0C (size: 0x4)
    float LYaw;                                                                       // 0x18B10 (size: 0x4)
    float RYaw;                                                                       // 0x18B14 (size: 0x4)
    float InputYawOffsetTime;                                                         // 0x18B18 (size: 0x4)
    float ForwardYawTime;                                                             // 0x18B1C (size: 0x4)
    float LeftYawTime;                                                                // 0x18B20 (size: 0x4)
    float RightYawTime;                                                               // 0x18B24 (size: 0x4)
    float MinAngleDelay;                                                              // 0x18B28 (size: 0x4)
    float MaxAngleDelay;                                                              // 0x18B2C (size: 0x4)
    float RotateMinThreshold;                                                         // 0x18B30 (size: 0x4)
    float RotateMaxThreshold;                                                         // 0x18B34 (size: 0x4)
    FTurnInPlace_Asset N_TurnIP_L90;                                                  // 0x18B38 (size: 0x20)
    FTurnInPlace_Asset N_TurnIP_R90;                                                  // 0x18B58 (size: 0x20)
    FTurnInPlace_Asset N_TurnIP_L180;                                                 // 0x18B78 (size: 0x20)
    FTurnInPlace_Asset N_TurnIP_R180;                                                 // 0x18B98 (size: 0x20)
    float AimYawRateMinRange;                                                         // 0x18BB8 (size: 0x4)
    float AimYawRateMaxRange;                                                         // 0x18BBC (size: 0x4)
    float MinPlayRate;                                                                // 0x18BC0 (size: 0x4)
    float MaxPlayRate;                                                                // 0x18BC4 (size: 0x4)
    FTurnInPlace_Asset CLF_TurnIP_L90;                                                // 0x18BC8 (size: 0x20)
    FTurnInPlace_Asset CLF_TurnIP_R90;                                                // 0x18BE8 (size: 0x20)
    FTurnInPlace_Asset CLF_TurnIP_L180;                                               // 0x18C08 (size: 0x20)
    FTurnInPlace_Asset CLF_TurnIP_R180;                                               // 0x18C28 (size: 0x20)
    float FlailRate;                                                                  // 0x18C48 (size: 0x4)
    float Enable_HandIK_L;                                                            // 0x18C4C (size: 0x4)
    float Enable_HandIK_R;                                                            // 0x18C50 (size: 0x4)
    float AnimatedWalkSpeed;                                                          // 0x18C54 (size: 0x4)
    float AnimatedRunSpeed;                                                           // 0x18C58 (size: 0x4)
    float AnimatedSprintSpeed;                                                        // 0x18C5C (size: 0x4)
    float AnimatedCrouchSpeed;                                                        // 0x18C60 (size: 0x4)
    float VelocityBlendInterpSpeed;                                                   // 0x18C64 (size: 0x4)
    float GroundedLeanInterpSpeed;                                                    // 0x18C68 (size: 0x4)
    float InAirLeanInterpSpeed;                                                       // 0x18C6C (size: 0x4)
    float SmoothedAimingRotationInterpSpeed;                                          // 0x18C70 (size: 0x4)
    float InputYawOffsetInterpSpeed;                                                  // 0x18C74 (size: 0x4)
    float TriggerPivotSpeedLimit;                                                     // 0x18C78 (size: 0x4)
    float FootHeight;                                                                 // 0x18C7C (size: 0x4)
    float IK_TraceDistanceAboveFoot;                                                  // 0x18C80 (size: 0x4)
    float IK_TraceDistanceBelowFoot;                                                  // 0x18C84 (size: 0x4)

    void AimOffsetBehaviors(FPoseLink& AimOffsetBehaviors);
    void Foot IK(FPoseLink InPose, FPoseLink& Foot IK);
    void (CLF) CycleBlending(FPoseLink F, FPoseLink B, FPoseLink LF, FPoseLink LB, FPoseLink RF, FPoseLink RB, FPoseLink& (CLF) CycleBlending);
    void (N) CycleBlending(FPoseLink F, FPoseLink B, FPoseLink LF, FPoseLink LB, FPoseLink RF, FPoseLink RB, FPoseLink Sprint, FPoseLink& (N) CycleBlending);
    void LayerBlending(FPoseLink Base Layer Input, FPoseLink Overlay Layer Input, FPoseLink Base Poses Input, FPoseLink& LayerBlending);
    void BasePoses(FPoseLink& BasePoses);
    void OverlayLayer(FPoseLink& OverlayLayer);
    void BaseLayer(FPoseLink& BaseLayer);
    void AnimGraph(FPoseLink& AnimGraph);
    void ResetIKOffsets();
    bool AngleInRange(float Angle, float MinAngle, float MaxAngle, float Buffer, bool IncreaseBuffer);
