#ifndef UE4SS_SDK_BM_SG_WoodcuttersLodge_HPP
#define UE4SS_SDK_BM_SG_WoodcuttersLodge_HPP

class ABM_SG_WoodcuttersLodge_C : public AStaticMeshActor
{
    class USceneComponent* ambience_fireplace;                                        // 0x0230 (size: 0x8)
    class UStaticMeshComponent* res_16_19;                                            // 0x0238 (size: 0x8)
    class UStaticMeshComponent* res_16_18;                                            // 0x0240 (size: 0x8)
    class UStaticMeshComponent* res_16_17;                                            // 0x0248 (size: 0x8)
    class UStaticMeshComponent* res_16_16;                                            // 0x0250 (size: 0x8)
    class UStaticMeshComponent* res_16_15;                                            // 0x0258 (size: 0x8)
    class UStaticMeshComponent* res_16_14;                                            // 0x0260 (size: 0x8)
    class UStaticMeshComponent* res_16_13;                                            // 0x0268 (size: 0x8)
    class UStaticMeshComponent* res_16_12;                                            // 0x0270 (size: 0x8)
    class UStaticMeshComponent* res_16_11;                                            // 0x0278 (size: 0x8)
    class UStaticMeshComponent* res_16_10;                                            // 0x0280 (size: 0x8)
    class UStaticMeshComponent* res_16_9;                                             // 0x0288 (size: 0x8)
    class UStaticMeshComponent* res_16_8;                                             // 0x0290 (size: 0x8)
    class UStaticMeshComponent* res_16_7;                                             // 0x0298 (size: 0x8)
    class UStaticMeshComponent* res_16_6;                                             // 0x02A0 (size: 0x8)
    class UStaticMeshComponent* res_16_5;                                             // 0x02A8 (size: 0x8)
    class UStaticMeshComponent* res_16_4;                                             // 0x02B0 (size: 0x8)
    class UStaticMeshComponent* res_16_3;                                             // 0x02B8 (size: 0x8)
    class UStaticMeshComponent* res_16_2;                                             // 0x02C0 (size: 0x8)
    class UStaticMeshComponent* res_16_1;                                             // 0x02C8 (size: 0x8)
    class UStaticMeshComponent* res_16_0;                                             // 0x02D0 (size: 0x8)
    class UStaticMeshComponent* dirt_0_5;                                             // 0x02D8 (size: 0x8)
    class UStaticMeshComponent* dirt_0_4;                                             // 0x02E0 (size: 0x8)
    class UStaticMeshComponent* Clutter7;                                             // 0x02E8 (size: 0x8)
    class UStaticMeshComponent* Clutter6;                                             // 0x02F0 (size: 0x8)
    class USceneComponent* gathering;                                                 // 0x02F8 (size: 0x8)
    class UStaticMeshComponent* Dirt_3_0;                                             // 0x0300 (size: 0x8)
    class UStaticMeshComponent* Bld_154_5;                                            // 0x0308 (size: 0x8)
    class UStaticMeshComponent* dirt_0_3;                                             // 0x0310 (size: 0x8)
    class UStaticMeshComponent* clutter_fenceEnd2;                                    // 0x0318 (size: 0x8)
    class UStaticMeshComponent* clutter_fenceEnd1;                                    // 0x0320 (size: 0x8)
    class UStaticMeshComponent* clutter_fenceEnd;                                     // 0x0328 (size: 0x8)
    class UStaticMeshComponent* Bld_401_8;                                            // 0x0330 (size: 0x8)
    class UStaticMeshComponent* Bld_401_7;                                            // 0x0338 (size: 0x8)
    class UStaticMeshComponent* Bld_401_6;                                            // 0x0340 (size: 0x8)
    class UStaticMeshComponent* Bld_401_5;                                            // 0x0348 (size: 0x8)
    class UStaticMeshComponent* Bld_401_4;                                            // 0x0350 (size: 0x8)
    class UStaticMeshComponent* Bld_401_0;                                            // 0x0358 (size: 0x8)
    class UStaticMeshComponent* Clutter5;                                             // 0x0360 (size: 0x8)
    class UStaticMeshComponent* Clutter4;                                             // 0x0368 (size: 0x8)
    class UStaticMeshComponent* Clutter3;                                             // 0x0370 (size: 0x8)
    class UStaticMeshComponent* Bld_154_4;                                            // 0x0378 (size: 0x8)
    class UStaticMeshComponent* Clutter2;                                             // 0x0380 (size: 0x8)
    class UStaticMeshComponent* Clutter1;                                             // 0x0388 (size: 0x8)
    class UStaticMeshComponent* clutter;                                              // 0x0390 (size: 0x8)
    class UStaticMeshComponent* FullBld_306;                                          // 0x0398 (size: 0x8)
    class UStaticMeshComponent* PS_Smoke;                                             // 0x03A0 (size: 0x8)
    class UStaticMeshComponent* Bld_154_3;                                            // 0x03A8 (size: 0x8)
    class UStaticMeshComponent* Bld_154_2;                                            // 0x03B0 (size: 0x8)
    class UStaticMeshComponent* Bld_154_1;                                            // 0x03B8 (size: 0x8)
    class UStaticMeshComponent* MainBld_400;                                          // 0x03C0 (size: 0x8)
    class UStaticMeshComponent* FullBld_35;                                           // 0x03C8 (size: 0x8)
    class UStaticMeshComponent* MainBld_22;                                           // 0x03D0 (size: 0x8)

}; // Size: 0x3D8

#endif
