#ifndef UE4SS_SDK_BM_SG_Roadpost_HPP
#define UE4SS_SDK_BM_SG_Roadpost_HPP

class ABM_SG_Roadpost_C : public AStaticMeshActor
{
    class UStaticMeshComponent* clutter_5;                                            // 0x0230 (size: 0x8)
    class UStaticMeshComponent* clutter_6;                                            // 0x0238 (size: 0x8)
    class UStaticMeshComponent* clutter_4;                                            // 0x0240 (size: 0x8)
    class UStaticMeshComponent* clutter_2;                                            // 0x0248 (size: 0x8)
    class UStaticMeshComponent* clutter_1;                                            // 0x0250 (size: 0x8)
    class UStaticMeshComponent* dirt_1_3;                                             // 0x0258 (size: 0x8)
    class UStaticMeshComponent* dirt_1_2;                                             // 0x0260 (size: 0x8)
    class UStaticMeshComponent* MainBld_422;                                          // 0x0268 (size: 0x8)

}; // Size: 0x270

#endif
