#ifndef UE4SS_SDK_C_HuntersTent_HPP
#define UE4SS_SDK_C_HuntersTent_HPP

class AC_HuntersTent_C : public AConstructionBP_C
{
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly16_StaticMeshComponent0;    // 0x04B0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly15_StaticMeshComponent0;    // 0x04B8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly14_StaticMeshComponent0;    // 0x04C0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly13_StaticMeshComponent0;    // 0x04C8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly12_StaticMeshComponent0;    // 0x04D0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly11_StaticMeshComponent0;    // 0x04D8 (size: 0x8)
    class UStaticMeshComponent* ropeTubeD9_StaticMeshComponent0;                      // 0x04E0 (size: 0x8)
    class UStaticMeshComponent* ropeTubeD8_StaticMeshComponent0;                      // 0x04E8 (size: 0x8)
    class UStaticMeshComponent* sg_huntersTentA2_StaticMeshComponent0;                // 0x04F0 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed_long216_StaticMeshComponent0;     // 0x04F8 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed_long215_StaticMeshComponent0;     // 0x0500 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed_long214_StaticMeshComponent0;     // 0x0508 (size: 0x8)
    class UStaticMeshComponent* bedroll2_StaticMeshComponent0;                        // 0x0510 (size: 0x8)
    class USceneComponent* sg_hunters_tent2_DefaultSceneRoot;                         // 0x0518 (size: 0x8)

}; // Size: 0x520

#endif
