#ifndef UE4SS_SDK_ControlTooltipPanel_HPP
#define UE4SS_SDK_ControlTooltipPanel_HPP

class UControlTooltipPanel_C : public UUserWidget
{
    FPointerToUberGraphFrame UberGraphFrame;                                          // 0x0260 (size: 0x8)
    class UImage* Image;                                                              // 0x0268 (size: 0x8)
    class UImage* Image_1;                                                            // 0x0270 (size: 0x8)
    class UImage* Image_2;                                                            // 0x0278 (size: 0x8)
    class UImage* Image_3;                                                            // 0x0280 (size: 0x8)
    class UImage* Image_4;                                                            // 0x0288 (size: 0x8)
    class UImage* Image_5;                                                            // 0x0290 (size: 0x8)
    class UImage* Image_6;                                                            // 0x0298 (size: 0x8)
    class UImage* Image_7;                                                            // 0x02A0 (size: 0x8)
    class UImage* Image_8;                                                            // 0x02A8 (size: 0x8)
    class UImage* Image_9;                                                            // 0x02B0 (size: 0x8)
    class UImage* Image_10;                                                           // 0x02B8 (size: 0x8)
    class UImage* Image_11;                                                           // 0x02C0 (size: 0x8)
    class UImage* Image_12;                                                           // 0x02C8 (size: 0x8)
    class UImage* Image_13;                                                           // 0x02D0 (size: 0x8)
    class UImage* Image_14;                                                           // 0x02D8 (size: 0x8)
    class UImage* Image_15;                                                           // 0x02E0 (size: 0x8)
    class UImage* Image_16;                                                           // 0x02E8 (size: 0x8)
    class UImage* Image_17;                                                           // 0x02F0 (size: 0x8)
    class UImage* Image_18;                                                           // 0x02F8 (size: 0x8)
    class UImage* Image_19;                                                           // 0x0300 (size: 0x8)
    class UImage* Image_20;                                                           // 0x0308 (size: 0x8)
    class UHorizontalBox* residential_HB;                                             // 0x0310 (size: 0x8)
    class UVerticalBox* tips_VB;                                                      // 0x0318 (size: 0x8)
    class UHorizontalBox* tt_building;                                                // 0x0320 (size: 0x8)
    class UHorizontalBox* tt_building_1;                                              // 0x0328 (size: 0x8)
    class UHorizontalBox* tt_building_2;                                              // 0x0330 (size: 0x8)
    class UHorizontalBox* tt_building_3;                                              // 0x0338 (size: 0x8)
    class UBorder* tt_cameraMovement;                                                 // 0x0340 (size: 0x8)
    class UHorizontalBox* tt_cameraMovement_hb_1;                                     // 0x0348 (size: 0x8)
    class UBorder* tt_construction;                                                   // 0x0350 (size: 0x8)
    class UBorder* tt_fields;                                                         // 0x0358 (size: 0x8)
    class UBorder* tt_home;                                                           // 0x0360 (size: 0x8)
    class UHorizontalBox* tt_home_hb;                                                 // 0x0368 (size: 0x8)
    class Utt_keybind_C* tt_keybind;                                                  // 0x0370 (size: 0x8)
    class Utt_keybind_C* tt_keybind_1;                                                // 0x0378 (size: 0x8)
    class Utt_keybind_C* tt_keybind_2;                                                // 0x0380 (size: 0x8)
    class Utt_keybind_C* tt_keybind_3;                                                // 0x0388 (size: 0x8)
    class Utt_keybind_C* tt_keybind_4;                                                // 0x0390 (size: 0x8)
    class Utt_keybind_C* tt_keybind_5;                                                // 0x0398 (size: 0x8)
    class Utt_keybind_C* tt_keybind_6;                                                // 0x03A0 (size: 0x8)
    class Utt_keybind_C* tt_keybind_7;                                                // 0x03A8 (size: 0x8)
    class Utt_keybind_C* tt_keybind_8;                                                // 0x03B0 (size: 0x8)
    class Utt_keybind_C* tt_keybind_9;                                                // 0x03B8 (size: 0x8)
    class Utt_keybind_C* tt_keybind_10;                                               // 0x03C0 (size: 0x8)
    class Utt_keybind_C* tt_keybind_11;                                               // 0x03C8 (size: 0x8)
    class Utt_keybind_C* tt_keybind_12;                                               // 0x03D0 (size: 0x8)
    class Utt_keybind_C* tt_keybind_13;                                               // 0x03D8 (size: 0x8)
    class Utt_keybind_C* tt_keybind_14;                                               // 0x03E0 (size: 0x8)
    class Utt_keybind_C* tt_keybind_15;                                               // 0x03E8 (size: 0x8)
    class Utt_keybind_C* tt_keybind_16;                                               // 0x03F0 (size: 0x8)
    class Utt_keybind_C* tt_keybind_17;                                               // 0x03F8 (size: 0x8)
    class Utt_keybind_C* tt_keybind_18;                                               // 0x0400 (size: 0x8)
    class Utt_keybind_C* tt_keybind_19;                                               // 0x0408 (size: 0x8)
    class URichTextBlock* tt_move;                                                    // 0x0410 (size: 0x8)
    class URichTextBlock* tt_move_1;                                                  // 0x0418 (size: 0x8)
    class URichTextBlock* tt_move_2;                                                  // 0x0420 (size: 0x8)
    class URichTextBlock* tt_move_3;                                                  // 0x0428 (size: 0x8)
    class URichTextBlock* tt_move_4;                                                  // 0x0430 (size: 0x8)
    class URichTextBlock* tt_move_5;                                                  // 0x0438 (size: 0x8)
    class URichTextBlock* tt_move_6;                                                  // 0x0440 (size: 0x8)
    class URichTextBlock* tt_move_7;                                                  // 0x0448 (size: 0x8)
    class URichTextBlock* tt_move_8;                                                  // 0x0450 (size: 0x8)
    class URichTextBlock* tt_move_9;                                                  // 0x0458 (size: 0x8)
    class URichTextBlock* tt_move_10;                                                 // 0x0460 (size: 0x8)
    class URichTextBlock* tt_move_11;                                                 // 0x0468 (size: 0x8)
    class URichTextBlock* tt_move_12;                                                 // 0x0470 (size: 0x8)
    class URichTextBlock* tt_move_13;                                                 // 0x0478 (size: 0x8)
    class URichTextBlock* tt_move_14;                                                 // 0x0480 (size: 0x8)
    class URichTextBlock* tt_move_15;                                                 // 0x0488 (size: 0x8)
    class URichTextBlock* tt_move_16;                                                 // 0x0490 (size: 0x8)
    class URichTextBlock* tt_move_17;                                                 // 0x0498 (size: 0x8)
    class URichTextBlock* tt_move_18;                                                 // 0x04A0 (size: 0x8)
    class URichTextBlock* tt_move_19;                                                 // 0x04A8 (size: 0x8)
    class URichTextBlock* tt_move_20;                                                 // 0x04B0 (size: 0x8)
    class URichTextBlock* tt_move_21;                                                 // 0x04B8 (size: 0x8)
    class UBorder* tt_roads;                                                          // 0x04C0 (size: 0x8)
    class UBorder* tt_workArea;                                                       // 0x04C8 (size: 0x8)
    float Delta;                                                                      // 0x04D0 (size: 0x4)
    bool shouldbeVisible;                                                             // 0x04D4 (size: 0x1)
    bool fadingIn;                                                                    // 0x04D5 (size: 0x1)

    void tooltip_WorkArea(class APawnCPP* Pawn);
    void tooltip_Area(class APawnCPP* Pawn);
    void Translate();
    void tooltip_Home(class APawnCPP* Pawn);
    void tooltip_roads(class AMyPawnCPP_BP3_C* PlayerPawn);
    void fadeTooltipComponent(class UWidget* ToolTip, bool show);
    void tooltip_buildingPlacement(class AMyPawnCPP_BP3_C* PlayerPawn);
    void tooltip_cameraMovement(class AMyPawnCPP_BP3_C* PlayerPawn);
    void globalFade();
    void Construct();
    void Tick(FGeometry MyGeometry, float InDeltaTime);
    void updateLoop();
    void ExecuteUbergraph_ControlTooltipPanel(int32 EntryPoint);
}; // Size: 0x4D6

#endif
