#ifndef UE4SS_SDK_developmentPanelTree_HPP
#define UE4SS_SDK_developmentPanelTree_HPP

class UdevelopmentPanelTree_C : public UUserWidget
{
    FPointerToUberGraphFrame UberGraphFrame;                                          // 0x0260 (size: 0x8)
    class UWidgetAnimation* duckHeader;                                               // 0x0268 (size: 0x8)
    class UWidgetAnimation* openAnim;                                                 // 0x0270 (size: 0x8)
    class UVerticalBox* allPolicies_VB;                                               // 0x0278 (size: 0x8)
    class UTextBlock* availablePoints_txt;                                            // 0x0280 (size: 0x8)
    class UBorder* avPoints_border;                                                   // 0x0288 (size: 0x8)
    class UImage* background_figures_1;                                               // 0x0290 (size: 0x8)
    class UImage* bg_brightGradient;                                                  // 0x0298 (size: 0x8)
    class UVerticalBox* close_vb;                                                     // 0x02A0 (size: 0x8)
    class USizeBox* devBranches_SizeBox;                                              // 0x02A8 (size: 0x8)
    class UdevCard_C* devCard_C_9;                                                    // 0x02B0 (size: 0x8)
    class UdevCard_C* devCard_C_24;                                                   // 0x02B8 (size: 0x8)
    class UdevCard_C* devCard_C_25;                                                   // 0x02C0 (size: 0x8)
    class UdevCard_C* devCard_C_28;                                                   // 0x02C8 (size: 0x8)
    class UdevCard_C* devCard_C_29;                                                   // 0x02D0 (size: 0x8)
    class UdevCard_C* devCard_C_32;                                                   // 0x02D8 (size: 0x8)
    class UdevCard_C* devCard_C_37;                                                   // 0x02E0 (size: 0x8)
    class UdevCard_C* devCard_C_38;                                                   // 0x02E8 (size: 0x8)
    class UdevCard_C* devCard_C_39;                                                   // 0x02F0 (size: 0x8)
    class UdevCard_C* devCard_C_42;                                                   // 0x02F8 (size: 0x8)
    class UdevLink_C* devLink;                                                        // 0x0300 (size: 0x8)
    class UdevLink_C* devLink_1;                                                      // 0x0308 (size: 0x8)
    class UdevLink_C* devLink_2;                                                      // 0x0310 (size: 0x8)
    class UdevLink_C* devLink_3;                                                      // 0x0318 (size: 0x8)
    class UdevLink_C* devLink_4;                                                      // 0x0320 (size: 0x8)
    class UdevLink_C* devLink_5;                                                      // 0x0328 (size: 0x8)
    class UdevLink_C* devLink_6;                                                      // 0x0330 (size: 0x8)
    class UdevLink_C* devLink_7;                                                      // 0x0338 (size: 0x8)
    class UdevLink_C* devLink_8;                                                      // 0x0340 (size: 0x8)
    class UdevLink_C* devLink_9;                                                      // 0x0348 (size: 0x8)
    class UdevLink_C* devLink_10;                                                     // 0x0350 (size: 0x8)
    class UdevLink_C* devLink_11;                                                     // 0x0358 (size: 0x8)
    class UScaleBox* devTree_ScaleBox;                                                // 0x0360 (size: 0x8)
    class UImage* gradient_img;                                                       // 0x0368 (size: 0x8)
    class UGridPanel* GridPanel_0;                                                    // 0x0370 (size: 0x8)
    class UHorizontalRadioSelect_C* HorizontalRadioSelect_MainCategories;             // 0x0378 (size: 0x8)
    class UImage* Image_2;                                                            // 0x0380 (size: 0x8)
    class UImage* Image_13;                                                           // 0x0388 (size: 0x8)
    class UImage* Image_18;                                                           // 0x0390 (size: 0x8)
    class UImage* Image_74;                                                           // 0x0398 (size: 0x8)
    class UImage* Image_82;                                                           // 0x03A0 (size: 0x8)
    class UImage* Image_133;                                                          // 0x03A8 (size: 0x8)
    class UlocalizedTextBox_C* localizedTextBox;                                      // 0x03B0 (size: 0x8)
    class UVerticalBox* main_vb;                                                      // 0x03B8 (size: 0x8)
    class USizeBox* MainSizeBox;                                                      // 0x03C0 (size: 0x8)
    class UTextBlock* name_txt;                                                       // 0x03C8 (size: 0x8)
    class UImage* paper_bg;                                                           // 0x03D0 (size: 0x8)
    class UHorizontalBox* policies_HB;                                                // 0x03D8 (size: 0x8)
    class UpolicyWidget_C* policyWidget;                                              // 0x03E0 (size: 0x8)
    class UpolicyWidget_C* policyWidget_1;                                            // 0x03E8 (size: 0x8)
    class UpolicyWidget_C* policyWidget_2;                                            // 0x03F0 (size: 0x8)
    class UpolicyWidget_C* policyWidget_3;                                            // 0x03F8 (size: 0x8)
    class UpolicyWidget_C* policyWidget_4;                                            // 0x0400 (size: 0x8)
    class UpolicyWidget_C* policyWidget_5;                                            // 0x0408 (size: 0x8)
    class UpolicyWidget_C* policyWidget_6;                                            // 0x0410 (size: 0x8)
    class UpolicyWidget_C* policyWidget_7;                                            // 0x0418 (size: 0x8)
    class UpolicyWidget_C* policyWidget_8;                                            // 0x0420 (size: 0x8)
    class UpolicyWidget_C* policyWidget_9;                                            // 0x0428 (size: 0x8)
    class UpolicyWidget_C* policyWidget_10;                                           // 0x0430 (size: 0x8)
    class UpolicyWidget_C* policyWidget_11;                                           // 0x0438 (size: 0x8)
    class UpolicyWidget_C* policyWidget_12;                                           // 0x0440 (size: 0x8)
    class UpolicyWidget_C* policyWidget_13;                                           // 0x0448 (size: 0x8)
    class UpolicyWidget_C* policyWidget_14;                                           // 0x0450 (size: 0x8)
    class UpolicyWidget_C* policyWidget_15;                                           // 0x0458 (size: 0x8)
    class UpolicyWidget_C* policyWidget_16;                                           // 0x0460 (size: 0x8)
    class UTextBlock* regionName;                                                     // 0x0468 (size: 0x8)
    class UImage* regionName_spacer;                                                  // 0x0470 (size: 0x8)
    class UTextBlock* regionName_txt;                                                 // 0x0478 (size: 0x8)
    class UButton* regionNextButton;                                                  // 0x0480 (size: 0x8)
    class UButton* regionPrevButton;                                                  // 0x0488 (size: 0x8)
    class UButton* rename_button_1;                                                   // 0x0490 (size: 0x8)
    class UmenuButton_C* return_button;                                               // 0x0498 (size: 0x8)
    class UBorder* ribbon;                                                            // 0x04A0 (size: 0x8)
    class UImage* settlementLv_Icon;                                                  // 0x04A8 (size: 0x8)
    class UdevelopmentBranchWidget_C* techButtWidget_C;                               // 0x04B0 (size: 0x8)
    class UdevelopmentBranchWidget_C* techButtWidget_C_1;                             // 0x04B8 (size: 0x8)
    class UdevelopmentBranchWidget_C* techButtWidget_C_2;                             // 0x04C0 (size: 0x8)
    class UdevelopmentBranchWidget_C* techButtWidget_C_3;                             // 0x04C8 (size: 0x8)
    class UdevelopmentBranchWidget_C* techButtWidget_C_4;                             // 0x04D0 (size: 0x8)
    class UdevelopmentBranchWidget_C* techButtWidget_C_5;                             // 0x04D8 (size: 0x8)
    class UdevelopmentBranchWidget_C* techButtWidget_C_6;                             // 0x04E0 (size: 0x8)
    class UdevelopmentBranchWidget_C* techButtWidget_C_7;                             // 0x04E8 (size: 0x8)
    class UdevelopmentBranchWidget_C* techButtWidget_C_8;                             // 0x04F0 (size: 0x8)
    class UdevelopmentBranchWidget_C* techButtWidget_C_9;                             // 0x04F8 (size: 0x8)
    class UdevelopmentBranchWidget_C* techButtWidget_C_10;                            // 0x0500 (size: 0x8)
    class UdevelopmentBranchWidget_C* techButtWidget_C_11;                            // 0x0508 (size: 0x8)
    class UdevelopmentBranchWidget_C* techButtWidget_C_12;                            // 0x0510 (size: 0x8)
    class UdevelopmentBranchWidget_C* techButtWidget_C_13;                            // 0x0518 (size: 0x8)
    class UdevelopmentBranchWidget_C* techButtWidget_C_14;                            // 0x0520 (size: 0x8)
    class UdevelopmentBranchWidget_C* techButtWidget_C_15;                            // 0x0528 (size: 0x8)
    class UdevelopmentBranchWidget_C* techButtWidget_C_16;                            // 0x0530 (size: 0x8)
    class UdevelopmentBranchWidget_C* techButtWidget_C_60;                            // 0x0538 (size: 0x8)
    class UdevelopmentBranchWidget_C* techButtWidget_C_61;                            // 0x0540 (size: 0x8)
    class UdevelopmentBranchWidget_C* techButtWidget_C_62;                            // 0x0548 (size: 0x8)
    class UdevelopmentBranchWidget_C* techButtWidget_C_63;                            // 0x0550 (size: 0x8)
    class UdevelopmentBranchWidget_C* techButtWidget_C_64;                            // 0x0558 (size: 0x8)
    class UdevelopmentBranchWidget_C* techButtWidget_C_65;                            // 0x0560 (size: 0x8)
    class UdevelopmentBranchWidget_C* techButtWidget_C_66;                            // 0x0568 (size: 0x8)
    class UdevelopmentBranchWidget_C* techButtWidget_C_67;                            // 0x0570 (size: 0x8)
    class UdevelopmentBranchWidget_C* techButtWidget_C_68;                            // 0x0578 (size: 0x8)
    class UdevelopmentBranchWidget_C* techButtWidget_C_69;                            // 0x0580 (size: 0x8)
    class UdevelopmentBranchWidget_C* techButtWidget_C_70;                            // 0x0588 (size: 0x8)
    class UdevelopmentBranchWidget_C* techButtWidget_C_71;                            // 0x0590 (size: 0x8)
    class UdevelopmentBranchWidget_C* techButtWidget_C_72;                            // 0x0598 (size: 0x8)
    class UdevelopmentBranchWidget_C* techButtWidget_C_73;                            // 0x05A0 (size: 0x8)
    class UdevelopmentBranchWidget_C* techButtWidget_C_74;                            // 0x05A8 (size: 0x8)
    class UdevelopmentBranchWidget_C* techButtWidget_C_77;                            // 0x05B0 (size: 0x8)
    class UdevelopmentBranchWidget_C* techButtWidget_C_79;                            // 0x05B8 (size: 0x8)
    class UdevelopmentBranchWidget_C* techButtWidget_C_81;                            // 0x05C0 (size: 0x8)
    class UdevelopmentBranchWidget_C* techButtWidget_C_82;                            // 0x05C8 (size: 0x8)
    class UdevelopmentBranchWidget_C* techButtWidget_C_87;                            // 0x05D0 (size: 0x8)
    class UdevelopmentBranchWidget_C* techButtWidget_C_88;                            // 0x05D8 (size: 0x8)
    class UdevelopmentBranchWidget_C* techButtWidget_C_94;                            // 0x05E0 (size: 0x8)
    class UdevelopmentBranchWidget_C* techButtWidget_C_95;                            // 0x05E8 (size: 0x8)
    class UdevelopmentBranchWidget_C* techButtWidget_C_97;                            // 0x05F0 (size: 0x8)
    class UdevelopmentBranchWidget_C* techButtWidget_C_98;                            // 0x05F8 (size: 0x8)
    class UCanvasPanel* techCanvas;                                                   // 0x0600 (size: 0x8)
    class UTextBlock* TextBlock_15;                                                   // 0x0608 (size: 0x8)
    class UTextBlock* TextBlock_209;                                                  // 0x0610 (size: 0x8)
    class ARegion* Region;                                                            // 0x0618 (size: 0x8)
    FVector TierHighlight;                                                            // 0x0620 (size: 0xC)
    float TierThres01;                                                                // 0x062C (size: 0x4)
    float deltaT;                                                                     // 0x0630 (size: 0x4)
    float TierThres02;                                                                // 0x0634 (size: 0x4)
    float TierThres03;                                                                // 0x0638 (size: 0x4)
    int32 numPointSpent;                                                              // 0x063C (size: 0x4)
    float treeZoomLv;                                                                 // 0x0640 (size: 0x4)
    bool Dragging;                                                                    // 0x0644 (size: 0x1)
    FVector2D prevMousePos2D;                                                         // 0x0648 (size: 0x8)
    FVector2D treeOffset;                                                             // 0x0650 (size: 0x8)
    FString currentCategory;                                                          // 0x0658 (size: 0x10)
    TArray<class UpolicyWidget_C*> allPolicyWidgets;                                  // 0x0668 (size: 0x10)

    void Find Link Nodes();
    void updatePolicies();
    void lerpInOutCategory(FString CategoryName, class UWidget*& Widget);
    FEventReply OnMouseButtonUp(FGeometry MyGeometry, const FPointerEvent& MouseEvent);
    FEventReply OnMouseButtonDown(FGeometry MyGeometry, const FPointerEvent& MouseEvent);
    FEventReply OnMouseWheel(FGeometry MyGeometry, const FPointerEvent& MouseEvent);
    void updateTranslation();
    void animateTierRings();
    void updateDevAttributes();
    void Close Development Points Available Entries DEPREC();
    void Tick(FGeometry MyGeometry, float InDeltaTime);
    void updateContents();
    void Construct();
    void PreConstruct(bool IsDesignTime);
    void Close();
    void BndEvt__developmentPanelTree_return_button_K2Node_ComponentBoundEvent_0_onReleased__DelegateSignature();
    void BndEvt__developmentPanelTree_rename_button_1_K2Node_ComponentBoundEvent_3_OnButtonReleasedEvent__DelegateSignature();
    void BndEvt__developmentPanelTree_HorizontalRadioSelect_K2Node_ComponentBoundEvent_4_RadioSelectedSignature__DelegateSignature(FString Value);
    void updatePoliciesEvent();
    void ExecuteUbergraph_developmentPanelTree(int32 EntryPoint);
}; // Size: 0x678

#endif
