#ifndef UE4SS_SDK_BM_DESTROYED_Windmill_HPP
#define UE4SS_SDK_BM_DESTROYED_Windmill_HPP

class ABM_DESTROYED_Windmill_C : public AStaticMeshActor
{
    class UStaticMeshComponent* Dirt_5_5;                                             // 0x0230 (size: 0x8)
    class UStaticMeshComponent* Dirt_2_6;                                             // 0x0238 (size: 0x8)
    class UStaticMeshComponent* Dirt_2_5;                                             // 0x0240 (size: 0x8)
    class UStaticMeshComponent* Dirt_5_4;                                             // 0x0248 (size: 0x8)
    class UStaticMeshComponent* Dirt_5_3;                                             // 0x0250 (size: 0x8)
    class UStaticMeshComponent* Dirt_5_2;                                             // 0x0258 (size: 0x8)
    class UStaticMeshComponent* dirt_0_1;                                             // 0x0260 (size: 0x8)
    class UStaticMeshComponent* MainBld_0;                                            // 0x0268 (size: 0x8)

}; // Size: 0x270

#endif
