#ifndef UE4SS_SDK_BM_HomelessTents_HPP
#define UE4SS_SDK_BM_HomelessTents_HPP

class ABM_HomelessTents_C : public AStaticMeshActor
{
    class UStaticMeshComponent* clutter_0;                                            // 0x0230 (size: 0x8)
    class USceneComponent* gatheringSpot;                                             // 0x0238 (size: 0x8)
    class UStaticMeshComponent* Dirt_3_2;                                             // 0x0240 (size: 0x8)
    class USceneComponent* ambience_flag;                                             // 0x0248 (size: 0x8)
    class USceneComponent* ambience_fireplace;                                        // 0x0250 (size: 0x8)
    class UStaticMeshComponent* lazyBld_48_2;                                         // 0x0258 (size: 0x8)
    class UStaticMeshComponent* clutter_12;                                           // 0x0260 (size: 0x8)
    class UStaticMeshComponent* MainBld_409_2;                                        // 0x0268 (size: 0x8)
    class UStaticMeshComponent* MainBld_409_3;                                        // 0x0270 (size: 0x8)
    class UStaticMeshComponent* PS_Smoke;                                             // 0x0278 (size: 0x8)
    class UStaticMeshComponent* Bld_401_2;                                            // 0x0280 (size: 0x8)
    class UStaticMeshComponent* lazyBld_48_0;                                         // 0x0288 (size: 0x8)
    class UStaticMeshComponent* lazyBld_48_1;                                         // 0x0290 (size: 0x8)
    class UStaticMeshComponent* MainBld_35;                                           // 0x0298 (size: 0x8)
    class UStaticMeshComponent* clutter_8;                                            // 0x02A0 (size: 0x8)
    class UStaticMeshComponent* clutter_7;                                            // 0x02A8 (size: 0x8)
    class UStaticMeshComponent* clutter_6;                                            // 0x02B0 (size: 0x8)
    class UStaticMeshComponent* clutter_1;                                            // 0x02B8 (size: 0x8)
    class UStaticMeshComponent* dirt_0_1;                                             // 0x02C0 (size: 0x8)
    class UStaticMeshComponent* MainBld_409;                                          // 0x02C8 (size: 0x8)

}; // Size: 0x2D0

#endif
