#ifndef UE4SS_SDK_BM_SG_Forager_HPP
#define UE4SS_SDK_BM_SG_Forager_HPP

class ABM_SG_Forager_C : public AStaticMeshActor
{
    class UStaticMeshComponent* clutter_stones15;                                     // 0x0230 (size: 0x8)
    class UStaticMeshComponent* clutter_stones14;                                     // 0x0238 (size: 0x8)
    class UStaticMeshComponent* clutter_stones13;                                     // 0x0240 (size: 0x8)
    class UStaticMeshComponent* clutter_stones12;                                     // 0x0248 (size: 0x8)
    class UStaticMeshComponent* clutter_stones11;                                     // 0x0250 (size: 0x8)
    class UStaticMeshComponent* clutter_stones10;                                     // 0x0258 (size: 0x8)
    class UStaticMeshComponent* clutter_stones9;                                      // 0x0260 (size: 0x8)
    class UStaticMeshComponent* clutter_stones8;                                      // 0x0268 (size: 0x8)
    class UStaticMeshComponent* clutter_stones7;                                      // 0x0270 (size: 0x8)
    class UStaticMeshComponent* res_16_1;                                             // 0x0278 (size: 0x8)
    class UStaticMeshComponent* res_16_0;                                             // 0x0280 (size: 0x8)
    class UStaticMeshComponent* clutter_1;                                            // 0x0288 (size: 0x8)
    class UStaticMeshComponent* clutter_0;                                            // 0x0290 (size: 0x8)
    class UStaticMeshComponent* res_171_9;                                            // 0x0298 (size: 0x8)
    class UStaticMeshComponent* res_171_8;                                            // 0x02A0 (size: 0x8)
    class UStaticMeshComponent* res_171_7;                                            // 0x02A8 (size: 0x8)
    class UStaticMeshComponent* res_171_6;                                            // 0x02B0 (size: 0x8)
    class UStaticMeshComponent* res_171_5;                                            // 0x02B8 (size: 0x8)
    class UStaticMeshComponent* res_171_4;                                            // 0x02C0 (size: 0x8)
    class UStaticMeshComponent* res_171_3;                                            // 0x02C8 (size: 0x8)
    class UStaticMeshComponent* Dirt_2_1;                                             // 0x02D0 (size: 0x8)
    class UStaticMeshComponent* Bld_401_7;                                            // 0x02D8 (size: 0x8)
    class UStaticMeshComponent* Bld_401_6;                                            // 0x02E0 (size: 0x8)
    class UStaticMeshComponent* Bld_401_5;                                            // 0x02E8 (size: 0x8)
    class UStaticMeshComponent* dirt_0_1;                                             // 0x02F0 (size: 0x8)
    class UStaticMeshComponent* Dirt_3_1;                                             // 0x02F8 (size: 0x8)
    class UStaticMeshComponent* MainBld_96;                                           // 0x0300 (size: 0x8)

}; // Size: 0x308

#endif
