#ifndef UE4SS_SDK_BM_Supplies_HPP
#define UE4SS_SDK_BM_Supplies_HPP

class ABM_Supplies_C : public AStaticMeshActor
{
    class UStaticMeshComponent* res_15_5;                                             // 0x0230 (size: 0x8)
    class UStaticMeshComponent* res_15_4;                                             // 0x0238 (size: 0x8)
    class UStaticMeshComponent* res_15_3;                                             // 0x0240 (size: 0x8)
    class UStaticMeshComponent* res_15_2;                                             // 0x0248 (size: 0x8)
    class UStaticMeshComponent* res_15_1;                                             // 0x0250 (size: 0x8)
    class UStaticMeshComponent* res_15_0;                                             // 0x0258 (size: 0x8)
    class UStaticMeshComponent* res_216_11;                                           // 0x0260 (size: 0x8)
    class UStaticMeshComponent* res_216_10;                                           // 0x0268 (size: 0x8)
    class UStaticMeshComponent* res_216_9;                                            // 0x0270 (size: 0x8)
    class UStaticMeshComponent* res_216_8;                                            // 0x0278 (size: 0x8)
    class UStaticMeshComponent* res_216_7;                                            // 0x0280 (size: 0x8)
    class UStaticMeshComponent* res_216_6;                                            // 0x0288 (size: 0x8)
    class UStaticMeshComponent* res_216_5;                                            // 0x0290 (size: 0x8)
    class UStaticMeshComponent* res_216_4;                                            // 0x0298 (size: 0x8)
    class UStaticMeshComponent* res_216_2;                                            // 0x02A0 (size: 0x8)
    class UStaticMeshComponent* res_216_1;                                            // 0x02A8 (size: 0x8)
    class UStaticMeshComponent* res_216_0;                                            // 0x02B0 (size: 0x8)
    class UStaticMeshComponent* res_172_4;                                            // 0x02B8 (size: 0x8)
    class UStaticMeshComponent* res_172_3;                                            // 0x02C0 (size: 0x8)
    class UStaticMeshComponent* res_172_2;                                            // 0x02C8 (size: 0x8)
    class UStaticMeshComponent* res_172_1;                                            // 0x02D0 (size: 0x8)
    class UStaticMeshComponent* res_172_0;                                            // 0x02D8 (size: 0x8)
    class UStaticMeshComponent* res_172;                                              // 0x02E0 (size: 0x8)
    class UStaticMeshComponent* res_16_19;                                            // 0x02E8 (size: 0x8)
    class UStaticMeshComponent* res_16_18;                                            // 0x02F0 (size: 0x8)
    class UStaticMeshComponent* res_16_17;                                            // 0x02F8 (size: 0x8)
    class UStaticMeshComponent* res_16_16;                                            // 0x0300 (size: 0x8)
    class UStaticMeshComponent* res_16_15;                                            // 0x0308 (size: 0x8)
    class UStaticMeshComponent* res_16_14;                                            // 0x0310 (size: 0x8)
    class UStaticMeshComponent* res_16_13;                                            // 0x0318 (size: 0x8)
    class UStaticMeshComponent* res_16_12;                                            // 0x0320 (size: 0x8)
    class UStaticMeshComponent* res_16_11;                                            // 0x0328 (size: 0x8)
    class UStaticMeshComponent* res_16_10;                                            // 0x0330 (size: 0x8)
    class UStaticMeshComponent* res_16_9;                                             // 0x0338 (size: 0x8)
    class UStaticMeshComponent* res_16_8;                                             // 0x0340 (size: 0x8)
    class UStaticMeshComponent* res_16_7;                                             // 0x0348 (size: 0x8)
    class UStaticMeshComponent* res_16_6;                                             // 0x0350 (size: 0x8)
    class UStaticMeshComponent* res_16_5;                                             // 0x0358 (size: 0x8)
    class UStaticMeshComponent* res_16_4;                                             // 0x0360 (size: 0x8)
    class UStaticMeshComponent* res_16_3;                                             // 0x0368 (size: 0x8)
    class UStaticMeshComponent* res_16_2;                                             // 0x0370 (size: 0x8)
    class UStaticMeshComponent* res_16_1;                                             // 0x0378 (size: 0x8)
    class UStaticMeshComponent* res_16_0;                                             // 0x0380 (size: 0x8)
    class UStaticMeshComponent* dirt_0_3;                                             // 0x0388 (size: 0x8)
    class UStaticMeshComponent* post;                                                 // 0x0390 (size: 0x8)

}; // Size: 0x398

#endif
