#ifndef UE4SS_SDK_c_campfire_HPP
#define UE4SS_SDK_c_campfire_HPP

class Ac_campfire_C : public AConstructionBP_C
{
    class UStaticMeshComponent* rop1;                                                 // 0x04B0 (size: 0x8)
    class UStaticMeshComponent* rop;                                                  // 0x04B8 (size: 0x8)
    class UStaticMeshComponent* Sctr_rock_granite_T_phxuF_LOD5_21_StaticMeshComponent0; // 0x04C0 (size: 0x8)
    class UStaticMeshComponent* Sctr_rock_granite_T_phxuF_LOD5_2_StaticMeshComponent0; // 0x04C8 (size: 0x8)
    class UStaticMeshComponent* Sctr_rock_granite_T_phxuF_LOD5_14_StaticMeshComponent0; // 0x04D0 (size: 0x8)
    class UStaticMeshComponent* Sctr_rock_granite_T_phxuF_LOD5_15_StaticMeshComponent0; // 0x04D8 (size: 0x8)
    class UStaticMeshComponent* Sctr_rock_granite_T_phxuF_LOD5_16_StaticMeshComponent0; // 0x04E0 (size: 0x8)
    class UStaticMeshComponent* Sctr_rock_granite_T_phxuF_LOD5_17_StaticMeshComponent0; // 0x04E8 (size: 0x8)
    class UStaticMeshComponent* Sctr_rock_granite_T_phxuF_LOD5_18_StaticMeshComponent0; // 0x04F0 (size: 0x8)
    class UStaticMeshComponent* Sctr_rock_granite_T_phxuF_LOD5_19_StaticMeshComponent0; // 0x04F8 (size: 0x8)
    class UStaticMeshComponent* Sctr_rock_granite_T_phxuF_LOD5_20_StaticMeshComponent0; // 0x0500 (size: 0x8)
    class UStaticMeshComponent* Sctr_rock_granite_T_phxuF_LOD5_1_StaticMeshComponent0; // 0x0508 (size: 0x8)
    class UStaticMeshComponent* Aset_rock_granite_M_raBbf_LOD5_StaticMeshComponent0;  // 0x0510 (size: 0x8)
    class UStaticMeshComponent* fire_StaticMeshComponent0;                            // 0x0518 (size: 0x8)
    class UStaticMeshComponent* fire3_StaticMeshComponent0;                           // 0x0520 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed90_StaticMeshComponent0;           // 0x0528 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed119_StaticMeshComponent0;          // 0x0530 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed120_StaticMeshComponent0;          // 0x0538 (size: 0x8)
    class UStaticMeshComponent* Firewood_Pack_LOD5_vbwhfi1iw_11_StaticMeshComponent0; // 0x0540 (size: 0x8)
    class UStaticMeshComponent* Firewood_Pack_LOD5_vbwhfi1iw_12_StaticMeshComponent0; // 0x0548 (size: 0x8)
    class UStaticMeshComponent* Firewood_Pack_LOD5_vbwhfi1iw_13_StaticMeshComponent0; // 0x0550 (size: 0x8)
    class USceneComponent* campfire_DefaultSceneRoot;                                 // 0x0558 (size: 0x8)

}; // Size: 0x560

#endif
