#ifndef UE4SS_SDK_c_cottage14m_HPP
#define UE4SS_SDK_c_cottage14m_HPP

class Ac_cottage14m_C : public AConstructionBP_C
{
    class UStaticMeshComponent* StaticMeshComponent066;                               // 0x04B0 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent064;                               // 0x04B8 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent063;                               // 0x04C0 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent062;                               // 0x04C8 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent061;                               // 0x04D0 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent060;                               // 0x04D8 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent059;                               // 0x04E0 (size: 0x8)
    class UStaticMeshComponent* StaticMesh44;                                         // 0x04E8 (size: 0x8)
    class UStaticMeshComponent* StaticMesh43;                                         // 0x04F0 (size: 0x8)
    class UStaticMeshComponent* StaticMesh42;                                         // 0x04F8 (size: 0x8)
    class UStaticMeshComponent* StaticMesh41;                                         // 0x0500 (size: 0x8)
    class UStaticMeshComponent* StaticMesh40;                                         // 0x0508 (size: 0x8)
    class UStaticMeshComponent* StaticMesh39;                                         // 0x0510 (size: 0x8)
    class UStaticMeshComponent* StaticMesh38;                                         // 0x0518 (size: 0x8)
    class UStaticMeshComponent* StaticMesh37;                                         // 0x0520 (size: 0x8)
    class UStaticMeshComponent* StaticMesh36;                                         // 0x0528 (size: 0x8)
    class UStaticMeshComponent* StaticMesh35;                                         // 0x0530 (size: 0x8)
    class UStaticMeshComponent* StaticMesh34;                                         // 0x0538 (size: 0x8)
    class UStaticMeshComponent* StaticMesh33;                                         // 0x0540 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent056;                               // 0x0548 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent055;                               // 0x0550 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent054;                               // 0x0558 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent053;                               // 0x0560 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent052;                               // 0x0568 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent050;                               // 0x0570 (size: 0x8)
    class UStaticMeshComponent* StaticMesh32;                                         // 0x0578 (size: 0x8)
    class UStaticMeshComponent* StaticMesh31;                                         // 0x0580 (size: 0x8)
    class UStaticMeshComponent* StaticMesh30;                                         // 0x0588 (size: 0x8)
    class UStaticMeshComponent* StaticMesh29;                                         // 0x0590 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent029;                               // 0x0598 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent028;                               // 0x05A0 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent027;                               // 0x05A8 (size: 0x8)
    class UStaticMeshComponent* owidzDoorA_resym;                                     // 0x05B0 (size: 0x8)
    class UStaticMeshComponent* StaticMesh2;                                          // 0x05B8 (size: 0x8)
    class UStaticMeshComponent* StaticMesh27;                                         // 0x05C0 (size: 0x8)
    class UStaticMeshComponent* StaticMesh26;                                         // 0x05C8 (size: 0x8)
    class UStaticMeshComponent* StaticMesh25;                                         // 0x05D0 (size: 0x8)
    class UStaticMeshComponent* StaticMesh24;                                         // 0x05D8 (size: 0x8)
    class UStaticMeshComponent* StaticMesh23;                                         // 0x05E0 (size: 0x8)
    class UStaticMeshComponent* StaticMesh22;                                         // 0x05E8 (size: 0x8)
    class UStaticMeshComponent* StaticMesh21;                                         // 0x05F0 (size: 0x8)
    class UStaticMeshComponent* StaticMesh20;                                         // 0x05F8 (size: 0x8)
    class UStaticMeshComponent* StaticMesh19;                                         // 0x0600 (size: 0x8)
    class UStaticMeshComponent* StaticMesh18;                                         // 0x0608 (size: 0x8)
    class UStaticMeshComponent* StaticMesh17;                                         // 0x0610 (size: 0x8)
    class UStaticMeshComponent* StaticMesh15;                                         // 0x0618 (size: 0x8)
    class UStaticMeshComponent* StaticMesh14;                                         // 0x0620 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent01;                                // 0x0628 (size: 0x8)
    class UStaticMeshComponent* StaticMesh12;                                         // 0x0630 (size: 0x8)
    class UStaticMeshComponent* StaticMesh11;                                         // 0x0638 (size: 0x8)
    class UStaticMeshComponent* owidzFenceHighPlaneCentered;                          // 0x0640 (size: 0x8)
    class UStaticMeshComponent* StaticMesh1;                                          // 0x0648 (size: 0x8)
    class UStaticMeshComponent* StaticMesh;                                           // 0x0650 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent065;                               // 0x0658 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent051;                               // 0x0660 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent049;                               // 0x0668 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent048;                               // 0x0670 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent047;                               // 0x0678 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent046;                               // 0x0680 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent045;                               // 0x0688 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent044;                               // 0x0690 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent043;                               // 0x0698 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent042;                               // 0x06A0 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent040;                               // 0x06A8 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent039;                               // 0x06B0 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent038;                               // 0x06B8 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent037;                               // 0x06C0 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent036;                               // 0x06C8 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent035;                               // 0x06D0 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent034;                               // 0x06D8 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent033;                               // 0x06E0 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent026;                               // 0x06E8 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent025;                               // 0x06F0 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent024;                               // 0x06F8 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent023;                               // 0x0700 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent022;                               // 0x0708 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent021;                               // 0x0710 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent020;                               // 0x0718 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent019;                               // 0x0720 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent016;                               // 0x0728 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent015;                               // 0x0730 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent014;                               // 0x0738 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent013;                               // 0x0740 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent012;                               // 0x0748 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent011;                               // 0x0750 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent010;                               // 0x0758 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent09;                                // 0x0760 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent08;                                // 0x0768 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent07;                                // 0x0770 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent06;                                // 0x0778 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent05;                                // 0x0780 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent04;                                // 0x0788 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent03;                                // 0x0790 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent02;                                // 0x0798 (size: 0x8)
    class UStaticMeshComponent* StaticMesh13;                                         // 0x07A0 (size: 0x8)

}; // Size: 0x7A8

#endif
