#ifndef UE4SS_SDK_C_SkinningRack_HPP
#define UE4SS_SDK_C_SkinningRack_HPP

class AC_SkinningRack_C : public AConstructionBP_C
{
    class UStaticMeshComponent* ropeKnotA36_StaticMeshComponent0;                     // 0x04B0 (size: 0x8)
    class UStaticMeshComponent* ropeKnotA35_StaticMeshComponent0;                     // 0x04B8 (size: 0x8)
    class UStaticMeshComponent* all_aboard_pivot_boardA108_StaticMeshComponent0;      // 0x04C0 (size: 0x8)
    class UStaticMeshComponent* ropeKnotA34_StaticMeshComponent0;                     // 0x04C8 (size: 0x8)
    class UStaticMeshComponent* ropeKnotA33_StaticMeshComponent0;                     // 0x04D0 (size: 0x8)
    class UStaticMeshComponent* ropeShort12_StaticMeshComponent0;                     // 0x04D8 (size: 0x8)
    class UStaticMeshComponent* ropeShort11_StaticMeshComponent0;                     // 0x04E0 (size: 0x8)
    class UStaticMeshComponent* ropeShort10_StaticMeshComponent0;                     // 0x04E8 (size: 0x8)
    class USceneComponent* sg_skinningRack_holder4_DefaultSceneRoot;                  // 0x04F0 (size: 0x8)
    class UStaticMeshComponent* ropeKnotA32_StaticMeshComponent0;                     // 0x04F8 (size: 0x8)
    class UStaticMeshComponent* ropeKnotA31_StaticMeshComponent0;                     // 0x0500 (size: 0x8)
    class UStaticMeshComponent* all_aboard_pivot_boardA107_StaticMeshComponent0;      // 0x0508 (size: 0x8)
    class UStaticMeshComponent* ropeKnotA30_StaticMeshComponent0;                     // 0x0510 (size: 0x8)
    class UStaticMeshComponent* ropeKnotA29_StaticMeshComponent0;                     // 0x0518 (size: 0x8)
    class UStaticMeshComponent* ropeShort9_StaticMeshComponent0;                      // 0x0520 (size: 0x8)
    class UStaticMeshComponent* ropeShort8_StaticMeshComponent0;                      // 0x0528 (size: 0x8)
    class UStaticMeshComponent* ropeShort7_StaticMeshComponent0;                      // 0x0530 (size: 0x8)
    class USceneComponent* sg_skinningRack_holder3_DefaultSceneRoot;                  // 0x0538 (size: 0x8)
    class UStaticMeshComponent* Common_Spruce_Branch_LOD5_uehjahtfa151_StaticMeshComponent0; // 0x0540 (size: 0x8)
    class UStaticMeshComponent* Common_Spruce_Branch_LOD5_uehjahtfa150_StaticMeshComponent0; // 0x0548 (size: 0x8)
    class UStaticMeshComponent* Common_Spruce_Branch_LOD5_uehjahtfa137_StaticMeshComponent0; // 0x0550 (size: 0x8)
    class UStaticMeshComponent* Common_Spruce_Branch_LOD5_uehjahtfa135_StaticMeshComponent0; // 0x0558 (size: 0x8)
    class UStaticMeshComponent* Common_Spruce_Branch_LOD5_uehjahtfa134_StaticMeshComponent0; // 0x0560 (size: 0x8)
    class USceneComponent* sg_skinningRack2_DefaultSceneRoot;                         // 0x0568 (size: 0x8)

}; // Size: 0x570

#endif
