#ifndef UE4SS_SDK_C_TatteredTentA_HPP
#define UE4SS_SDK_C_TatteredTentA_HPP

class AC_TatteredTentA_C : public AConstructionBP_C
{
    class UStaticMeshComponent* tentsAllCentered_Object004_StaticMeshComponent0;      // 0x04B0 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed_long206_StaticMeshComponent0;     // 0x04B8 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed_long207_StaticMeshComponent0;     // 0x04C0 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed_long209_StaticMeshComponent0;     // 0x04C8 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed_long210_StaticMeshComponent0;     // 0x04D0 (size: 0x8)
    class UStaticMeshComponent* SM_Rope39_StaticMeshComponent0;                       // 0x04D8 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed_long208_StaticMeshComponent0;     // 0x04E0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly_StaticMeshComponent0;      // 0x04E8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly2_StaticMeshComponent0;     // 0x04F0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly3_StaticMeshComponent0;     // 0x04F8 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed_long204_StaticMeshComponent0;     // 0x0500 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed_long205_StaticMeshComponent0;     // 0x0508 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly4_StaticMeshComponent0;     // 0x0510 (size: 0x8)

}; // Size: 0x518

#endif
