#ifndef UE4SS_SDK_UI_UnitStats_HPP
#define UE4SS_SDK_UI_UnitStats_HPP

struct FUI_UnitStats
{
    float att_4_743CC385435A93220804DFB500578A6D;                                     // 0x0000 (size: 0x4)
    float def_6_C1D6393C4D639F88145AA0BAD8B4D1F9;                                     // 0x0004 (size: 0x4)
    float shield_8_3343CF1D48C153ADC38F9CA59042BE38;                                  // 0x0008 (size: 0x4)
    float charge_10_ECDCC4E246EDAF9CB0146EA73F3EC957;                                 // 0x000C (size: 0x4)
    float charge-stop_12_3FC579044C0C73538A4EAD96865C7188;                            // 0x0010 (size: 0x4)
    float speed_14_5E50DA5C4A10E499171DD8B7E0ACA2DA;                                  // 0x0014 (size: 0x4)
    float ranged_16_E99380C54A0519CA7C9BC79ED0FB4978;                                 // 0x0018 (size: 0x4)
    float antiarmour_18_7A2DFAF74CD54F4EDAD36EA77D0182FD;                             // 0x001C (size: 0x4)
    float range_20_65B7D4B24A371C9FC898E18B9A10CFD9;                                  // 0x0020 (size: 0x4)
    float shootingrange_22_EDACF7874690FDF308BD8C998223F207;                          // 0x0024 (size: 0x4)

}; // Size: 0x28

#endif
