#ifndef UE4SS_SDK_BM_CorpsePit_HPP
#define UE4SS_SDK_BM_CorpsePit_HPP

class ABM_CorpsePit_C : public AStaticMeshActor
{
    class UStaticMeshComponent* Dirt_6_7;                                             // 0x02A0 (size: 0x8)
    class USceneComponent* exclusion_0;                                               // 0x02A8 (size: 0x8)
    class USceneComponent* workPos_4;                                                 // 0x02B0 (size: 0x8)
    class USceneComponent* workPos_3;                                                 // 0x02B8 (size: 0x8)
    class USceneComponent* workPos_2;                                                 // 0x02C0 (size: 0x8)
    class USceneComponent* workPos_1;                                                 // 0x02C8 (size: 0x8)
    class USceneComponent* workPos_0;                                                 // 0x02D0 (size: 0x8)
    class UStaticMeshComponent* bld_0;                                                // 0x02D8 (size: 0x8)
    class UStaticMeshComponent* bld_00;                                               // 0x02E0 (size: 0x8)

}; // Size: 0x2E8

#endif
