#ifndef UE4SS_SDK_BM_SG_Cottage_LV2_A_HPP
#define UE4SS_SDK_BM_SG_Cottage_LV2_A_HPP

class ABM_SG_Cottage_LV2_A_C : public AStaticMeshActor
{
    class UStaticMeshComponent* FullBld_477;                                          // 0x02A0 (size: 0x8)
    class UStaticMeshComponent* clutter_52;                                           // 0x02A8 (size: 0x8)
    class UStaticMeshComponent* Dirt_3_1;                                             // 0x02B0 (size: 0x8)
    class UStaticMeshComponent* clutter_51;                                           // 0x02B8 (size: 0x8)
    class UStaticMeshComponent* clutter_49;                                           // 0x02C0 (size: 0x8)
    class UStaticMeshComponent* clutter_pavement6;                                    // 0x02C8 (size: 0x8)
    class UStaticMeshComponent* res_16_1;                                             // 0x02D0 (size: 0x8)
    class UStaticMeshComponent* res_16_0;                                             // 0x02D8 (size: 0x8)
    class UStaticMeshComponent* clutter_46;                                           // 0x02E0 (size: 0x8)
    class UStaticMeshComponent* clutter_45;                                           // 0x02E8 (size: 0x8)
    class UStaticMeshComponent* clutter_13;                                           // 0x02F0 (size: 0x8)
    class UStaticMeshComponent* clutter_12;                                           // 0x02F8 (size: 0x8)
    class UStaticMeshComponent* Dirt_0_0;                                             // 0x0300 (size: 0x8)
    class UStaticMeshComponent* clutter_48;                                           // 0x0308 (size: 0x8)
    class UStaticMeshComponent* clutter_47;                                           // 0x0310 (size: 0x8)
    class UStaticMeshComponent* MainBld_27;                                           // 0x0318 (size: 0x8)

}; // Size: 0x320

#endif
