#ifndef UE4SS_SDK_BM_SG_Townhouse_LV3_EmptyBPart_3_Wide_HPP
#define UE4SS_SDK_BM_SG_Townhouse_LV3_EmptyBPart_3_Wide_HPP

class ABM_SG_Townhouse_LV3_EmptyBPart_3_Wide_C : public AStaticMeshActor
{
    class UStaticMeshComponent* clutter_15;                                           // 0x02A0 (size: 0x8)
    class UStaticMeshComponent* clutter_14;                                           // 0x02A8 (size: 0x8)
    class UStaticMeshComponent* clutter_9;                                            // 0x02B0 (size: 0x8)
    class UStaticMeshComponent* clutter_pavement7;                                    // 0x02B8 (size: 0x8)
    class UStaticMeshComponent* clutter_48;                                           // 0x02C0 (size: 0x8)
    class UStaticMeshComponent* clutter_47;                                           // 0x02C8 (size: 0x8)
    class UStaticMeshComponent* clutter_46;                                           // 0x02D0 (size: 0x8)
    class UStaticMeshComponent* clutter_45;                                           // 0x02D8 (size: 0x8)
    class UStaticMeshComponent* clutter_13;                                           // 0x02E0 (size: 0x8)
    class UStaticMeshComponent* clutter_12;                                           // 0x02E8 (size: 0x8)
    class UStaticMeshComponent* Dirt_0_0;                                             // 0x02F0 (size: 0x8)
    class UStaticMeshComponent* MainBld_465;                                          // 0x02F8 (size: 0x8)
    class UStaticMeshComponent* clutter_16;                                           // 0x0300 (size: 0x8)
    class USceneComponent* Scene;                                                     // 0x0308 (size: 0x8)

}; // Size: 0x310

#endif
