#ifndef UE4SS_SDK_BM_SG_Ext_HayShed_HPP
#define UE4SS_SDK_BM_SG_Ext_HayShed_HPP

class ABM_SG_Ext_HayShed_C : public AStaticMeshActor
{
    class UStaticMeshComponent* clutter_16;                                           // 0x02A0 (size: 0x8)
    class UStaticMeshComponent* clutter_tub2;                                         // 0x02A8 (size: 0x8)
    class UStaticMeshComponent* clutter_tub1;                                         // 0x02B0 (size: 0x8)
    class UStaticMeshComponent* clutter_tub;                                          // 0x02B8 (size: 0x8)
    class UStaticMeshComponent* clutter_9;                                            // 0x02C0 (size: 0x8)
    class UStaticMeshComponent* clutter_pavement1;                                    // 0x02C8 (size: 0x8)
    class UStaticMeshComponent* R;                                                    // 0x02D0 (size: 0x8)
    class UStaticMeshComponent* clutter_hay;                                          // 0x02D8 (size: 0x8)
    class UStaticMeshComponent* bld_0_foundationStone_7;                              // 0x02E0 (size: 0x8)
    class UStaticMeshComponent* bld_0_foundationStone_6;                              // 0x02E8 (size: 0x8)
    class UStaticMeshComponent* bld_0_foundationStone_5;                              // 0x02F0 (size: 0x8)
    class UStaticMeshComponent* bld_0_foundationStone_4;                              // 0x02F8 (size: 0x8)
    class UStaticMeshComponent* bld_0_foundationStone_3;                              // 0x0300 (size: 0x8)
    class UStaticMeshComponent* bld_0_foundationStone_2;                              // 0x0308 (size: 0x8)
    class UStaticMeshComponent* bld_0_foundationStone_1;                              // 0x0310 (size: 0x8)
    class UStaticMeshComponent* bld_0_foundationStone_0;                              // 0x0318 (size: 0x8)
    class USceneComponent* workpos1;                                                  // 0x0320 (size: 0x8)
    class USceneComponent* workPos;                                                   // 0x0328 (size: 0x8)
    class UStaticMeshComponent* Dirt_3_2;                                             // 0x0330 (size: 0x8)
    class UStaticMeshComponent* clutter_stones8;                                      // 0x0338 (size: 0x8)
    class UStaticMeshComponent* clutter_stones7;                                      // 0x0340 (size: 0x8)
    class UStaticMeshComponent* clutter_stones3;                                      // 0x0348 (size: 0x8)
    class UStaticMeshComponent* clutter_stones2;                                      // 0x0350 (size: 0x8)
    class UStaticMeshComponent* clutter_stones1;                                      // 0x0358 (size: 0x8)
    class UStaticMeshComponent* Dirt_0_0;                                             // 0x0360 (size: 0x8)
    class UStaticMeshComponent* FullBld_481;                                          // 0x0368 (size: 0x8)

}; // Size: 0x370

#endif
