#ifndef UE4SS_SDK_BM_SG_ClayFurnace_HPP
#define UE4SS_SDK_BM_SG_ClayFurnace_HPP

class ABM_SG_ClayFurnace_C : public AStaticMeshActor
{
    class UStaticMeshComponent* res_269_9;                                            // 0x02A0 (size: 0x8)
    class UStaticMeshComponent* res_269_8;                                            // 0x02A8 (size: 0x8)
    class UStaticMeshComponent* res_269_7;                                            // 0x02B0 (size: 0x8)
    class UStaticMeshComponent* res_269_6;                                            // 0x02B8 (size: 0x8)
    class UStaticMeshComponent* res_269_5;                                            // 0x02C0 (size: 0x8)
    class UStaticMeshComponent* res_269_4;                                            // 0x02C8 (size: 0x8)
    class UStaticMeshComponent* res_269_3;                                            // 0x02D0 (size: 0x8)
    class UStaticMeshComponent* res_269_2;                                            // 0x02D8 (size: 0x8)
    class UStaticMeshComponent* res_269_1;                                            // 0x02E0 (size: 0x8)
    class UStaticMeshComponent* res_269_0;                                            // 0x02E8 (size: 0x8)
    class UStaticMeshComponent* res_146_2;                                            // 0x02F0 (size: 0x8)
    class UStaticMeshComponent* res_146_1;                                            // 0x02F8 (size: 0x8)
    class UStaticMeshComponent* res_146;                                              // 0x0300 (size: 0x8)
    class UStaticMeshComponent* FullBld_440;                                          // 0x0308 (size: 0x8)
    class UStaticMeshComponent* FullBld_439;                                          // 0x0310 (size: 0x8)
    class UStaticMeshComponent* bld_0_10;                                             // 0x0318 (size: 0x8)
    class USceneComponent* workPos_3;                                                 // 0x0320 (size: 0x8)
    class USceneComponent* workPos_2;                                                 // 0x0328 (size: 0x8)
    class USceneComponent* workPos_1;                                                 // 0x0330 (size: 0x8)
    class USceneComponent* workPos_0;                                                 // 0x0338 (size: 0x8)
    class UStaticMeshComponent* bld_0_9;                                              // 0x0340 (size: 0x8)
    class UStaticMeshComponent* clutter_9;                                            // 0x0348 (size: 0x8)
    class UStaticMeshComponent* clutter_6;                                            // 0x0350 (size: 0x8)
    class UStaticMeshComponent* clutter_5;                                            // 0x0358 (size: 0x8)
    class UStaticMeshComponent* bld_0_8;                                              // 0x0360 (size: 0x8)
    class UStaticMeshComponent* res_16_5;                                             // 0x0368 (size: 0x8)
    class UStaticMeshComponent* res_16_4;                                             // 0x0370 (size: 0x8)
    class UStaticMeshComponent* res_16_3;                                             // 0x0378 (size: 0x8)
    class UStaticMeshComponent* res_16_2;                                             // 0x0380 (size: 0x8)
    class UStaticMeshComponent* Dirt_3_2;                                             // 0x0388 (size: 0x8)
    class UStaticMeshComponent* Dirt_0_0;                                             // 0x0390 (size: 0x8)
    class UStaticMeshComponent* FullBld_468;                                          // 0x0398 (size: 0x8)
    class UStaticMeshComponent* Dirt_3_0;                                             // 0x03A0 (size: 0x8)
    class UStaticMeshComponent* MainBld_466;                                          // 0x03A8 (size: 0x8)
    class UStaticMeshComponent* MainBld_467;                                          // 0x03B0 (size: 0x8)
    class USceneComponent* Scene;                                                     // 0x03B8 (size: 0x8)

}; // Size: 0x3C0

#endif
