#ifndef UE4SS_SDK_BM_SG_Tavern_LV1_HPP
#define UE4SS_SDK_BM_SG_Tavern_LV1_HPP

class ABM_SG_Tavern_LV1_C : public AStaticMeshActor
{
    class USceneComponent* workPos_8;                                                 // 0x02A0 (size: 0x8)
    class USceneComponent* workPos_7;                                                 // 0x02A8 (size: 0x8)
    class USceneComponent* workPos_6;                                                 // 0x02B0 (size: 0x8)
    class USceneComponent* workPos_5;                                                 // 0x02B8 (size: 0x8)
    class USceneComponent* workPos_4;                                                 // 0x02C0 (size: 0x8)
    class USceneComponent* workPos_3;                                                 // 0x02C8 (size: 0x8)
    class USceneComponent* workPos_2;                                                 // 0x02D0 (size: 0x8)
    class USceneComponent* workPos_1;                                                 // 0x02D8 (size: 0x8)
    class USceneComponent* workPos_0;                                                 // 0x02E0 (size: 0x8)
    class UStaticMeshComponent* clutter_dirt5;                                        // 0x02E8 (size: 0x8)
    class UStaticMeshComponent* clutter_dirt4;                                        // 0x02F0 (size: 0x8)
    class UStaticMeshComponent* clutter_dirt3;                                        // 0x02F8 (size: 0x8)
    class UStaticMeshComponent* clutter_dirt2;                                        // 0x0300 (size: 0x8)
    class UStaticMeshComponent* clutter_dirt1;                                        // 0x0308 (size: 0x8)
    class UStaticMeshComponent* clutter_dirt;                                         // 0x0310 (size: 0x8)
    class UStaticMeshComponent* clutter_barrel_9;                                     // 0x0318 (size: 0x8)
    class UStaticMeshComponent* res_28_6;                                             // 0x0320 (size: 0x8)
    class UStaticMeshComponent* res_28_5;                                             // 0x0328 (size: 0x8)
    class UStaticMeshComponent* res_28_4;                                             // 0x0330 (size: 0x8)
    class UStaticMeshComponent* res_28_3;                                             // 0x0338 (size: 0x8)
    class UStaticMeshComponent* res_28_2;                                             // 0x0340 (size: 0x8)
    class UStaticMeshComponent* res_28_1;                                             // 0x0348 (size: 0x8)
    class UStaticMeshComponent* res_28_0;                                             // 0x0350 (size: 0x8)
    class UStaticMeshComponent* clutter_barrel_2;                                     // 0x0358 (size: 0x8)
    class UStaticMeshComponent* clutter_barrel_5;                                     // 0x0360 (size: 0x8)
    class UStaticMeshComponent* clutter_rope;                                         // 0x0368 (size: 0x8)
    class UStaticMeshComponent* clutter_barrel_1;                                     // 0x0370 (size: 0x8)
    class UStaticMeshComponent* clutter_barrel_0;                                     // 0x0378 (size: 0x8)
    class UStaticMeshComponent* Dirt_3_3;                                             // 0x0380 (size: 0x8)
    class UStaticMeshComponent* Dirt_0_2;                                             // 0x0388 (size: 0x8)
    class UStaticMeshComponent* bld_432;                                              // 0x0390 (size: 0x8)
    class UStaticMeshComponent* Bld_401_13;                                           // 0x0398 (size: 0x8)
    class UStaticMeshComponent* Bld_401_12;                                           // 0x03A0 (size: 0x8)
    class UStaticMeshComponent* Bld_401_11;                                           // 0x03A8 (size: 0x8)
    class UStaticMeshComponent* Bld_401_10;                                           // 0x03B0 (size: 0x8)
    class UStaticMeshComponent* Bld_401_9;                                            // 0x03B8 (size: 0x8)
    class UStaticMeshComponent* Bld_401_8;                                            // 0x03C0 (size: 0x8)
    class UStaticMeshComponent* Bld_401_7;                                            // 0x03C8 (size: 0x8)
    class UStaticMeshComponent* Bld_401_6;                                            // 0x03D0 (size: 0x8)
    class UStaticMeshComponent* Bld_401_5;                                            // 0x03D8 (size: 0x8)
    class UStaticMeshComponent* Bld_401_4;                                            // 0x03E0 (size: 0x8)
    class UStaticMeshComponent* Bld_401_3;                                            // 0x03E8 (size: 0x8)
    class UStaticMeshComponent* Bld_401_2;                                            // 0x03F0 (size: 0x8)
    class UStaticMeshComponent* Bld_401_1;                                            // 0x03F8 (size: 0x8)
    class UStaticMeshComponent* Bld_401_0;                                            // 0x0400 (size: 0x8)
    class UStaticMeshComponent* MainBld_429;                                          // 0x0408 (size: 0x8)
    class UStaticMeshComponent* clutter_ench7;                                        // 0x0410 (size: 0x8)
    class UStaticMeshComponent* clutter_table3;                                       // 0x0418 (size: 0x8)
    class UStaticMeshComponent* clutter_ench6;                                        // 0x0420 (size: 0x8)
    class UStaticMeshComponent* clutter_table2;                                       // 0x0428 (size: 0x8)
    class UStaticMeshComponent* clutter_ench5;                                        // 0x0430 (size: 0x8)
    class UStaticMeshComponent* clutter_ench4;                                        // 0x0438 (size: 0x8)
    class UStaticMeshComponent* clutter_ench3;                                        // 0x0440 (size: 0x8)
    class UStaticMeshComponent* clutter_ench2;                                        // 0x0448 (size: 0x8)
    class UStaticMeshComponent* clutter_ench1;                                        // 0x0450 (size: 0x8)
    class UStaticMeshComponent* clutter_dont_use_the_word_ench;                       // 0x0458 (size: 0x8)
    class UStaticMeshComponent* clutter_table1;                                       // 0x0460 (size: 0x8)
    class UStaticMeshComponent* clutter_table;                                        // 0x0468 (size: 0x8)
    class UStaticMeshComponent* clutter_cobble2;                                      // 0x0470 (size: 0x8)
    class UStaticMeshComponent* clutter_cobble1;                                      // 0x0478 (size: 0x8)
    class UStaticMeshComponent* clutter_cobble;                                       // 0x0480 (size: 0x8)
    class UStaticMeshComponent* Dirt_0_1;                                             // 0x0488 (size: 0x8)
    class UStaticMeshComponent* Dirt_3_2;                                             // 0x0490 (size: 0x8)
    class UStaticMeshComponent* Dirt_3_1;                                             // 0x0498 (size: 0x8)
    class UStaticMeshComponent* FullBld_431;                                          // 0x04A0 (size: 0x8)
    class UStaticMeshComponent* Dirt_0_0;                                             // 0x04A8 (size: 0x8)
    class UStaticMeshComponent* FullBld_430;                                          // 0x04B0 (size: 0x8)
    class UStaticMeshComponent* Dirt_3_0;                                             // 0x04B8 (size: 0x8)
    class USceneComponent* Scene;                                                     // 0x04C0 (size: 0x8)

}; // Size: 0x4C8

#endif
