#ifndef UE4SS_SDK_BM_SG_Townhouse_LV3_BPart_B_HPP
#define UE4SS_SDK_BM_SG_Townhouse_LV3_BPart_B_HPP

class ABM_SG_Townhouse_LV3_BPart_B_C : public AStaticMeshActor
{
    class UStaticMeshComponent* clutter_51;                                           // 0x02A0 (size: 0x8)
    class UStaticMeshComponent* clutter_50;                                           // 0x02A8 (size: 0x8)
    class UStaticMeshComponent* clutter_49;                                           // 0x02B0 (size: 0x8)
    class UStaticMeshComponent* clutter_pavement9;                                    // 0x02B8 (size: 0x8)
    class UStaticMeshComponent* clutter_pavement6;                                    // 0x02C0 (size: 0x8)
    class UStaticMeshComponent* clutter_pavement5;                                    // 0x02C8 (size: 0x8)
    class UStaticMeshComponent* clutter_48;                                           // 0x02D0 (size: 0x8)
    class UStaticMeshComponent* clutter_47;                                           // 0x02D8 (size: 0x8)
    class UStaticMeshComponent* clutter_46;                                           // 0x02E0 (size: 0x8)
    class UStaticMeshComponent* clutter_45;                                           // 0x02E8 (size: 0x8)
    class UStaticMeshComponent* clutter_13;                                           // 0x02F0 (size: 0x8)
    class UStaticMeshComponent* clutter_12;                                           // 0x02F8 (size: 0x8)
    class UStaticMeshComponent* Dirt_0_0;                                             // 0x0300 (size: 0x8)
    class UStaticMeshComponent* dirt_4_0;                                             // 0x0308 (size: 0x8)
    class UStaticMeshComponent* MainBld_454;                                          // 0x0310 (size: 0x8)

}; // Size: 0x318

#endif
