#ifndef UE4SS_SDK_BM_SG_Farm1_HPP
#define UE4SS_SDK_BM_SG_Farm1_HPP

class ABM_SG_Farm1_C : public AStaticMeshActor
{
    class UStaticMeshComponent* Bench_298_7;                                          // 0x02A0 (size: 0x8)
    class UStaticMeshComponent* Bench_298_6;                                          // 0x02A8 (size: 0x8)
    class UStaticMeshComponent* Bench_298_5;                                          // 0x02B0 (size: 0x8)
    class UStaticMeshComponent* Bench_298_4;                                          // 0x02B8 (size: 0x8)
    class UStaticMeshComponent* Bench_298_3;                                          // 0x02C0 (size: 0x8)
    class UStaticMeshComponent* Bench_298_2;                                          // 0x02C8 (size: 0x8)
    class UStaticMeshComponent* Bench_298_1;                                          // 0x02D0 (size: 0x8)
    class UStaticMeshComponent* Bench_298_0;                                          // 0x02D8 (size: 0x8)
    class UStaticMeshComponent* Bld_401_16;                                           // 0x02E0 (size: 0x8)
    class UStaticMeshComponent* Res_165_18;                                           // 0x02E8 (size: 0x8)
    class UStaticMeshComponent* Res_165_17;                                           // 0x02F0 (size: 0x8)
    class UStaticMeshComponent* Res_165_16;                                           // 0x02F8 (size: 0x8)
    class UStaticMeshComponent* Res_165_15;                                           // 0x0300 (size: 0x8)
    class UStaticMeshComponent* Res_165_14;                                           // 0x0308 (size: 0x8)
    class UStaticMeshComponent* Res_165_13;                                           // 0x0310 (size: 0x8)
    class UStaticMeshComponent* Res_11_1;                                             // 0x0318 (size: 0x8)
    class UStaticMeshComponent* Res_11_0;                                             // 0x0320 (size: 0x8)
    class UStaticMeshComponent* res_1_1;                                              // 0x0328 (size: 0x8)
    class UStaticMeshComponent* res_1_0;                                              // 0x0330 (size: 0x8)
    class UStaticMeshComponent* res_1_7;                                              // 0x0338 (size: 0x8)
    class UStaticMeshComponent* res_1_6;                                              // 0x0340 (size: 0x8)
    class UStaticMeshComponent* res_1_5;                                              // 0x0348 (size: 0x8)
    class UStaticMeshComponent* res_1_4;                                              // 0x0350 (size: 0x8)
    class UStaticMeshComponent* res_1_3;                                              // 0x0358 (size: 0x8)
    class UStaticMeshComponent* res_1_2;                                              // 0x0360 (size: 0x8)
    class USceneComponent* Scene;                                                     // 0x0368 (size: 0x8)
    class UStaticMeshComponent* res_16_4;                                             // 0x0370 (size: 0x8)
    class UStaticMeshComponent* res_16_3;                                             // 0x0378 (size: 0x8)
    class UStaticMeshComponent* res_16_2;                                             // 0x0380 (size: 0x8)
    class UStaticMeshComponent* res_16_1;                                             // 0x0388 (size: 0x8)
    class UStaticMeshComponent* dirt_2_2;                                             // 0x0390 (size: 0x8)
    class UStaticMeshComponent* dirt_2_1;                                             // 0x0398 (size: 0x8)
    class UStaticMeshComponent* Dirt_3_2;                                             // 0x03A0 (size: 0x8)
    class UStaticMeshComponent* Bench_217_12;                                         // 0x03A8 (size: 0x8)
    class UStaticMeshComponent* Bench_217_11;                                         // 0x03B0 (size: 0x8)
    class UStaticMeshComponent* Bench_217_9;                                          // 0x03B8 (size: 0x8)
    class UStaticMeshComponent* Bench_217_8;                                          // 0x03C0 (size: 0x8)
    class UStaticMeshComponent* Bench_217_7;                                          // 0x03C8 (size: 0x8)
    class UStaticMeshComponent* Bench_217_6;                                          // 0x03D0 (size: 0x8)
    class UStaticMeshComponent* Bench_217_5;                                          // 0x03D8 (size: 0x8)
    class UStaticMeshComponent* Bench_217_4;                                          // 0x03E0 (size: 0x8)
    class UStaticMeshComponent* Bench_217_3;                                          // 0x03E8 (size: 0x8)
    class UStaticMeshComponent* Bench_217_2;                                          // 0x03F0 (size: 0x8)
    class UStaticMeshComponent* Bench_217_1;                                          // 0x03F8 (size: 0x8)
    class USceneComponent* workPos_0;                                                 // 0x0400 (size: 0x8)
    class UStaticMeshComponent* handcart_2;                                           // 0x0408 (size: 0x8)
    class UStaticMeshComponent* handcart_1;                                           // 0x0410 (size: 0x8)
    class UStaticMeshComponent* Dirt_3_1;                                             // 0x0418 (size: 0x8)
    class UStaticMeshComponent* Clutter4;                                             // 0x0420 (size: 0x8)
    class UStaticMeshComponent* Clutter3;                                             // 0x0428 (size: 0x8)
    class UStaticMeshComponent* Clutter2;                                             // 0x0430 (size: 0x8)
    class UStaticMeshComponent* Clutter1;                                             // 0x0438 (size: 0x8)
    class UStaticMeshComponent* clutter;                                              // 0x0440 (size: 0x8)
    class UStaticMeshComponent* strut;                                                // 0x0448 (size: 0x8)
    class UStaticMeshComponent* Bld_401_15;                                           // 0x0450 (size: 0x8)
    class UStaticMeshComponent* Bld_401_14;                                           // 0x0458 (size: 0x8)
    class UStaticMeshComponent* Bld_401_13;                                           // 0x0460 (size: 0x8)
    class UStaticMeshComponent* Bld_401_12;                                           // 0x0468 (size: 0x8)
    class UStaticMeshComponent* Bld_401_11;                                           // 0x0470 (size: 0x8)
    class UStaticMeshComponent* Bld_401_10;                                           // 0x0478 (size: 0x8)
    class UStaticMeshComponent* Bld_401_9;                                            // 0x0480 (size: 0x8)
    class UStaticMeshComponent* Bld_401_8;                                            // 0x0488 (size: 0x8)
    class UStaticMeshComponent* Bld_401_7;                                            // 0x0490 (size: 0x8)
    class UStaticMeshComponent* Bld_401_6;                                            // 0x0498 (size: 0x8)
    class UStaticMeshComponent* Bld_401_5;                                            // 0x04A0 (size: 0x8)
    class UStaticMeshComponent* bld_299;                                              // 0x04A8 (size: 0x8)
    class UStaticMeshComponent* Bld_401_4;                                            // 0x04B0 (size: 0x8)
    class UStaticMeshComponent* bld_298;                                              // 0x04B8 (size: 0x8)
    class UStaticMeshComponent* Bld_401_3;                                            // 0x04C0 (size: 0x8)
    class UStaticMeshComponent* Bld_401_2;                                            // 0x04C8 (size: 0x8)
    class UStaticMeshComponent* Bld_401_1;                                            // 0x04D0 (size: 0x8)
    class UStaticMeshComponent* upg_oxShed;                                           // 0x04D8 (size: 0x8)
    class UStaticMeshComponent* MainBld_402;                                          // 0x04E0 (size: 0x8)
    class UStaticMeshComponent* MainBld_403;                                          // 0x04E8 (size: 0x8)

}; // Size: 0x4F0

#endif
