#ifndef UE4SS_SDK_BM_SG_Storehouse_Lv1_HPP
#define UE4SS_SDK_BM_SG_Storehouse_Lv1_HPP

class ABM_SG_Storehouse_Lv1_C : public AStaticMeshActor
{
    class UStaticMeshComponent* res_16_1;                                             // 0x02A0 (size: 0x8)
    class UStaticMeshComponent* res_16_0;                                             // 0x02A8 (size: 0x8)
    class UStaticMeshComponent* res_15_0;                                             // 0x02B0 (size: 0x8)
    class UStaticMeshComponent* res_15_5;                                             // 0x02B8 (size: 0x8)
    class UStaticMeshComponent* res_15_4;                                             // 0x02C0 (size: 0x8)
    class UStaticMeshComponent* res_15_3;                                             // 0x02C8 (size: 0x8)
    class UStaticMeshComponent* res_15_2;                                             // 0x02D0 (size: 0x8)
    class UStaticMeshComponent* res_15_1;                                             // 0x02D8 (size: 0x8)
    class UStaticMeshComponent* res_3_4;                                              // 0x02E0 (size: 0x8)
    class UStaticMeshComponent* res_3_3;                                              // 0x02E8 (size: 0x8)
    class UStaticMeshComponent* res_3_2;                                              // 0x02F0 (size: 0x8)
    class UStaticMeshComponent* res_3_1;                                              // 0x02F8 (size: 0x8)
    class UStaticMeshComponent* res_3_0;                                              // 0x0300 (size: 0x8)
    class UStaticMeshComponent* res_216_8;                                            // 0x0308 (size: 0x8)
    class UStaticMeshComponent* res_216_7;                                            // 0x0310 (size: 0x8)
    class UStaticMeshComponent* res_216_6;                                            // 0x0318 (size: 0x8)
    class UStaticMeshComponent* res_216_5;                                            // 0x0320 (size: 0x8)
    class UStaticMeshComponent* res_216_4;                                            // 0x0328 (size: 0x8)
    class UStaticMeshComponent* res_216_3;                                            // 0x0330 (size: 0x8)
    class UStaticMeshComponent* res_216_2;                                            // 0x0338 (size: 0x8)
    class UStaticMeshComponent* res_216_1;                                            // 0x0340 (size: 0x8)
    class UStaticMeshComponent* res_216_0;                                            // 0x0348 (size: 0x8)
    class UStaticMeshComponent* Dirt_0_1;                                             // 0x0350 (size: 0x8)
    class UStaticMeshComponent* bld_306;                                              // 0x0358 (size: 0x8)
    class UStaticMeshComponent* Dirt_0_0;                                             // 0x0360 (size: 0x8)
    class UStaticMeshComponent* Handcart1;                                            // 0x0368 (size: 0x8)
    class UStaticMeshComponent* handcart;                                             // 0x0370 (size: 0x8)
    class UStaticMeshComponent* MainBld_411;                                          // 0x0378 (size: 0x8)
    class USceneComponent* Scene;                                                     // 0x0380 (size: 0x8)

}; // Size: 0x388

#endif
