#ifndef UE4SS_SDK_BM_SG_StableLow_HPP
#define UE4SS_SDK_BM_SG_StableLow_HPP

class ABM_SG_StableLow_C : public AStaticMeshActor
{
    class UStaticMeshComponent* clutter_16;                                           // 0x02A0 (size: 0x8)
    class UStaticMeshComponent* clutter_hay1;                                         // 0x02A8 (size: 0x8)
    class UStaticMeshComponent* clutter_hay;                                          // 0x02B0 (size: 0x8)
    class UStaticMeshComponent* clutter_tub2;                                         // 0x02B8 (size: 0x8)
    class UStaticMeshComponent* clutter_tub1;                                         // 0x02C0 (size: 0x8)
    class UStaticMeshComponent* clutter_tub;                                          // 0x02C8 (size: 0x8)
    class UStaticMeshComponent* bld_0_foundationStone_7;                              // 0x02D0 (size: 0x8)
    class UStaticMeshComponent* bld_0_foundationStone_6;                              // 0x02D8 (size: 0x8)
    class UStaticMeshComponent* bld_0_foundationStone_5;                              // 0x02E0 (size: 0x8)
    class UStaticMeshComponent* bld_0_foundationStone_4;                              // 0x02E8 (size: 0x8)
    class UStaticMeshComponent* bld_0_oundationStone_3;                               // 0x02F0 (size: 0x8)
    class UStaticMeshComponent* bld_0_foundationStone_2;                              // 0x02F8 (size: 0x8)
    class UStaticMeshComponent* bld_0_foundationStone_1;                              // 0x0300 (size: 0x8)
    class UStaticMeshComponent* bld_0_foundationStone_0;                              // 0x0308 (size: 0x8)
    class UStaticMeshComponent* FullBld_480;                                          // 0x0310 (size: 0x8)
    class UStaticMeshComponent* Dirt_3_2;                                             // 0x0318 (size: 0x8)
    class UStaticMeshComponent* Dirt_0_0;                                             // 0x0320 (size: 0x8)

}; // Size: 0x328

#endif
