#ifndef UE4SS_SDK_BM_SG_Ext_AnimalFeeder_HPP
#define UE4SS_SDK_BM_SG_Ext_AnimalFeeder_HPP

class ABM_SG_Ext_AnimalFeeder_C : public AStaticMeshActor
{
    class UStaticMeshComponent* clutter_hay;                                          // 0x02A0 (size: 0x8)
    class USceneComponent* workpos1;                                                  // 0x02A8 (size: 0x8)
    class USceneComponent* workPos;                                                   // 0x02B0 (size: 0x8)
    class UStaticMeshComponent* clutter_stones8;                                      // 0x02B8 (size: 0x8)
    class UStaticMeshComponent* clutter_stones2;                                      // 0x02C0 (size: 0x8)
    class UStaticMeshComponent* clutter_stones1;                                      // 0x02C8 (size: 0x8)
    class UStaticMeshComponent* Dirt_0_0;                                             // 0x02D0 (size: 0x8)
    class UStaticMeshComponent* FullBld_479;                                          // 0x02D8 (size: 0x8)
    class USceneComponent* Scene;                                                     // 0x02E0 (size: 0x8)

}; // Size: 0x2E8

#endif
