#ifndef UE4SS_SDK_C_Carpenter2_HPP
#define UE4SS_SDK_C_Carpenter2_HPP

class AC_Carpenter2_C : public AConstructionBP_C
{
    class USceneComponent* SharedRoot4;                                               // 0x0550 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent50;                                // 0x0558 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent49;                                // 0x0560 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent48;                                // 0x0568 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent47;                                // 0x0570 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent46;                                // 0x0578 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent45;                                // 0x0580 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent44;                                // 0x0588 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent43;                                // 0x0590 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent42;                                // 0x0598 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent41;                                // 0x05A0 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent40;                                // 0x05A8 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent27;                                // 0x05B0 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent38;                                // 0x05B8 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent37;                                // 0x05C0 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent36;                                // 0x05C8 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent35;                                // 0x05D0 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent34;                                // 0x05D8 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent33;                                // 0x05E0 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent32;                                // 0x05E8 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent31;                                // 0x05F0 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent30;                                // 0x05F8 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent29;                                // 0x0600 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent28;                                // 0x0608 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent39;                                // 0x0610 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent148;                               // 0x0618 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent147;                               // 0x0620 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent146;                               // 0x0628 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent145;                               // 0x0630 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent144;                               // 0x0638 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent143;                               // 0x0640 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent142;                               // 0x0648 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent141;                               // 0x0650 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent140;                               // 0x0658 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent139;                               // 0x0660 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent138;                               // 0x0668 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent137;                               // 0x0670 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent136;                               // 0x0678 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent135;                               // 0x0680 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent134;                               // 0x0688 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent109;                               // 0x0690 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent108;                               // 0x0698 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent107;                               // 0x06A0 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent106;                               // 0x06A8 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent105;                               // 0x06B0 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent104;                               // 0x06B8 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent103;                               // 0x06C0 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent102;                               // 0x06C8 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent101;                               // 0x06D0 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent100;                               // 0x06D8 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent99;                                // 0x06E0 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent98;                                // 0x06E8 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent97;                                // 0x06F0 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent92;                                // 0x06F8 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent91;                                // 0x0700 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent89;                                // 0x0708 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent87;                                // 0x0710 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent86;                                // 0x0718 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent84;                                // 0x0720 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent83;                                // 0x0728 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent81;                                // 0x0730 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent80;                                // 0x0738 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent79;                                // 0x0740 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent78;                                // 0x0748 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent77;                                // 0x0750 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent76;                                // 0x0758 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent75;                                // 0x0760 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent74;                                // 0x0768 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent73;                                // 0x0770 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent72;                                // 0x0778 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent71;                                // 0x0780 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent70;                                // 0x0788 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent69;                                // 0x0790 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent68;                                // 0x0798 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent67;                                // 0x07A0 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent66;                                // 0x07A8 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent65;                                // 0x07B0 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent64;                                // 0x07B8 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent63;                                // 0x07C0 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent62;                                // 0x07C8 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent61;                                // 0x07D0 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent60;                                // 0x07D8 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent59;                                // 0x07E0 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent58;                                // 0x07E8 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent57;                                // 0x07F0 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent56;                                // 0x07F8 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent54;                                // 0x0800 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent88;                                // 0x0808 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent0;                                 // 0x0810 (size: 0x8)
    class USceneComponent* SharedRoot2;                                               // 0x0818 (size: 0x8)
    class USceneComponent* DefaultSceneRoot1;                                         // 0x0820 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent1;                                 // 0x0828 (size: 0x8)
    class USceneComponent* Scene;                                                     // 0x0830 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent158;                               // 0x0838 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent157;                               // 0x0840 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent155;                               // 0x0848 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent154;                               // 0x0850 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent153;                               // 0x0858 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent152;                               // 0x0860 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent151;                               // 0x0868 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent150;                               // 0x0870 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent149;                               // 0x0878 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent133;                               // 0x0880 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent132;                               // 0x0888 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent131;                               // 0x0890 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent130;                               // 0x0898 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent129;                               // 0x08A0 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent128;                               // 0x08A8 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent127;                               // 0x08B0 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent126;                               // 0x08B8 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent125;                               // 0x08C0 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent124;                               // 0x08C8 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent123;                               // 0x08D0 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent122;                               // 0x08D8 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent121;                               // 0x08E0 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent120;                               // 0x08E8 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent119;                               // 0x08F0 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent118;                               // 0x08F8 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent117;                               // 0x0900 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent116;                               // 0x0908 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent115;                               // 0x0910 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent114;                               // 0x0918 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent113;                               // 0x0920 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent112;                               // 0x0928 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent111;                               // 0x0930 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent110;                               // 0x0938 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent96;                                // 0x0940 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent95;                                // 0x0948 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent94;                                // 0x0950 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent93;                                // 0x0958 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent85;                                // 0x0960 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent82;                                // 0x0968 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent55;                                // 0x0970 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent53;                                // 0x0978 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent52;                                // 0x0980 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent51;                                // 0x0988 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent095;                               // 0x0990 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent094;                               // 0x0998 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent093;                               // 0x09A0 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent092;                               // 0x09A8 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent091;                               // 0x09B0 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent090;                               // 0x09B8 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent089;                               // 0x09C0 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent088;                               // 0x09C8 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent087;                               // 0x09D0 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent086;                               // 0x09D8 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent085;                               // 0x09E0 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent084;                               // 0x09E8 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent083;                               // 0x09F0 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent080;                               // 0x09F8 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent079;                               // 0x0A00 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent078;                               // 0x0A08 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent077;                               // 0x0A10 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent076;                               // 0x0A18 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent075;                               // 0x0A20 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent074;                               // 0x0A28 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent073;                               // 0x0A30 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent072;                               // 0x0A38 (size: 0x8)
    class USceneComponent* SharedRoot12;                                              // 0x0A40 (size: 0x8)
    class USceneComponent* SharedRoot5;                                               // 0x0A48 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent052;                               // 0x0A50 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent062;                               // 0x0A58 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent082;                               // 0x0A60 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent070;                               // 0x0A68 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent068;                               // 0x0A70 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent063;                               // 0x0A78 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent067;                               // 0x0A80 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent066;                               // 0x0A88 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent065;                               // 0x0A90 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent064;                               // 0x0A98 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent050;                               // 0x0AA0 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent051;                               // 0x0AA8 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent061;                               // 0x0AB0 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent060;                               // 0x0AB8 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent059;                               // 0x0AC0 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent058;                               // 0x0AC8 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent057;                               // 0x0AD0 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent056;                               // 0x0AD8 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent055;                               // 0x0AE0 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent054;                               // 0x0AE8 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent053;                               // 0x0AF0 (size: 0x8)
    class USceneComponent* SharedRoot11;                                              // 0x0AF8 (size: 0x8)
    class USceneComponent* SharedRoot3;                                               // 0x0B00 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent26;                                // 0x0B08 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent25;                                // 0x0B10 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent24;                                // 0x0B18 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent23;                                // 0x0B20 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent22;                                // 0x0B28 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent21;                                // 0x0B30 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent20;                                // 0x0B38 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent19;                                // 0x0B40 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent18;                                // 0x0B48 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent17;                                // 0x0B50 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent16;                                // 0x0B58 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent15;                                // 0x0B60 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent14;                                // 0x0B68 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent13;                                // 0x0B70 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent12;                                // 0x0B78 (size: 0x8)
    class USceneComponent* SharedRoot1;                                               // 0x0B80 (size: 0x8)
    class USceneComponent* DefaultSceneRoot2;                                         // 0x0B88 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent11;                                // 0x0B90 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent10;                                // 0x0B98 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent9;                                 // 0x0BA0 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent8;                                 // 0x0BA8 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent7;                                 // 0x0BB0 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent6;                                 // 0x0BB8 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent5;                                 // 0x0BC0 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent4;                                 // 0x0BC8 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent3;                                 // 0x0BD0 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent2;                                 // 0x0BD8 (size: 0x8)
    class USceneComponent* SharedRoot;                                                // 0x0BE0 (size: 0x8)

}; // Size: 0xBE8

#endif
