#ifndef UE4SS_SDK_C_CobblerAttachment_HPP
#define UE4SS_SDK_C_CobblerAttachment_HPP

class AC_CobblerAttachment_C : public AConstructionBP_C
{
    class UStaticMeshComponent* box23_StaticMeshComponent0;                           // 0x0550 (size: 0x8)
    class UStaticMeshComponent* groundGrass122_StaticMeshComponent0;                  // 0x0558 (size: 0x8)
    class UStaticMeshComponent* groundGrass121_StaticMeshComponent0;                  // 0x0560 (size: 0x8)
    class UStaticMeshComponent* groundGrass120_StaticMeshComponent0;                  // 0x0568 (size: 0x8)
    class UStaticMeshComponent* groundGrass119_StaticMeshComponent0;                  // 0x0570 (size: 0x8)
    class UStaticMeshComponent* groundGrass118_StaticMeshComponent0;                  // 0x0578 (size: 0x8)
    class UStaticMeshComponent* groundGrass117_StaticMeshComponent0;                  // 0x0580 (size: 0x8)
    class UStaticMeshComponent* groundGrass116_StaticMeshComponent0;                  // 0x0588 (size: 0x8)
    class UStaticMeshComponent* groundGrass115_StaticMeshComponent0;                  // 0x0590 (size: 0x8)
    class UStaticMeshComponent* groundGrass114_StaticMeshComponent0;                  // 0x0598 (size: 0x8)
    class UStaticMeshComponent* groundGrass113_StaticMeshComponent0;                  // 0x05A0 (size: 0x8)
    class UStaticMeshComponent* groundGrass112_StaticMeshComponent0;                  // 0x05A8 (size: 0x8)
    class UStaticMeshComponent* groundGrass111_StaticMeshComponent0;                  // 0x05B0 (size: 0x8)
    class UStaticMeshComponent* groundGrass110_StaticMeshComponent0;                  // 0x05B8 (size: 0x8)
    class UStaticMeshComponent* Plane82_StaticMeshComponent0;                         // 0x05C0 (size: 0x8)
    class UStaticMeshComponent* Plane81_StaticMeshComponent0;                         // 0x05C8 (size: 0x8)
    class UStaticMeshComponent* tool_shears9_StaticMeshComponent0;                    // 0x05D0 (size: 0x8)
    class UStaticMeshComponent* roll23_StaticMeshComponent0;                          // 0x05D8 (size: 0x8)
    class UStaticMeshComponent* roll22_StaticMeshComponent0;                          // 0x05E0 (size: 0x8)
    class UStaticMeshComponent* roll21_StaticMeshComponent0;                          // 0x05E8 (size: 0x8)
    class UStaticMeshComponent* roll20_StaticMeshComponent0;                          // 0x05F0 (size: 0x8)
    class UStaticMeshComponent* box22_StaticMeshComponent0;                           // 0x05F8 (size: 0x8)
    class UStaticMeshComponent* box21_StaticMeshComponent0;                           // 0x0600 (size: 0x8)
    class UStaticMeshComponent* box20_StaticMeshComponent0;                           // 0x0608 (size: 0x8)
    class UStaticMeshComponent* stool_lod15_StaticMeshComponent0;                     // 0x0610 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long1470_StaticMeshComponent0;       // 0x0618 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long1469_StaticMeshComponent0;       // 0x0620 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long1468_StaticMeshComponent0;       // 0x0628 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long1467_StaticMeshComponent0;       // 0x0630 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long1466_StaticMeshComponent0;       // 0x0638 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long1465_StaticMeshComponent0;       // 0x0640 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long1464_StaticMeshComponent0;       // 0x0648 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long1463_StaticMeshComponent0;       // 0x0650 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long1462_StaticMeshComponent0;       // 0x0658 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long1461_StaticMeshComponent0;       // 0x0660 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long1460_StaticMeshComponent0;       // 0x0668 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long1459_StaticMeshComponent0;       // 0x0670 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long1458_StaticMeshComponent0;       // 0x0678 (size: 0x8)
    class UStaticMeshComponent* shoesLying22_StaticMeshComponent0;                    // 0x0680 (size: 0x8)
    class UStaticMeshComponent* shoesLying21_StaticMeshComponent0;                    // 0x0688 (size: 0x8)
    class UStaticMeshComponent* shoesLying20_StaticMeshComponent0;                    // 0x0690 (size: 0x8)
    class UStaticMeshComponent* shoesLying19_StaticMeshComponent0;                    // 0x0698 (size: 0x8)
    class UStaticMeshComponent* shoesLying18_StaticMeshComponent0;                    // 0x06A0 (size: 0x8)
    class UStaticMeshComponent* shoes12_StaticMeshComponent0;                         // 0x06A8 (size: 0x8)
    class UStaticMeshComponent* shoesLying17_StaticMeshComponent0;                    // 0x06B0 (size: 0x8)
    class UStaticMeshComponent* shoesLying16_StaticMeshComponent0;                    // 0x06B8 (size: 0x8)
    class UStaticMeshComponent* shoes11_StaticMeshComponent0;                         // 0x06C0 (size: 0x8)
    class UStaticMeshComponent* shoes10_StaticMeshComponent0;                         // 0x06C8 (size: 0x8)
    class UStaticMeshComponent* shoesLying15_StaticMeshComponent0;                    // 0x06D0 (size: 0x8)
    class UStaticMeshComponent* shoes9_StaticMeshComponent0;                          // 0x06D8 (size: 0x8)
    class UStaticMeshComponent* shoesLying14_StaticMeshComponent0;                    // 0x06E0 (size: 0x8)
    class UStaticMeshComponent* shoes8_StaticMeshComponent0;                          // 0x06E8 (size: 0x8)
    class UStaticMeshComponent* shoes7_StaticMeshComponent0;                          // 0x06F0 (size: 0x8)
    class UStaticMeshComponent* shoesLying13_StaticMeshComponent0;                    // 0x06F8 (size: 0x8)
    class UStaticMeshComponent* shoesLying12_StaticMeshComponent0;                    // 0x0700 (size: 0x8)
    class UStaticMeshComponent* roll19_StaticMeshComponent0;                          // 0x0708 (size: 0x8)
    class UStaticMeshComponent* roll18_StaticMeshComponent0;                          // 0x0710 (size: 0x8)
    class UStaticMeshComponent* roll17_StaticMeshComponent0;                          // 0x0718 (size: 0x8)
    class UStaticMeshComponent* roll16_StaticMeshComponent0;                          // 0x0720 (size: 0x8)
    class UStaticMeshComponent* tkqmdbnhw_LOD13_StaticMeshComponent0;                 // 0x0728 (size: 0x8)
    class UStaticMeshComponent* Hammer_low11_StaticMeshComponent0;                    // 0x0730 (size: 0x8)
    class UStaticMeshComponent* tool_shears8_StaticMeshComponent0;                    // 0x0738 (size: 0x8)
    class UStaticMeshComponent* tool_HammerB8_StaticMeshComponent0;                   // 0x0740 (size: 0x8)
    class UStaticMeshComponent* Hammer_low10_StaticMeshComponent0;                    // 0x0748 (size: 0x8)
    class UStaticMeshComponent* tkqmdbnhw_LOD12_StaticMeshComponent0;                 // 0x0750 (size: 0x8)
    class UStaticMeshComponent* tkqmdbnhw_LOD11_StaticMeshComponent0;                 // 0x0758 (size: 0x8)
    class UStaticMeshComponent* Hammer_low9_StaticMeshComponent0;                     // 0x0760 (size: 0x8)
    class UStaticMeshComponent* tool_HammerB7_StaticMeshComponent0;                   // 0x0768 (size: 0x8)
    class UStaticMeshComponent* tool_HammerB6_StaticMeshComponent0;                   // 0x0770 (size: 0x8)
    class UStaticMeshComponent* tool_shears7_StaticMeshComponent0;                    // 0x0778 (size: 0x8)
    class UStaticMeshComponent* tool_HammerB5_StaticMeshComponent0;                   // 0x0780 (size: 0x8)
    class UStaticMeshComponent* tool_pickaxe2_StaticMeshComponent0;                   // 0x0788 (size: 0x8)
    class UStaticMeshComponent* SM_Rug_8_StaticMeshComponent0;                        // 0x0790 (size: 0x8)
    class UStaticMeshComponent* Plane80_StaticMeshComponent0;                         // 0x0798 (size: 0x8)
    class UStaticMeshComponent* SM_Rug_7_StaticMeshComponent0;                        // 0x07A0 (size: 0x8)
    class UStaticMeshComponent* Hammer_low8_StaticMeshComponent0;                     // 0x07A8 (size: 0x8)
    class UStaticMeshComponent* ucymdgciw_LOD16_StaticMeshComponent0;                 // 0x07B0 (size: 0x8)
    class UStaticMeshComponent* ucymdgciw_LOD15_StaticMeshComponent0;                 // 0x07B8 (size: 0x8)
    class UStaticMeshComponent* ubqsdhdfa_LOD7_StaticMeshComponent0;                  // 0x07C0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long1457_StaticMeshComponent0;       // 0x07C8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long1456_StaticMeshComponent0;       // 0x07D0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long1455_StaticMeshComponent0;       // 0x07D8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long1454_StaticMeshComponent0;       // 0x07E0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long1453_StaticMeshComponent0;       // 0x07E8 (size: 0x8)
    class UStaticMeshComponent* SM_Besom2_StaticMeshComponent0;                       // 0x07F0 (size: 0x8)
    class UStaticMeshComponent* stool_lod14_StaticMeshComponent0;                     // 0x07F8 (size: 0x8)
    class UStaticMeshComponent* stool_lod13_StaticMeshComponent0;                     // 0x0800 (size: 0x8)
    class UStaticMeshComponent* SM_Table4_StaticMeshComponent0;                       // 0x0808 (size: 0x8)
    class UStaticMeshComponent* box19_StaticMeshComponent0;                           // 0x0810 (size: 0x8)
    class UStaticMeshComponent* box18_StaticMeshComponent0;                           // 0x0818 (size: 0x8)
    class UStaticMeshComponent* box17_StaticMeshComponent0;                           // 0x0820 (size: 0x8)
    class UStaticMeshComponent* box16_StaticMeshComponent0;                           // 0x0828 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long1452_StaticMeshComponent0;       // 0x0830 (size: 0x8)
    class UStaticMeshComponent* owidzWattleTrimmed84_StaticMeshComponent0;            // 0x0838 (size: 0x8)
    class UStaticMeshComponent* zb_cottage_03_shingles26_StaticMeshComponent0;        // 0x0840 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long1451_StaticMeshComponent0;       // 0x0848 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long1450_StaticMeshComponent0;       // 0x0850 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long1449_StaticMeshComponent0;       // 0x0858 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long1448_StaticMeshComponent0;       // 0x0860 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long1447_StaticMeshComponent0;       // 0x0868 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long1446_StaticMeshComponent0;       // 0x0870 (size: 0x8)
    class UStaticMeshComponent* zb_cottage_03_shingles25_StaticMeshComponent0;        // 0x0878 (size: 0x8)
    class UStaticMeshComponent* zb_cottage_03_shingles24_StaticMeshComponent0;        // 0x0880 (size: 0x8)
    class UStaticMeshComponent* zb_cottage_03_shingles23_StaticMeshComponent0;        // 0x0888 (size: 0x8)
    class UStaticMeshComponent* zb_cottage_03_shingles22_StaticMeshComponent0;        // 0x0890 (size: 0x8)
    class UStaticMeshComponent* zb_cottage_03_shingles21_StaticMeshComponent0;        // 0x0898 (size: 0x8)
    class UStaticMeshComponent* zb_cottage_03_shingles20_StaticMeshComponent0;        // 0x08A0 (size: 0x8)
    class UStaticMeshComponent* zb_cottage_03_shingles19_StaticMeshComponent0;        // 0x08A8 (size: 0x8)
    class UStaticMeshComponent* zb_cottage_03_shingles18_StaticMeshComponent0;        // 0x08B0 (size: 0x8)
    class UStaticMeshComponent* zb_cottage_03_shingles17_StaticMeshComponent0;        // 0x08B8 (size: 0x8)
    class UStaticMeshComponent* zb_cottage_03_shingles16_StaticMeshComponent0;        // 0x08C0 (size: 0x8)
    class UStaticMeshComponent* zb_cottage_03_shingles15_StaticMeshComponent0;        // 0x08C8 (size: 0x8)
    class UStaticMeshComponent* zb_cottage_03_shingles14_StaticMeshComponent0;        // 0x08D0 (size: 0x8)
    class UStaticMeshComponent* owidzWattleTrimmed83_StaticMeshComponent0;            // 0x08D8 (size: 0x8)
    class UStaticMeshComponent* owidzWattleTrimmed82_StaticMeshComponent0;            // 0x08E0 (size: 0x8)
    class UStaticMeshComponent* owidzWattleTrimmed81_StaticMeshComponent0;            // 0x08E8 (size: 0x8)
    class UStaticMeshComponent* owidzWattleTrimmed80_StaticMeshComponent0;            // 0x08F0 (size: 0x8)
    class UStaticMeshComponent* owidzWattleTrimmed79_StaticMeshComponent0;            // 0x08F8 (size: 0x8)
    class UStaticMeshComponent* owidzWattleTrimmed78_StaticMeshComponent0;            // 0x0900 (size: 0x8)
    class UStaticMeshComponent* owidzWattleTrimmed77_StaticMeshComponent0;            // 0x0908 (size: 0x8)
    class UStaticMeshComponent* owidzWattleTrimmed76_StaticMeshComponent0;            // 0x0910 (size: 0x8)
    class UStaticMeshComponent* owidzWattleTrimmed75_StaticMeshComponent0;            // 0x0918 (size: 0x8)
    class UStaticMeshComponent* ucymdgciw_LOD14_StaticMeshComponent0;                 // 0x0920 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long1445_StaticMeshComponent0;       // 0x0928 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long1444_StaticMeshComponent0;       // 0x0930 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long1443_StaticMeshComponent0;       // 0x0938 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long1442_StaticMeshComponent0;       // 0x0940 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long1441_StaticMeshComponent0;       // 0x0948 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long1440_StaticMeshComponent0;       // 0x0950 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long1439_StaticMeshComponent0;       // 0x0958 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long1438_StaticMeshComponent0;       // 0x0960 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long1437_StaticMeshComponent0;       // 0x0968 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long1436_StaticMeshComponent0;       // 0x0970 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long1435_StaticMeshComponent0;       // 0x0978 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long1434_StaticMeshComponent0;       // 0x0980 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long1433_StaticMeshComponent0;       // 0x0988 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long1432_StaticMeshComponent0;       // 0x0990 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long1431_StaticMeshComponent0;       // 0x0998 (size: 0x8)
    class UStaticMeshComponent* owidzWattleTrimmed74_StaticMeshComponent0;            // 0x09A0 (size: 0x8)
    class UStaticMeshComponent* owidzWattleTrimmed73_StaticMeshComponent0;            // 0x09A8 (size: 0x8)
    class UStaticMeshComponent* owidzWattleTrimmed72_StaticMeshComponent0;            // 0x09B0 (size: 0x8)
    class UStaticMeshComponent* owidzWattleTrimmed71_StaticMeshComponent0;            // 0x09B8 (size: 0x8)
    class UStaticMeshComponent* owidzWattleTrimmed70_StaticMeshComponent0;            // 0x09C0 (size: 0x8)
    class UStaticMeshComponent* owidzWattleTrimmed69_StaticMeshComponent0;            // 0x09C8 (size: 0x8)
    class UStaticMeshComponent* owidzWattleTrimmed68_StaticMeshComponent0;            // 0x09D0 (size: 0x8)
    class UStaticMeshComponent* owidzWattleTrimmed67_StaticMeshComponent0;            // 0x09D8 (size: 0x8)
    class UStaticMeshComponent* owidzWattleTrimmed66_StaticMeshComponent0;            // 0x09E0 (size: 0x8)
    class UStaticMeshComponent* owidzWattleTrimmed58_StaticMeshComponent0;            // 0x09E8 (size: 0x8)
    class UStaticMeshComponent* owidzWattleTrimmed57_StaticMeshComponent0;            // 0x09F0 (size: 0x8)
    class UStaticMeshComponent* owidzWattleTrimmed56_StaticMeshComponent0;            // 0x09F8 (size: 0x8)
    class UStaticMeshComponent* ucymdgciw_LOD13_StaticMeshComponent0;                 // 0x0A00 (size: 0x8)
    class UStaticMeshComponent* ucymdgciw_LOD12_StaticMeshComponent0;                 // 0x0A08 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long1430_StaticMeshComponent0;       // 0x0A10 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long1429_StaticMeshComponent0;       // 0x0A18 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long1428_StaticMeshComponent0;       // 0x0A20 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long1427_StaticMeshComponent0;       // 0x0A28 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long1426_StaticMeshComponent0;       // 0x0A30 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long1425_StaticMeshComponent0;       // 0x0A38 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long1424_StaticMeshComponent0;       // 0x0A40 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long1423_StaticMeshComponent0;       // 0x0A48 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long1422_StaticMeshComponent0;       // 0x0A50 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long1421_StaticMeshComponent0;       // 0x0A58 (size: 0x8)
    class UStaticMeshComponent* stool_lod12_StaticMeshComponent0;                     // 0x0A60 (size: 0x8)
    class USceneComponent* cobblerAttachment2_DefaultSceneRoot;                       // 0x0A68 (size: 0x8)

}; // Size: 0xA70

#endif
