#ifndef UE4SS_SDK_C_HuntersTent_HPP
#define UE4SS_SDK_C_HuntersTent_HPP

class AC_HuntersTent_C : public AConstructionBP_C
{
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly16_StaticMeshComponent0;    // 0x0550 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly15_StaticMeshComponent0;    // 0x0558 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly14_StaticMeshComponent0;    // 0x0560 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly13_StaticMeshComponent0;    // 0x0568 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly12_StaticMeshComponent0;    // 0x0570 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly11_StaticMeshComponent0;    // 0x0578 (size: 0x8)
    class UStaticMeshComponent* ropeTubeD9_StaticMeshComponent0;                      // 0x0580 (size: 0x8)
    class UStaticMeshComponent* ropeTubeD8_StaticMeshComponent0;                      // 0x0588 (size: 0x8)
    class UStaticMeshComponent* sg_huntersTentA2_StaticMeshComponent0;                // 0x0590 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed_long216_StaticMeshComponent0;     // 0x0598 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed_long215_StaticMeshComponent0;     // 0x05A0 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed_long214_StaticMeshComponent0;     // 0x05A8 (size: 0x8)
    class UStaticMeshComponent* bedroll2_StaticMeshComponent0;                        // 0x05B0 (size: 0x8)
    class USceneComponent* sg_hunters_tent2_DefaultSceneRoot;                         // 0x05B8 (size: 0x8)

}; // Size: 0x5C0

#endif
