#ifndef UE4SS_SDK_C_SG_Farm_Barn_HPP
#define UE4SS_SDK_C_SG_Farm_Barn_HPP

class AC_SG_Farm_Barn_C : public AConstructionBP_C
{
    class UStaticMeshComponent* SG_fillerBoardA162_StaticMeshComponent0;              // 0x0550 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA161_StaticMeshComponent0;              // 0x0558 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA160_StaticMeshComponent0;              // 0x0560 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA159_StaticMeshComponent0;              // 0x0568 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA158_StaticMeshComponent0;              // 0x0570 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA157_StaticMeshComponent0;              // 0x0578 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA156_StaticMeshComponent0;              // 0x0580 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA155_StaticMeshComponent0;              // 0x0588 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA154_StaticMeshComponent0;              // 0x0590 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA153_StaticMeshComponent0;              // 0x0598 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA152_StaticMeshComponent0;              // 0x05A0 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA151_StaticMeshComponent0;              // 0x05A8 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA150_StaticMeshComponent0;              // 0x05B0 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA149_StaticMeshComponent0;              // 0x05B8 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA148_StaticMeshComponent0;              // 0x05C0 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA147_StaticMeshComponent0;              // 0x05C8 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA146_StaticMeshComponent0;              // 0x05D0 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA145_StaticMeshComponent0;              // 0x05D8 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA144_StaticMeshComponent0;              // 0x05E0 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA143_StaticMeshComponent0;              // 0x05E8 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA142_StaticMeshComponent0;              // 0x05F0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m625_StaticMeshComponent0;                // 0x05F8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m624_StaticMeshComponent0;                // 0x0600 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m623_StaticMeshComponent0;                // 0x0608 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m622_StaticMeshComponent0;                // 0x0610 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m621_StaticMeshComponent0;                // 0x0618 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m620_StaticMeshComponent0;                // 0x0620 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m619_StaticMeshComponent0;                // 0x0628 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m618_StaticMeshComponent0;                // 0x0630 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m617_StaticMeshComponent0;                // 0x0638 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m616_StaticMeshComponent0;                // 0x0640 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m615_StaticMeshComponent0;                // 0x0648 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short363_StaticMeshComponent0;       // 0x0650 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA141_StaticMeshComponent0;              // 0x0658 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA140_StaticMeshComponent0;              // 0x0660 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA139_StaticMeshComponent0;              // 0x0668 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA138_StaticMeshComponent0;              // 0x0670 (size: 0x8)
    class UStaticMeshComponent* foundationTiling_A_detailed173_StaticMeshComponent0;  // 0x0678 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m614_StaticMeshComponent0;                // 0x0680 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA137_StaticMeshComponent0;              // 0x0688 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA136_StaticMeshComponent0;              // 0x0690 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA135_StaticMeshComponent0;              // 0x0698 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA134_StaticMeshComponent0;              // 0x06A0 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA133_StaticMeshComponent0;              // 0x06A8 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA132_StaticMeshComponent0;              // 0x06B0 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA131_StaticMeshComponent0;              // 0x06B8 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA130_StaticMeshComponent0;              // 0x06C0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m613_StaticMeshComponent0;                // 0x06C8 (size: 0x8)
    class UStaticMeshComponent* foundationTiling_A_detailed172_StaticMeshComponent0;  // 0x06D0 (size: 0x8)
    class UStaticMeshComponent* foundationTiling_A_detailed171_StaticMeshComponent0;  // 0x06D8 (size: 0x8)
    class UStaticMeshComponent* foundationTiling_A_detailed170_StaticMeshComponent0;  // 0x06E0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m612_StaticMeshComponent0;                // 0x06E8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m611_StaticMeshComponent0;                // 0x06F0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m610_StaticMeshComponent0;                // 0x06F8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m609_StaticMeshComponent0;                // 0x0700 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m608_StaticMeshComponent0;                // 0x0708 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m607_StaticMeshComponent0;                // 0x0710 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m606_StaticMeshComponent0;                // 0x0718 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m605_StaticMeshComponent0;                // 0x0720 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m604_StaticMeshComponent0;                // 0x0728 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m603_StaticMeshComponent0;                // 0x0730 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m602_StaticMeshComponent0;                // 0x0738 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m601_StaticMeshComponent0;                // 0x0740 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m600_StaticMeshComponent0;                // 0x0748 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m599_StaticMeshComponent0;                // 0x0750 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m598_StaticMeshComponent0;                // 0x0758 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m597_StaticMeshComponent0;                // 0x0760 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m596_StaticMeshComponent0;                // 0x0768 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m595_StaticMeshComponent0;                // 0x0770 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m594_StaticMeshComponent0;                // 0x0778 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long_diagonalD37_StaticMeshComponent0; // 0x0780 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long_diagonalD36_StaticMeshComponent0; // 0x0788 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m593_StaticMeshComponent0;                // 0x0790 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m592_StaticMeshComponent0;                // 0x0798 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m591_StaticMeshComponent0;                // 0x07A0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m590_StaticMeshComponent0;                // 0x07A8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m589_StaticMeshComponent0;                // 0x07B0 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA129_StaticMeshComponent0;              // 0x07B8 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA128_StaticMeshComponent0;              // 0x07C0 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA127_StaticMeshComponent0;              // 0x07C8 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA126_StaticMeshComponent0;              // 0x07D0 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA125_StaticMeshComponent0;              // 0x07D8 (size: 0x8)
    class UStaticMeshComponent* foundationTiling_A_detailed169_StaticMeshComponent0;  // 0x07E0 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA124_StaticMeshComponent0;              // 0x07E8 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA123_StaticMeshComponent0;              // 0x07F0 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA122_StaticMeshComponent0;              // 0x07F8 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA121_StaticMeshComponent0;              // 0x0800 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA120_StaticMeshComponent0;              // 0x0808 (size: 0x8)
    class UStaticMeshComponent* foundationTiling_A_detailed168_StaticMeshComponent0;  // 0x0810 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short362_StaticMeshComponent0;       // 0x0818 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA119_StaticMeshComponent0;              // 0x0820 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA118_StaticMeshComponent0;              // 0x0828 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA117_StaticMeshComponent0;              // 0x0830 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m588_StaticMeshComponent0;                // 0x0838 (size: 0x8)
    class UStaticMeshComponent* foundationTiling_A_detailed167_StaticMeshComponent0;  // 0x0840 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m587_StaticMeshComponent0;                // 0x0848 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short361_StaticMeshComponent0;       // 0x0850 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA116_StaticMeshComponent0;              // 0x0858 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA115_StaticMeshComponent0;              // 0x0860 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA114_StaticMeshComponent0;              // 0x0868 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m586_StaticMeshComponent0;                // 0x0870 (size: 0x8)
    class UStaticMeshComponent* foundationTiling_A_detailed166_StaticMeshComponent0;  // 0x0878 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA113_StaticMeshComponent0;              // 0x0880 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA112_StaticMeshComponent0;              // 0x0888 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA111_StaticMeshComponent0;              // 0x0890 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA110_StaticMeshComponent0;              // 0x0898 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA109_StaticMeshComponent0;              // 0x08A0 (size: 0x8)
    class UStaticMeshComponent* foundationTiling_A_detailed165_StaticMeshComponent0;  // 0x08A8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m585_StaticMeshComponent0;                // 0x08B0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m584_StaticMeshComponent0;                // 0x08B8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short360_StaticMeshComponent0;       // 0x08C0 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA108_StaticMeshComponent0;              // 0x08C8 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA107_StaticMeshComponent0;              // 0x08D0 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA106_StaticMeshComponent0;              // 0x08D8 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA105_StaticMeshComponent0;              // 0x08E0 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA104_StaticMeshComponent0;              // 0x08E8 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA103_StaticMeshComponent0;              // 0x08F0 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA102_StaticMeshComponent0;              // 0x08F8 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA101_StaticMeshComponent0;              // 0x0900 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m583_StaticMeshComponent0;                // 0x0908 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m582_StaticMeshComponent0;                // 0x0910 (size: 0x8)
    class UStaticMeshComponent* foundationTiling_A_detailed164_StaticMeshComponent0;  // 0x0918 (size: 0x8)
    class UStaticMeshComponent* foundationTiling_A_detailed163_StaticMeshComponent0;  // 0x0920 (size: 0x8)
    class UStaticMeshComponent* foundationTiling_A_detailed162_StaticMeshComponent0;  // 0x0928 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long_diagonalD35_StaticMeshComponent0; // 0x0930 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m581_StaticMeshComponent0;                // 0x0938 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short359_StaticMeshComponent0;       // 0x0940 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short356_StaticMeshComponent0;       // 0x0948 (size: 0x8)
    class UStaticMeshComponent* Cobblestone_LOD5_tjemdbyiw329_StaticMeshComponent0;   // 0x0950 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA100_StaticMeshComponent0;              // 0x0958 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA99_StaticMeshComponent0;               // 0x0960 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA98_StaticMeshComponent0;               // 0x0968 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m518_StaticMeshComponent0;                // 0x0970 (size: 0x8)
    class UStaticMeshComponent* foundationTiling_A_detailed161_StaticMeshComponent0;  // 0x0978 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m517_StaticMeshComponent0;                // 0x0980 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA97_StaticMeshComponent0;               // 0x0988 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA96_StaticMeshComponent0;               // 0x0990 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA95_StaticMeshComponent0;               // 0x0998 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long_diagonalD32_StaticMeshComponent0; // 0x09A0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long_diagonalD31_StaticMeshComponent0; // 0x09A8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m516_StaticMeshComponent0;                // 0x09B0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m502_StaticMeshComponent0;                // 0x09B8 (size: 0x8)
    class UStaticMeshComponent* Cobblestone_LOD5_tjemdbyiw328_StaticMeshComponent0;   // 0x09C0 (size: 0x8)
    class UStaticMeshComponent* foundationTiling_A_detailed156_StaticMeshComponent0;  // 0x09C8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m500_StaticMeshComponent0;                // 0x09D0 (size: 0x8)
    class UStaticMeshComponent* sg_thatchBarn2_StaticMeshComponent0;                  // 0x09D8 (size: 0x8)
    class USceneComponent* SG_Farm_Barn2_DefaultSceneRoot;                            // 0x09E0 (size: 0x8)

}; // Size: 0x9E8

#endif
