#ifndef UE4SS_SDK_C_SG_Church_Lv2_Core_WholeProcess_HPP
#define UE4SS_SDK_C_SG_Church_Lv2_Core_WholeProcess_HPP

class AC_SG_Church_Lv2_Core_WholeProcess_C : public AConstructionBP_C
{
    class UStaticMeshComponent* SM_WoodBeam3m86_StaticMeshComponent0;                 // 0x0550 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Tapered_CutE26_StaticMeshComponent0;        // 0x0558 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_39_StaticMeshComponent0; // 0x0560 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_4_StaticMeshComponent0; // 0x0568 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_38_StaticMeshComponent0; // 0x0570 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_37_StaticMeshComponent0; // 0x0578 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Tapered_CutE25_StaticMeshComponent0;        // 0x0580 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Tapered_CutE24_StaticMeshComponent0;        // 0x0588 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Tapered_CutE23_StaticMeshComponent0;        // 0x0590 (size: 0x8)
    class UStaticMeshComponent* sg_woodenGableA3_StaticMeshComponent0;                // 0x0598 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long_ultra18_StaticMeshComponent0;   // 0x05A0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long_ultra17_StaticMeshComponent0;   // 0x05A8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long_ultra16_StaticMeshComponent0;   // 0x05B0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m85_StaticMeshComponent0;                 // 0x05B8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m84_StaticMeshComponent0;                 // 0x05C0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m83_StaticMeshComponent0;                 // 0x05C8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m82_StaticMeshComponent0;                 // 0x05D0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m81_StaticMeshComponent0;                 // 0x05D8 (size: 0x8)
    class UStaticMeshComponent* sg_woodenGableA4_StaticMeshComponent0;                // 0x05E0 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Tapered_CutE22_StaticMeshComponent0;        // 0x05E8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m158_StaticMeshComponent0;                // 0x05F0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m157_StaticMeshComponent0;                // 0x05F8 (size: 0x8)
    class UStaticMeshComponent* sg_shutterA12_StaticMeshComponent0;                   // 0x0600 (size: 0x8)
    class UStaticMeshComponent* sg_shutterA11_StaticMeshComponent0;                   // 0x0608 (size: 0x8)
    class UStaticMeshComponent* sg_shutterA10_StaticMeshComponent0;                   // 0x0610 (size: 0x8)
    class UStaticMeshComponent* sg_shutterA9_StaticMeshComponent0;                    // 0x0618 (size: 0x8)
    class UStaticMeshComponent* sg_shutterA8_StaticMeshComponent0;                    // 0x0620 (size: 0x8)
    class UStaticMeshComponent* sg_shutterA7_StaticMeshComponent0;                    // 0x0628 (size: 0x8)
    class UStaticMeshComponent* PlaneDenseSmallSegment14_StaticMeshComponent0;        // 0x0630 (size: 0x8)
    class UStaticMeshComponent* PlaneDenseSmallSegment13_StaticMeshComponent0;        // 0x0638 (size: 0x8)
    class UStaticMeshComponent* PlaneDenseBeveledB28_StaticMeshComponent0;            // 0x0640 (size: 0x8)
    class UStaticMeshComponent* PlaneDenseBeveledB27_StaticMeshComponent0;            // 0x0648 (size: 0x8)
    class UStaticMeshComponent* PlaneDenseBeveledWide18_StaticMeshComponent0;         // 0x0650 (size: 0x8)
    class UStaticMeshComponent* PlaneDenseBeveledB26_StaticMeshComponent0;            // 0x0658 (size: 0x8)
    class UStaticMeshComponent* PlaneDenseBeveledWide17_StaticMeshComponent0;         // 0x0660 (size: 0x8)
    class UStaticMeshComponent* PlaneDenseBeveledB25_StaticMeshComponent0;            // 0x0668 (size: 0x8)
    class UStaticMeshComponent* PlaneDenseSmallSegment12_StaticMeshComponent0;        // 0x0670 (size: 0x8)
    class UStaticMeshComponent* PlaneDenseSmallSegment11_StaticMeshComponent0;        // 0x0678 (size: 0x8)
    class UStaticMeshComponent* PlaneDenseBeveledB24_StaticMeshComponent0;            // 0x0680 (size: 0x8)
    class UStaticMeshComponent* PlaneDenseBeveledB23_StaticMeshComponent0;            // 0x0688 (size: 0x8)
    class UStaticMeshComponent* PlaneDenseBeveledWide16_StaticMeshComponent0;         // 0x0690 (size: 0x8)
    class UStaticMeshComponent* PlaneDenseBeveledB22_StaticMeshComponent0;            // 0x0698 (size: 0x8)
    class UStaticMeshComponent* PlaneDenseBeveledWide15_StaticMeshComponent0;         // 0x06A0 (size: 0x8)
    class UStaticMeshComponent* PlaneDenseBeveledB21_StaticMeshComponent0;            // 0x06A8 (size: 0x8)
    class UStaticMeshComponent* PlaneDenseBeveledWide14_StaticMeshComponent0;         // 0x06B0 (size: 0x8)
    class UStaticMeshComponent* PlaneDenseSmallSegment10_StaticMeshComponent0;        // 0x06B8 (size: 0x8)
    class UStaticMeshComponent* PlaneDenseBeveledB20_StaticMeshComponent0;            // 0x06C0 (size: 0x8)
    class UStaticMeshComponent* PlaneDenseBeveledB19_StaticMeshComponent0;            // 0x06C8 (size: 0x8)
    class UStaticMeshComponent* PlaneDenseBeveledWide13_StaticMeshComponent0;         // 0x06D0 (size: 0x8)
    class UStaticMeshComponent* PlaneDenseBeveledWide12_StaticMeshComponent0;         // 0x06D8 (size: 0x8)
    class UStaticMeshComponent* PlaneDenseSmallSegment9_StaticMeshComponent0;         // 0x06E0 (size: 0x8)
    class UStaticMeshComponent* PlaneDenseSmallSegment8_StaticMeshComponent0;         // 0x06E8 (size: 0x8)
    class UStaticMeshComponent* PlaneDenseBeveledB18_StaticMeshComponent0;            // 0x06F0 (size: 0x8)
    class UStaticMeshComponent* PlaneDenseBeveledB17_StaticMeshComponent0;            // 0x06F8 (size: 0x8)
    class UStaticMeshComponent* PlaneDenseBeveledWide11_StaticMeshComponent0;         // 0x0700 (size: 0x8)
    class UStaticMeshComponent* PlaneDenseBeveledB16_StaticMeshComponent0;            // 0x0708 (size: 0x8)
    class UStaticMeshComponent* PlaneDenseBeveledWide10_StaticMeshComponent0;         // 0x0710 (size: 0x8)
    class UStaticMeshComponent* PlaneDenseBeveledB15_StaticMeshComponent0;            // 0x0718 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly120_StaticMeshComponent0;   // 0x0720 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly119_StaticMeshComponent0;   // 0x0728 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly118_StaticMeshComponent0;   // 0x0730 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly117_StaticMeshComponent0;   // 0x0738 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly116_StaticMeshComponent0;   // 0x0740 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly115_StaticMeshComponent0;   // 0x0748 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly114_StaticMeshComponent0;   // 0x0750 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly113_StaticMeshComponent0;   // 0x0758 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly112_StaticMeshComponent0;   // 0x0760 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly111_StaticMeshComponent0;   // 0x0768 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly110_StaticMeshComponent0;   // 0x0770 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly109_StaticMeshComponent0;   // 0x0778 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly108_StaticMeshComponent0;   // 0x0780 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly107_StaticMeshComponent0;   // 0x0788 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly106_StaticMeshComponent0;   // 0x0790 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly105_StaticMeshComponent0;   // 0x0798 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly104_StaticMeshComponent0;   // 0x07A0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly103_StaticMeshComponent0;   // 0x07A8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly102_StaticMeshComponent0;   // 0x07B0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly101_StaticMeshComponent0;   // 0x07B8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly100_StaticMeshComponent0;   // 0x07C0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly99_StaticMeshComponent0;    // 0x07C8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly98_StaticMeshComponent0;    // 0x07D0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly97_StaticMeshComponent0;    // 0x07D8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly96_StaticMeshComponent0;    // 0x07E0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly95_StaticMeshComponent0;    // 0x07E8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly94_StaticMeshComponent0;    // 0x07F0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly93_StaticMeshComponent0;    // 0x07F8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly92_StaticMeshComponent0;    // 0x0800 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly91_StaticMeshComponent0;    // 0x0808 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly90_StaticMeshComponent0;    // 0x0810 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly89_StaticMeshComponent0;    // 0x0818 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly88_StaticMeshComponent0;    // 0x0820 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly87_StaticMeshComponent0;    // 0x0828 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly86_StaticMeshComponent0;    // 0x0830 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly85_StaticMeshComponent0;    // 0x0838 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly84_StaticMeshComponent0;    // 0x0840 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly83_StaticMeshComponent0;    // 0x0848 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly82_StaticMeshComponent0;    // 0x0850 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly81_StaticMeshComponent0;    // 0x0858 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly80_StaticMeshComponent0;    // 0x0860 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly79_StaticMeshComponent0;    // 0x0868 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly78_StaticMeshComponent0;    // 0x0870 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly77_StaticMeshComponent0;    // 0x0878 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly76_StaticMeshComponent0;    // 0x0880 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly75_StaticMeshComponent0;    // 0x0888 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly74_StaticMeshComponent0;    // 0x0890 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly73_StaticMeshComponent0;    // 0x0898 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly72_StaticMeshComponent0;    // 0x08A0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly71_StaticMeshComponent0;    // 0x08A8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly70_StaticMeshComponent0;    // 0x08B0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly69_StaticMeshComponent0;    // 0x08B8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly68_StaticMeshComponent0;    // 0x08C0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly67_StaticMeshComponent0;    // 0x08C8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly66_StaticMeshComponent0;    // 0x08D0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly65_StaticMeshComponent0;    // 0x08D8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly64_StaticMeshComponent0;    // 0x08E0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly63_StaticMeshComponent0;    // 0x08E8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly62_StaticMeshComponent0;    // 0x08F0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly61_StaticMeshComponent0;    // 0x08F8 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_71_StaticMeshComponent0; // 0x0900 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_70_StaticMeshComponent0; // 0x0908 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_69_StaticMeshComponent0; // 0x0910 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_68_StaticMeshComponent0; // 0x0918 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_67_StaticMeshComponent0; // 0x0920 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_66_StaticMeshComponent0; // 0x0928 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_65_StaticMeshComponent0; // 0x0930 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_64_StaticMeshComponent0; // 0x0938 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth_tapered12_StaticMeshComponent0;   // 0x0940 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_62_StaticMeshComponent0; // 0x0948 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_61_StaticMeshComponent0; // 0x0950 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_60_StaticMeshComponent0; // 0x0958 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_59_StaticMeshComponent0; // 0x0960 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_58_StaticMeshComponent0; // 0x0968 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_57_StaticMeshComponent0; // 0x0970 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_56_StaticMeshComponent0; // 0x0978 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_55_StaticMeshComponent0; // 0x0980 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_54_StaticMeshComponent0; // 0x0988 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_53_StaticMeshComponent0; // 0x0990 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_52_StaticMeshComponent0; // 0x0998 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_51_StaticMeshComponent0; // 0x09A0 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_50_StaticMeshComponent0; // 0x09A8 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_49_StaticMeshComponent0; // 0x09B0 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_48_StaticMeshComponent0; // 0x09B8 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_47_StaticMeshComponent0; // 0x09C0 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_46_StaticMeshComponent0; // 0x09C8 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_45_StaticMeshComponent0; // 0x09D0 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_44_StaticMeshComponent0; // 0x09D8 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_43_StaticMeshComponent0; // 0x09E0 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_42_StaticMeshComponent0; // 0x09E8 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_41_StaticMeshComponent0; // 0x09F0 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_40_StaticMeshComponent0; // 0x09F8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m143_StaticMeshComponent0;                // 0x0A00 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m142_StaticMeshComponent0;                // 0x0A08 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m141_StaticMeshComponent0;                // 0x0A10 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m140_StaticMeshComponent0;                // 0x0A18 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m139_StaticMeshComponent0;                // 0x0A20 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m138_StaticMeshComponent0;                // 0x0A28 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m137_StaticMeshComponent0;                // 0x0A30 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m136_StaticMeshComponent0;                // 0x0A38 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m135_StaticMeshComponent0;                // 0x0A40 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m134_StaticMeshComponent0;                // 0x0A48 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m133_StaticMeshComponent0;                // 0x0A50 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m132_StaticMeshComponent0;                // 0x0A58 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m131_StaticMeshComponent0;                // 0x0A60 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m130_StaticMeshComponent0;                // 0x0A68 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m129_StaticMeshComponent0;                // 0x0A70 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m128_StaticMeshComponent0;                // 0x0A78 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m127_StaticMeshComponent0;                // 0x0A80 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m126_StaticMeshComponent0;                // 0x0A88 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m125_StaticMeshComponent0;                // 0x0A90 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m124_StaticMeshComponent0;                // 0x0A98 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m123_StaticMeshComponent0;                // 0x0AA0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m122_StaticMeshComponent0;                // 0x0AA8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m121_StaticMeshComponent0;                // 0x0AB0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m120_StaticMeshComponent0;                // 0x0AB8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m119_StaticMeshComponent0;                // 0x0AC0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m118_StaticMeshComponent0;                // 0x0AC8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m117_StaticMeshComponent0;                // 0x0AD0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m116_StaticMeshComponent0;                // 0x0AD8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m115_StaticMeshComponent0;                // 0x0AE0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m114_StaticMeshComponent0;                // 0x0AE8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m113_StaticMeshComponent0;                // 0x0AF0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m112_StaticMeshComponent0;                // 0x0AF8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m111_StaticMeshComponent0;                // 0x0B00 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long_ultra30_StaticMeshComponent0;   // 0x0B08 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long_ultra29_StaticMeshComponent0;   // 0x0B10 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long_ultra28_StaticMeshComponent0;   // 0x0B18 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long_ultra27_StaticMeshComponent0;   // 0x0B20 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long_ultra26_StaticMeshComponent0;   // 0x0B28 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long_ultra25_StaticMeshComponent0;   // 0x0B30 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long_ultra24_StaticMeshComponent0;   // 0x0B38 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long_ultra23_StaticMeshComponent0;   // 0x0B40 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long_ultra22_StaticMeshComponent0;   // 0x0B48 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long_ultra21_StaticMeshComponent0;   // 0x0B50 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long_ultra20_StaticMeshComponent0;   // 0x0B58 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long_ultra19_StaticMeshComponent0;   // 0x0B60 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m110_StaticMeshComponent0;                // 0x0B68 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Tapered_Cut14_StaticMeshComponent0;         // 0x0B70 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m109_StaticMeshComponent0;                // 0x0B78 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m108_StaticMeshComponent0;                // 0x0B80 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth_tapered18_StaticMeshComponent0;   // 0x0B88 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m107_StaticMeshComponent0;                // 0x0B90 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Tapered_Cut13_StaticMeshComponent0;         // 0x0B98 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m106_StaticMeshComponent0;                // 0x0BA0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m105_StaticMeshComponent0;                // 0x0BA8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth_tapered17_StaticMeshComponent0;   // 0x0BB0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m104_StaticMeshComponent0;                // 0x0BB8 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Tapered_Cut12_StaticMeshComponent0;         // 0x0BC0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m103_StaticMeshComponent0;                // 0x0BC8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m102_StaticMeshComponent0;                // 0x0BD0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth_tapered16_StaticMeshComponent0;   // 0x0BD8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m101_StaticMeshComponent0;                // 0x0BE0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m100_StaticMeshComponent0;                // 0x0BE8 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Tapered_Cut11_StaticMeshComponent0;         // 0x0BF0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m99_StaticMeshComponent0;                 // 0x0BF8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m98_StaticMeshComponent0;                 // 0x0C00 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth_tapered15_StaticMeshComponent0;   // 0x0C08 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m97_StaticMeshComponent0;                 // 0x0C10 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m96_StaticMeshComponent0;                 // 0x0C18 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Tapered_Cut10_StaticMeshComponent0;         // 0x0C20 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m95_StaticMeshComponent0;                 // 0x0C28 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m94_StaticMeshComponent0;                 // 0x0C30 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth_tapered14_StaticMeshComponent0;   // 0x0C38 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m93_StaticMeshComponent0;                 // 0x0C40 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m92_StaticMeshComponent0;                 // 0x0C48 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Tapered_Cut9_StaticMeshComponent0;          // 0x0C50 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m91_StaticMeshComponent0;                 // 0x0C58 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m90_StaticMeshComponent0;                 // 0x0C60 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth_tapered13_StaticMeshComponent0;   // 0x0C68 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m89_StaticMeshComponent0;                 // 0x0C70 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Tapered_Cut8_StaticMeshComponent0;          // 0x0C78 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m88_StaticMeshComponent0;                 // 0x0C80 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m87_StaticMeshComponent0;                 // 0x0C88 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_63_StaticMeshComponent0; // 0x0C90 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m156_StaticMeshComponent0;                // 0x0C98 (size: 0x8)
    class UStaticMeshComponent* SG_tiledRoof_Church_lv2_TOWER_detail2_StaticMeshComponent0; // 0x0CA0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m155_StaticMeshComponent0;                // 0x0CA8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m154_StaticMeshComponent0;                // 0x0CB0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m153_StaticMeshComponent0;                // 0x0CB8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m152_StaticMeshComponent0;                // 0x0CC0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m151_StaticMeshComponent0;                // 0x0CC8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m150_StaticMeshComponent0;                // 0x0CD0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m149_StaticMeshComponent0;                // 0x0CD8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m148_StaticMeshComponent0;                // 0x0CE0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth_tapered19_StaticMeshComponent0;   // 0x0CE8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth_tapered22_StaticMeshComponent0;   // 0x0CF0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth_tapered21_StaticMeshComponent0;   // 0x0CF8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m146_StaticMeshComponent0;                // 0x0D00 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m145_StaticMeshComponent0;                // 0x0D08 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m144_StaticMeshComponent0;                // 0x0D10 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Tapered_CutE8_StaticMeshComponent0;         // 0x0D18 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Tapered_CutE7_StaticMeshComponent0;         // 0x0D20 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Tapered_CutE6_StaticMeshComponent0;         // 0x0D28 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Tapered_CutE5_StaticMeshComponent0;         // 0x0D30 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth_tapered20_StaticMeshComponent0;   // 0x0D38 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m147_StaticMeshComponent0;                // 0x0D40 (size: 0x8)
    class UStaticMeshComponent* SG_tiledRoof_Church_lv3_StaticMeshComponent0;         // 0x0D48 (size: 0x8)
    class UStaticMeshComponent* J_ChurchWindows_Luv_centered_small8_StaticMeshComponent0; // 0x0D50 (size: 0x8)
    class UStaticMeshComponent* J_ChurchWindows_Luv_centered_small7_StaticMeshComponent0; // 0x0D58 (size: 0x8)
    class UStaticMeshComponent* J_ChurchWindows_Luv_centered_medium4_StaticMeshComponent0; // 0x0D60 (size: 0x8)
    class UStaticMeshComponent* RoofTileTopSeam2_StaticMeshComponent0;                // 0x0D68 (size: 0x8)
    class UStaticMeshComponent* J_ChurchWindows_Luv_centered_medium3_StaticMeshComponent0; // 0x0D70 (size: 0x8)
    class UStaticMeshComponent* J_ChurchWindows_Luv_centered_small6_StaticMeshComponent0; // 0x0D78 (size: 0x8)
    class UStaticMeshComponent* J_ChurchWindows_Luv_centered_small5_StaticMeshComponent0; // 0x0D80 (size: 0x8)
    class UStaticMeshComponent* sg_stoneDoorA_decor2_StaticMeshComponent0;            // 0x0D88 (size: 0x8)
    class UStaticMeshComponent* J_ChurchWindows_Luv_centered_big2_StaticMeshComponent0; // 0x0D90 (size: 0x8)

}; // Size: 0xD98

#endif
