#ifndef UE4SS_SDK_C_SG_Gate_Lv2_A_HPP
#define UE4SS_SDK_C_SG_Gate_Lv2_A_HPP

class AC_SG_Gate_Lv2_A_C : public AConstructionBP_C
{
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly26_StaticMeshComponent0;    // 0x0550 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly25_StaticMeshComponent0;    // 0x0558 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly24_StaticMeshComponent0;    // 0x0560 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly23_StaticMeshComponent0;    // 0x0568 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly22_StaticMeshComponent0;    // 0x0570 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly21_StaticMeshComponent0;    // 0x0578 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly20_StaticMeshComponent0;    // 0x0580 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly19_StaticMeshComponent0;    // 0x0588 (size: 0x8)
    class UStaticMeshComponent* sg_woodenGableA4_StaticMeshComponent0;                // 0x0590 (size: 0x8)
    class UStaticMeshComponent* sg_woodenGableA3_StaticMeshComponent0;                // 0x0598 (size: 0x8)
    class UStaticMeshComponent* Dirty_Castle_Stone_LOD5_sdAta8_StaticMeshComponent0;  // 0x05A0 (size: 0x8)
    class UStaticMeshComponent* Dirty_Castle_Stone_LOD5_sdAta7_StaticMeshComponent0;  // 0x05A8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly18_StaticMeshComponent0;    // 0x05B0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly17_StaticMeshComponent0;    // 0x05B8 (size: 0x8)
    class UStaticMeshComponent* roofSingleDisplaced_cutdownTinier6_StaticMeshComponent0; // 0x05C0 (size: 0x8)
    class UStaticMeshComponent* roofSingleDisplaced_cutdownTinier5_StaticMeshComponent0; // 0x05C8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m113_StaticMeshComponent0;                // 0x05D0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m112_StaticMeshComponent0;                // 0x05D8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m111_StaticMeshComponent0;                // 0x05E0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m110_StaticMeshComponent0;                // 0x05E8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m109_StaticMeshComponent0;                // 0x05F0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m108_StaticMeshComponent0;                // 0x05F8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m107_StaticMeshComponent0;                // 0x0600 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m106_StaticMeshComponent0;                // 0x0608 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m105_StaticMeshComponent0;                // 0x0610 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short57_StaticMeshComponent0;        // 0x0618 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short56_StaticMeshComponent0;        // 0x0620 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short55_StaticMeshComponent0;        // 0x0628 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_34_StaticMeshComponent0; // 0x0630 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_33_StaticMeshComponent0; // 0x0638 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_32_StaticMeshComponent0; // 0x0640 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_31_StaticMeshComponent0; // 0x0648 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_30_StaticMeshComponent0; // 0x0650 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_29_StaticMeshComponent0; // 0x0658 (size: 0x8)
    class USceneComponent* Gate7_DefaultSceneRoot;                                    // 0x0660 (size: 0x8)

}; // Size: 0x668

#endif
