#ifndef UE4SS_SDK_C_SG_WeaverCore_LV1_HPP
#define UE4SS_SDK_C_SG_WeaverCore_LV1_HPP

class AC_SG_WeaverCore_LV1_C : public AConstructionBP_C
{
    class UStaticMeshComponent* all_aboard_pivot_boardC26_StaticMeshComponent0;       // 0x0550 (size: 0x8)
    class UStaticMeshComponent* all_aboard_pivot_boardC27_StaticMeshComponent0;       // 0x0558 (size: 0x8)
    class UStaticMeshComponent* all_aboard_pivot_boardC28_StaticMeshComponent0;       // 0x0560 (size: 0x8)
    class UStaticMeshComponent* all_aboard_pivot_boardC29_StaticMeshComponent0;       // 0x0568 (size: 0x8)
    class UStaticMeshComponent* all_aboard_pivot_boardC30_StaticMeshComponent0;       // 0x0570 (size: 0x8)
    class UStaticMeshComponent* all_aboard_pivot_boardC31_StaticMeshComponent0;       // 0x0578 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth23_StaticMeshComponent0;           // 0x0580 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth24_StaticMeshComponent0;           // 0x0588 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth25_StaticMeshComponent0;           // 0x0590 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Tapered_Cut11_StaticMeshComponent0;         // 0x0598 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Tapered_Cut12_StaticMeshComponent0;         // 0x05A0 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Tapered_Cut13_StaticMeshComponent0;         // 0x05A8 (size: 0x8)
    class UStaticMeshComponent* all_aboard_pivot_boardC32_StaticMeshComponent0;       // 0x05B0 (size: 0x8)
    class UStaticMeshComponent* all_aboard_pivot_boardC33_StaticMeshComponent0;       // 0x05B8 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_18_StaticMeshComponent0; // 0x05C0 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_19_StaticMeshComponent0; // 0x05C8 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_20_StaticMeshComponent0; // 0x05D0 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_21_StaticMeshComponent0; // 0x05D8 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_22_StaticMeshComponent0; // 0x05E0 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_23_StaticMeshComponent0; // 0x05E8 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_24_StaticMeshComponent0; // 0x05F0 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_25_StaticMeshComponent0; // 0x05F8 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_26_StaticMeshComponent0; // 0x0600 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_27_StaticMeshComponent0; // 0x0608 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_28_StaticMeshComponent0; // 0x0610 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_29_StaticMeshComponent0; // 0x0618 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_30_StaticMeshComponent0; // 0x0620 (size: 0x8)
    class UStaticMeshComponent* PlaneDenseWindowsKitchen2_StaticMeshComponent0;       // 0x0628 (size: 0x8)
    class UStaticMeshComponent* all_aboard_pivot_boardC34_StaticMeshComponent0;       // 0x0630 (size: 0x8)
    class UStaticMeshComponent* PlaneDenseWindowSlotsA_v2_Bevel2_StaticMeshComponent0; // 0x0638 (size: 0x8)
    class UStaticMeshComponent* all_aboard_pivot_boardC35_StaticMeshComponent0;       // 0x0640 (size: 0x8)
    class UStaticMeshComponent* PlaneDenseWindowsWidePainted2_StaticMeshComponent0;   // 0x0648 (size: 0x8)
    class UStaticMeshComponent* PlaneDenseBeveledWide7_StaticMeshComponent0;          // 0x0650 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth26_StaticMeshComponent0;           // 0x0658 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth27_StaticMeshComponent0;           // 0x0660 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth28_StaticMeshComponent0;           // 0x0668 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth29_StaticMeshComponent0;           // 0x0670 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Tapered_Cut14_StaticMeshComponent0;         // 0x0678 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth30_StaticMeshComponent0;           // 0x0680 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth31_StaticMeshComponent0;           // 0x0688 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Tapered_Cut15_StaticMeshComponent0;         // 0x0690 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth32_StaticMeshComponent0;           // 0x0698 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth33_StaticMeshComponent0;           // 0x06A0 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Tapered_Cut16_StaticMeshComponent0;         // 0x06A8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth34_StaticMeshComponent0;           // 0x06B0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth35_StaticMeshComponent0;           // 0x06B8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth36_StaticMeshComponent0;           // 0x06C0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth37_StaticMeshComponent0;           // 0x06C8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth38_StaticMeshComponent0;           // 0x06D0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth39_StaticMeshComponent0;           // 0x06D8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth40_StaticMeshComponent0;           // 0x06E0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth41_StaticMeshComponent0;           // 0x06E8 (size: 0x8)
    class UStaticMeshComponent* all_aboard_pivot_boardC36_StaticMeshComponent0;       // 0x06F0 (size: 0x8)
    class UStaticMeshComponent* all_aboard_pivot_boardC37_StaticMeshComponent0;       // 0x06F8 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Tapered_Cut17_StaticMeshComponent0;         // 0x0700 (size: 0x8)
    class UStaticMeshComponent* all_aboard_pivot_boardC38_StaticMeshComponent0;       // 0x0708 (size: 0x8)
    class UStaticMeshComponent* all_aboard_pivot_boardC39_StaticMeshComponent0;       // 0x0710 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Tapered_Cut18_StaticMeshComponent0;         // 0x0718 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_31_StaticMeshComponent0; // 0x0720 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_32_StaticMeshComponent0; // 0x0728 (size: 0x8)
    class UStaticMeshComponent* all_aboard_pivot_boardC40_StaticMeshComponent0;       // 0x0730 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth42_StaticMeshComponent0;           // 0x0738 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth43_StaticMeshComponent0;           // 0x0740 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth44_StaticMeshComponent0;           // 0x0748 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Tapered_Cut19_StaticMeshComponent0;         // 0x0750 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed6_StaticMeshComponent0;            // 0x0758 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed7_StaticMeshComponent0;            // 0x0760 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed8_StaticMeshComponent0;            // 0x0768 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed9_StaticMeshComponent0;            // 0x0770 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed10_StaticMeshComponent0;           // 0x0778 (size: 0x8)
    class UStaticMeshComponent* PlaneDenseBeveledWide8_StaticMeshComponent0;          // 0x0780 (size: 0x8)
    class UStaticMeshComponent* planeDenseBeveledA3_StaticMeshComponent0;             // 0x0788 (size: 0x8)
    class UStaticMeshComponent* planeDenseBeveledA4_StaticMeshComponent0;             // 0x0790 (size: 0x8)
    class UStaticMeshComponent* PlaneDenseCorner5_StaticMeshComponent0;               // 0x0798 (size: 0x8)
    class UStaticMeshComponent* PlaneDenseCorner6_StaticMeshComponent0;               // 0x07A0 (size: 0x8)
    class UStaticMeshComponent* PlaneDenseSmallSegment2_StaticMeshComponent0;         // 0x07A8 (size: 0x8)
    class UStaticMeshComponent* PlaneDenseBeveledWide9_StaticMeshComponent0;          // 0x07B0 (size: 0x8)
    class UStaticMeshComponent* PlaneDenseBeveledWide10_StaticMeshComponent0;         // 0x07B8 (size: 0x8)
    class UStaticMeshComponent* PlaneDenseCorner7_StaticMeshComponent0;               // 0x07C0 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_33_StaticMeshComponent0; // 0x07C8 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_34_StaticMeshComponent0; // 0x07D0 (size: 0x8)
    class UStaticMeshComponent* PlaneDenseBeveledWide11_StaticMeshComponent0;         // 0x07D8 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Tapered_Cut20_StaticMeshComponent0;         // 0x07E0 (size: 0x8)
    class UStaticMeshComponent* PlaneDenseCorner8_StaticMeshComponent0;               // 0x07E8 (size: 0x8)
    class UStaticMeshComponent* PlaneDenseBeveledWide12_StaticMeshComponent0;         // 0x07F0 (size: 0x8)
    class UStaticMeshComponent* sg_woodenGableA2_StaticMeshComponent0;                // 0x07F8 (size: 0x8)
    class UStaticMeshComponent* sg_shutterA_short5_StaticMeshComponent0;              // 0x0800 (size: 0x8)
    class UStaticMeshComponent* sg_shutterA_short6_StaticMeshComponent0;              // 0x0808 (size: 0x8)
    class UStaticMeshComponent* sg_shutterA_short7_StaticMeshComponent0;              // 0x0810 (size: 0x8)
    class UStaticMeshComponent* sg_shutterA_short8_StaticMeshComponent0;              // 0x0818 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly24_StaticMeshComponent0;    // 0x0820 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly25_StaticMeshComponent0;    // 0x0828 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly26_StaticMeshComponent0;    // 0x0830 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly27_StaticMeshComponent0;    // 0x0838 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly28_StaticMeshComponent0;    // 0x0840 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly29_StaticMeshComponent0;    // 0x0848 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly30_StaticMeshComponent0;    // 0x0850 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly31_StaticMeshComponent0;    // 0x0858 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly32_StaticMeshComponent0;    // 0x0860 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly33_StaticMeshComponent0;    // 0x0868 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly34_StaticMeshComponent0;    // 0x0870 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly35_StaticMeshComponent0;    // 0x0878 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly36_StaticMeshComponent0;    // 0x0880 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly37_StaticMeshComponent0;    // 0x0888 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly38_StaticMeshComponent0;    // 0x0890 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly39_StaticMeshComponent0;    // 0x0898 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly40_StaticMeshComponent0;    // 0x08A0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly41_StaticMeshComponent0;    // 0x08A8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly42_StaticMeshComponent0;    // 0x08B0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly43_StaticMeshComponent0;    // 0x08B8 (size: 0x8)
    class UStaticMeshComponent* all_aboard_pivot_boardC41_StaticMeshComponent0;       // 0x08C0 (size: 0x8)
    class UStaticMeshComponent* WattleOwidzTriangle2_StaticMeshComponent0;            // 0x08C8 (size: 0x8)
    class UStaticMeshComponent* all_aboard_pivot_boardC42_StaticMeshComponent0;       // 0x08D0 (size: 0x8)
    class UStaticMeshComponent* all_aboard_pivot_boardC43_StaticMeshComponent0;       // 0x08D8 (size: 0x8)
    class UStaticMeshComponent* all_aboard_pivot_boardC44_StaticMeshComponent0;       // 0x08E0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly44_StaticMeshComponent0;    // 0x08E8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly45_StaticMeshComponent0;    // 0x08F0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly46_StaticMeshComponent0;    // 0x08F8 (size: 0x8)
    class UStaticMeshComponent* all_aboard_pivot_boardC45_StaticMeshComponent0;       // 0x0900 (size: 0x8)
    class UStaticMeshComponent* all_aboard_pivot_boardC46_StaticMeshComponent0;       // 0x0908 (size: 0x8)
    class UStaticMeshComponent* all_aboard_pivot_boardC47_StaticMeshComponent0;       // 0x0910 (size: 0x8)
    class UStaticMeshComponent* all_aboard_pivot_boardC48_StaticMeshComponent0;       // 0x0918 (size: 0x8)
    class UStaticMeshComponent* all_aboard_pivot_boardC49_StaticMeshComponent0;       // 0x0920 (size: 0x8)
    class UStaticMeshComponent* all_aboard_pivot_boardC50_StaticMeshComponent0;       // 0x0928 (size: 0x8)
    class UStaticMeshComponent* SM_WindowFrame5_StaticMeshComponent0;                 // 0x0930 (size: 0x8)
    class UStaticMeshComponent* SM_WindowFrame6_StaticMeshComponent0;                 // 0x0938 (size: 0x8)
    class UStaticMeshComponent* SM_WindowFrame7_StaticMeshComponent0;                 // 0x0940 (size: 0x8)
    class UStaticMeshComponent* SM_WindowFrame8_StaticMeshComponent0;                 // 0x0948 (size: 0x8)
    class UStaticMeshComponent* thatch_roof_weaverCoreLv2_StaticMeshComponent0;       // 0x0950 (size: 0x8)
    class UStaticMeshComponent* pebbleWallDisplaced11_StaticMeshComponent0;           // 0x0958 (size: 0x8)
    class UStaticMeshComponent* pebbleWallDisplaced12_StaticMeshComponent0;           // 0x0960 (size: 0x8)
    class UStaticMeshComponent* pebbleWallDisplaced13_StaticMeshComponent0;           // 0x0968 (size: 0x8)
    class UStaticMeshComponent* pebbleWallDisplaced14_StaticMeshComponent0;           // 0x0970 (size: 0x8)
    class UStaticMeshComponent* pebbleWallDisplaced15_StaticMeshComponent0;           // 0x0978 (size: 0x8)
    class UStaticMeshComponent* pebbleWallDisplaced16_StaticMeshComponent0;           // 0x0980 (size: 0x8)
    class UStaticMeshComponent* pebbleWallDisplaced17_StaticMeshComponent0;           // 0x0988 (size: 0x8)
    class UStaticMeshComponent* pebbleWallDisplaced18_StaticMeshComponent0;           // 0x0990 (size: 0x8)
    class UStaticMeshComponent* pebbleWallDisplaced19_StaticMeshComponent0;           // 0x0998 (size: 0x8)
    class UStaticMeshComponent* thatch_strip_A2_StaticMeshComponent0;                 // 0x09A0 (size: 0x8)
    class USceneComponent* Actor2_DefaultSceneRoot;                                   // 0x09A8 (size: 0x8)

}; // Size: 0x9B0

#endif
