#ifndef UE4SS_SDK_C_SG_WoodcuttersLodge_Cabin_HPP
#define UE4SS_SDK_C_SG_WoodcuttersLodge_Cabin_HPP

class AC_SG_WoodcuttersLodge_Cabin_C : public AConstructionBP_C
{
    class UStaticMeshComponent* strut_straighteneed174_StaticMeshComponent0;          // 0x0550 (size: 0x8)
    class UStaticMeshComponent* owidzLogWall01_sym58_StaticMeshComponent0;            // 0x0558 (size: 0x8)
    class UStaticMeshComponent* owidzLogWall01_sym57_StaticMeshComponent0;            // 0x0560 (size: 0x8)
    class UStaticMeshComponent* owidzLogWall01_sym56_StaticMeshComponent0;            // 0x0568 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA32_StaticMeshComponent0;               // 0x0570 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed173_StaticMeshComponent0;          // 0x0578 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed172_StaticMeshComponent0;          // 0x0580 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed171_StaticMeshComponent0;          // 0x0588 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed170_StaticMeshComponent0;          // 0x0590 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short349_StaticMeshComponent0;       // 0x0598 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short348_StaticMeshComponent0;       // 0x05A0 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA31_StaticMeshComponent0;               // 0x05A8 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA30_StaticMeshComponent0;               // 0x05B0 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA29_StaticMeshComponent0;               // 0x05B8 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA28_StaticMeshComponent0;               // 0x05C0 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed169_StaticMeshComponent0;          // 0x05C8 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed168_StaticMeshComponent0;          // 0x05D0 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed167_StaticMeshComponent0;          // 0x05D8 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed166_StaticMeshComponent0;          // 0x05E0 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed165_StaticMeshComponent0;          // 0x05E8 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed164_StaticMeshComponent0;          // 0x05F0 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed163_StaticMeshComponent0;          // 0x05F8 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed162_StaticMeshComponent0;          // 0x0600 (size: 0x8)
    class UStaticMeshComponent* owidzLogWall01_sym55_StaticMeshComponent0;            // 0x0608 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed161_StaticMeshComponent0;          // 0x0610 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed160_StaticMeshComponent0;          // 0x0618 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed159_StaticMeshComponent0;          // 0x0620 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed158_StaticMeshComponent0;          // 0x0628 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed157_StaticMeshComponent0;          // 0x0630 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed156_StaticMeshComponent0;          // 0x0638 (size: 0x8)
    class UStaticMeshComponent* owidzLogWall01_sym54_StaticMeshComponent0;            // 0x0640 (size: 0x8)
    class UStaticMeshComponent* owidzLogWall01_sym53_StaticMeshComponent0;            // 0x0648 (size: 0x8)
    class UStaticMeshComponent* owidzLogWall01_sym52_StaticMeshComponent0;            // 0x0650 (size: 0x8)
    class UStaticMeshComponent* owidzLogWall01_sym51_StaticMeshComponent0;            // 0x0658 (size: 0x8)
    class UStaticMeshComponent* all_aboard_longboardE56_StaticMeshComponent0;         // 0x0660 (size: 0x8)
    class UStaticMeshComponent* all_aboard_longboardD44_StaticMeshComponent0;         // 0x0668 (size: 0x8)
    class UStaticMeshComponent* all_aboard_longboardB159_StaticMeshComponent0;        // 0x0670 (size: 0x8)
    class UStaticMeshComponent* all_aboard_longboardB158_StaticMeshComponent0;        // 0x0678 (size: 0x8)
    class UStaticMeshComponent* all_aboard_longboardB157_StaticMeshComponent0;        // 0x0680 (size: 0x8)
    class UStaticMeshComponent* all_aboard_longboardE55_StaticMeshComponent0;         // 0x0688 (size: 0x8)
    class UStaticMeshComponent* all_aboard_longboardE54_StaticMeshComponent0;         // 0x0690 (size: 0x8)
    class UStaticMeshComponent* all_aboard_longboardD43_StaticMeshComponent0;         // 0x0698 (size: 0x8)
    class UStaticMeshComponent* all_aboard_longboardE53_StaticMeshComponent0;         // 0x06A0 (size: 0x8)
    class UStaticMeshComponent* all_aboard_longboardD42_StaticMeshComponent0;         // 0x06A8 (size: 0x8)
    class UStaticMeshComponent* all_aboard_longboardE52_StaticMeshComponent0;         // 0x06B0 (size: 0x8)
    class UStaticMeshComponent* all_aboard_longboardB156_StaticMeshComponent0;        // 0x06B8 (size: 0x8)
    class UStaticMeshComponent* all_aboard_longboardB155_StaticMeshComponent0;        // 0x06C0 (size: 0x8)
    class UStaticMeshComponent* all_aboard_longboardE51_StaticMeshComponent0;         // 0x06C8 (size: 0x8)
    class UStaticMeshComponent* all_aboard_longboardD41_StaticMeshComponent0;         // 0x06D0 (size: 0x8)
    class UStaticMeshComponent* all_aboard_longboardC38_StaticMeshComponent0;         // 0x06D8 (size: 0x8)
    class UStaticMeshComponent* all_aboard_longboardB154_StaticMeshComponent0;        // 0x06E0 (size: 0x8)
    class UStaticMeshComponent* all_aboard_longboardB153_StaticMeshComponent0;        // 0x06E8 (size: 0x8)
    class UStaticMeshComponent* all_aboard_longboardE50_StaticMeshComponent0;         // 0x06F0 (size: 0x8)
    class UStaticMeshComponent* all_aboard_longboardD40_StaticMeshComponent0;         // 0x06F8 (size: 0x8)
    class UStaticMeshComponent* all_aboard_longboardC37_StaticMeshComponent0;         // 0x0700 (size: 0x8)
    class UStaticMeshComponent* all_aboard_longboardB152_StaticMeshComponent0;        // 0x0708 (size: 0x8)
    class UStaticMeshComponent* all_aboard_longboardB151_StaticMeshComponent0;        // 0x0710 (size: 0x8)
    class UStaticMeshComponent* all_aboard_longboardE49_StaticMeshComponent0;         // 0x0718 (size: 0x8)
    class UStaticMeshComponent* all_aboard_longboardD39_StaticMeshComponent0;         // 0x0720 (size: 0x8)
    class UStaticMeshComponent* all_aboard_longboardC36_StaticMeshComponent0;         // 0x0728 (size: 0x8)
    class UStaticMeshComponent* all_aboard_longboardB75_StaticMeshComponent0;         // 0x0730 (size: 0x8)
    class UStaticMeshComponent* all_aboard_longboardB74_StaticMeshComponent0;         // 0x0738 (size: 0x8)
    class UStaticMeshComponent* all_aboard_longboardE48_StaticMeshComponent0;         // 0x0740 (size: 0x8)
    class UStaticMeshComponent* all_aboard_longboardD38_StaticMeshComponent0;         // 0x0748 (size: 0x8)
    class UStaticMeshComponent* all_aboard_longboardC35_StaticMeshComponent0;         // 0x0750 (size: 0x8)
    class UStaticMeshComponent* all_aboard_longboardB73_StaticMeshComponent0;         // 0x0758 (size: 0x8)
    class UStaticMeshComponent* all_aboard_longboardE47_StaticMeshComponent0;         // 0x0760 (size: 0x8)
    class UStaticMeshComponent* all_aboard_longboardC34_StaticMeshComponent0;         // 0x0768 (size: 0x8)
    class UStaticMeshComponent* all_aboard_longboardB72_StaticMeshComponent0;         // 0x0770 (size: 0x8)
    class UStaticMeshComponent* all_aboard_longboardB71_StaticMeshComponent0;         // 0x0778 (size: 0x8)
    class UStaticMeshComponent* all_aboard_longboardE46_StaticMeshComponent0;         // 0x0780 (size: 0x8)
    class UStaticMeshComponent* all_aboard_longboardD37_StaticMeshComponent0;         // 0x0788 (size: 0x8)
    class UStaticMeshComponent* all_aboard_longboardC33_StaticMeshComponent0;         // 0x0790 (size: 0x8)
    class UStaticMeshComponent* all_aboard_longboardB70_StaticMeshComponent0;         // 0x0798 (size: 0x8)
    class UStaticMeshComponent* all_aboard_longboardB69_StaticMeshComponent0;         // 0x07A0 (size: 0x8)
    class UStaticMeshComponent* all_aboard_longboardE45_StaticMeshComponent0;         // 0x07A8 (size: 0x8)
    class UStaticMeshComponent* all_aboard_longboardD36_StaticMeshComponent0;         // 0x07B0 (size: 0x8)
    class UStaticMeshComponent* all_aboard_longboardC32_StaticMeshComponent0;         // 0x07B8 (size: 0x8)
    class UStaticMeshComponent* all_aboard_longboardB68_StaticMeshComponent0;         // 0x07C0 (size: 0x8)
    class UStaticMeshComponent* all_aboard_longboardB67_StaticMeshComponent0;         // 0x07C8 (size: 0x8)
    class UStaticMeshComponent* all_aboard_longboardE44_StaticMeshComponent0;         // 0x07D0 (size: 0x8)
    class UStaticMeshComponent* all_aboard_longboardD35_StaticMeshComponent0;         // 0x07D8 (size: 0x8)
    class UStaticMeshComponent* all_aboard_longboardC31_StaticMeshComponent0;         // 0x07E0 (size: 0x8)
    class UStaticMeshComponent* all_aboard_longboardB66_StaticMeshComponent0;         // 0x07E8 (size: 0x8)
    class UStaticMeshComponent* all_aboard_longboardB65_StaticMeshComponent0;         // 0x07F0 (size: 0x8)
    class UStaticMeshComponent* all_aboard_longboardE43_StaticMeshComponent0;         // 0x07F8 (size: 0x8)
    class UStaticMeshComponent* all_aboard_longboardD34_StaticMeshComponent0;         // 0x0800 (size: 0x8)
    class UStaticMeshComponent* all_aboard_longboardC30_StaticMeshComponent0;         // 0x0808 (size: 0x8)
    class UStaticMeshComponent* all_aboard_longboardB64_StaticMeshComponent0;         // 0x0810 (size: 0x8)
    class USceneComponent* woodcutterCabin4_DefaultSceneRoot;                         // 0x0818 (size: 0x8)

}; // Size: 0x820

#endif
