#ifndef UE4SS_SDK_C_SG_Townhouse_Lv3_C_HPP
#define UE4SS_SDK_C_SG_Townhouse_Lv3_C_HPP

class AC_SG_Townhouse_Lv3_C_C : public AConstructionBP_C
{
    class UStaticMeshComponent* SM_Beam6m_Tapered_CutB18_StaticMeshComponent0;        // 0x0550 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m180_StaticMeshComponent0;                // 0x0558 (size: 0x8)
    class UStaticMeshComponent* ClayRoofTownhouse_LV3_C2_StaticMeshComponent0;        // 0x0560 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Narrow_Var59_StaticMeshComponent0;         // 0x0568 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Narrow_Var58_StaticMeshComponent0;         // 0x0570 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_TwoWindowsStandard34_StaticMeshComponent0; // 0x0578 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_TwoWindowsStandard33_StaticMeshComponent0; // 0x0580 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_TwoWindowsStandard32_StaticMeshComponent0; // 0x0588 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_TwoWindowsStandard31_StaticMeshComponent0; // 0x0590 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_TwoWindowsStandard30_StaticMeshComponent0; // 0x0598 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_TwoWindowsStandard29_StaticMeshComponent0; // 0x05A0 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_TwoWindowsStandard28_StaticMeshComponent0; // 0x05A8 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_TwoWindowsStandard27_StaticMeshComponent0; // 0x05B0 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_TwoWindowsStandard26_StaticMeshComponent0; // 0x05B8 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_TwoWindowsStandard25_StaticMeshComponent0; // 0x05C0 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_TwoWindowsStandard24_StaticMeshComponent0; // 0x05C8 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_TwoWindowsStandard23_StaticMeshComponent0; // 0x05D0 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_TwoWindowsStandard22_StaticMeshComponent0; // 0x05D8 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_TwoWindowsStandard21_StaticMeshComponent0; // 0x05E0 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_TwoWindowsStandard20_StaticMeshComponent0; // 0x05E8 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_TwoWindowsStandard19_StaticMeshComponent0; // 0x05F0 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Narrow_Var57_StaticMeshComponent0;         // 0x05F8 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Narrow_Var56_StaticMeshComponent0;         // 0x0600 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Narrow_Var55_StaticMeshComponent0;         // 0x0608 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Narrow_Var54_StaticMeshComponent0;         // 0x0610 (size: 0x8)
    class UStaticMeshComponent* interior4_StaticMeshComponent0;                       // 0x0618 (size: 0x8)
    class UStaticMeshComponent* interior3_StaticMeshComponent0;                       // 0x0620 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly106_StaticMeshComponent0;   // 0x0628 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly105_StaticMeshComponent0;   // 0x0630 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Narrow_Var53_StaticMeshComponent0;         // 0x0638 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Narrow_Var52_StaticMeshComponent0;         // 0x0640 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Narrow_Var51_StaticMeshComponent0;         // 0x0648 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Narrow_Var50_StaticMeshComponent0;         // 0x0650 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Narrow_Var49_StaticMeshComponent0;         // 0x0658 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Narrow_Var48_StaticMeshComponent0;         // 0x0660 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Narrow_Var47_StaticMeshComponent0;         // 0x0668 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Narrow_Var46_StaticMeshComponent0;         // 0x0670 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Narrow_Var45_StaticMeshComponent0;         // 0x0678 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_TwoWindowsStandard18_StaticMeshComponent0; // 0x0680 (size: 0x8)
    class UStaticMeshComponent* FoundationSeamless_LeftCorner_500x500_supportGap12_StaticMeshComponent0; // 0x0688 (size: 0x8)
    class UStaticMeshComponent* FoundationSeamless_LeftCorner_500x500_supportGap11_StaticMeshComponent0; // 0x0690 (size: 0x8)
    class UStaticMeshComponent* FoundationSeamless_LeftCorner_500x500_supportGap10_StaticMeshComponent0; // 0x0698 (size: 0x8)
    class UStaticMeshComponent* FoundationSeamless_LeftCorner_500x500_supportGap9_StaticMeshComponent0; // 0x06A0 (size: 0x8)
    class UStaticMeshComponent* FoundationSeamless_LeftCorner_500x500_supportGap8_StaticMeshComponent0; // 0x06A8 (size: 0x8)
    class UStaticMeshComponent* FoundationSeamless_LeftCorner_500x500_supportGap7_StaticMeshComponent0; // 0x06B0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m179_StaticMeshComponent0;                // 0x06B8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m178_StaticMeshComponent0;                // 0x06C0 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Narrow_Var44_StaticMeshComponent0;         // 0x06C8 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Narrow_Var43_StaticMeshComponent0;         // 0x06D0 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Narrow_Var42_StaticMeshComponent0;         // 0x06D8 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Narrow_Var41_StaticMeshComponent0;         // 0x06E0 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Narrow_Var40_StaticMeshComponent0;         // 0x06E8 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Narrow_Var39_StaticMeshComponent0;         // 0x06F0 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Narrow_Var38_StaticMeshComponent0;         // 0x06F8 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Narrow_Var37_StaticMeshComponent0;         // 0x0700 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Narrow_Var36_StaticMeshComponent0;         // 0x0708 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Narrow_Var35_StaticMeshComponent0;         // 0x0710 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Narrow_Var34_StaticMeshComponent0;         // 0x0718 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Narrow_Var33_StaticMeshComponent0;         // 0x0720 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Narrow_Var32_StaticMeshComponent0;         // 0x0728 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Narrow_Var31_StaticMeshComponent0;         // 0x0730 (size: 0x8)
    class UStaticMeshComponent* sg_chimneyTop2_StaticMeshComponent0;                  // 0x0738 (size: 0x8)
    class UStaticMeshComponent* ChimneyLP2_StaticMeshComponent0;                      // 0x0740 (size: 0x8)
    class UStaticMeshComponent* sg_shutterA8_StaticMeshComponent0;                    // 0x0748 (size: 0x8)
    class UStaticMeshComponent* sg_shutterA_short14_StaticMeshComponent0;             // 0x0750 (size: 0x8)
    class UStaticMeshComponent* sg_shutterA_short13_StaticMeshComponent0;             // 0x0758 (size: 0x8)
    class UStaticMeshComponent* sg_shutterA7_StaticMeshComponent0;                    // 0x0760 (size: 0x8)
    class UStaticMeshComponent* sg_shutterA_short12_StaticMeshComponent0;             // 0x0768 (size: 0x8)
    class UStaticMeshComponent* sg_shutterA_short11_StaticMeshComponent0;             // 0x0770 (size: 0x8)
    class UStaticMeshComponent* sg_shutterA_short10_StaticMeshComponent0;             // 0x0778 (size: 0x8)
    class UStaticMeshComponent* sg_shutterA_short9_StaticMeshComponent0;              // 0x0780 (size: 0x8)
    class UStaticMeshComponent* sg_shutterA_short8_StaticMeshComponent0;              // 0x0788 (size: 0x8)
    class UStaticMeshComponent* sg_shutterA6_StaticMeshComponent0;                    // 0x0790 (size: 0x8)
    class UStaticMeshComponent* sg_shutterA5_StaticMeshComponent0;                    // 0x0798 (size: 0x8)
    class UStaticMeshComponent* SG_SmallGlassWindowB_Frame4_StaticMeshComponent0;     // 0x07A0 (size: 0x8)
    class UStaticMeshComponent* SG_SmallGlassWindowB_Frame3_StaticMeshComponent0;     // 0x07A8 (size: 0x8)
    class UStaticMeshComponent* SG_SmallGlassWindowA4_StaticMeshComponent0;           // 0x07B0 (size: 0x8)
    class UStaticMeshComponent* SG_SmallGlassWindowA3_StaticMeshComponent0;           // 0x07B8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly104_StaticMeshComponent0;   // 0x07C0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly103_StaticMeshComponent0;   // 0x07C8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly102_StaticMeshComponent0;   // 0x07D0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly101_StaticMeshComponent0;   // 0x07D8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly100_StaticMeshComponent0;   // 0x07E0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly99_StaticMeshComponent0;    // 0x07E8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly98_StaticMeshComponent0;    // 0x07F0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly97_StaticMeshComponent0;    // 0x07F8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly96_StaticMeshComponent0;    // 0x0800 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly95_StaticMeshComponent0;    // 0x0808 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly94_StaticMeshComponent0;    // 0x0810 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly93_StaticMeshComponent0;    // 0x0818 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly92_StaticMeshComponent0;    // 0x0820 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly91_StaticMeshComponent0;    // 0x0828 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly90_StaticMeshComponent0;    // 0x0830 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly89_StaticMeshComponent0;    // 0x0838 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly88_StaticMeshComponent0;    // 0x0840 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly87_StaticMeshComponent0;    // 0x0848 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly86_StaticMeshComponent0;    // 0x0850 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly85_StaticMeshComponent0;    // 0x0858 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly84_StaticMeshComponent0;    // 0x0860 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly83_StaticMeshComponent0;    // 0x0868 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly82_StaticMeshComponent0;    // 0x0870 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly81_StaticMeshComponent0;    // 0x0878 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly80_StaticMeshComponent0;    // 0x0880 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly79_StaticMeshComponent0;    // 0x0888 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly78_StaticMeshComponent0;    // 0x0890 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly77_StaticMeshComponent0;    // 0x0898 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly76_StaticMeshComponent0;    // 0x08A0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly75_StaticMeshComponent0;    // 0x08A8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly74_StaticMeshComponent0;    // 0x08B0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly73_StaticMeshComponent0;    // 0x08B8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly72_StaticMeshComponent0;    // 0x08C0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly71_StaticMeshComponent0;    // 0x08C8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly70_StaticMeshComponent0;    // 0x08D0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly69_StaticMeshComponent0;    // 0x08D8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly68_StaticMeshComponent0;    // 0x08E0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly67_StaticMeshComponent0;    // 0x08E8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly66_StaticMeshComponent0;    // 0x08F0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly65_StaticMeshComponent0;    // 0x08F8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly64_StaticMeshComponent0;    // 0x0900 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly63_StaticMeshComponent0;    // 0x0908 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly62_StaticMeshComponent0;    // 0x0910 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly61_StaticMeshComponent0;    // 0x0918 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly60_StaticMeshComponent0;    // 0x0920 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly59_StaticMeshComponent0;    // 0x0928 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly58_StaticMeshComponent0;    // 0x0930 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly57_StaticMeshComponent0;    // 0x0938 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly56_StaticMeshComponent0;    // 0x0940 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly55_StaticMeshComponent0;    // 0x0948 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly54_StaticMeshComponent0;    // 0x0950 (size: 0x8)
    class UStaticMeshComponent* PlaneDenseCorner4_StaticMeshComponent0;               // 0x0958 (size: 0x8)
    class UStaticMeshComponent* PlaneDenseCorner3_StaticMeshComponent0;               // 0x0960 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m177_StaticMeshComponent0;                // 0x0968 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m176_StaticMeshComponent0;                // 0x0970 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m175_StaticMeshComponent0;                // 0x0978 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m174_StaticMeshComponent0;                // 0x0980 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m173_StaticMeshComponent0;                // 0x0988 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m172_StaticMeshComponent0;                // 0x0990 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m171_StaticMeshComponent0;                // 0x0998 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m170_StaticMeshComponent0;                // 0x09A0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m169_StaticMeshComponent0;                // 0x09A8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m168_StaticMeshComponent0;                // 0x09B0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m167_StaticMeshComponent0;                // 0x09B8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m166_StaticMeshComponent0;                // 0x09C0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m165_StaticMeshComponent0;                // 0x09C8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m164_StaticMeshComponent0;                // 0x09D0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m163_StaticMeshComponent0;                // 0x09D8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m162_StaticMeshComponent0;                // 0x09E0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m161_StaticMeshComponent0;                // 0x09E8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m160_StaticMeshComponent0;                // 0x09F0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m159_StaticMeshComponent0;                // 0x09F8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m158_StaticMeshComponent0;                // 0x0A00 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m157_StaticMeshComponent0;                // 0x0A08 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m156_StaticMeshComponent0;                // 0x0A10 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m155_StaticMeshComponent0;                // 0x0A18 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m154_StaticMeshComponent0;                // 0x0A20 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m153_StaticMeshComponent0;                // 0x0A28 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m152_StaticMeshComponent0;                // 0x0A30 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m151_StaticMeshComponent0;                // 0x0A38 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m150_StaticMeshComponent0;                // 0x0A40 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m149_StaticMeshComponent0;                // 0x0A48 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m148_StaticMeshComponent0;                // 0x0A50 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m147_StaticMeshComponent0;                // 0x0A58 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m146_StaticMeshComponent0;                // 0x0A60 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m145_StaticMeshComponent0;                // 0x0A68 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m144_StaticMeshComponent0;                // 0x0A70 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m143_StaticMeshComponent0;                // 0x0A78 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m142_StaticMeshComponent0;                // 0x0A80 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m141_StaticMeshComponent0;                // 0x0A88 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m140_StaticMeshComponent0;                // 0x0A90 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m139_StaticMeshComponent0;                // 0x0A98 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m138_StaticMeshComponent0;                // 0x0AA0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short101_StaticMeshComponent0;       // 0x0AA8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m137_StaticMeshComponent0;                // 0x0AB0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m136_StaticMeshComponent0;                // 0x0AB8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m135_StaticMeshComponent0;                // 0x0AC0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m134_StaticMeshComponent0;                // 0x0AC8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m133_StaticMeshComponent0;                // 0x0AD0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m132_StaticMeshComponent0;                // 0x0AD8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m131_StaticMeshComponent0;                // 0x0AE0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m130_StaticMeshComponent0;                // 0x0AE8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m129_StaticMeshComponent0;                // 0x0AF0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m128_StaticMeshComponent0;                // 0x0AF8 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_6_StaticMeshComponent0; // 0x0B00 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_5_StaticMeshComponent0; // 0x0B08 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m127_StaticMeshComponent0;                // 0x0B10 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Tapered_CutB32_StaticMeshComponent0;        // 0x0B18 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Tapered_CutB31_StaticMeshComponent0;        // 0x0B20 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Tapered_CutB30_StaticMeshComponent0;        // 0x0B28 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Tapered_CutB29_StaticMeshComponent0;        // 0x0B30 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Tapered_CutB28_StaticMeshComponent0;        // 0x0B38 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short100_StaticMeshComponent0;       // 0x0B40 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short99_StaticMeshComponent0;        // 0x0B48 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m126_StaticMeshComponent0;                // 0x0B50 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m125_StaticMeshComponent0;                // 0x0B58 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m124_StaticMeshComponent0;                // 0x0B60 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m123_StaticMeshComponent0;                // 0x0B68 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m122_StaticMeshComponent0;                // 0x0B70 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m121_StaticMeshComponent0;                // 0x0B78 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m120_StaticMeshComponent0;                // 0x0B80 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m119_StaticMeshComponent0;                // 0x0B88 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m118_StaticMeshComponent0;                // 0x0B90 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m117_StaticMeshComponent0;                // 0x0B98 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m116_StaticMeshComponent0;                // 0x0BA0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m115_StaticMeshComponent0;                // 0x0BA8 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_4_StaticMeshComponent0; // 0x0BB0 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_2_StaticMeshComponent0; // 0x0BB8 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Tapered_CutB27_StaticMeshComponent0;        // 0x0BC0 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Tapered_CutB26_StaticMeshComponent0;        // 0x0BC8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short98_StaticMeshComponent0;        // 0x0BD0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short97_StaticMeshComponent0;        // 0x0BD8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m114_StaticMeshComponent0;                // 0x0BE0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m113_StaticMeshComponent0;                // 0x0BE8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m112_StaticMeshComponent0;                // 0x0BF0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m111_StaticMeshComponent0;                // 0x0BF8 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Tapered_CutB25_StaticMeshComponent0;        // 0x0C00 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m110_StaticMeshComponent0;                // 0x0C08 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m109_StaticMeshComponent0;                // 0x0C10 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_65_StaticMeshComponent0; // 0x0C18 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_64_StaticMeshComponent0; // 0x0C20 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_63_StaticMeshComponent0; // 0x0C28 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_62_StaticMeshComponent0; // 0x0C30 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_61_StaticMeshComponent0; // 0x0C38 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_60_StaticMeshComponent0; // 0x0C40 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_59_StaticMeshComponent0; // 0x0C48 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_58_StaticMeshComponent0; // 0x0C50 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_57_StaticMeshComponent0; // 0x0C58 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_56_StaticMeshComponent0; // 0x0C60 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short96_StaticMeshComponent0;        // 0x0C68 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_55_StaticMeshComponent0; // 0x0C70 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_54_StaticMeshComponent0; // 0x0C78 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_53_StaticMeshComponent0; // 0x0C80 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_52_StaticMeshComponent0; // 0x0C88 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_51_StaticMeshComponent0; // 0x0C90 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_50_StaticMeshComponent0; // 0x0C98 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short95_StaticMeshComponent0;        // 0x0CA0 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_49_StaticMeshComponent0; // 0x0CA8 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_48_StaticMeshComponent0; // 0x0CB0 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_47_StaticMeshComponent0; // 0x0CB8 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_46_StaticMeshComponent0; // 0x0CC0 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_45_StaticMeshComponent0; // 0x0CC8 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_44_StaticMeshComponent0; // 0x0CD0 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_43_StaticMeshComponent0; // 0x0CD8 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_42_StaticMeshComponent0; // 0x0CE0 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_41_StaticMeshComponent0; // 0x0CE8 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_40_StaticMeshComponent0; // 0x0CF0 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_39_StaticMeshComponent0; // 0x0CF8 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_38_StaticMeshComponent0; // 0x0D00 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_37_StaticMeshComponent0; // 0x0D08 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_36_StaticMeshComponent0; // 0x0D10 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m108_StaticMeshComponent0;                // 0x0D18 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m107_StaticMeshComponent0;                // 0x0D20 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m106_StaticMeshComponent0;                // 0x0D28 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m105_StaticMeshComponent0;                // 0x0D30 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m104_StaticMeshComponent0;                // 0x0D38 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m103_StaticMeshComponent0;                // 0x0D40 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m102_StaticMeshComponent0;                // 0x0D48 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short94_StaticMeshComponent0;        // 0x0D50 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m101_StaticMeshComponent0;                // 0x0D58 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m100_StaticMeshComponent0;                // 0x0D60 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m99_StaticMeshComponent0;                 // 0x0D68 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Tapered_CutB24_StaticMeshComponent0;        // 0x0D70 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Tapered_CutB23_StaticMeshComponent0;        // 0x0D78 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Tapered_CutB22_StaticMeshComponent0;        // 0x0D80 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Tapered_CutB21_StaticMeshComponent0;        // 0x0D88 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Tapered_CutB20_StaticMeshComponent0;        // 0x0D90 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Tapered_CutB19_StaticMeshComponent0;        // 0x0D98 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m98_StaticMeshComponent0;                 // 0x0DA0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m97_StaticMeshComponent0;                 // 0x0DA8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m96_StaticMeshComponent0;                 // 0x0DB0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m95_StaticMeshComponent0;                 // 0x0DB8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m94_StaticMeshComponent0;                 // 0x0DC0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m93_StaticMeshComponent0;                 // 0x0DC8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short93_StaticMeshComponent0;        // 0x0DD0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short92_StaticMeshComponent0;        // 0x0DD8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short91_StaticMeshComponent0;        // 0x0DE0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short90_StaticMeshComponent0;        // 0x0DE8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short89_StaticMeshComponent0;        // 0x0DF0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short88_StaticMeshComponent0;        // 0x0DF8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short87_StaticMeshComponent0;        // 0x0E00 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m92_StaticMeshComponent0;                 // 0x0E08 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m181_StaticMeshComponent0;                // 0x0E10 (size: 0x8)
    class USceneComponent* Actor2_DefaultSceneRoot;                                   // 0x0E18 (size: 0x8)

}; // Size: 0xE20

#endif
