#ifndef UE4SS_SDK_C_SG_Weaver_Core_HPP
#define UE4SS_SDK_C_SG_Weaver_Core_HPP

class AC_SG_Weaver_Core_C : public AConstructionBP_C
{
    class UStaticMeshComponent* SM_Beam6m_Noise536_StaticMeshComponent0;              // 0x0550 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise535_StaticMeshComponent0;              // 0x0558 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise534_StaticMeshComponent0;              // 0x0560 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise533_StaticMeshComponent0;              // 0x0568 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise532_StaticMeshComponent0;              // 0x0570 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise531_StaticMeshComponent0;              // 0x0578 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise530_StaticMeshComponent0;              // 0x0580 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise529_StaticMeshComponent0;              // 0x0588 (size: 0x8)
    class UStaticMeshComponent* roofSingleDisplaced9_StaticMeshComponent0;            // 0x0590 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise528_StaticMeshComponent0;              // 0x0598 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise527_StaticMeshComponent0;              // 0x05A0 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise526_StaticMeshComponent0;              // 0x05A8 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise525_StaticMeshComponent0;              // 0x05B0 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise524_StaticMeshComponent0;              // 0x05B8 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise523_StaticMeshComponent0;              // 0x05C0 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise522_StaticMeshComponent0;              // 0x05C8 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise521_StaticMeshComponent0;              // 0x05D0 (size: 0x8)
    class UStaticMeshComponent* watt4_StaticMeshComponent0;                           // 0x05D8 (size: 0x8)
    class UStaticMeshComponent* watt3_StaticMeshComponent0;                           // 0x05E0 (size: 0x8)
    class UStaticMeshComponent* sg_peg246_StaticMeshComponent0;                       // 0x05E8 (size: 0x8)
    class UStaticMeshComponent* sg_peg245_StaticMeshComponent0;                       // 0x05F0 (size: 0x8)
    class UStaticMeshComponent* sg_peg244_StaticMeshComponent0;                       // 0x05F8 (size: 0x8)
    class UStaticMeshComponent* roofSingleDisplaced_cutdownTiny10_StaticMeshComponent0; // 0x0600 (size: 0x8)
    class UStaticMeshComponent* roofSingleDisplaced_cutdownTiny9_StaticMeshComponent0; // 0x0608 (size: 0x8)
    class UStaticMeshComponent* roofSingleDisplaced_cutdownTiny8_StaticMeshComponent0; // 0x0610 (size: 0x8)
    class UStaticMeshComponent* roofSingleDisplaced_cutdownTiny7_StaticMeshComponent0; // 0x0618 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise520_StaticMeshComponent0;              // 0x0620 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise519_StaticMeshComponent0;              // 0x0628 (size: 0x8)
    class UStaticMeshComponent* sg_peg243_StaticMeshComponent0;                       // 0x0630 (size: 0x8)
    class UStaticMeshComponent* sg_peg242_StaticMeshComponent0;                       // 0x0638 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise518_StaticMeshComponent0;              // 0x0640 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise517_StaticMeshComponent0;              // 0x0648 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise516_StaticMeshComponent0;              // 0x0650 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise515_StaticMeshComponent0;              // 0x0658 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise514_StaticMeshComponent0;              // 0x0660 (size: 0x8)
    class UStaticMeshComponent* sg_peg241_StaticMeshComponent0;                       // 0x0668 (size: 0x8)
    class UStaticMeshComponent* sg_peg240_StaticMeshComponent0;                       // 0x0670 (size: 0x8)
    class UStaticMeshComponent* doorHeadA_angled5_StaticMeshComponent0;               // 0x0678 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise513_StaticMeshComponent0;              // 0x0680 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise512_StaticMeshComponent0;              // 0x0688 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise511_StaticMeshComponent0;              // 0x0690 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise510_StaticMeshComponent0;              // 0x0698 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise509_StaticMeshComponent0;              // 0x06A0 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise508_StaticMeshComponent0;              // 0x06A8 (size: 0x8)
    class UStaticMeshComponent* glassWind15_StaticMeshComponent0;                     // 0x06B0 (size: 0x8)
    class UStaticMeshComponent* glassWind14_StaticMeshComponent0;                     // 0x06B8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long_diagonalD124_StaticMeshComponent0; // 0x06C0 (size: 0x8)
    class UStaticMeshComponent* planeDenseBeveledA57_StaticMeshComponent0;            // 0x06C8 (size: 0x8)
    class UStaticMeshComponent* roofSingleDisplaced_cutdownTiny6_StaticMeshComponent0; // 0x06D0 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise507_StaticMeshComponent0;              // 0x06D8 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise506_StaticMeshComponent0;              // 0x06E0 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise505_StaticMeshComponent0;              // 0x06E8 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise504_StaticMeshComponent0;              // 0x06F0 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise503_StaticMeshComponent0;              // 0x06F8 (size: 0x8)
    class UStaticMeshComponent* PlaneDenseCorner12_StaticMeshComponent0;              // 0x0700 (size: 0x8)
    class UStaticMeshComponent* PlaneDenseCorner11_StaticMeshComponent0;              // 0x0708 (size: 0x8)
    class UStaticMeshComponent* PlaneDenseWindowSlotsA_wider_widespacing30_StaticMeshComponent0; // 0x0710 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise502_StaticMeshComponent0;              // 0x0718 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise501_StaticMeshComponent0;              // 0x0720 (size: 0x8)
    class UStaticMeshComponent* sg_woodenGableB4_StaticMeshComponent0;                // 0x0728 (size: 0x8)
    class UStaticMeshComponent* LevitatingOuthouse4_StaticMeshComponent0;             // 0x0730 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long_diagonalD123_StaticMeshComponent0; // 0x0738 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long_diagonalD122_StaticMeshComponent0; // 0x0740 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long_diagonalD121_StaticMeshComponent0; // 0x0748 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long_diagonalD120_StaticMeshComponent0; // 0x0750 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long_diagonalD119_StaticMeshComponent0; // 0x0758 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long_diagonalD118_StaticMeshComponent0; // 0x0760 (size: 0x8)
    class UStaticMeshComponent* sg_beam_supportStraight4_StaticMeshComponent0;        // 0x0768 (size: 0x8)
    class UStaticMeshComponent* sg_beam_supportStraight3_StaticMeshComponent0;        // 0x0770 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise500_StaticMeshComponent0;              // 0x0778 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise499_StaticMeshComponent0;              // 0x0780 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise498_StaticMeshComponent0;              // 0x0788 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long_diagonalD117_StaticMeshComponent0; // 0x0790 (size: 0x8)
    class UStaticMeshComponent* roofSingleDisplaced8_StaticMeshComponent0;            // 0x0798 (size: 0x8)
    class UStaticMeshComponent* roofSingleDisplaced7_StaticMeshComponent0;            // 0x07A0 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise497_StaticMeshComponent0;              // 0x07A8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long_diagonalD116_StaticMeshComponent0; // 0x07B0 (size: 0x8)
    class UStaticMeshComponent* sg_woodenGableB3_StaticMeshComponent0;                // 0x07B8 (size: 0x8)
    class UStaticMeshComponent* roofSingleDisplaced5_StaticMeshComponent0;            // 0x07C0 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise496_StaticMeshComponent0;              // 0x07C8 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise495_StaticMeshComponent0;              // 0x07D0 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise494_StaticMeshComponent0;              // 0x07D8 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise493_StaticMeshComponent0;              // 0x07E0 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise492_StaticMeshComponent0;              // 0x07E8 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise491_StaticMeshComponent0;              // 0x07F0 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise490_StaticMeshComponent0;              // 0x07F8 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise489_StaticMeshComponent0;              // 0x0800 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise488_StaticMeshComponent0;              // 0x0808 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise487_StaticMeshComponent0;              // 0x0810 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise486_StaticMeshComponent0;              // 0x0818 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise485_StaticMeshComponent0;              // 0x0820 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise484_StaticMeshComponent0;              // 0x0828 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise483_StaticMeshComponent0;              // 0x0830 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise482_StaticMeshComponent0;              // 0x0838 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise481_StaticMeshComponent0;              // 0x0840 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise480_StaticMeshComponent0;              // 0x0848 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise479_StaticMeshComponent0;              // 0x0850 (size: 0x8)
    class UStaticMeshComponent* pebbleWallDisplaced69_StaticMeshComponent0;           // 0x0858 (size: 0x8)
    class UStaticMeshComponent* pebbleWallDisplaced68_StaticMeshComponent0;           // 0x0860 (size: 0x8)
    class UStaticMeshComponent* pebbleWallDisplaced67_StaticMeshComponent0;           // 0x0868 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long_diagonalD115_StaticMeshComponent0; // 0x0870 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise478_StaticMeshComponent0;              // 0x0878 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise477_StaticMeshComponent0;              // 0x0880 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long_diagonalD114_StaticMeshComponent0; // 0x0888 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long_diagonalD113_StaticMeshComponent0; // 0x0890 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long_diagonalD112_StaticMeshComponent0; // 0x0898 (size: 0x8)
    class UStaticMeshComponent* glassWind13_StaticMeshComponent0;                     // 0x08A0 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise476_StaticMeshComponent0;              // 0x08A8 (size: 0x8)
    class UStaticMeshComponent* PlaneDenseWindowSlotsA_wider_widespacing29_StaticMeshComponent0; // 0x08B0 (size: 0x8)
    class UStaticMeshComponent* PlaneDenseWindowSlotsA_wider_widespacing28_StaticMeshComponent0; // 0x08B8 (size: 0x8)
    class UStaticMeshComponent* PlaneDenseWindowSlotsA_wider_widespacing27_StaticMeshComponent0; // 0x08C0 (size: 0x8)
    class UStaticMeshComponent* PlaneDenseWindowSlotsA_wider_widespacing26_StaticMeshComponent0; // 0x08C8 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise475_StaticMeshComponent0;              // 0x08D0 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise474_StaticMeshComponent0;              // 0x08D8 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise473_StaticMeshComponent0;              // 0x08E0 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise472_StaticMeshComponent0;              // 0x08E8 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise471_StaticMeshComponent0;              // 0x08F0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long_diagonalD111_StaticMeshComponent0; // 0x08F8 (size: 0x8)
    class UStaticMeshComponent* glassWind12_StaticMeshComponent0;                     // 0x0900 (size: 0x8)
    class UStaticMeshComponent* sg_peg239_StaticMeshComponent0;                       // 0x0908 (size: 0x8)
    class UStaticMeshComponent* sg_peg238_StaticMeshComponent0;                       // 0x0910 (size: 0x8)
    class UStaticMeshComponent* sg_peg237_StaticMeshComponent0;                       // 0x0918 (size: 0x8)
    class UStaticMeshComponent* sg_peg236_StaticMeshComponent0;                       // 0x0920 (size: 0x8)
    class UStaticMeshComponent* sg_peg235_StaticMeshComponent0;                       // 0x0928 (size: 0x8)
    class UStaticMeshComponent* sg_peg234_StaticMeshComponent0;                       // 0x0930 (size: 0x8)
    class UStaticMeshComponent* sg_peg233_StaticMeshComponent0;                       // 0x0938 (size: 0x8)
    class UStaticMeshComponent* sg_peg232_StaticMeshComponent0;                       // 0x0940 (size: 0x8)
    class UStaticMeshComponent* sg_peg231_StaticMeshComponent0;                       // 0x0948 (size: 0x8)
    class UStaticMeshComponent* sg_peg230_StaticMeshComponent0;                       // 0x0950 (size: 0x8)
    class UStaticMeshComponent* sg_peg229_StaticMeshComponent0;                       // 0x0958 (size: 0x8)
    class UStaticMeshComponent* sg_peg228_StaticMeshComponent0;                       // 0x0960 (size: 0x8)
    class UStaticMeshComponent* sg_peg227_StaticMeshComponent0;                       // 0x0968 (size: 0x8)
    class UStaticMeshComponent* sg_peg208_StaticMeshComponent0;                       // 0x0970 (size: 0x8)
    class UStaticMeshComponent* sg_peg207_StaticMeshComponent0;                       // 0x0978 (size: 0x8)
    class UStaticMeshComponent* sg_peg205_StaticMeshComponent0;                       // 0x0980 (size: 0x8)
    class UStaticMeshComponent* sg_peg204_StaticMeshComponent0;                       // 0x0988 (size: 0x8)
    class UStaticMeshComponent* sg_peg202_StaticMeshComponent0;                       // 0x0990 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long_diagonalD110_StaticMeshComponent0; // 0x0998 (size: 0x8)
    class UStaticMeshComponent* sg_peg201_StaticMeshComponent0;                       // 0x09A0 (size: 0x8)
    class UStaticMeshComponent* sg_shutterA_short34_StaticMeshComponent0;             // 0x09A8 (size: 0x8)
    class UStaticMeshComponent* sg_shutterA_short33_StaticMeshComponent0;             // 0x09B0 (size: 0x8)
    class UStaticMeshComponent* sg_shutterA_short30_StaticMeshComponent0;             // 0x09B8 (size: 0x8)
    class UStaticMeshComponent* sg_shutterA_short29_StaticMeshComponent0;             // 0x09C0 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise470_StaticMeshComponent0;              // 0x09C8 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise469_StaticMeshComponent0;              // 0x09D0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long_diagonalD109_StaticMeshComponent0; // 0x09D8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long_diagonalD108_StaticMeshComponent0; // 0x09E0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long_diagonalD107_StaticMeshComponent0; // 0x09E8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long_diagonalD106_StaticMeshComponent0; // 0x09F0 (size: 0x8)
    class UStaticMeshComponent* planeDenseBeveledA56_StaticMeshComponent0;            // 0x09F8 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise468_StaticMeshComponent0;              // 0x0A00 (size: 0x8)
    class UStaticMeshComponent* Cube9_StaticMeshComponent0;                           // 0x0A08 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise467_StaticMeshComponent0;              // 0x0A10 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise466_StaticMeshComponent0;              // 0x0A18 (size: 0x8)
    class UStaticMeshComponent* planeDenseBeveledA49_StaticMeshComponent0;            // 0x0A20 (size: 0x8)
    class UStaticMeshComponent* planeDenseBeveledA48_StaticMeshComponent0;            // 0x0A28 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long_diagonalD105_StaticMeshComponent0; // 0x0A30 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long_diagonalD104_StaticMeshComponent0; // 0x0A38 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise465_StaticMeshComponent0;              // 0x0A40 (size: 0x8)
    class UStaticMeshComponent* PlaneDenseCorner10_StaticMeshComponent0;              // 0x0A48 (size: 0x8)
    class UStaticMeshComponent* PlaneDenseCorner9_StaticMeshComponent0;               // 0x0A50 (size: 0x8)
    class UStaticMeshComponent* PlaneDenseWindowSlotsA_wider_widespacing25_StaticMeshComponent0; // 0x0A58 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise464_StaticMeshComponent0;              // 0x0A60 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise463_StaticMeshComponent0;              // 0x0A68 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise462_StaticMeshComponent0;              // 0x0A70 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise461_StaticMeshComponent0;              // 0x0A78 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise460_StaticMeshComponent0;              // 0x0A80 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise459_StaticMeshComponent0;              // 0x0A88 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise458_StaticMeshComponent0;              // 0x0A90 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise457_StaticMeshComponent0;              // 0x0A98 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise456_StaticMeshComponent0;              // 0x0AA0 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise455_StaticMeshComponent0;              // 0x0AA8 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise454_StaticMeshComponent0;              // 0x0AB0 (size: 0x8)
    class UStaticMeshComponent* PlaneDenseWindowSlotsA_wider_widespacing24_StaticMeshComponent0; // 0x0AB8 (size: 0x8)
    class UStaticMeshComponent* PlaneDenseWindowSlotsA_wider_widespacing23_StaticMeshComponent0; // 0x0AC0 (size: 0x8)
    class UStaticMeshComponent* PlaneDenseWindowSlotsA_wider_widespacing22_StaticMeshComponent0; // 0x0AC8 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise453_StaticMeshComponent0;              // 0x0AD0 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise452_StaticMeshComponent0;              // 0x0AD8 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise451_StaticMeshComponent0;              // 0x0AE0 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise450_StaticMeshComponent0;              // 0x0AE8 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise449_StaticMeshComponent0;              // 0x0AF0 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise448_StaticMeshComponent0;              // 0x0AF8 (size: 0x8)
    class UStaticMeshComponent* PlaneDenseWindowSlotsA_wider_widespacing21_StaticMeshComponent0; // 0x0B00 (size: 0x8)
    class UStaticMeshComponent* PlaneDenseWindowSlotsA_wider_widespacing20_StaticMeshComponent0; // 0x0B08 (size: 0x8)
    class UStaticMeshComponent* planeDenseBeveledA47_StaticMeshComponent0;            // 0x0B10 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise447_StaticMeshComponent0;              // 0x0B18 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise446_StaticMeshComponent0;              // 0x0B20 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise445_StaticMeshComponent0;              // 0x0B28 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise444_StaticMeshComponent0;              // 0x0B30 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long_diagonalD103_StaticMeshComponent0; // 0x0B38 (size: 0x8)
    class UStaticMeshComponent* Aset_castle_wall_M_sdAta_LOD18_StaticMeshComponent0;  // 0x0B40 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise443_StaticMeshComponent0;              // 0x0B48 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise442_StaticMeshComponent0;              // 0x0B50 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long_diagonalD95_StaticMeshComponent0; // 0x0B58 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise441_StaticMeshComponent0;              // 0x0B60 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise440_StaticMeshComponent0;              // 0x0B68 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise439_StaticMeshComponent0;              // 0x0B70 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise438_StaticMeshComponent0;              // 0x0B78 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise437_StaticMeshComponent0;              // 0x0B80 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise436_StaticMeshComponent0;              // 0x0B88 (size: 0x8)
    class UStaticMeshComponent* pebbleWallDisplaced66_StaticMeshComponent0;           // 0x0B90 (size: 0x8)
    class UStaticMeshComponent* pebbleWallDisplaced65_StaticMeshComponent0;           // 0x0B98 (size: 0x8)
    class UStaticMeshComponent* pebbleWallDisplaced64_StaticMeshComponent0;           // 0x0BA0 (size: 0x8)
    class UStaticMeshComponent* pebbleWallDisplaced63_StaticMeshComponent0;           // 0x0BA8 (size: 0x8)
    class UStaticMeshComponent* pebbleWallDisplaced62_StaticMeshComponent0;           // 0x0BB0 (size: 0x8)
    class UStaticMeshComponent* pebbleWallDisplaced61_StaticMeshComponent0;           // 0x0BB8 (size: 0x8)
    class UStaticMeshComponent* pebbleWallDisplaced60_StaticMeshComponent0;           // 0x0BC0 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise435_StaticMeshComponent0;              // 0x0BC8 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise434_StaticMeshComponent0;              // 0x0BD0 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise433_StaticMeshComponent0;              // 0x0BD8 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise432_StaticMeshComponent0;              // 0x0BE0 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise376_StaticMeshComponent0;              // 0x0BE8 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise375_StaticMeshComponent0;              // 0x0BF0 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise303_StaticMeshComponent0;              // 0x0BF8 (size: 0x8)
    class UStaticMeshComponent* pebbleWallDisplaced59_StaticMeshComponent0;           // 0x0C00 (size: 0x8)
    class UStaticMeshComponent* pebbleWallDisplaced58_StaticMeshComponent0;           // 0x0C08 (size: 0x8)
    class UStaticMeshComponent* pebbleWallDisplaced57_StaticMeshComponent0;           // 0x0C10 (size: 0x8)
    class UStaticMeshComponent* shinglesTinyWindow4_StaticMeshComponent0;             // 0x0C18 (size: 0x8)
    class UStaticMeshComponent* shinglesTinyWindow3_StaticMeshComponent0;             // 0x0C20 (size: 0x8)
    class USceneComponent* SG_Weaver_Core2_DefaultSceneRoot;                          // 0x0C28 (size: 0x8)

}; // Size: 0xC30

#endif
