#ifndef UE4SS_SDK_C_SG_Shed_Granary_HPP
#define UE4SS_SDK_C_SG_Shed_Granary_HPP

class AC_SG_Shed_Granary_C : public AConstructionBP_C
{
    class UStaticMeshComponent* sg_WallRough_D9_StaticMeshComponent0;                 // 0x0550 (size: 0x8)
    class UStaticMeshComponent* sg_WallRough_C39_StaticMeshComponent0;                // 0x0558 (size: 0x8)
    class UStaticMeshComponent* sg_WallRough_D8_StaticMeshComponent0;                 // 0x0560 (size: 0x8)
    class UStaticMeshComponent* sg_WallRough_C38_StaticMeshComponent0;                // 0x0568 (size: 0x8)
    class UStaticMeshComponent* sg_WallRough_A4_StaticMeshComponent0;                 // 0x0570 (size: 0x8)
    class UStaticMeshComponent* sg_WallRough_C37_StaticMeshComponent0;                // 0x0578 (size: 0x8)
    class UStaticMeshComponent* sg_WallRough_C36_StaticMeshComponent0;                // 0x0580 (size: 0x8)
    class UStaticMeshComponent* sg_WallRough_C35_StaticMeshComponent0;                // 0x0588 (size: 0x8)
    class UStaticMeshComponent* sg_WallRough_C34_StaticMeshComponent0;                // 0x0590 (size: 0x8)
    class UStaticMeshComponent* sg_WallRough_C33_StaticMeshComponent0;                // 0x0598 (size: 0x8)
    class UStaticMeshComponent* sg_WallRough_C32_StaticMeshComponent0;                // 0x05A0 (size: 0x8)
    class UStaticMeshComponent* sg_WallRough_C31_StaticMeshComponent0;                // 0x05A8 (size: 0x8)
    class UStaticMeshComponent* sg_WallRough_C30_StaticMeshComponent0;                // 0x05B0 (size: 0x8)
    class UStaticMeshComponent* sg_WallRough_C29_StaticMeshComponent0;                // 0x05B8 (size: 0x8)
    class UStaticMeshComponent* sg_WallRough_C28_StaticMeshComponent0;                // 0x05C0 (size: 0x8)
    class UStaticMeshComponent* sg_WallRough_D7_StaticMeshComponent0;                 // 0x05C8 (size: 0x8)
    class UStaticMeshComponent* sg_WallRough_C27_StaticMeshComponent0;                // 0x05D0 (size: 0x8)
    class UStaticMeshComponent* sg_WallRough_C26_StaticMeshComponent0;                // 0x05D8 (size: 0x8)
    class UStaticMeshComponent* sg_WallRough_C25_StaticMeshComponent0;                // 0x05E0 (size: 0x8)
    class UStaticMeshComponent* sg_WallRough_C24_StaticMeshComponent0;                // 0x05E8 (size: 0x8)
    class UStaticMeshComponent* sg_WallRough_C23_StaticMeshComponent0;                // 0x05F0 (size: 0x8)
    class UStaticMeshComponent* sg_WallRough_C22_StaticMeshComponent0;                // 0x05F8 (size: 0x8)
    class UStaticMeshComponent* sg_WallRough_D6_StaticMeshComponent0;                 // 0x0600 (size: 0x8)
    class UStaticMeshComponent* sg_WallRough_C21_StaticMeshComponent0;                // 0x0608 (size: 0x8)
    class UStaticMeshComponent* sg_WallRough_A3_StaticMeshComponent0;                 // 0x0610 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly18_StaticMeshComponent0;    // 0x0618 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly17_StaticMeshComponent0;    // 0x0620 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly16_StaticMeshComponent0;    // 0x0628 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly15_StaticMeshComponent0;    // 0x0630 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly14_StaticMeshComponent0;    // 0x0638 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly13_StaticMeshComponent0;    // 0x0640 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly12_StaticMeshComponent0;    // 0x0648 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly11_StaticMeshComponent0;    // 0x0650 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly10_StaticMeshComponent0;    // 0x0658 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short71_StaticMeshComponent0;        // 0x0660 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short70_StaticMeshComponent0;        // 0x0668 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed62_StaticMeshComponent0;           // 0x0670 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed61_StaticMeshComponent0;           // 0x0678 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed60_StaticMeshComponent0;           // 0x0680 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed59_StaticMeshComponent0;           // 0x0688 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed58_StaticMeshComponent0;           // 0x0690 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed57_StaticMeshComponent0;           // 0x0698 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed56_StaticMeshComponent0;           // 0x06A0 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed55_StaticMeshComponent0;           // 0x06A8 (size: 0x8)
    class UStaticMeshComponent* foundationTiling_A_detailed33_StaticMeshComponent0;   // 0x06B0 (size: 0x8)
    class UStaticMeshComponent* foundationTiling_A_detailed32_StaticMeshComponent0;   // 0x06B8 (size: 0x8)
    class UStaticMeshComponent* foundationTiling_A_detailed31_StaticMeshComponent0;   // 0x06C0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short69_StaticMeshComponent0;        // 0x06C8 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed54_StaticMeshComponent0;           // 0x06D0 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed53_StaticMeshComponent0;           // 0x06D8 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed52_StaticMeshComponent0;           // 0x06E0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m33_StaticMeshComponent0;                 // 0x06E8 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed51_StaticMeshComponent0;           // 0x06F0 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed50_StaticMeshComponent0;           // 0x06F8 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed49_StaticMeshComponent0;           // 0x0700 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m32_StaticMeshComponent0;                 // 0x0708 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short68_StaticMeshComponent0;        // 0x0710 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short67_StaticMeshComponent0;        // 0x0718 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed48_StaticMeshComponent0;           // 0x0720 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed47_StaticMeshComponent0;           // 0x0728 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed46_StaticMeshComponent0;           // 0x0730 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m31_StaticMeshComponent0;                 // 0x0738 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed45_StaticMeshComponent0;           // 0x0740 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed44_StaticMeshComponent0;           // 0x0748 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed43_StaticMeshComponent0;           // 0x0750 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m30_StaticMeshComponent0;                 // 0x0758 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m29_StaticMeshComponent0;                 // 0x0760 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m28_StaticMeshComponent0;                 // 0x0768 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m27_StaticMeshComponent0;                 // 0x0770 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m26_StaticMeshComponent0;                 // 0x0778 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m25_StaticMeshComponent0;                 // 0x0780 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m24_StaticMeshComponent0;                 // 0x0788 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m23_StaticMeshComponent0;                 // 0x0790 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m22_StaticMeshComponent0;                 // 0x0798 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Tapered_CutB12_StaticMeshComponent0;        // 0x07A0 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Tapered_CutB11_StaticMeshComponent0;        // 0x07A8 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Tapered_CutB10_StaticMeshComponent0;        // 0x07B0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short66_StaticMeshComponent0;        // 0x07B8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short65_StaticMeshComponent0;        // 0x07C0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short64_StaticMeshComponent0;        // 0x07C8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short63_StaticMeshComponent0;        // 0x07D0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short62_StaticMeshComponent0;        // 0x07D8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m21_StaticMeshComponent0;                 // 0x07E0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m20_StaticMeshComponent0;                 // 0x07E8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short61_StaticMeshComponent0;        // 0x07F0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short60_StaticMeshComponent0;        // 0x07F8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short59_StaticMeshComponent0;        // 0x0800 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short58_StaticMeshComponent0;        // 0x0808 (size: 0x8)
    class UStaticMeshComponent* sg_thatch_square2_StaticMeshComponent0;               // 0x0810 (size: 0x8)
    class USceneComponent* Actor2_DefaultSceneRoot;                                   // 0x0818 (size: 0x8)

}; // Size: 0x820

#endif
