#ifndef UE4SS_SDK_C_SG_ShedLargeCrude_HPP
#define UE4SS_SDK_C_SG_ShedLargeCrude_HPP

class AC_SG_ShedLargeCrude_C : public AConstructionBP_C
{
    class UStaticMeshComponent* rope_danglingRotated14_StaticMeshComponent0;          // 0x0550 (size: 0x8)
    class UStaticMeshComponent* rope_danglingRotated13_StaticMeshComponent0;          // 0x0558 (size: 0x8)
    class UStaticMeshComponent* rope_danglingRotated12_StaticMeshComponent0;          // 0x0560 (size: 0x8)
    class UStaticMeshComponent* rope_danglingRotated11_StaticMeshComponent0;          // 0x0568 (size: 0x8)
    class UStaticMeshComponent* rope_danglingRotated10_StaticMeshComponent0;          // 0x0570 (size: 0x8)
    class UStaticMeshComponent* rope_danglingRotated9_StaticMeshComponent0;           // 0x0578 (size: 0x8)
    class UStaticMeshComponent* rope_danglingRotated8_StaticMeshComponent0;           // 0x0580 (size: 0x8)
    class UStaticMeshComponent* Cobblestone_LOD5_tjemdbyiw327_StaticMeshComponent0;   // 0x0588 (size: 0x8)
    class UStaticMeshComponent* Cobblestone_LOD5_tjemdbyiw326_StaticMeshComponent0;   // 0x0590 (size: 0x8)
    class UStaticMeshComponent* Cobblestone_LOD5_tjemdbyiw325_StaticMeshComponent0;   // 0x0598 (size: 0x8)
    class UStaticMeshComponent* Cobblestone_LOD5_tjemdbyiw324_StaticMeshComponent0;   // 0x05A0 (size: 0x8)
    class UStaticMeshComponent* Cobblestone_LOD5_tjemdbyiw323_StaticMeshComponent0;   // 0x05A8 (size: 0x8)
    class UStaticMeshComponent* Cobblestone_LOD5_tjemdbyiw322_StaticMeshComponent0;   // 0x05B0 (size: 0x8)
    class UStaticMeshComponent* Modular_Fence_3_M_LOD5_ufflaitdw_1_Ultralong49_StaticMeshComponent0; // 0x05B8 (size: 0x8)
    class UStaticMeshComponent* strutBended4_StaticMeshComponent0;                    // 0x05C0 (size: 0x8)
    class UStaticMeshComponent* strutBended3_StaticMeshComponent0;                    // 0x05C8 (size: 0x8)
    class UStaticMeshComponent* owidzThatch_luv_packedCentered8_StaticMeshComponent0; // 0x05D0 (size: 0x8)
    class UStaticMeshComponent* owidzThatch_luv_packedCentered7_StaticMeshComponent0; // 0x05D8 (size: 0x8)
    class UStaticMeshComponent* Modular_Fence_3_M_LOD5_ufflaitdw_1_Ultralong48_StaticMeshComponent0; // 0x05E0 (size: 0x8)
    class UStaticMeshComponent* Modular_Fence_3_M_LOD5_ufflaitdw_1_Ultralong47_StaticMeshComponent0; // 0x05E8 (size: 0x8)
    class UStaticMeshComponent* Modular_Fence_3_M_LOD5_ufflaitdw_1_Ultralong46_StaticMeshComponent0; // 0x05F0 (size: 0x8)
    class UStaticMeshComponent* Modular_Fence_3_M_LOD5_ufflaitdw_1_Ultralong45_StaticMeshComponent0; // 0x05F8 (size: 0x8)
    class UStaticMeshComponent* Modular_Fence_3_M_LOD5_ufflaitdw_1_Ultralong44_StaticMeshComponent0; // 0x0600 (size: 0x8)
    class UStaticMeshComponent* Modular_Fence_3_M_LOD5_ufflaitdw_1_Ultralong43_StaticMeshComponent0; // 0x0608 (size: 0x8)
    class UStaticMeshComponent* Modular_Fence_3_M_LOD5_ufflaitdw_1_Ultralong42_StaticMeshComponent0; // 0x0610 (size: 0x8)
    class UStaticMeshComponent* Modular_Fence_3_M_LOD5_ufflaitdw_1_Ultralong41_StaticMeshComponent0; // 0x0618 (size: 0x8)
    class UStaticMeshComponent* Modular_Fence_3_M_LOD5_ufflaitdw_1_Ultralong40_StaticMeshComponent0; // 0x0620 (size: 0x8)
    class UStaticMeshComponent* Modular_Fence_3_M_LOD5_ufflaitdw_1_Ultralong39_StaticMeshComponent0; // 0x0628 (size: 0x8)
    class UStaticMeshComponent* Modular_Fence_3_M_LOD5_ufflaitdw_1_Ultralong38_StaticMeshComponent0; // 0x0630 (size: 0x8)
    class UStaticMeshComponent* Modular_Fence_3_M_LOD5_ufflaitdw_1_Ultralong37_StaticMeshComponent0; // 0x0638 (size: 0x8)
    class UStaticMeshComponent* Modular_Fence_3_M_LOD5_ufflaitdw_1_Ultralong36_StaticMeshComponent0; // 0x0640 (size: 0x8)
    class UStaticMeshComponent* Modular_Fence_3_M_LOD5_ufflaitdw_1_Ultralong35_StaticMeshComponent0; // 0x0648 (size: 0x8)
    class UStaticMeshComponent* Modular_Fence_3_M_LOD5_ufflaitdw_1_Ultralong34_StaticMeshComponent0; // 0x0650 (size: 0x8)
    class UStaticMeshComponent* Modular_Fence_3_M_LOD5_ufflaitdw_1_Ultralong33_StaticMeshComponent0; // 0x0658 (size: 0x8)
    class UStaticMeshComponent* Modular_Fence_3_M_LOD5_ufflaitdw_1_Ultralong32_StaticMeshComponent0; // 0x0660 (size: 0x8)
    class UStaticMeshComponent* Modular_Fence_3_M_LOD5_ufflaitdw_128_StaticMeshComponent0; // 0x0668 (size: 0x8)
    class UStaticMeshComponent* Modular_Fence_3_M_LOD5_ufflaitdw_127_StaticMeshComponent0; // 0x0670 (size: 0x8)
    class UStaticMeshComponent* Modular_Fence_3_M_LOD5_ufflaitdw_126_StaticMeshComponent0; // 0x0678 (size: 0x8)
    class UStaticMeshComponent* Modular_Fence_3_M_LOD5_ufflaitdw_1_Ultralong31_StaticMeshComponent0; // 0x0680 (size: 0x8)
    class UStaticMeshComponent* Modular_Fence_3_M_LOD5_ufflaitdw_125_StaticMeshComponent0; // 0x0688 (size: 0x8)
    class UStaticMeshComponent* Modular_Fence_3_M_LOD5_ufflaitdw_124_StaticMeshComponent0; // 0x0690 (size: 0x8)
    class UStaticMeshComponent* Modular_Fence_3_M_LOD5_ufflaitdw_123_StaticMeshComponent0; // 0x0698 (size: 0x8)
    class USceneComponent* bigCrudeShed2_DefaultSceneRoot;                            // 0x06A0 (size: 0x8)

}; // Size: 0x6A8

#endif
