#ifndef UE4SS_SDK_C_SG_Townhouse_G_Medium_HPP
#define UE4SS_SDK_C_SG_Townhouse_G_Medium_HPP

class AC_SG_Townhouse_G_Medium_C : public AConstructionBP_C
{
    class UStaticMeshComponent* foundations_townhouse_G2_StaticMeshComponent0;        // 0x0550 (size: 0x8)
    class UStaticMeshComponent* Cube6_StaticMeshComponent0;                           // 0x0558 (size: 0x8)
    class UStaticMeshComponent* Cube5_StaticMeshComponent0;                           // 0x0560 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m126_StaticMeshComponent0;                     // 0x0568 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m125_StaticMeshComponent0;                     // 0x0570 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m124_StaticMeshComponent0;                     // 0x0578 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m123_StaticMeshComponent0;                     // 0x0580 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m122_StaticMeshComponent0;                     // 0x0588 (size: 0x8)
    class UStaticMeshComponent* Cube4_StaticMeshComponent0;                           // 0x0590 (size: 0x8)
    class UStaticMeshComponent* ClayRoof_Townhouse_G2_StaticMeshComponent0;           // 0x0598 (size: 0x8)
    class UStaticMeshComponent* SG_BigWindowA10_StaticMeshComponent0;                 // 0x05A0 (size: 0x8)
    class UStaticMeshComponent* SG_BigWindowA9_StaticMeshComponent0;                  // 0x05A8 (size: 0x8)
    class UStaticMeshComponent* UBeam_Shutter2_StaticMeshComponent0;                  // 0x05B0 (size: 0x8)
    class UStaticMeshComponent* SG_SmallGlassWindowB_Frame2_StaticMeshComponent0;     // 0x05B8 (size: 0x8)
    class UStaticMeshComponent* SG_SmallGlassWindowA2_StaticMeshComponent0;           // 0x05C0 (size: 0x8)
    class UStaticMeshComponent* SG_BigWindowA8_StaticMeshComponent0;                  // 0x05C8 (size: 0x8)
    class UStaticMeshComponent* SG_BigWindowA7_StaticMeshComponent0;                  // 0x05D0 (size: 0x8)
    class UStaticMeshComponent* SG_BigWindowA6_StaticMeshComponent0;                  // 0x05D8 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Standard33_StaticMeshComponent0;           // 0x05E0 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Narrow43_StaticMeshComponent0;             // 0x05E8 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Standard32_StaticMeshComponent0;           // 0x05F0 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Standard31_StaticMeshComponent0;           // 0x05F8 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Standard30_StaticMeshComponent0;           // 0x0600 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Standard29_StaticMeshComponent0;           // 0x0608 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Standard28_StaticMeshComponent0;           // 0x0610 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Narrow42_StaticMeshComponent0;             // 0x0618 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_SlitThinner4_StaticMeshComponent0;         // 0x0620 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_StandardSingleWindow9_StaticMeshComponent0; // 0x0628 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_SingleWindowNarrow3_StaticMeshComponent0;  // 0x0630 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_TwoWindowsStandard4_StaticMeshComponent0;  // 0x0638 (size: 0x8)
    class UStaticMeshComponent* UBeam_GableSimpleA4_StaticMeshComponent0;             // 0x0640 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Narrow41_StaticMeshComponent0;             // 0x0648 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Narrow40_StaticMeshComponent0;             // 0x0650 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Narrow39_StaticMeshComponent0;             // 0x0658 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Narrow38_StaticMeshComponent0;             // 0x0660 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Corner10_StaticMeshComponent0;             // 0x0668 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Corner9_StaticMeshComponent0;              // 0x0670 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Standard27_StaticMeshComponent0;           // 0x0678 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Standard26_StaticMeshComponent0;           // 0x0680 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Standard25_StaticMeshComponent0;           // 0x0688 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Narrow37_StaticMeshComponent0;             // 0x0690 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Narrow36_StaticMeshComponent0;             // 0x0698 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_TwoWindowsStandard_Wide6_StaticMeshComponent0; // 0x06A0 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardB4_StaticMeshComponent0;             // 0x06A8 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardB3_StaticMeshComponent0;             // 0x06B0 (size: 0x8)
    class UStaticMeshComponent* UBeam_GableSimpleA3_StaticMeshComponent0;             // 0x06B8 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_SlitThinner3_StaticMeshComponent0;         // 0x06C0 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Narrow35_StaticMeshComponent0;             // 0x06C8 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Narrow34_StaticMeshComponent0;             // 0x06D0 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Narrow33_StaticMeshComponent0;             // 0x06D8 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Narrow32_StaticMeshComponent0;             // 0x06E0 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Narrow31_StaticMeshComponent0;             // 0x06E8 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Corner8_StaticMeshComponent0;              // 0x06F0 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Corner7_StaticMeshComponent0;              // 0x06F8 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Standard24_StaticMeshComponent0;           // 0x0700 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Standard23_StaticMeshComponent0;           // 0x0708 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Standard22_StaticMeshComponent0;           // 0x0710 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Narrow30_StaticMeshComponent0;             // 0x0718 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_StandardSingleWindow8_StaticMeshComponent0; // 0x0720 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_TwoWindowsStandard3_StaticMeshComponent0;  // 0x0728 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Narrow29_StaticMeshComponent0;             // 0x0730 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Narrow28_StaticMeshComponent0;             // 0x0738 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Standard21_StaticMeshComponent0;           // 0x0740 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Standard20_StaticMeshComponent0;           // 0x0748 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Standard19_StaticMeshComponent0;           // 0x0750 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_StandardSingleWindow7_StaticMeshComponent0; // 0x0758 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Slit_SmokeHole2_StaticMeshComponent0;      // 0x0760 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Standard18_StaticMeshComponent0;           // 0x0768 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Narrow27_StaticMeshComponent0;             // 0x0770 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Narrow26_StaticMeshComponent0;             // 0x0778 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Narrow25_StaticMeshComponent0;             // 0x0780 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Narrow24_StaticMeshComponent0;             // 0x0788 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_TwoWindowsStandard_Wide5_StaticMeshComponent0; // 0x0790 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Narrow23_StaticMeshComponent0;             // 0x0798 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_StandardSingleWindow6_StaticMeshComponent0; // 0x07A0 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg223_StaticMeshComponent0;    // 0x07A8 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg222_StaticMeshComponent0;    // 0x07B0 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg221_StaticMeshComponent0;    // 0x07B8 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg220_StaticMeshComponent0;    // 0x07C0 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg219_StaticMeshComponent0;    // 0x07C8 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg218_StaticMeshComponent0;    // 0x07D0 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg217_StaticMeshComponent0;    // 0x07D8 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg216_StaticMeshComponent0;    // 0x07E0 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg215_StaticMeshComponent0;    // 0x07E8 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg214_StaticMeshComponent0;    // 0x07F0 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg213_StaticMeshComponent0;    // 0x07F8 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg212_StaticMeshComponent0;    // 0x0800 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg211_StaticMeshComponent0;    // 0x0808 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg210_StaticMeshComponent0;    // 0x0810 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg209_StaticMeshComponent0;    // 0x0818 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg208_StaticMeshComponent0;    // 0x0820 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg207_StaticMeshComponent0;    // 0x0828 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg206_StaticMeshComponent0;    // 0x0830 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg205_StaticMeshComponent0;    // 0x0838 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg204_StaticMeshComponent0;    // 0x0840 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg203_StaticMeshComponent0;    // 0x0848 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg202_StaticMeshComponent0;    // 0x0850 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg201_StaticMeshComponent0;    // 0x0858 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg200_StaticMeshComponent0;    // 0x0860 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg199_StaticMeshComponent0;    // 0x0868 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg198_StaticMeshComponent0;    // 0x0870 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg197_StaticMeshComponent0;    // 0x0878 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg196_StaticMeshComponent0;    // 0x0880 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg195_StaticMeshComponent0;    // 0x0888 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg194_StaticMeshComponent0;    // 0x0890 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg193_StaticMeshComponent0;    // 0x0898 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg192_StaticMeshComponent0;    // 0x08A0 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg191_StaticMeshComponent0;    // 0x08A8 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg190_StaticMeshComponent0;    // 0x08B0 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg189_StaticMeshComponent0;    // 0x08B8 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg188_StaticMeshComponent0;    // 0x08C0 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg187_StaticMeshComponent0;    // 0x08C8 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg186_StaticMeshComponent0;    // 0x08D0 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg185_StaticMeshComponent0;    // 0x08D8 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg184_StaticMeshComponent0;    // 0x08E0 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg183_StaticMeshComponent0;    // 0x08E8 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg182_StaticMeshComponent0;    // 0x08F0 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg181_StaticMeshComponent0;    // 0x08F8 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg180_StaticMeshComponent0;    // 0x0900 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg179_StaticMeshComponent0;    // 0x0908 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg178_StaticMeshComponent0;    // 0x0910 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg177_StaticMeshComponent0;    // 0x0918 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg176_StaticMeshComponent0;    // 0x0920 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg175_StaticMeshComponent0;    // 0x0928 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg174_StaticMeshComponent0;    // 0x0930 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg173_StaticMeshComponent0;    // 0x0938 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg172_StaticMeshComponent0;    // 0x0940 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg171_StaticMeshComponent0;    // 0x0948 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg170_StaticMeshComponent0;    // 0x0950 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg169_StaticMeshComponent0;    // 0x0958 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg168_StaticMeshComponent0;    // 0x0960 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg167_StaticMeshComponent0;    // 0x0968 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg166_StaticMeshComponent0;    // 0x0970 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg165_StaticMeshComponent0;    // 0x0978 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg164_StaticMeshComponent0;    // 0x0980 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg163_StaticMeshComponent0;    // 0x0988 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg162_StaticMeshComponent0;    // 0x0990 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg161_StaticMeshComponent0;    // 0x0998 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg160_StaticMeshComponent0;    // 0x09A0 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg159_StaticMeshComponent0;    // 0x09A8 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg158_StaticMeshComponent0;    // 0x09B0 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg157_StaticMeshComponent0;    // 0x09B8 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg156_StaticMeshComponent0;    // 0x09C0 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg155_StaticMeshComponent0;    // 0x09C8 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg154_StaticMeshComponent0;    // 0x09D0 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg153_StaticMeshComponent0;    // 0x09D8 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg152_StaticMeshComponent0;    // 0x09E0 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg151_StaticMeshComponent0;    // 0x09E8 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg150_StaticMeshComponent0;    // 0x09F0 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg149_StaticMeshComponent0;    // 0x09F8 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg148_StaticMeshComponent0;    // 0x0A00 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg147_StaticMeshComponent0;    // 0x0A08 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg146_StaticMeshComponent0;    // 0x0A10 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg145_StaticMeshComponent0;    // 0x0A18 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg144_StaticMeshComponent0;    // 0x0A20 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg143_StaticMeshComponent0;    // 0x0A28 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg142_StaticMeshComponent0;    // 0x0A30 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg141_StaticMeshComponent0;    // 0x0A38 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg140_StaticMeshComponent0;    // 0x0A40 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg139_StaticMeshComponent0;    // 0x0A48 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg138_StaticMeshComponent0;    // 0x0A50 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg137_StaticMeshComponent0;    // 0x0A58 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg136_StaticMeshComponent0;    // 0x0A60 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg135_StaticMeshComponent0;    // 0x0A68 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg134_StaticMeshComponent0;    // 0x0A70 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg133_StaticMeshComponent0;    // 0x0A78 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg132_StaticMeshComponent0;    // 0x0A80 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg131_StaticMeshComponent0;    // 0x0A88 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg130_StaticMeshComponent0;    // 0x0A90 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg129_StaticMeshComponent0;    // 0x0A98 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg128_StaticMeshComponent0;    // 0x0AA0 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg127_StaticMeshComponent0;    // 0x0AA8 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg126_StaticMeshComponent0;    // 0x0AB0 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg99_StaticMeshComponent0;     // 0x0AB8 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg98_StaticMeshComponent0;     // 0x0AC0 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m44_StaticMeshComponent0;                   // 0x0AC8 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m43_StaticMeshComponent0;                   // 0x0AD0 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m42_StaticMeshComponent0;                   // 0x0AD8 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m121_StaticMeshComponent0;                     // 0x0AE0 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m41_StaticMeshComponent0;                   // 0x0AE8 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m40_StaticMeshComponent0;                   // 0x0AF0 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m39_StaticMeshComponent0;                   // 0x0AF8 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m120_StaticMeshComponent0;                     // 0x0B00 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_111_StaticMeshComponent0;              // 0x0B08 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_110_StaticMeshComponent0;              // 0x0B10 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m119_StaticMeshComponent0;                     // 0x0B18 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m38_StaticMeshComponent0;                   // 0x0B20 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m37_StaticMeshComponent0;                   // 0x0B28 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m36_StaticMeshComponent0;                   // 0x0B30 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m118_StaticMeshComponent0;                     // 0x0B38 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m35_StaticMeshComponent0;                   // 0x0B40 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m34_StaticMeshComponent0;                   // 0x0B48 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m33_StaticMeshComponent0;                   // 0x0B50 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m32_StaticMeshComponent0;                   // 0x0B58 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m31_StaticMeshComponent0;                   // 0x0B60 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m30_StaticMeshComponent0;                   // 0x0B68 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_01_10_StaticMeshComponent0;            // 0x0B70 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_01_9_StaticMeshComponent0;             // 0x0B78 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m117_StaticMeshComponent0;                     // 0x0B80 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m116_StaticMeshComponent0;                     // 0x0B88 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m115_StaticMeshComponent0;                     // 0x0B90 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m114_StaticMeshComponent0;                     // 0x0B98 (size: 0x8)
    class UStaticMeshComponent* UBeam_TaperedCutB36_StaticMeshComponent0;             // 0x0BA0 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m76_StaticMeshComponent0;                      // 0x0BA8 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m75_StaticMeshComponent0;                      // 0x0BB0 (size: 0x8)
    class UStaticMeshComponent* UBeam_TaperedCutB35_StaticMeshComponent0;             // 0x0BB8 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m74_StaticMeshComponent0;                      // 0x0BC0 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m73_StaticMeshComponent0;                      // 0x0BC8 (size: 0x8)
    class UStaticMeshComponent* UBeam_TaperedCutB34_StaticMeshComponent0;             // 0x0BD0 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m72_StaticMeshComponent0;                      // 0x0BD8 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m71_StaticMeshComponent0;                      // 0x0BE0 (size: 0x8)
    class UStaticMeshComponent* UBeam_TaperedCutB33_StaticMeshComponent0;             // 0x0BE8 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m70_StaticMeshComponent0;                      // 0x0BF0 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m69_StaticMeshComponent0;                      // 0x0BF8 (size: 0x8)
    class UStaticMeshComponent* UBeam_TaperedCutB32_StaticMeshComponent0;             // 0x0C00 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m68_StaticMeshComponent0;                      // 0x0C08 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m67_StaticMeshComponent0;                      // 0x0C10 (size: 0x8)
    class UStaticMeshComponent* UBeam_TaperedCutB31_StaticMeshComponent0;             // 0x0C18 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m66_StaticMeshComponent0;                      // 0x0C20 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m65_StaticMeshComponent0;                      // 0x0C28 (size: 0x8)
    class UStaticMeshComponent* UBeam_TaperedCutB30_StaticMeshComponent0;             // 0x0C30 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m64_StaticMeshComponent0;                      // 0x0C38 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m63_StaticMeshComponent0;                      // 0x0C40 (size: 0x8)
    class UStaticMeshComponent* UBeam_TaperedCutB29_StaticMeshComponent0;             // 0x0C48 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m62_StaticMeshComponent0;                      // 0x0C50 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m61_StaticMeshComponent0;                      // 0x0C58 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_01_8_StaticMeshComponent0;             // 0x0C60 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_01_7_StaticMeshComponent0;             // 0x0C68 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m113_StaticMeshComponent0;                     // 0x0C70 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m112_StaticMeshComponent0;                     // 0x0C78 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m111_StaticMeshComponent0;                     // 0x0C80 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m110_StaticMeshComponent0;                     // 0x0C88 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m109_StaticMeshComponent0;                     // 0x0C90 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m108_StaticMeshComponent0;                     // 0x0C98 (size: 0x8)
    class UStaticMeshComponent* UBeam_TaperedCutB28_StaticMeshComponent0;             // 0x0CA0 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m60_StaticMeshComponent0;                      // 0x0CA8 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m59_StaticMeshComponent0;                      // 0x0CB0 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m29_StaticMeshComponent0;                   // 0x0CB8 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m28_StaticMeshComponent0;                   // 0x0CC0 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m27_StaticMeshComponent0;                   // 0x0CC8 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m26_StaticMeshComponent0;                   // 0x0CD0 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m25_StaticMeshComponent0;                   // 0x0CD8 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m24_StaticMeshComponent0;                   // 0x0CE0 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m23_StaticMeshComponent0;                   // 0x0CE8 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m107_StaticMeshComponent0;                     // 0x0CF0 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m106_StaticMeshComponent0;                     // 0x0CF8 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_109_StaticMeshComponent0;              // 0x0D00 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_108_StaticMeshComponent0;              // 0x0D08 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_107_StaticMeshComponent0;              // 0x0D10 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_106_StaticMeshComponent0;              // 0x0D18 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_105_StaticMeshComponent0;              // 0x0D20 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_104_StaticMeshComponent0;              // 0x0D28 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m105_StaticMeshComponent0;                     // 0x0D30 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_103_StaticMeshComponent0;              // 0x0D38 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_102_StaticMeshComponent0;              // 0x0D40 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_101_StaticMeshComponent0;              // 0x0D48 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_100_StaticMeshComponent0;              // 0x0D50 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_99_StaticMeshComponent0;               // 0x0D58 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_98_StaticMeshComponent0;               // 0x0D60 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m104_StaticMeshComponent0;                     // 0x0D68 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_97_StaticMeshComponent0;               // 0x0D70 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_96_StaticMeshComponent0;               // 0x0D78 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_95_StaticMeshComponent0;               // 0x0D80 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_94_StaticMeshComponent0;               // 0x0D88 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m103_StaticMeshComponent0;                     // 0x0D90 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m102_StaticMeshComponent0;                     // 0x0D98 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m101_StaticMeshComponent0;                     // 0x0DA0 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m100_StaticMeshComponent0;                     // 0x0DA8 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m99_StaticMeshComponent0;                      // 0x0DB0 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m98_StaticMeshComponent0;                      // 0x0DB8 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m97_StaticMeshComponent0;                      // 0x0DC0 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m96_StaticMeshComponent0;                      // 0x0DC8 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m95_StaticMeshComponent0;                      // 0x0DD0 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_93_StaticMeshComponent0;               // 0x0DD8 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_01_6_StaticMeshComponent0;             // 0x0DE0 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_92_StaticMeshComponent0;               // 0x0DE8 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m94_StaticMeshComponent0;                      // 0x0DF0 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_91_StaticMeshComponent0;               // 0x0DF8 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m93_StaticMeshComponent0;                      // 0x0E00 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m92_StaticMeshComponent0;                      // 0x0E08 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_90_StaticMeshComponent0;               // 0x0E10 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_89_StaticMeshComponent0;               // 0x0E18 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m91_StaticMeshComponent0;                      // 0x0E20 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m90_StaticMeshComponent0;                      // 0x0E28 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_88_StaticMeshComponent0;               // 0x0E30 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_87_StaticMeshComponent0;               // 0x0E38 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_86_StaticMeshComponent0;               // 0x0E40 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_85_StaticMeshComponent0;               // 0x0E48 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_84_StaticMeshComponent0;               // 0x0E50 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_83_StaticMeshComponent0;               // 0x0E58 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_82_StaticMeshComponent0;               // 0x0E60 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_81_StaticMeshComponent0;               // 0x0E68 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_80_StaticMeshComponent0;               // 0x0E70 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_79_StaticMeshComponent0;               // 0x0E78 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_78_StaticMeshComponent0;               // 0x0E80 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m89_StaticMeshComponent0;                      // 0x0E88 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_77_StaticMeshComponent0;               // 0x0E90 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_76_StaticMeshComponent0;               // 0x0E98 (size: 0x8)
    class UStaticMeshComponent* UBeam_Doorehad_SpikyTop2_StaticMeshComponent0;        // 0x0EA0 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m88_StaticMeshComponent0;                      // 0x0EA8 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m87_StaticMeshComponent0;                      // 0x0EB0 (size: 0x8)
    class UStaticMeshComponent* UBeam_TaperedCutB27_StaticMeshComponent0;             // 0x0EB8 (size: 0x8)
    class UStaticMeshComponent* UBeam_TaperedCutB26_StaticMeshComponent0;             // 0x0EC0 (size: 0x8)
    class UStaticMeshComponent* UBeam_TaperedCutB25_StaticMeshComponent0;             // 0x0EC8 (size: 0x8)
    class UStaticMeshComponent* UBeam_TaperedCutB24_StaticMeshComponent0;             // 0x0ED0 (size: 0x8)
    class UStaticMeshComponent* UBeam_TaperedCutB23_StaticMeshComponent0;             // 0x0ED8 (size: 0x8)
    class UStaticMeshComponent* UBeam_TaperedCutB22_StaticMeshComponent0;             // 0x0EE0 (size: 0x8)
    class UStaticMeshComponent* UBeam_TaperedCutB21_StaticMeshComponent0;             // 0x0EE8 (size: 0x8)
    class UStaticMeshComponent* UBeam_TaperedCutB20_StaticMeshComponent0;             // 0x0EF0 (size: 0x8)
    class UStaticMeshComponent* UBeam_TaperedCutB19_StaticMeshComponent0;             // 0x0EF8 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m58_StaticMeshComponent0;                      // 0x0F00 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m86_StaticMeshComponent0;                      // 0x0F08 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m85_StaticMeshComponent0;                      // 0x0F10 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m84_StaticMeshComponent0;                      // 0x0F18 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_75_StaticMeshComponent0;               // 0x0F20 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m83_StaticMeshComponent0;                      // 0x0F28 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_74_StaticMeshComponent0;               // 0x0F30 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_73_StaticMeshComponent0;               // 0x0F38 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m82_StaticMeshComponent0;                      // 0x0F40 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m81_StaticMeshComponent0;                      // 0x0F48 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m80_StaticMeshComponent0;                      // 0x0F50 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m79_StaticMeshComponent0;                      // 0x0F58 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m78_StaticMeshComponent0;                      // 0x0F60 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_72_StaticMeshComponent0;               // 0x0F68 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_71_StaticMeshComponent0;               // 0x0F70 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_70_StaticMeshComponent0;               // 0x0F78 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_69_StaticMeshComponent0;               // 0x0F80 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_68_StaticMeshComponent0;               // 0x0F88 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_67_StaticMeshComponent0;               // 0x0F90 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_66_StaticMeshComponent0;               // 0x0F98 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_65_StaticMeshComponent0;               // 0x0FA0 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_64_StaticMeshComponent0;               // 0x0FA8 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_63_StaticMeshComponent0;               // 0x0FB0 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_62_StaticMeshComponent0;               // 0x0FB8 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_61_StaticMeshComponent0;               // 0x0FC0 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m77_StaticMeshComponent0;                      // 0x0FC8 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m76_StaticMeshComponent0;                      // 0x0FD0 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m75_StaticMeshComponent0;                      // 0x0FD8 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m74_StaticMeshComponent0;                      // 0x0FE0 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m57_StaticMeshComponent0;                      // 0x0FE8 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m73_StaticMeshComponent0;                      // 0x0FF0 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m72_StaticMeshComponent0;                      // 0x0FF8 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m71_StaticMeshComponent0;                      // 0x1000 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m70_StaticMeshComponent0;                      // 0x1008 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m69_StaticMeshComponent0;                      // 0x1010 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m56_StaticMeshComponent0;                      // 0x1018 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m55_StaticMeshComponent0;                      // 0x1020 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m54_StaticMeshComponent0;                      // 0x1028 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m53_StaticMeshComponent0;                      // 0x1030 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m52_StaticMeshComponent0;                      // 0x1038 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m51_StaticMeshComponent0;                      // 0x1040 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m50_StaticMeshComponent0;                      // 0x1048 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m49_StaticMeshComponent0;                      // 0x1050 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m68_StaticMeshComponent0;                      // 0x1058 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m67_StaticMeshComponent0;                      // 0x1060 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m66_StaticMeshComponent0;                      // 0x1068 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m65_StaticMeshComponent0;                      // 0x1070 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m64_StaticMeshComponent0;                      // 0x1078 (size: 0x8)
    class USceneComponent* sg_townhouse_G2_DefaultSceneRoot;                          // 0x1080 (size: 0x8)

}; // Size: 0x1088

#endif
