#ifndef UE4SS_SDK_C_SG_OxShed_UBeam_HPP
#define UE4SS_SDK_C_SG_OxShed_UBeam_HPP

class AC_SG_OxShed_UBeam_C : public AConstructionBP_C
{
    class UStaticMeshComponent* UBeam_Strut_Straight80_StaticMeshComponent2;          // 0x0550 (size: 0x8)
    class UStaticMeshComponent* UBeam_Strut_Straight73_StaticMeshComponent1;          // 0x0558 (size: 0x8)
    class UStaticMeshComponent* UBeam_Strut_Straight71_StaticMeshComponent1;          // 0x0560 (size: 0x8)
    class UStaticMeshComponent* UBeam_Strut_Straight72_StaticMeshComponent1;          // 0x0568 (size: 0x8)
    class UStaticMeshComponent* UBeam_Strut_Straight74_StaticMeshComponent1;          // 0x0570 (size: 0x8)
    class UStaticMeshComponent* UBeam_Strut_Straight79_StaticMeshComponent1;          // 0x0578 (size: 0x8)
    class UStaticMeshComponent* UBeam_Strut_Straight80_StaticMeshComponent1;          // 0x0580 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg28_StaticMeshComponent0;     // 0x0588 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg27_StaticMeshComponent0;     // 0x0590 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_24_StaticMeshComponent0;               // 0x0598 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg26_StaticMeshComponent0;     // 0x05A0 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg25_StaticMeshComponent0;     // 0x05A8 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg24_StaticMeshComponent0;     // 0x05B0 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg23_StaticMeshComponent0;     // 0x05B8 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg22_StaticMeshComponent0;     // 0x05C0 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg21_StaticMeshComponent0;     // 0x05C8 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg20_StaticMeshComponent0;     // 0x05D0 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg19_StaticMeshComponent0;     // 0x05D8 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_23_StaticMeshComponent0;               // 0x05E0 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg18_StaticMeshComponent0;     // 0x05E8 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg17_StaticMeshComponent0;     // 0x05F0 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg16_StaticMeshComponent0;     // 0x05F8 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg15_StaticMeshComponent0;     // 0x0600 (size: 0x8)
    class UStaticMeshComponent* UBeam_WoodenGableA4_StaticMeshComponent0;             // 0x0608 (size: 0x8)
    class UStaticMeshComponent* UBeam_WoodenGableA3_StaticMeshComponent0;             // 0x0610 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_22_StaticMeshComponent0;               // 0x0618 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_21_StaticMeshComponent0;               // 0x0620 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_20_StaticMeshComponent0;               // 0x0628 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_19_StaticMeshComponent0;               // 0x0630 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_18_StaticMeshComponent0;               // 0x0638 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_17_StaticMeshComponent0;               // 0x0640 (size: 0x8)
    class UStaticMeshComponent* roofSingleDisplaced4_StaticMeshComponent0;            // 0x0648 (size: 0x8)
    class UStaticMeshComponent* roofSingleDisplaced3_StaticMeshComponent0;            // 0x0650 (size: 0x8)
    class UStaticMeshComponent* UBeam_Strut_Straight95_StaticMeshComponent0;          // 0x0658 (size: 0x8)
    class UStaticMeshComponent* UBeam_Strut_Straight94_StaticMeshComponent0;          // 0x0660 (size: 0x8)
    class UStaticMeshComponent* UBeam_Strut_Straight93_StaticMeshComponent0;          // 0x0668 (size: 0x8)
    class UStaticMeshComponent* UBeam_Strut_Straight92_StaticMeshComponent0;          // 0x0670 (size: 0x8)
    class UStaticMeshComponent* UBeam_Strut_Straight91_StaticMeshComponent0;          // 0x0678 (size: 0x8)
    class UStaticMeshComponent* UBeam_Strut_Straight90_StaticMeshComponent0;          // 0x0680 (size: 0x8)
    class UStaticMeshComponent* UBeam_Strut_Straight89_StaticMeshComponent0;          // 0x0688 (size: 0x8)
    class UStaticMeshComponent* UBeam_Strut_Straight88_StaticMeshComponent0;          // 0x0690 (size: 0x8)
    class UStaticMeshComponent* UBeam_Strut_Straight87_StaticMeshComponent0;          // 0x0698 (size: 0x8)
    class UStaticMeshComponent* UBeam_Strut_Straight86_StaticMeshComponent0;          // 0x06A0 (size: 0x8)
    class UStaticMeshComponent* UBeam_Strut_Straight85_StaticMeshComponent0;          // 0x06A8 (size: 0x8)
    class UStaticMeshComponent* UBeam_Strut_Straight84_StaticMeshComponent0;          // 0x06B0 (size: 0x8)
    class UStaticMeshComponent* UBeam_Strut_Straight83_StaticMeshComponent0;          // 0x06B8 (size: 0x8)
    class UStaticMeshComponent* UBeam_Strut_Straight82_StaticMeshComponent0;          // 0x06C0 (size: 0x8)
    class UStaticMeshComponent* UBeam_Strut_Straight81_StaticMeshComponent0;          // 0x06C8 (size: 0x8)
    class UStaticMeshComponent* UBeam_Strut_Straight80_StaticMeshComponent0;          // 0x06D0 (size: 0x8)
    class UStaticMeshComponent* UBeam_Strut_Straight79_StaticMeshComponent0;          // 0x06D8 (size: 0x8)
    class UStaticMeshComponent* UBeam_Strut_Straight78_StaticMeshComponent0;          // 0x06E0 (size: 0x8)
    class UStaticMeshComponent* UBeam_Strut_Straight77_StaticMeshComponent0;          // 0x06E8 (size: 0x8)
    class UStaticMeshComponent* UBeam_Strut_Straight76_StaticMeshComponent0;          // 0x06F0 (size: 0x8)
    class UStaticMeshComponent* UBeam_Strut_Straight75_StaticMeshComponent0;          // 0x06F8 (size: 0x8)
    class UStaticMeshComponent* UBeam_Strut_Straight74_StaticMeshComponent0;          // 0x0700 (size: 0x8)
    class UStaticMeshComponent* UBeam_Strut_Straight73_StaticMeshComponent0;          // 0x0708 (size: 0x8)
    class UStaticMeshComponent* UBeam_Strut_Straight72_StaticMeshComponent0;          // 0x0710 (size: 0x8)
    class UStaticMeshComponent* UBeam_Strut_Straight71_StaticMeshComponent0;          // 0x0718 (size: 0x8)
    class UStaticMeshComponent* UBeam_Strut_Straight70_StaticMeshComponent0;          // 0x0720 (size: 0x8)
    class UStaticMeshComponent* UBeam_Strut_Straight69_StaticMeshComponent0;          // 0x0728 (size: 0x8)
    class UStaticMeshComponent* UBeam_Strut_Straight68_StaticMeshComponent0;          // 0x0730 (size: 0x8)
    class UStaticMeshComponent* UBeam_Strut_Straight67_StaticMeshComponent0;          // 0x0738 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_16_StaticMeshComponent0;               // 0x0740 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_15_StaticMeshComponent0;               // 0x0748 (size: 0x8)
    class UStaticMeshComponent* UBeam_PivotShort22_StaticMeshComponent0;              // 0x0750 (size: 0x8)
    class UStaticMeshComponent* UBeam_PivotShort21_StaticMeshComponent0;              // 0x0758 (size: 0x8)
    class UStaticMeshComponent* UBeam_PivotShort20_StaticMeshComponent0;              // 0x0760 (size: 0x8)
    class UStaticMeshComponent* UBeam_PivotShort19_StaticMeshComponent0;              // 0x0768 (size: 0x8)
    class UStaticMeshComponent* UBeam_PivotShort18_StaticMeshComponent0;              // 0x0770 (size: 0x8)
    class UStaticMeshComponent* UBeam_PivotShort17_StaticMeshComponent0;              // 0x0778 (size: 0x8)
    class UStaticMeshComponent* UBeam_PivotShort16_StaticMeshComponent0;              // 0x0780 (size: 0x8)
    class UStaticMeshComponent* UBeam_PivotShort15_StaticMeshComponent0;              // 0x0788 (size: 0x8)
    class UStaticMeshComponent* UBeam_PivotShort14_StaticMeshComponent0;              // 0x0790 (size: 0x8)
    class UStaticMeshComponent* UBeam_PivotShort13_StaticMeshComponent0;              // 0x0798 (size: 0x8)
    class UStaticMeshComponent* UBeam_PivotShort12_StaticMeshComponent0;              // 0x07A0 (size: 0x8)
    class USceneComponent* sg_oxShed_ubeam2_DefaultSceneRoot;                         // 0x07A8 (size: 0x8)

}; // Size: 0x7B0

#endif
