#ifndef UE4SS_SDK_C_SG_Windmill_Top_HPP
#define UE4SS_SDK_C_SG_Windmill_Top_HPP

class AC_SG_Windmill_Top_C : public AConstructionBP_C
{
    class UStaticMeshComponent* UBeam_GableSimpleB_Planks4_StaticMeshComponent0;      // 0x0550 (size: 0x8)
    class UStaticMeshComponent* UBeam_GableSimpleB_Planks3_StaticMeshComponent0;      // 0x0558 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA115_StaticMeshComponent0;           // 0x0560 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA114_StaticMeshComponent0;           // 0x0568 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA113_StaticMeshComponent0;           // 0x0570 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA112_StaticMeshComponent0;           // 0x0578 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA111_StaticMeshComponent0;           // 0x0580 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA110_StaticMeshComponent0;           // 0x0588 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA109_StaticMeshComponent0;           // 0x0590 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA108_StaticMeshComponent0;           // 0x0598 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA107_StaticMeshComponent0;           // 0x05A0 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA106_StaticMeshComponent0;           // 0x05A8 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA105_StaticMeshComponent0;           // 0x05B0 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA104_StaticMeshComponent0;           // 0x05B8 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA103_StaticMeshComponent0;           // 0x05C0 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA102_StaticMeshComponent0;           // 0x05C8 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA101_StaticMeshComponent0;           // 0x05D0 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA100_StaticMeshComponent0;           // 0x05D8 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA99_StaticMeshComponent0;            // 0x05E0 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA98_StaticMeshComponent0;            // 0x05E8 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA97_StaticMeshComponent0;            // 0x05F0 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA96_StaticMeshComponent0;            // 0x05F8 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA95_StaticMeshComponent0;            // 0x0600 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA94_StaticMeshComponent0;            // 0x0608 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA93_StaticMeshComponent0;            // 0x0610 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA92_StaticMeshComponent0;            // 0x0618 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA64_StaticMeshComponent0;            // 0x0620 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA90_StaticMeshComponent0;            // 0x0628 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA89_StaticMeshComponent0;            // 0x0630 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA88_StaticMeshComponent0;            // 0x0638 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA87_StaticMeshComponent0;            // 0x0640 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA86_StaticMeshComponent0;            // 0x0648 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA85_StaticMeshComponent0;            // 0x0650 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA84_StaticMeshComponent0;            // 0x0658 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA83_StaticMeshComponent0;            // 0x0660 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA82_StaticMeshComponent0;            // 0x0668 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA81_StaticMeshComponent0;            // 0x0670 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA80_StaticMeshComponent0;            // 0x0678 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA79_StaticMeshComponent0;            // 0x0680 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA78_StaticMeshComponent0;            // 0x0688 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA77_StaticMeshComponent0;            // 0x0690 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA76_StaticMeshComponent0;            // 0x0698 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA75_StaticMeshComponent0;            // 0x06A0 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA74_StaticMeshComponent0;            // 0x06A8 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA73_StaticMeshComponent0;            // 0x06B0 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA72_StaticMeshComponent0;            // 0x06B8 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA71_StaticMeshComponent0;            // 0x06C0 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA70_StaticMeshComponent0;            // 0x06C8 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA69_StaticMeshComponent0;            // 0x06D0 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA68_StaticMeshComponent0;            // 0x06D8 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA67_StaticMeshComponent0;            // 0x06E0 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA66_StaticMeshComponent0;            // 0x06E8 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA65_StaticMeshComponent0;            // 0x06F0 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA91_StaticMeshComponent0;            // 0x06F8 (size: 0x8)
    class UStaticMeshComponent* door;                                                 // 0x0700 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m136_StaticMeshComponent0;                     // 0x0708 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m135_StaticMeshComponent0;                     // 0x0710 (size: 0x8)
    class USceneComponent* windmill_boarding2_DefaultSceneRoot;                       // 0x0718 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m134_StaticMeshComponent0;                     // 0x0720 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m133_StaticMeshComponent0;                     // 0x0728 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m132_StaticMeshComponent0;                     // 0x0730 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m131_StaticMeshComponent0;                     // 0x0738 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_71_StaticMeshComponent0;               // 0x0740 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_70_StaticMeshComponent0;               // 0x0748 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_69_StaticMeshComponent0;               // 0x0750 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m130_StaticMeshComponent0;                     // 0x0758 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m129_StaticMeshComponent0;                     // 0x0760 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m128_StaticMeshComponent0;                     // 0x0768 (size: 0x8)
    class UStaticMeshComponent* crane1_bearing2_StaticMeshComponent0;                 // 0x0770 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_68_StaticMeshComponent0;               // 0x0778 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_67_StaticMeshComponent0;               // 0x0780 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_66_StaticMeshComponent0;               // 0x0788 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_65_StaticMeshComponent0;               // 0x0790 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_64_StaticMeshComponent0;               // 0x0798 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_63_StaticMeshComponent0;               // 0x07A0 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_62_StaticMeshComponent0;               // 0x07A8 (size: 0x8)
    class UStaticMeshComponent* woodenShinglesMega_anotherSculpt_Detailed_SHORT2_StaticMeshComponent0; // 0x07B0 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_61_StaticMeshComponent0;               // 0x07B8 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_60_StaticMeshComponent0;               // 0x07C0 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_59_StaticMeshComponent0;               // 0x07C8 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_58_StaticMeshComponent0;               // 0x07D0 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_57_StaticMeshComponent0;               // 0x07D8 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_56_StaticMeshComponent0;               // 0x07E0 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_55_StaticMeshComponent0;               // 0x07E8 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_54_StaticMeshComponent0;               // 0x07F0 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m127_StaticMeshComponent0;                     // 0x07F8 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m126_StaticMeshComponent0;                     // 0x0800 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_53_StaticMeshComponent0;               // 0x0808 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_52_StaticMeshComponent0;               // 0x0810 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m125_StaticMeshComponent0;                     // 0x0818 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m124_StaticMeshComponent0;                     // 0x0820 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m123_StaticMeshComponent0;                     // 0x0828 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m122_StaticMeshComponent0;                     // 0x0830 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_51_StaticMeshComponent0;               // 0x0838 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_50_StaticMeshComponent0;               // 0x0840 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m121_StaticMeshComponent0;                     // 0x0848 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m120_StaticMeshComponent0;                     // 0x0850 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m119_StaticMeshComponent0;                     // 0x0858 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m118_StaticMeshComponent0;                     // 0x0860 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m117_StaticMeshComponent0;                     // 0x0868 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_49_StaticMeshComponent0;               // 0x0870 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_48_StaticMeshComponent0;               // 0x0878 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m116_StaticMeshComponent0;                     // 0x0880 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m115_StaticMeshComponent0;                     // 0x0888 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m114_StaticMeshComponent0;                     // 0x0890 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m113_StaticMeshComponent0;                     // 0x0898 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m112_StaticMeshComponent0;                     // 0x08A0 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m111_StaticMeshComponent0;                     // 0x08A8 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m110_StaticMeshComponent0;                     // 0x08B0 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m109_StaticMeshComponent0;                     // 0x08B8 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m108_StaticMeshComponent0;                     // 0x08C0 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m107_StaticMeshComponent0;                     // 0x08C8 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m106_StaticMeshComponent0;                     // 0x08D0 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m105_StaticMeshComponent0;                     // 0x08D8 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m104_StaticMeshComponent0;                     // 0x08E0 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m103_StaticMeshComponent0;                     // 0x08E8 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_47_StaticMeshComponent0;               // 0x08F0 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_46_StaticMeshComponent0;               // 0x08F8 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_45_StaticMeshComponent0;               // 0x0900 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_44_StaticMeshComponent0;               // 0x0908 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_43_StaticMeshComponent0;               // 0x0910 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_42_StaticMeshComponent0;               // 0x0918 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m102_StaticMeshComponent0;                     // 0x0920 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m101_StaticMeshComponent0;                     // 0x0928 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_41_StaticMeshComponent0;               // 0x0930 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_40_StaticMeshComponent0;               // 0x0938 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_39_StaticMeshComponent0;               // 0x0940 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_38_StaticMeshComponent0;               // 0x0948 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m100_StaticMeshComponent0;                     // 0x0950 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m99_StaticMeshComponent0;                      // 0x0958 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m98_StaticMeshComponent0;                      // 0x0960 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m97_StaticMeshComponent0;                      // 0x0968 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m96_StaticMeshComponent0;                      // 0x0970 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m95_StaticMeshComponent0;                      // 0x0978 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m94_StaticMeshComponent0;                      // 0x0980 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m93_StaticMeshComponent0;                      // 0x0988 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m92_StaticMeshComponent0;                      // 0x0990 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m91_StaticMeshComponent0;                      // 0x0998 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m90_StaticMeshComponent0;                      // 0x09A0 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m89_StaticMeshComponent0;                      // 0x09A8 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m88_StaticMeshComponent0;                      // 0x09B0 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m87_StaticMeshComponent0;                      // 0x09B8 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m86_StaticMeshComponent0;                      // 0x09C0 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m85_StaticMeshComponent0;                      // 0x09C8 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m84_StaticMeshComponent0;                      // 0x09D0 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m83_StaticMeshComponent0;                      // 0x09D8 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m82_StaticMeshComponent0;                      // 0x09E0 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m81_StaticMeshComponent0;                      // 0x09E8 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m80_StaticMeshComponent0;                      // 0x09F0 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m79_StaticMeshComponent0;                      // 0x09F8 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m78_StaticMeshComponent0;                      // 0x0A00 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m77_StaticMeshComponent0;                      // 0x0A08 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m76_StaticMeshComponent0;                      // 0x0A10 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m75_StaticMeshComponent0;                      // 0x0A18 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m74_StaticMeshComponent0;                      // 0x0A20 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m73_StaticMeshComponent0;                      // 0x0A28 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m72_StaticMeshComponent0;                      // 0x0A30 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m19_StaticMeshComponent0;                      // 0x0A38 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m14_StaticMeshComponent0;                      // 0x0A40 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m13_StaticMeshComponent0;                      // 0x0A48 (size: 0x8)
    class UStaticMeshComponent* roofSquareDisp4_StaticMeshComponent0;                 // 0x0A50 (size: 0x8)
    class UStaticMeshComponent* roofSquareDisp3_StaticMeshComponent0;                 // 0x0A58 (size: 0x8)
    class USceneComponent* SG_WindmillTop2_DefaultSceneRoot;                          // 0x0A60 (size: 0x8)

}; // Size: 0xA68

#endif
