#ifndef UE4SS_SDK_C_SG_TanneryCore_HPP
#define UE4SS_SDK_C_SG_TanneryCore_HPP

class AC_SG_TanneryCore_C : public AConstructionBP_C
{
    class UStaticMeshComponent* ClothDangling13_StaticMeshComponent0;                 // 0x0550 (size: 0x8)
    class UStaticMeshComponent* ClothDangling12_StaticMeshComponent0;                 // 0x0558 (size: 0x8)
    class UStaticMeshComponent* ClothDangling11_StaticMeshComponent0;                 // 0x0560 (size: 0x8)
    class UStaticMeshComponent* SM_Rope42_StaticMeshComponent0;                       // 0x0568 (size: 0x8)
    class UStaticMeshComponent* SM_Rope41_StaticMeshComponent0;                       // 0x0570 (size: 0x8)
    class UStaticMeshComponent* SM_Rope_4_StaticMeshComponent0;                       // 0x0578 (size: 0x8)
    class UStaticMeshComponent* rope3_StaticMeshComponent0;                           // 0x0580 (size: 0x8)
    class UStaticMeshComponent* sg_peg172_StaticMeshComponent0;                       // 0x0588 (size: 0x8)
    class UStaticMeshComponent* sg_peg171_StaticMeshComponent0;                       // 0x0590 (size: 0x8)
    class UStaticMeshComponent* sg_peg170_StaticMeshComponent0;                       // 0x0598 (size: 0x8)
    class UStaticMeshComponent* sg_peg169_StaticMeshComponent0;                       // 0x05A0 (size: 0x8)
    class UStaticMeshComponent* sg_peg168_StaticMeshComponent0;                       // 0x05A8 (size: 0x8)
    class UStaticMeshComponent* sg_peg167_StaticMeshComponent0;                       // 0x05B0 (size: 0x8)
    class UStaticMeshComponent* sg_peg166_StaticMeshComponent0;                       // 0x05B8 (size: 0x8)
    class UStaticMeshComponent* sg_peg165_StaticMeshComponent0;                       // 0x05C0 (size: 0x8)
    class UStaticMeshComponent* sg_shutterA_short23_StaticMeshComponent0;             // 0x05C8 (size: 0x8)
    class UStaticMeshComponent* sg_shutterA_short22_StaticMeshComponent0;             // 0x05D0 (size: 0x8)
    class UStaticMeshComponent* halfHipWindowWall4_StaticMeshComponent0;              // 0x05D8 (size: 0x8)
    class UStaticMeshComponent* halfHipWindowWall3_StaticMeshComponent0;              // 0x05E0 (size: 0x8)
    class UStaticMeshComponent* halfHipTanner2_StaticMeshComponent0;                  // 0x05E8 (size: 0x8)
    class UStaticMeshComponent* Dirty_Castle_Stone_LOD5_sdAta2_StaticMeshComponent0;  // 0x05F0 (size: 0x8)
    class UStaticMeshComponent* PlaneDenseWindowSlotsA_wider20_StaticMeshComponent0;  // 0x05F8 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise247_StaticMeshComponent0;              // 0x0600 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise246_StaticMeshComponent0;              // 0x0608 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise245_StaticMeshComponent0;              // 0x0610 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long_diagonalD80_StaticMeshComponent0; // 0x0618 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long_diagonalD79_StaticMeshComponent0; // 0x0620 (size: 0x8)
    class UStaticMeshComponent* PlaneDenseWindowSlotsA_wider19_StaticMeshComponent0;  // 0x0628 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long_diagonalD78_StaticMeshComponent0; // 0x0630 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long_diagonalD77_StaticMeshComponent0; // 0x0638 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long_diagonalD76_StaticMeshComponent0; // 0x0640 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long_diagonalD75_StaticMeshComponent0; // 0x0648 (size: 0x8)
    class UStaticMeshComponent* PlaneDenseWindowSlotsA_wider18_StaticMeshComponent0;  // 0x0650 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise244_StaticMeshComponent0;              // 0x0658 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise243_StaticMeshComponent0;              // 0x0660 (size: 0x8)
    class UStaticMeshComponent* PlaneDenseWindowSlotsA_wider17_StaticMeshComponent0;  // 0x0668 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long_diagonalD74_StaticMeshComponent0; // 0x0670 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long_diagonalD73_StaticMeshComponent0; // 0x0678 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long_diagonalD72_StaticMeshComponent0; // 0x0680 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long_diagonalD71_StaticMeshComponent0; // 0x0688 (size: 0x8)
    class UStaticMeshComponent* PlaneDenseWindowSlotsA_wider16_StaticMeshComponent0;  // 0x0690 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise242_StaticMeshComponent0;              // 0x0698 (size: 0x8)
    class UStaticMeshComponent* PlaneDenseWindowSlotsA_wider15_StaticMeshComponent0;  // 0x06A0 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise241_StaticMeshComponent0;              // 0x06A8 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise240_StaticMeshComponent0;              // 0x06B0 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise239_StaticMeshComponent0;              // 0x06B8 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise238_StaticMeshComponent0;              // 0x06C0 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise237_StaticMeshComponent0;              // 0x06C8 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed179_StaticMeshComponent0;          // 0x06D0 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed178_StaticMeshComponent0;          // 0x06D8 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed177_StaticMeshComponent0;          // 0x06E0 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed176_StaticMeshComponent0;          // 0x06E8 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed175_StaticMeshComponent0;          // 0x06F0 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise236_StaticMeshComponent0;              // 0x06F8 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise235_StaticMeshComponent0;              // 0x0700 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise234_StaticMeshComponent0;              // 0x0708 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise233_StaticMeshComponent0;              // 0x0710 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise232_StaticMeshComponent0;              // 0x0718 (size: 0x8)
    class UStaticMeshComponent* blackness12_StaticMeshComponent0;                     // 0x0720 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise231_StaticMeshComponent0;              // 0x0728 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise230_StaticMeshComponent0;              // 0x0730 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise229_StaticMeshComponent0;              // 0x0738 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise228_StaticMeshComponent0;              // 0x0740 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise227_StaticMeshComponent0;              // 0x0748 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise226_StaticMeshComponent0;              // 0x0750 (size: 0x8)
    class UStaticMeshComponent* PlaneDenseWindowSlotsA_wider14_StaticMeshComponent0;  // 0x0758 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise225_StaticMeshComponent0;              // 0x0760 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise224_StaticMeshComponent0;              // 0x0768 (size: 0x8)
    class UStaticMeshComponent* PlaneDenseWindowSlotsA_wider13_StaticMeshComponent0;  // 0x0770 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise223_StaticMeshComponent0;              // 0x0778 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise222_StaticMeshComponent0;              // 0x0780 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise221_StaticMeshComponent0;              // 0x0788 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise220_StaticMeshComponent0;              // 0x0790 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise219_StaticMeshComponent0;              // 0x0798 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise218_StaticMeshComponent0;              // 0x07A0 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise217_StaticMeshComponent0;              // 0x07A8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long_diagonalD70_StaticMeshComponent0; // 0x07B0 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise216_StaticMeshComponent0;              // 0x07B8 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise215_StaticMeshComponent0;              // 0x07C0 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise214_StaticMeshComponent0;              // 0x07C8 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise213_StaticMeshComponent0;              // 0x07D0 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise212_StaticMeshComponent0;              // 0x07D8 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise211_StaticMeshComponent0;              // 0x07E0 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise210_StaticMeshComponent0;              // 0x07E8 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise209_StaticMeshComponent0;              // 0x07F0 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise208_StaticMeshComponent0;              // 0x07F8 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise207_StaticMeshComponent0;              // 0x0800 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise206_StaticMeshComponent0;              // 0x0808 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long1611_StaticMeshComponent0;       // 0x0810 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long1610_StaticMeshComponent0;       // 0x0818 (size: 0x8)
    class UStaticMeshComponent* blackness11_StaticMeshComponent0;                     // 0x0820 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long_diagonalD69_StaticMeshComponent0; // 0x0828 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long_diagonalD68_StaticMeshComponent0; // 0x0830 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long_diagonalD67_StaticMeshComponent0; // 0x0838 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long_diagonalD66_StaticMeshComponent0; // 0x0840 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long_diagonalD65_StaticMeshComponent0; // 0x0848 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long1609_StaticMeshComponent0;       // 0x0850 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise205_StaticMeshComponent0;              // 0x0858 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise204_StaticMeshComponent0;              // 0x0860 (size: 0x8)
    class UStaticMeshComponent* sg_shutterA_short21_StaticMeshComponent0;             // 0x0868 (size: 0x8)
    class UStaticMeshComponent* sg_shutterA_short20_StaticMeshComponent0;             // 0x0870 (size: 0x8)
    class UStaticMeshComponent* foundationTiling_A_detailed246_StaticMeshComponent0;  // 0x0878 (size: 0x8)
    class UStaticMeshComponent* foundationTiling_A_detailed245_StaticMeshComponent0;  // 0x0880 (size: 0x8)
    class UStaticMeshComponent* foundationTiling_A_detailed244_StaticMeshComponent0;  // 0x0888 (size: 0x8)
    class UStaticMeshComponent* foundationTiling_A_detailed243_StaticMeshComponent0;  // 0x0890 (size: 0x8)
    class UStaticMeshComponent* foundationTiling_A_detailed242_StaticMeshComponent0;  // 0x0898 (size: 0x8)
    class UStaticMeshComponent* foundationTiling_A_detailed241_StaticMeshComponent0;  // 0x08A0 (size: 0x8)
    class UStaticMeshComponent* foundationTiling_A_detailed240_StaticMeshComponent0;  // 0x08A8 (size: 0x8)
    class UStaticMeshComponent* foundationTiling_A_detailed239_StaticMeshComponent0;  // 0x08B0 (size: 0x8)
    class UStaticMeshComponent* foundationTiling_A_detailed238_StaticMeshComponent0;  // 0x08B8 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise203_StaticMeshComponent0;              // 0x08C0 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise202_StaticMeshComponent0;              // 0x08C8 (size: 0x8)
    class UStaticMeshComponent* PlaneDenseWindowSlotsA_wider12_StaticMeshComponent0;  // 0x08D0 (size: 0x8)
    class UStaticMeshComponent* PlaneDenseWindowSlotsA_wider11_StaticMeshComponent0;  // 0x08D8 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise201_StaticMeshComponent0;              // 0x08E0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long1605_StaticMeshComponent0;       // 0x08E8 (size: 0x8)
    class UStaticMeshComponent* foundationTiling_A_detailed237_StaticMeshComponent0;  // 0x08F0 (size: 0x8)
    class UStaticMeshComponent* foundationTiling_A_detailed236_StaticMeshComponent0;  // 0x08F8 (size: 0x8)
    class UStaticMeshComponent* foundationTiling_A_detailed235_StaticMeshComponent0;  // 0x0900 (size: 0x8)
    class USceneComponent* sg_tannery_core2_DefaultSceneRoot;                         // 0x0908 (size: 0x8)

}; // Size: 0x910

#endif
