#ifndef UE4SS_SDK_C_SG_Tannery_LV1_HPP
#define UE4SS_SDK_C_SG_Tannery_LV1_HPP

class AC_SG_Tannery_LV1_C : public AConstructionBP_C
{
    class UStaticMeshComponent* foundationTiling_A_detailed_StaticMeshComponent0;     // 0x0550 (size: 0x8)
    class UStaticMeshComponent* foundationTiling_A_detailed2_StaticMeshComponent0;    // 0x0558 (size: 0x8)
    class UStaticMeshComponent* foundationTiling_A_detailed3_StaticMeshComponent0;    // 0x0560 (size: 0x8)
    class UStaticMeshComponent* foundationTiling_A_detailed4_StaticMeshComponent0;    // 0x0568 (size: 0x8)
    class UStaticMeshComponent* foundationTiling_A_detailed5_StaticMeshComponent0;    // 0x0570 (size: 0x8)
    class UStaticMeshComponent* foundationTiling_A_detailed6_StaticMeshComponent0;    // 0x0578 (size: 0x8)
    class UStaticMeshComponent* foundationTiling_A_detailed7_StaticMeshComponent0;    // 0x0580 (size: 0x8)
    class UStaticMeshComponent* foundationTiling_A_detailed8_StaticMeshComponent0;    // 0x0588 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short_StaticMeshComponent0;          // 0x0590 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short2_StaticMeshComponent0;         // 0x0598 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short3_StaticMeshComponent0;         // 0x05A0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short4_StaticMeshComponent0;         // 0x05A8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short5_StaticMeshComponent0;         // 0x05B0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short6_StaticMeshComponent0;         // 0x05B8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short7_StaticMeshComponent0;         // 0x05C0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth_StaticMeshComponent0;             // 0x05C8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth2_StaticMeshComponent0;            // 0x05D0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth3_StaticMeshComponent0;            // 0x05D8 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Tapered_Cut_StaticMeshComponent0;           // 0x05E0 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Tapered_Cut2_StaticMeshComponent0;          // 0x05E8 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Tapered_Cut3_StaticMeshComponent0;          // 0x05F0 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Tapered_Cut4_StaticMeshComponent0;          // 0x05F8 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Tapered_Cut5_StaticMeshComponent0;          // 0x0600 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Tapered_Cut6_StaticMeshComponent0;          // 0x0608 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth4_StaticMeshComponent0;            // 0x0610 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth5_StaticMeshComponent0;            // 0x0618 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth6_StaticMeshComponent0;            // 0x0620 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth7_StaticMeshComponent0;            // 0x0628 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth8_StaticMeshComponent0;            // 0x0630 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth9_StaticMeshComponent0;            // 0x0638 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth10_StaticMeshComponent0;           // 0x0640 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth11_StaticMeshComponent0;           // 0x0648 (size: 0x8)
    class UStaticMeshComponent* sg_woodenGableA_StaticMeshComponent0;                 // 0x0650 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed_StaticMeshComponent0;             // 0x0658 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed2_StaticMeshComponent0;            // 0x0660 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed3_StaticMeshComponent0;            // 0x0668 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed4_StaticMeshComponent0;            // 0x0670 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed5_StaticMeshComponent0;            // 0x0678 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed6_StaticMeshComponent0;            // 0x0680 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed7_StaticMeshComponent0;            // 0x0688 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed8_StaticMeshComponent0;            // 0x0690 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed9_StaticMeshComponent0;            // 0x0698 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed10_StaticMeshComponent0;           // 0x06A0 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed11_StaticMeshComponent0;           // 0x06A8 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed12_StaticMeshComponent0;           // 0x06B0 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_02_StaticMeshComponent0; // 0x06B8 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_3_StaticMeshComponent0; // 0x06C0 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_4_StaticMeshComponent0; // 0x06C8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short8_StaticMeshComponent0;         // 0x06D0 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_5_StaticMeshComponent0; // 0x06D8 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_6_StaticMeshComponent0; // 0x06E0 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_7_StaticMeshComponent0; // 0x06E8 (size: 0x8)
    class UStaticMeshComponent* doorHeadA_angled_StaticMeshComponent0;                // 0x06F0 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_8_StaticMeshComponent0; // 0x06F8 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_9_StaticMeshComponent0; // 0x0700 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short9_StaticMeshComponent0;         // 0x0708 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short10_StaticMeshComponent0;        // 0x0710 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short11_StaticMeshComponent0;        // 0x0718 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA_StaticMeshComponent0;                 // 0x0720 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardB_thin_StaticMeshComponent0;            // 0x0728 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardC_thinner_StaticMeshComponent0;         // 0x0730 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardB_thin2_StaticMeshComponent0;           // 0x0738 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardC_thinner2_StaticMeshComponent0;        // 0x0740 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardB_thin3_StaticMeshComponent0;           // 0x0748 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA3_StaticMeshComponent0;                // 0x0750 (size: 0x8)
    class UStaticMeshComponent* SG_windowBoardE_double_square_StaticMeshComponent0;   // 0x0758 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short12_StaticMeshComponent0;        // 0x0760 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA2_StaticMeshComponent0;                // 0x0768 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardB_thin4_StaticMeshComponent0;           // 0x0770 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardC_thinner3_StaticMeshComponent0;        // 0x0778 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardB_thin5_StaticMeshComponent0;           // 0x0780 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardC_thinner4_StaticMeshComponent0;        // 0x0788 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardB_thin6_StaticMeshComponent0;           // 0x0790 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA4_StaticMeshComponent0;                // 0x0798 (size: 0x8)
    class UStaticMeshComponent* SG_windowBoardE_double_square2_StaticMeshComponent0;  // 0x07A0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short13_StaticMeshComponent0;        // 0x07A8 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_10_StaticMeshComponent0; // 0x07B0 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_11_StaticMeshComponent0; // 0x07B8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short14_StaticMeshComponent0;        // 0x07C0 (size: 0x8)
    class UStaticMeshComponent* PlaneDenseWindowSingleWide_StaticMeshComponent0;      // 0x07C8 (size: 0x8)
    class UStaticMeshComponent* planeDenseBeveledA_StaticMeshComponent0;              // 0x07D0 (size: 0x8)
    class UStaticMeshComponent* PlaneDenseWindowSlotsA_wider_StaticMeshComponent0;    // 0x07D8 (size: 0x8)
    class UStaticMeshComponent* PlaneDenseWindowSlotsA_v2_Bevel_Taller_StaticMeshComponent0; // 0x07E0 (size: 0x8)
    class UStaticMeshComponent* PlaneDenseBeveledWide_StaticMeshComponent0;           // 0x07E8 (size: 0x8)
    class UStaticMeshComponent* PlaneDenseBeveledWide2_StaticMeshComponent0;          // 0x07F0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth12_StaticMeshComponent0;           // 0x07F8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth13_StaticMeshComponent0;           // 0x0800 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth14_StaticMeshComponent0;           // 0x0808 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth15_StaticMeshComponent0;           // 0x0810 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth16_StaticMeshComponent0;           // 0x0818 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth17_StaticMeshComponent0;           // 0x0820 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth18_StaticMeshComponent0;           // 0x0828 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed13_StaticMeshComponent0;           // 0x0830 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed14_StaticMeshComponent0;           // 0x0838 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed15_StaticMeshComponent0;           // 0x0840 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed16_StaticMeshComponent0;           // 0x0848 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed17_StaticMeshComponent0;           // 0x0850 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed18_StaticMeshComponent0;           // 0x0858 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed19_StaticMeshComponent0;           // 0x0860 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly_StaticMeshComponent0;      // 0x0868 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly2_StaticMeshComponent0;     // 0x0870 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly3_StaticMeshComponent0;     // 0x0878 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly4_StaticMeshComponent0;     // 0x0880 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly5_StaticMeshComponent0;     // 0x0888 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short15_StaticMeshComponent0;        // 0x0890 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly6_StaticMeshComponent0;     // 0x0898 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly7_StaticMeshComponent0;     // 0x08A0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly8_StaticMeshComponent0;     // 0x08A8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly9_StaticMeshComponent0;     // 0x08B0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly10_StaticMeshComponent0;    // 0x08B8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly11_StaticMeshComponent0;    // 0x08C0 (size: 0x8)
    class UStaticMeshComponent* sg_woodenGableA2_StaticMeshComponent0;                // 0x08C8 (size: 0x8)
    class UStaticMeshComponent* sg_thatch_tannery_lv1_StaticMeshComponent0;           // 0x08D0 (size: 0x8)
    class UStaticMeshComponent* rope_dangling_StaticMeshComponent0;                   // 0x08D8 (size: 0x8)
    class UStaticMeshComponent* rope_dangling2_StaticMeshComponent0;                  // 0x08E0 (size: 0x8)
    class UStaticMeshComponent* SM_Rope_02_StaticMeshComponent0;                      // 0x08E8 (size: 0x8)
    class UStaticMeshComponent* SM_Rope_3_StaticMeshComponent0;                       // 0x08F0 (size: 0x8)
    class USceneComponent* sg_tannery_lv1_core_DefaultSceneRoot;                      // 0x08F8 (size: 0x8)

}; // Size: 0x900

#endif
