#ifndef UE4SS_SDK_C_SG_Cottage_Lv1_C_UBeam_HPP
#define UE4SS_SDK_C_SG_Cottage_Lv1_C_UBeam_HPP

class AC_SG_Cottage_Lv1_C_UBeam_C : public AConstructionBP_C
{
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg44_StaticMeshComponent0;     // 0x0550 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg43_StaticMeshComponent0;     // 0x0558 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg42_StaticMeshComponent0;     // 0x0560 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg41_StaticMeshComponent0;     // 0x0568 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg40_StaticMeshComponent0;     // 0x0570 (size: 0x8)
    class UStaticMeshComponent* black faded7_StaticMeshComponent0;                    // 0x0578 (size: 0x8)
    class UStaticMeshComponent* SG_windowBoardE_double_square54_StaticMeshComponent0; // 0x0580 (size: 0x8)
    class UStaticMeshComponent* SG_windowBoardE_double_square53_StaticMeshComponent0; // 0x0588 (size: 0x8)
    class UStaticMeshComponent* SG_windowBoardE_double_square52_StaticMeshComponent0; // 0x0590 (size: 0x8)
    class UStaticMeshComponent* sg_ubeam_gable_planks4_StaticMeshComponent0;          // 0x0598 (size: 0x8)
    class UStaticMeshComponent* sg_ubeam_gable_planks3_StaticMeshComponent0;          // 0x05A0 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg39_StaticMeshComponent0;     // 0x05A8 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg38_StaticMeshComponent0;     // 0x05B0 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg37_StaticMeshComponent0;     // 0x05B8 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg36_StaticMeshComponent0;     // 0x05C0 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg35_StaticMeshComponent0;     // 0x05C8 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg34_StaticMeshComponent0;     // 0x05D0 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg33_StaticMeshComponent0;     // 0x05D8 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg32_StaticMeshComponent0;     // 0x05E0 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg31_StaticMeshComponent0;     // 0x05E8 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg30_StaticMeshComponent0;     // 0x05F0 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg29_StaticMeshComponent0;     // 0x05F8 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg28_StaticMeshComponent0;     // 0x0600 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg27_StaticMeshComponent0;     // 0x0608 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg26_StaticMeshComponent0;     // 0x0610 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg16_StaticMeshComponent0;     // 0x0618 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg15_StaticMeshComponent0;     // 0x0620 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg14_StaticMeshComponent0;     // 0x0628 (size: 0x8)
    class UStaticMeshComponent* Foundation_DoorStepStone2_StaticMeshComponent0;       // 0x0630 (size: 0x8)
    class UStaticMeshComponent* Foundations_SG_Cottage_LV1_C_Ubeam2_StaticMeshComponent0; // 0x0638 (size: 0x8)
    class UStaticMeshComponent* black faded6_StaticMeshComponent0;                    // 0x0640 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m528_StaticMeshComponent0;                // 0x0648 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m527_StaticMeshComponent0;                // 0x0650 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m526_StaticMeshComponent0;                // 0x0658 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_40_StaticMeshComponent0;               // 0x0660 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_39_StaticMeshComponent0;               // 0x0668 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_38_StaticMeshComponent0;               // 0x0670 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_37_StaticMeshComponent0;               // 0x0678 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_36_StaticMeshComponent0;               // 0x0680 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_35_StaticMeshComponent0;               // 0x0688 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Slit_DenseUV38_StaticMeshComponent0;       // 0x0690 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Slit_DenseUV37_StaticMeshComponent0;       // 0x0698 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Slit_DenseUV36_StaticMeshComponent0;       // 0x06A0 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Slit_DenseUV35_StaticMeshComponent0;       // 0x06A8 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Slit_DenseUV34_StaticMeshComponent0;       // 0x06B0 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Slit_DenseUV33_StaticMeshComponent0;       // 0x06B8 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_34_StaticMeshComponent0;               // 0x06C0 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_33_StaticMeshComponent0;               // 0x06C8 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_32_StaticMeshComponent0;               // 0x06D0 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_31_StaticMeshComponent0;               // 0x06D8 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_30_StaticMeshComponent0;               // 0x06E0 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_29_StaticMeshComponent0;               // 0x06E8 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_28_StaticMeshComponent0;               // 0x06F0 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Slit_DenseUV32_StaticMeshComponent0;       // 0x06F8 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Slit_DenseUV31_StaticMeshComponent0;       // 0x0700 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Slit_DenseUV30_StaticMeshComponent0;       // 0x0708 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Slit_DenseUV29_StaticMeshComponent0;       // 0x0710 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Slit_DenseUV28_StaticMeshComponent0;       // 0x0718 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Slit_DenseUV27_StaticMeshComponent0;       // 0x0720 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_27_StaticMeshComponent0;               // 0x0728 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Slit_DenseUV26_StaticMeshComponent0;       // 0x0730 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Slit_DenseUV25_StaticMeshComponent0;       // 0x0738 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Slit_DenseUV24_StaticMeshComponent0;       // 0x0740 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Slit_DenseUV23_StaticMeshComponent0;       // 0x0748 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Slit_DenseUV22_StaticMeshComponent0;       // 0x0750 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Slit_DenseUV21_StaticMeshComponent0;       // 0x0758 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Slit_DenseUV20_StaticMeshComponent0;       // 0x0760 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_26_StaticMeshComponent0;               // 0x0768 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_25_StaticMeshComponent0;               // 0x0770 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_24_StaticMeshComponent0;               // 0x0778 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_23_StaticMeshComponent0;               // 0x0780 (size: 0x8)
    class UStaticMeshComponent* black faded5_StaticMeshComponent0;                    // 0x0788 (size: 0x8)
    class UStaticMeshComponent* sg_shutterA6_StaticMeshComponent0;                    // 0x0790 (size: 0x8)
    class UStaticMeshComponent* sg_shutterA5_StaticMeshComponent0;                    // 0x0798 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m525_StaticMeshComponent0;                // 0x07A0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m524_StaticMeshComponent0;                // 0x07A8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m523_StaticMeshComponent0;                // 0x07B0 (size: 0x8)
    class UStaticMeshComponent* SG_windowBoardE_double_square46_StaticMeshComponent0; // 0x07B8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m522_StaticMeshComponent0;                // 0x07C0 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed_long223_StaticMeshComponent0;     // 0x07C8 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed_long222_StaticMeshComponent0;     // 0x07D0 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed_long221_StaticMeshComponent0;     // 0x07D8 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed_long220_StaticMeshComponent0;     // 0x07E0 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed_long219_StaticMeshComponent0;     // 0x07E8 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed_long218_StaticMeshComponent0;     // 0x07F0 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed_long217_StaticMeshComponent0;     // 0x07F8 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed_long216_StaticMeshComponent0;     // 0x0800 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed_long215_StaticMeshComponent0;     // 0x0808 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed_long214_StaticMeshComponent0;     // 0x0810 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed_long213_StaticMeshComponent0;     // 0x0818 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed_long212_StaticMeshComponent0;     // 0x0820 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed_long211_StaticMeshComponent0;     // 0x0828 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed_long210_StaticMeshComponent0;     // 0x0830 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed_long209_StaticMeshComponent0;     // 0x0838 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed_long208_StaticMeshComponent0;     // 0x0840 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed_long207_StaticMeshComponent0;     // 0x0848 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed_long206_StaticMeshComponent0;     // 0x0850 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed_long205_StaticMeshComponent0;     // 0x0858 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed_long204_StaticMeshComponent0;     // 0x0860 (size: 0x8)
    class UStaticMeshComponent* SG_windowBoardE_double_square45_StaticMeshComponent0; // 0x0868 (size: 0x8)
    class UStaticMeshComponent* SG_windowBoardE_double_square44_StaticMeshComponent0; // 0x0870 (size: 0x8)
    class UStaticMeshComponent* SG_windowBoardE_double_square43_StaticMeshComponent0; // 0x0878 (size: 0x8)
    class UStaticMeshComponent* SG_windowBoardE_double_square42_StaticMeshComponent0; // 0x0880 (size: 0x8)
    class UStaticMeshComponent* SG_windowBoardE_double_square41_StaticMeshComponent0; // 0x0888 (size: 0x8)
    class UStaticMeshComponent* SG_windowBoardE_double_square40_StaticMeshComponent0; // 0x0890 (size: 0x8)
    class UStaticMeshComponent* SG_windowBoardE_double_square39_StaticMeshComponent0; // 0x0898 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m521_StaticMeshComponent0;                // 0x08A0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short337_StaticMeshComponent0;       // 0x08A8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m520_StaticMeshComponent0;                // 0x08B0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m519_StaticMeshComponent0;                // 0x08B8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m518_StaticMeshComponent0;                // 0x08C0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m517_StaticMeshComponent0;                // 0x08C8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m516_StaticMeshComponent0;                // 0x08D0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m515_StaticMeshComponent0;                // 0x08D8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m514_StaticMeshComponent0;                // 0x08E0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m513_StaticMeshComponent0;                // 0x08E8 (size: 0x8)
    class UStaticMeshComponent* cottage3thatch3_StaticMeshComponent0;                 // 0x08F0 (size: 0x8)
    class UStaticMeshComponent* SG_windowBoardE_double_square38_StaticMeshComponent0; // 0x08F8 (size: 0x8)
    class UStaticMeshComponent* SG_windowBoardE_double_square37_StaticMeshComponent0; // 0x0900 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short336_StaticMeshComponent0;       // 0x0908 (size: 0x8)
    class UStaticMeshComponent* SG_windowBoardE_double_square35_StaticMeshComponent0; // 0x0910 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m512_StaticMeshComponent0;                // 0x0918 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m511_StaticMeshComponent0;                // 0x0920 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m510_StaticMeshComponent0;                // 0x0928 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m509_StaticMeshComponent0;                // 0x0930 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m508_StaticMeshComponent0;                // 0x0938 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m507_StaticMeshComponent0;                // 0x0940 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m506_StaticMeshComponent0;                // 0x0948 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m505_StaticMeshComponent0;                // 0x0950 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m504_StaticMeshComponent0;                // 0x0958 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m503_StaticMeshComponent0;                // 0x0960 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m502_StaticMeshComponent0;                // 0x0968 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m501_StaticMeshComponent0;                // 0x0970 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m500_StaticMeshComponent0;                // 0x0978 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m493_StaticMeshComponent0;                // 0x0980 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m479_StaticMeshComponent0;                // 0x0988 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m477_StaticMeshComponent0;                // 0x0990 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m459_StaticMeshComponent0;                // 0x0998 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m458_StaticMeshComponent0;                // 0x09A0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m457_StaticMeshComponent0;                // 0x09A8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short335_StaticMeshComponent0;       // 0x09B0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short334_StaticMeshComponent0;       // 0x09B8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m456_StaticMeshComponent0;                // 0x09C0 (size: 0x8)
    class USceneComponent* sg_cottage_lv1_C_Ubeam2_DefaultSceneRoot;                  // 0x09C8 (size: 0x8)

}; // Size: 0x9D0

#endif
