#ifndef UE4SS_SDK_C_SkinningRack_HPP
#define UE4SS_SDK_C_SkinningRack_HPP

class AC_SkinningRack_C : public AConstructionBP_C
{
    class UStaticMeshComponent* ropeKnotA36_StaticMeshComponent0;                     // 0x0550 (size: 0x8)
    class UStaticMeshComponent* ropeKnotA35_StaticMeshComponent0;                     // 0x0558 (size: 0x8)
    class UStaticMeshComponent* all_aboard_pivot_boardA108_StaticMeshComponent0;      // 0x0560 (size: 0x8)
    class UStaticMeshComponent* ropeKnotA34_StaticMeshComponent0;                     // 0x0568 (size: 0x8)
    class UStaticMeshComponent* ropeKnotA33_StaticMeshComponent0;                     // 0x0570 (size: 0x8)
    class UStaticMeshComponent* ropeShort12_StaticMeshComponent0;                     // 0x0578 (size: 0x8)
    class UStaticMeshComponent* ropeShort11_StaticMeshComponent0;                     // 0x0580 (size: 0x8)
    class UStaticMeshComponent* ropeShort10_StaticMeshComponent0;                     // 0x0588 (size: 0x8)
    class USceneComponent* sg_skinningRack_holder4_DefaultSceneRoot;                  // 0x0590 (size: 0x8)
    class UStaticMeshComponent* ropeKnotA32_StaticMeshComponent0;                     // 0x0598 (size: 0x8)
    class UStaticMeshComponent* ropeKnotA31_StaticMeshComponent0;                     // 0x05A0 (size: 0x8)
    class UStaticMeshComponent* all_aboard_pivot_boardA107_StaticMeshComponent0;      // 0x05A8 (size: 0x8)
    class UStaticMeshComponent* ropeKnotA30_StaticMeshComponent0;                     // 0x05B0 (size: 0x8)
    class UStaticMeshComponent* ropeKnotA29_StaticMeshComponent0;                     // 0x05B8 (size: 0x8)
    class UStaticMeshComponent* ropeShort9_StaticMeshComponent0;                      // 0x05C0 (size: 0x8)
    class UStaticMeshComponent* ropeShort8_StaticMeshComponent0;                      // 0x05C8 (size: 0x8)
    class UStaticMeshComponent* ropeShort7_StaticMeshComponent0;                      // 0x05D0 (size: 0x8)
    class USceneComponent* sg_skinningRack_holder3_DefaultSceneRoot;                  // 0x05D8 (size: 0x8)
    class UStaticMeshComponent* Common_Spruce_Branch_LOD5_uehjahtfa151_StaticMeshComponent0; // 0x05E0 (size: 0x8)
    class UStaticMeshComponent* Common_Spruce_Branch_LOD5_uehjahtfa150_StaticMeshComponent0; // 0x05E8 (size: 0x8)
    class UStaticMeshComponent* Common_Spruce_Branch_LOD5_uehjahtfa137_StaticMeshComponent0; // 0x05F0 (size: 0x8)
    class UStaticMeshComponent* Common_Spruce_Branch_LOD5_uehjahtfa135_StaticMeshComponent0; // 0x05F8 (size: 0x8)
    class UStaticMeshComponent* Common_Spruce_Branch_LOD5_uehjahtfa134_StaticMeshComponent0; // 0x0600 (size: 0x8)
    class USceneComponent* sg_skinningRack2_DefaultSceneRoot;                         // 0x0608 (size: 0x8)

}; // Size: 0x610

#endif
