#ifndef UE4SS_SDK_MLDebuggerWindow_HPP
#define UE4SS_SDK_MLDebuggerWindow_HPP

class UMLDebuggerWindow_C : public UUserWidget
{
    FPointerToUberGraphFrame UberGraphFrame;                                          // 0x02E0 (size: 0x8)
    class UVerticalBox* AI_vb_WIP;                                                    // 0x02E8 (size: 0x8)
    class UButton* boop_mode;                                                         // 0x02F0 (size: 0x8)
    class UButton* boop_mode_1;                                                       // 0x02F8 (size: 0x8)
    class UCheckBox* CheckBox;                                                        // 0x0300 (size: 0x8)
    class UCheckBox* CheckBox_1;                                                      // 0x0308 (size: 0x8)
    class UCheckBox* CheckBox_2;                                                      // 0x0310 (size: 0x8)
    class UCheckBox* CheckBox_3;                                                      // 0x0318 (size: 0x8)
    class UCheckBox* CheckBox_4;                                                      // 0x0320 (size: 0x8)
    class UCheckBox* CheckBox_5;                                                      // 0x0328 (size: 0x8)
    class UCheckBox* CheckBox_6;                                                      // 0x0330 (size: 0x8)
    class UCheckBox* CheckBox_7;                                                      // 0x0338 (size: 0x8)
    class UCheckBox* CheckBox_8;                                                      // 0x0340 (size: 0x8)
    class UCheckBox* CheckBox_9;                                                      // 0x0348 (size: 0x8)
    class UCheckBox* CheckBox_10;                                                     // 0x0350 (size: 0x8)
    class UCheckBox* CheckBox_11;                                                     // 0x0358 (size: 0x8)
    class UCheckBox* CheckBox_142;                                                    // 0x0360 (size: 0x8)
    class UVerticalBox* combat_fb;                                                    // 0x0368 (size: 0x8)
    class UCheckBox* debug_chkb;                                                      // 0x0370 (size: 0x8)
    class UCheckBox* debug_chkb_1;                                                    // 0x0378 (size: 0x8)
    class UCheckBox* debug_chkb_2;                                                    // 0x0380 (size: 0x8)
    class UVerticalBox* debugCategoryVBs_VB;                                          // 0x0388 (size: 0x8)
    class UVerticalBox* disablejobIDs_vb;                                             // 0x0390 (size: 0x8)
    class UVerticalBox* economy_vb;                                                   // 0x0398 (size: 0x8)
    class UEditableTextBox* EditableTextBox_100;                                      // 0x03A0 (size: 0x8)
    class UVerticalBox* generic_vb;                                                   // 0x03A8 (size: 0x8)
    class UVerticalBox* hoverUnitDetails_hb;                                          // 0x03B0 (size: 0x8)
    class UImage* Image_63;                                                           // 0x03B8 (size: 0x8)
    class UTextBlock* last_general_AI_log;                                            // 0x03C0 (size: 0x8)
    class UTextBlock* last_tactics_AI_log;                                            // 0x03C8 (size: 0x8)
    class UTextBlock* log_tactics_txt;                                                // 0x03D0 (size: 0x8)
    class UTextBlock* logContentGeneralAI;                                            // 0x03D8 (size: 0x8)
    class UTextBlock* logContentHoverUnit;                                            // 0x03E0 (size: 0x8)
    class UVerticalBox* logs_generalAI;                                               // 0x03E8 (size: 0x8)
    class UVerticalBox* logs_hoverUnit;                                               // 0x03F0 (size: 0x8)
    class UVerticalBox* logs_tacticsAI;                                               // 0x03F8 (size: 0x8)
    class UMLDebug_DisableJobWidget_C* MLDebug_DisableJobWidget;                      // 0x0400 (size: 0x8)
    class UMLDebug_DisableJobWidget_C* MLDebug_DisableJobWidget_1;                    // 0x0408 (size: 0x8)
    class UMLDebug_DisableJobWidget_C* MLDebug_DisableJobWidget_2;                    // 0x0410 (size: 0x8)
    class UMLDebug_DisableJobWidget_C* MLDebug_DisableJobWidget_3;                    // 0x0418 (size: 0x8)
    class UMLDebug_DisableJobWidget_C* MLDebug_DisableJobWidget_4;                    // 0x0420 (size: 0x8)
    class UMLDebug_DisableJobWidget_C* MLDebug_DisableJobWidget_5;                    // 0x0428 (size: 0x8)
    class UMLDebug_DisableJobWidget_C* MLDebug_DisableJobWidget_6;                    // 0x0430 (size: 0x8)
    class UMLDebug_DisableJobWidget_C* MLDebug_DisableJobWidget_7;                    // 0x0438 (size: 0x8)
    class UMLDebug_DisableJobWidget_C* MLDebug_DisableJobWidget_8;                    // 0x0440 (size: 0x8)
    class UMLDebug_DisableJobWidget_C* MLDebug_DisableJobWidget_9;                    // 0x0448 (size: 0x8)
    class UMLDebug_DisableJobWidget_C* MLDebug_DisableJobWidget_10;                   // 0x0450 (size: 0x8)
    class UMLDebug_DisableJobWidget_C* MLDebug_DisableJobWidget_11;                   // 0x0458 (size: 0x8)
    class UMLDebug_DisableJobWidget_C* MLDebug_DisableJobWidget_12;                   // 0x0460 (size: 0x8)
    class UMLDebug_DisableJobWidget_C* MLDebug_DisableJobWidget_13;                   // 0x0468 (size: 0x8)
    class UMLDebug_DisableJobWidget_C* MLDebug_DisableJobWidget_14;                   // 0x0470 (size: 0x8)
    class UMLDebug_DisableJobWidget_C* MLDebug_DisableJobWidget_15;                   // 0x0478 (size: 0x8)
    class UMLDebug_DisableJobWidget_C* MLDebug_DisableJobWidget_16;                   // 0x0480 (size: 0x8)
    class UMLDebug_DisableJobWidget_C* MLDebug_DisableJobWidget_17;                   // 0x0488 (size: 0x8)
    class UMLDebug_DisableJobWidget_C* MLDebug_DisableJobWidget_18;                   // 0x0490 (size: 0x8)
    class UMLDebug_DisableJobWidget_C* MLDebug_DisableJobWidget_19;                   // 0x0498 (size: 0x8)
    class UMLDebug_DisableJobWidget_C* MLDebug_DisableJobWidget_20;                   // 0x04A0 (size: 0x8)
    class UMLDebug_DisableJobWidget_C* MLDebug_DisableJobWidget_21;                   // 0x04A8 (size: 0x8)
    class UMLDebug_DisableJobWidget_C* MLDebug_DisableJobWidget_22;                   // 0x04B0 (size: 0x8)
    class UMLDebug_DisableJobWidget_C* MLDebug_DisableJobWidget_23;                   // 0x04B8 (size: 0x8)
    class UMLDebug_DisableJobWidget_C* MLDebug_DisableJobWidget_24;                   // 0x04C0 (size: 0x8)
    class UMLDebug_DisableJobWidget_C* MLDebug_DisableJobWidget_25;                   // 0x04C8 (size: 0x8)
    class UMLDebugFilterCheckbox_C* MLDebugFilterCheckbox;                            // 0x04D0 (size: 0x8)
    class UMLDebugFilterCheckbox_C* MLDebugFilterCheckbox_1;                          // 0x04D8 (size: 0x8)
    class UMLDebugFilterCheckbox_C* MLDebugFilterCheckbox_2;                          // 0x04E0 (size: 0x8)
    class UMLDebugFilterCheckbox_C* MLDebugFilterCheckbox_3;                          // 0x04E8 (size: 0x8)
    class UMLDebugFilterCheckbox_C* MLDebugFilterCheckbox_4;                          // 0x04F0 (size: 0x8)
    class UMLDebugFilterCheckbox_C* MLDebugFilterCheckbox_5;                          // 0x04F8 (size: 0x8)
    class UMLDebugFilterCheckbox_C* MLDebugFilterCheckbox_6;                          // 0x0500 (size: 0x8)
    class UMLDebugFilterCheckbox_C* MLDebugFilterCheckbox_7;                          // 0x0508 (size: 0x8)
    class UMLDebugFilterCheckbox_C* MLDebugFilterCheckbox_8;                          // 0x0510 (size: 0x8)
    class UMLDebugFilterCheckbox_C* MLDebugFilterCheckbox_9;                          // 0x0518 (size: 0x8)
    class UMLDebugFilterCheckbox_C* MLDebugFilterCheckbox_10;                         // 0x0520 (size: 0x8)
    class UMLDebugFilterCheckbox_C* MLDebugFilterCheckbox_11;                         // 0x0528 (size: 0x8)
    class UMLDebugFilterCheckbox_C* MLDebugFilterCheckbox_12;                         // 0x0530 (size: 0x8)
    class UMLDebugFilterCheckbox_C* MLDebugFilterCheckbox_13;                         // 0x0538 (size: 0x8)
    class UMLDebugFilterCheckbox_C* MLDebugFilterCheckbox_14;                         // 0x0540 (size: 0x8)
    class UMLDebugFilterCheckbox_C* MLDebugFilterCheckbox_15;                         // 0x0548 (size: 0x8)
    class UMLDebugFilterCheckbox_C* MLDebugFilterCheckbox_16;                         // 0x0550 (size: 0x8)
    class UMLDebugFilterCheckbox_C* MLDebugFilterCheckbox_17;                         // 0x0558 (size: 0x8)
    class UMLDebugFilterCheckbox_C* MLDebugFilterCheckbox_18;                         // 0x0560 (size: 0x8)
    class UMLDebugFilterCheckbox_C* MLDebugFilterCheckbox_19;                         // 0x0568 (size: 0x8)
    class UMLDebugFilterCheckbox_C* MLDebugFilterCheckbox_20;                         // 0x0570 (size: 0x8)
    class UMLDebugFilterCheckbox_C* MLDebugFilterCheckbox_21;                         // 0x0578 (size: 0x8)
    class UMLDebugFilterCheckbox_C* MLDebugFilterCheckbox_22;                         // 0x0580 (size: 0x8)
    class UMLDebugFilterCheckbox_C* MLDebugFilterCheckbox_23;                         // 0x0588 (size: 0x8)
    class UMLDebugFilterCheckbox_C* MLDebugFilterCheckbox_24;                         // 0x0590 (size: 0x8)
    class UMLDebugFilterCheckbox_C* MLDebugFilterCheckbox_25;                         // 0x0598 (size: 0x8)
    class UMLDebugFilterCheckbox_C* MLDebugFilterCheckbox_26;                         // 0x05A0 (size: 0x8)
    class UMLDebugFilterCheckbox_C* MLDebugFilterCheckbox_27;                         // 0x05A8 (size: 0x8)
    class UMLDebugFilterCheckbox_C* MLDebugFilterCheckbox_28;                         // 0x05B0 (size: 0x8)
    class UMLDebugFilterCheckbox_C* MLDebugFilterCheckbox_29;                         // 0x05B8 (size: 0x8)
    class UMLDebugFilterCheckbox_C* MLDebugFilterCheckbox_30;                         // 0x05C0 (size: 0x8)
    class UMLDebugFilterCheckbox_C* MLDebugFilterCheckbox_31;                         // 0x05C8 (size: 0x8)
    class UMLDebugFilterCheckbox_C* MLDebugFilterCheckbox_32;                         // 0x05D0 (size: 0x8)
    class UMLDebugFilterCheckbox_C* MLDebugFilterCheckbox_33;                         // 0x05D8 (size: 0x8)
    class UMLDebugFilterCheckbox_C* MLDebugFilterCheckbox_34;                         // 0x05E0 (size: 0x8)
    class UMLDebugFilterCheckbox_C* MLDebugFilterCheckbox_35;                         // 0x05E8 (size: 0x8)
    class UMLDebugFilterCheckbox_C* MLDebugFilterCheckbox_36;                         // 0x05F0 (size: 0x8)
    class UMLDebugFilterCheckbox_C* MLDebugFilterCheckbox_37;                         // 0x05F8 (size: 0x8)
    class UMLDebugFilterCheckbox_C* MLDebugFilterCheckbox_38;                         // 0x0600 (size: 0x8)
    class UMLDebugFilterCheckbox_C* MLDebugFilterCheckbox_39;                         // 0x0608 (size: 0x8)
    class UMLDebugFilterCheckbox_C* MLDebugFilterCheckbox_40;                         // 0x0610 (size: 0x8)
    class UMLDebugFilterCheckbox_C* MLDebugFilterCheckbox_41;                         // 0x0618 (size: 0x8)
    class UMLDebugFilterCheckbox_C* MLDebugFilterCheckbox_42;                         // 0x0620 (size: 0x8)
    class UMLDebugFilterCheckbox_C* MLDebugFilterCheckbox_43;                         // 0x0628 (size: 0x8)
    class UMLDebugFilterCheckbox_C* MLDebugFilterCheckbox_44;                         // 0x0630 (size: 0x8)
    class UMLDebugFilterCheckbox_C* MLDebugFilterCheckbox_45;                         // 0x0638 (size: 0x8)
    class UMLDebugFilterCheckbox_C* MLDebugFilterCheckbox_46;                         // 0x0640 (size: 0x8)
    class UMLDebugFilterCheckbox_C* MLDebugFilterCheckbox_47;                         // 0x0648 (size: 0x8)
    class UMLDebugFilterCheckbox_C* MLDebugFilterCheckbox_48;                         // 0x0650 (size: 0x8)
    class UMLDebugFilterCheckbox_C* MLDebugFilterCheckbox_49;                         // 0x0658 (size: 0x8)
    class UMLDebugFilterCheckbox_C* MLDebugFilterCheckbox_50;                         // 0x0660 (size: 0x8)
    class UMLDebugFilterCheckbox_C* MLDebugFilterCheckbox_51;                         // 0x0668 (size: 0x8)
    class UMLDebugFilterCheckbox_C* MLDebugFilterCheckbox_52;                         // 0x0670 (size: 0x8)
    class UMLDebugFilterCheckbox_C* MLDebugFilterCheckbox_53;                         // 0x0678 (size: 0x8)
    class UMLDebugFilterCheckbox_C* MLDebugFilterCheckbox_54;                         // 0x0680 (size: 0x8)
    class UMLDebugFilterCheckbox_C* MLDebugFilterCheckbox_55;                         // 0x0688 (size: 0x8)
    class UMLDebugFilterCheckbox_C* MLDebugFilterCheckbox_56;                         // 0x0690 (size: 0x8)
    class UMLDebugFilterCheckbox_C* MLDebugFilterCheckbox_57;                         // 0x0698 (size: 0x8)
    class UMLDebugFilterCheckbox_C* MLDebugFilterCheckbox_58;                         // 0x06A0 (size: 0x8)
    class UMLDebugFilterCheckbox_C* MLDebugFilterCheckbox_59;                         // 0x06A8 (size: 0x8)
    class UMLDebugFilterCheckbox_C* MLDebugFilterCheckbox_60;                         // 0x06B0 (size: 0x8)
    class UMLDebugFilterCheckbox_C* MLDebugFilterCheckbox_61;                         // 0x06B8 (size: 0x8)
    class UMLDebugFilterCheckbox_C* MLDebugFilterCheckbox_62;                         // 0x06C0 (size: 0x8)
    class UMLDebugFilterCheckbox_C* MLDebugFilterCheckbox_63;                         // 0x06C8 (size: 0x8)
    class UMLDebugFilterCheckbox_C* MLDebugFilterCheckbox_64;                         // 0x06D0 (size: 0x8)
    class UMLDebugFilterCheckbox_C* MLDebugFilterCheckbox_65;                         // 0x06D8 (size: 0x8)
    class UMLDebugFilterCheckbox_C* MLDebugFilterCheckbox_66;                         // 0x06E0 (size: 0x8)
    class UMLDebugFilterCheckbox_C* MLDebugFilterCheckbox_67;                         // 0x06E8 (size: 0x8)
    class UMLDebugFilterCheckbox_C* MLDebugFilterCheckbox_68;                         // 0x06F0 (size: 0x8)
    class UMLDebugFilterCheckbox_C* MLDebugFilterCheckbox_69;                         // 0x06F8 (size: 0x8)
    class UMLDebugFilterCheckbox_C* MLDebugFilterCheckbox_70;                         // 0x0700 (size: 0x8)
    class UMLDebugFilterCheckbox_C* MLDebugFilterCheckbox_71;                         // 0x0708 (size: 0x8)
    class UMLDebugFilterCheckbox_C* MLDebugFilterCheckbox_72;                         // 0x0710 (size: 0x8)
    class UMLDebugFilterCheckbox_C* MLDebugFilterCheckbox_73;                         // 0x0718 (size: 0x8)
    class UMLDebugFilterCheckbox_C* MLDebugFilterCheckbox_74;                         // 0x0720 (size: 0x8)
    class UMLDebugFilterCheckbox_C* MLDebugFilterCheckbox_75;                         // 0x0728 (size: 0x8)
    class UMLDebugFilterCheckbox_C* MLDebugFilterCheckbox_76;                         // 0x0730 (size: 0x8)
    class UMLDebugFilterCheckbox_C* MLDebugFilterCheckbox_77;                         // 0x0738 (size: 0x8)
    class UMLDebugFilterCheckbox_C* MLDebugFilterCheckbox_78;                         // 0x0740 (size: 0x8)
    class UMLDebugFilterCheckbox_C* MLDebugFilterCheckbox_79;                         // 0x0748 (size: 0x8)
    class UMLDebugFilterCheckbox_C* MLDebugFilterCheckbox_80;                         // 0x0750 (size: 0x8)
    class UMLDebugFilterCheckbox_C* MLDebugFilterCheckbox_81;                         // 0x0758 (size: 0x8)
    class UMLDebugFilterCheckbox_C* MLDebugFilterCheckbox_82;                         // 0x0760 (size: 0x8)
    class UMLDebugFilterCheckbox_C* MLDebugFilterCheckbox_83;                         // 0x0768 (size: 0x8)
    class UMLDebugFilterCheckbox_C* MLDebugFilterCheckbox_84;                         // 0x0770 (size: 0x8)
    class UMLDebugFilterCheckbox_C* MLDebugFilterCheckbox_85;                         // 0x0778 (size: 0x8)
    class UMLDebugFilterCheckbox_C* MLDebugFilterCheckbox_86;                         // 0x0780 (size: 0x8)
    class UMLDebugFilterCheckbox_C* MLDebugFilterCheckbox_87;                         // 0x0788 (size: 0x8)
    class UMLDebugFilterCheckbox_C* MLDebugFilterCheckbox_88;                         // 0x0790 (size: 0x8)
    class UMLDebugFilterCheckbox_C* MLDebugFilterCheckbox_89;                         // 0x0798 (size: 0x8)
    class UMLDebugFilterCheckbox_C* MLDebugFilterCheckbox_90;                         // 0x07A0 (size: 0x8)
    class UMLDebugFilterCheckbox_C* MLDebugFilterCheckbox_91;                         // 0x07A8 (size: 0x8)
    class UMLDebugFilterCheckbox_C* MLDebugFilterCheckbox_92;                         // 0x07B0 (size: 0x8)
    class UMLDebugFilterCheckbox_C* MLDebugFilterCheckbox_93;                         // 0x07B8 (size: 0x8)
    class UMLDebugFilterCheckbox_C* MLDebugFilterCheckbox_94;                         // 0x07C0 (size: 0x8)
    class UMLDebugFilterCheckbox_C* MLDebugFilterCheckbox_95;                         // 0x07C8 (size: 0x8)
    class UMLDebugFilterCheckbox_C* MLDebugFilterCheckbox_96;                         // 0x07D0 (size: 0x8)
    class UMLDebugFilterCheckbox_C* MLDebugFilterCheckbox_97;                         // 0x07D8 (size: 0x8)
    class UMLDebugFilterCheckbox_C* MLDebugFilterCheckbox_98;                         // 0x07E0 (size: 0x8)
    class UMLDebugFilterCheckbox_C* MLDebugFilterCheckbox_99;                         // 0x07E8 (size: 0x8)
    class UMLDebugFilterCheckbox_C* MLDebugFilterCheckbox_100;                        // 0x07F0 (size: 0x8)
    class UMLDebugFilterCheckbox_C* MLDebugFilterCheckbox_101;                        // 0x07F8 (size: 0x8)
    class UMLDebugFilterCheckbox_C* MLDebugFilterCheckbox_102;                        // 0x0800 (size: 0x8)
    class UMLDebugFilterCheckbox_C* MLDebugFilterCheckbox_103;                        // 0x0808 (size: 0x8)
    class UMLDebugFilterCheckbox_C* MLDebugFilterCheckbox_104;                        // 0x0810 (size: 0x8)
    class UMLDebugFilterCheckbox_C* MLDebugFilterCheckbox_105;                        // 0x0818 (size: 0x8)
    class UMLDebugFilterCheckbox_C* MLDebugFilterCheckbox_106;                        // 0x0820 (size: 0x8)
    class UMLDebugFilterCheckbox_C* MLDebugFilterCheckbox_107;                        // 0x0828 (size: 0x8)
    class UMLDebugFilterCheckbox_C* MLDebugFilterCheckbox_108;                        // 0x0830 (size: 0x8)
    class UMLDebugFilterCheckbox_C* MLDebugFilterCheckbox_109;                        // 0x0838 (size: 0x8)
    class UMLDebugFilterCheckbox_C* MLDebugFilterCheckbox_110;                        // 0x0840 (size: 0x8)
    class UMLDebugFilterCheckbox_C* MLDebugFilterCheckbox_111;                        // 0x0848 (size: 0x8)
    class UMLDebugFilterCheckbox_C* MLDebugFilterCheckbox_112;                        // 0x0850 (size: 0x8)
    class UMLDebugFilterCheckbox_C* MLDebugFilterCheckbox_113;                        // 0x0858 (size: 0x8)
    class UMLDebugFilterCheckbox_C* MLDebugFilterCheckbox_114;                        // 0x0860 (size: 0x8)
    class UMLDebugFilterCheckbox_C* MLDebugFilterCheckbox_115;                        // 0x0868 (size: 0x8)
    class UMLDebugFilterCheckbox_C* MLDebugFilterCheckbox_116;                        // 0x0870 (size: 0x8)
    class UMLDebugFilterCheckbox_C* MLDebugFilterCheckbox_117;                        // 0x0878 (size: 0x8)
    class UMLDebugFilterCheckbox_C* MLDebugFilterCheckbox_118;                        // 0x0880 (size: 0x8)
    class UMLDebugFilterCheckbox_C* MLDebugFilterCheckbox_119;                        // 0x0888 (size: 0x8)
    class UMLDebugFilterCheckbox_C* MLDebugFilterCheckbox_120;                        // 0x0890 (size: 0x8)
    class UMLDebugFilterCheckbox_C* MLDebugFilterCheckbox_121;                        // 0x0898 (size: 0x8)
    class UMLDebugFilterCheckbox_C* MLDebugFilterCheckbox_122;                        // 0x08A0 (size: 0x8)
    class UMLDebugFilterCheckbox_C* MLDebugFilterCheckbox_123;                        // 0x08A8 (size: 0x8)
    class UMLDebugFilterCheckbox_C* MLDebugFilterCheckbox_124;                        // 0x08B0 (size: 0x8)
    class UMLDebugFilterCheckbox_C* MLDebugFilterCheckbox_125;                        // 0x08B8 (size: 0x8)
    class UMLDebugFilterCheckbox_C* MLDebugFilterCheckbox_126;                        // 0x08C0 (size: 0x8)
    class UMLDebugFilterCheckbox_C* MLDebugFilterCheckbox_127;                        // 0x08C8 (size: 0x8)
    class UMLDebugFilterCheckbox_C* MLDebugFilterCheckbox_128;                        // 0x08D0 (size: 0x8)
    class UMLDebugFilterCheckbox_C* MLDebugFilterCheckbox_129;                        // 0x08D8 (size: 0x8)
    class UMLDebugFilterCheckbox_C* MLDebugFilterCheckbox_130;                        // 0x08E0 (size: 0x8)
    class UMLDebugFilterCheckbox_C* MLDebugFilterCheckbox_131;                        // 0x08E8 (size: 0x8)
    class UMLDebugFilterCheckbox_C* MLDebugFilterCheckbox_132;                        // 0x08F0 (size: 0x8)
    class UMLDebugFilterCheckbox_C* MLDebugFilterCheckbox_133;                        // 0x08F8 (size: 0x8)
    class UMLDebugFilterCheckbox_C* MLDebugFilterCheckbox_134;                        // 0x0900 (size: 0x8)
    class UMLDebugFilterCheckbox_C* MLDebugFilterCheckbox_135;                        // 0x0908 (size: 0x8)
    class UMLDebugFilterCheckbox_C* MLDebugFilterCheckbox_136;                        // 0x0910 (size: 0x8)
    class UMLDebugFilterCheckbox_C* MLDebugFilterCheckbox_137;                        // 0x0918 (size: 0x8)
    class UMLDebugFilterCheckbox_C* MLDebugFilterCheckbox_138;                        // 0x0920 (size: 0x8)
    class UMLDebugFilterCheckbox_C* MLDebugFilterCheckbox_139;                        // 0x0928 (size: 0x8)
    class UMLDebugFilterCheckbox_C* MLDebugFilterCheckbox_140;                        // 0x0930 (size: 0x8)
    class UMLDebugFilterCheckbox_C* MLDebugFilterCheckbox_141;                        // 0x0938 (size: 0x8)
    class UMLDebugFilterCheckbox_C* MLDebugFilterCheckbox_142;                        // 0x0940 (size: 0x8)
    class UMLDebugFilterCheckbox_C* MLDebugFilterCheckbox_143;                        // 0x0948 (size: 0x8)
    class UMLDebugFilterCheckbox_C* MLDebugFilterCheckbox_144;                        // 0x0950 (size: 0x8)
    class UMLDebugFilterCheckbox_C* MLDebugFilterCheckbox_145;                        // 0x0958 (size: 0x8)
    class UMLDebugFilterCheckbox_C* MLDebugFilterCheckbox_146;                        // 0x0960 (size: 0x8)
    class UMLDebugFilterCheckbox_C* MLDebugFilterCheckbox_147;                        // 0x0968 (size: 0x8)
    class UMLDebugFilterCheckbox_C* MLDebugFilterCheckbox_148;                        // 0x0970 (size: 0x8)
    class UMLDebugFilterCheckbox_C* MLDebugFilterCheckbox_149;                        // 0x0978 (size: 0x8)
    class UMLDebugFilterCheckbox_C* MLDebugFilterCheckbox_150;                        // 0x0980 (size: 0x8)
    class UMLDebugFilterCheckbox_C* MLDebugFilterCheckbox_151;                        // 0x0988 (size: 0x8)
    class UMLDebugFilterCheckbox_C* MLDebugFilterCheckbox_152;                        // 0x0990 (size: 0x8)
    class UMLDebugFilterCheckbox_C* MLDebugFilterCheckbox_153;                        // 0x0998 (size: 0x8)
    class UMLDebugFilterCheckbox_C* MLDebugFilterCheckbox_154;                        // 0x09A0 (size: 0x8)
    class UMLDebugFilterCheckbox_C* MLDebugFilterCheckbox_155;                        // 0x09A8 (size: 0x8)
    class UMLDebugFilterCheckbox_C* MLDebugFilterCheckbox_156;                        // 0x09B0 (size: 0x8)
    class UMLDebugFilterCheckbox_C* MLDebugFilterCheckbox_157;                        // 0x09B8 (size: 0x8)
    class UMLDebugFilterCheckbox_C* MLDebugFilterCheckbox_158;                        // 0x09C0 (size: 0x8)
    class UMLDebugFilterCheckbox_C* MLDebugFilterCheckbox_159;                        // 0x09C8 (size: 0x8)
    class UMLDebugFilterCheckbox_C* MLDebugFilterCheckbox_160;                        // 0x09D0 (size: 0x8)
    class UMLDebugFilterCheckbox_C* MLDebugFilterCheckbox_161;                        // 0x09D8 (size: 0x8)
    class UMLDebugFilterCheckbox_C* MLDebugFilterCheckbox_162;                        // 0x09E0 (size: 0x8)
    class UMLDebugFilterCheckbox_C* MLDebugFilterCheckbox_163;                        // 0x09E8 (size: 0x8)
    class UMLDebugFilterCheckbox_C* MLDebugFilterCheckbox_164;                        // 0x09F0 (size: 0x8)
    class UMLDebugFilterCheckbox_C* MLDebugFilterCheckbox_165;                        // 0x09F8 (size: 0x8)
    class UMLDebugFilterCheckbox_C* MLDebugFilterCheckbox_166;                        // 0x0A00 (size: 0x8)
    class UMLDebugFilterCheckbox_C* MLDebugFilterCheckbox_167;                        // 0x0A08 (size: 0x8)
    class UMLDebugFilterCheckbox_C* MLDebugFilterCheckbox_168;                        // 0x0A10 (size: 0x8)
    class UMLDebugFilterCheckbox_C* MLDebugFilterCheckbox_169;                        // 0x0A18 (size: 0x8)
    class UMLDebugFilterCheckbox_C* MLDebugFilterCheckbox_170;                        // 0x0A20 (size: 0x8)
    class UMLDebugFilterCheckbox_C* MLDebugFilterCheckbox_171;                        // 0x0A28 (size: 0x8)
    class UMLDebugFilterCheckbox_C* MLDebugFilterCheckbox_172;                        // 0x0A30 (size: 0x8)
    class UMLDebugFilterCheckbox_C* MLDebugFilterCheckbox_173;                        // 0x0A38 (size: 0x8)
    class UMLDebugFilterCheckbox_C* MLDebugFilterCheckbox_174;                        // 0x0A40 (size: 0x8)
    class UMLDebugFilterCheckbox_C* MLDebugFilterCheckbox_175;                        // 0x0A48 (size: 0x8)
    class UMLDebugFilterCheckbox_C* MLDebugFilterCheckbox_176;                        // 0x0A50 (size: 0x8)
    class UMLDebugFilterCheckbox_C* MLDebugFilterCheckbox_177;                        // 0x0A58 (size: 0x8)
    class UMLDebugFilterCheckbox_C* MLDebugFilterCheckbox_178;                        // 0x0A60 (size: 0x8)
    class UMLDebugFilterCheckbox_C* MLDebugFilterCheckbox_179;                        // 0x0A68 (size: 0x8)
    class UMLDebugFilterCheckbox_C* MLDebugFilterCheckbox_180;                        // 0x0A70 (size: 0x8)
    class UMLDebugFilterCheckbox_C* MLDebugFilterCheckbox_181;                        // 0x0A78 (size: 0x8)
    class UMLDebugFilterCheckbox_C* MLDebugFilterCheckbox_182;                        // 0x0A80 (size: 0x8)
    class UMLDebugFilterCheckbox_C* MLDebugFilterCheckbox_183;                        // 0x0A88 (size: 0x8)
    class UMLDebugFilterCheckbox_C* MLDebugFilterCheckbox_184;                        // 0x0A90 (size: 0x8)
    class UMLDebugFilterCheckbox_C* MLDebugFilterCheckbox_185;                        // 0x0A98 (size: 0x8)
    class UMLDebugFilterCheckbox_C* MLDebugFilterCheckbox_186;                        // 0x0AA0 (size: 0x8)
    class UMLDebugFilterCheckbox_C* MLDebugFilterCheckbox_187;                        // 0x0AA8 (size: 0x8)
    class UMLDebugFilterCheckbox_C* MLDebugFilterCheckbox_188;                        // 0x0AB0 (size: 0x8)
    class UMLDebugFilterCheckbox_C* MLDebugFilterCheckbox_189;                        // 0x0AB8 (size: 0x8)
    class UMLDebugFilterCheckbox_C* MLDebugFilterCheckbox_190;                        // 0x0AC0 (size: 0x8)
    class UMLDebugFilterCheckbox_C* MLDebugFilterCheckbox_191;                        // 0x0AC8 (size: 0x8)
    class UMLDebugFilterCheckbox_C* MLDebugFilterCheckbox_192;                        // 0x0AD0 (size: 0x8)
    class UMLDebugFilterCheckbox_C* MLDebugFilterCheckbox_193;                        // 0x0AD8 (size: 0x8)
    class UMLDebugFilterCheckbox_C* MLDebugFilterCheckbox_194;                        // 0x0AE0 (size: 0x8)
    class UMLDebugFilterCheckbox_C* MLDebugFilterCheckbox_195;                        // 0x0AE8 (size: 0x8)
    class UMLDebugFilterCheckbox_C* MLDebugFilterCheckbox_196;                        // 0x0AF0 (size: 0x8)
    class UMLDebugFilterCheckbox_C* MLDebugFilterCheckbox_197;                        // 0x0AF8 (size: 0x8)
    class UMLDebugFilterCheckbox_C* MLDebugFilterCheckbox_198;                        // 0x0B00 (size: 0x8)
    class UMLDebugFilterCheckbox_C* MLDebugFilterCheckbox_199;                        // 0x0B08 (size: 0x8)
    class UMLDebugFilterCheckbox_C* MLDebugFilterCheckbox_200;                        // 0x0B10 (size: 0x8)
    class UMLDebugFilterCheckbox_C* MLDebugFilterCheckbox_201;                        // 0x0B18 (size: 0x8)
    class UMLDebugFilterCheckbox_C* MLDebugFilterCheckbox_202;                        // 0x0B20 (size: 0x8)
    class UMLDebugFilterCheckbox_C* MLDebugFilterCheckbox_203;                        // 0x0B28 (size: 0x8)
    class UMLDebugFilterCheckbox_C* MLDebugFilterCheckbox_204;                        // 0x0B30 (size: 0x8)
    class UMLDebugFilterCheckbox_C* MLDebugFilterCheckbox_205;                        // 0x0B38 (size: 0x8)
    class UMLDebugFilterCheckbox_C* MLDebugFilterCheckbox_206;                        // 0x0B40 (size: 0x8)
    class UMLDebugFilterCheckbox_C* MLDebugFilterCheckbox_207;                        // 0x0B48 (size: 0x8)
    class UMLDebugFilterCheckbox_C* MLDebugFilterCheckbox_208;                        // 0x0B50 (size: 0x8)
    class UMLDebugFilterCheckbox_C* MLDebugFilterCheckbox_209;                        // 0x0B58 (size: 0x8)
    class UMLDebugFilterCheckbox_C* MLDebugFilterCheckbox_210;                        // 0x0B60 (size: 0x8)
    class UMLDebugFilterCheckbox_C* MLDebugFilterCheckbox_211;                        // 0x0B68 (size: 0x8)
    class UMLDebugFilterCheckbox_C* MLDebugFilterCheckbox_212;                        // 0x0B70 (size: 0x8)
    class UMLDebugFilterCheckbox_C* MLDebugFilterCheckbox_213;                        // 0x0B78 (size: 0x8)
    class UMLDebugFilterCheckbox_C* MLDebugFilterCheckbox_214;                        // 0x0B80 (size: 0x8)
    class UMLDebugFilterCheckbox_C* MLDebugFilterCheckbox_215;                        // 0x0B88 (size: 0x8)
    class UMLDebugFilterCheckbox_C* MLDebugFilterCheckbox_216;                        // 0x0B90 (size: 0x8)
    class UMLDebugFilterCheckbox_C* MLDebugFilterCheckbox_217;                        // 0x0B98 (size: 0x8)
    class UMLDebugFilterCheckbox_C* MLDebugFilterCheckbox_218;                        // 0x0BA0 (size: 0x8)
    class UMLDebugFilterCheckbox_C* MLDebugFilterCheckbox_219;                        // 0x0BA8 (size: 0x8)
    class UMLDebugFilterCheckbox_C* MLDebugFilterCheckbox_220;                        // 0x0BB0 (size: 0x8)
    class UMLDebugFilterCheckbox_C* MLDebugFilterCheckbox_221;                        // 0x0BB8 (size: 0x8)
    class UMLDebugFilterCheckbox_C* MLDebugFilterCheckbox_222;                        // 0x0BC0 (size: 0x8)
    class UMLDebugFilterCheckbox_C* MLDebugFilterCheckbox_223;                        // 0x0BC8 (size: 0x8)
    class UMLDebugFilterCheckbox_C* MLDebugFilterCheckbox_224;                        // 0x0BD0 (size: 0x8)
    class UMLDebugFilterCheckbox_C* MLDebugFilterCheckbox_225;                        // 0x0BD8 (size: 0x8)
    class UMLDebugFilterCheckbox_C* MLDebugFilterCheckbox_226;                        // 0x0BE0 (size: 0x8)
    class UMLDebugFilterCheckbox_C* MLDebugFilterCheckbox_death;                      // 0x0BE8 (size: 0x8)
    class UVerticalBox* pathfinding_vb;                                               // 0x0BF0 (size: 0x8)
    class UVerticalBox* plots_vb;                                                     // 0x0BF8 (size: 0x8)
    class USizeBox* SizeBox_0;                                                        // 0x0C00 (size: 0x8)
    class UVerticalBox* tasks_jobs_VB;                                                // 0x0C08 (size: 0x8)
    class UTextBlock* TextBlock_12;                                                   // 0x0C10 (size: 0x8)
    class UTextBlock* TextBlock_13;                                                   // 0x0C18 (size: 0x8)
    class UTextBlock* TextBlock_41;                                                   // 0x0C20 (size: 0x8)
    class UTextBlock* TextBlock_88;                                                   // 0x0C28 (size: 0x8)
    class UTextBlock* TextBlock_131;                                                  // 0x0C30 (size: 0x8)
    class UTextBlock* tradeLog_txt;                                                   // 0x0C38 (size: 0x8)
    class UVerticalBox* tradelog_vb;                                                  // 0x0C40 (size: 0x8)
    class UVerticalBox* VAMP_VB;                                                      // 0x0C48 (size: 0x8)
    class UWrapBox* WrapBox_0;                                                        // 0x0C50 (size: 0x8)
    class ARTSMultiEngineCPP* masterPtr;                                              // 0x0C58 (size: 0x8)
    FString debugLogTemp;                                                             // 0x0C60 (size: 0x10)

    void getRegionNameIfValid(class ARegion* Region, FString& Region Name);
    void printCurrentRegionTradeLog();
    void getInventory(class ASMUnit* Target, FString& invStr1);
    void sumIntoString(TArray<int32>& Array, FString& summedIds1);
    FSquad getSquadIfHasOne(class APawnCPP* Pawn, int32 squadID);
    void Update Log(class UTextBlock* textBox, bool& Condition, const TArray<FString>& logs, class UTextBlock* last_log_txt);
    void udpateHoverUnitDetails(double InputPin);
    void getTask(const TArray<FTask>& TargetArray, int32& Type);
    void Construct();
    void Tick(FGeometry MyGeometry, float InDeltaTime);
    void BndEvt__MLDebuggerWindow_CheckBox_142_K2Node_ComponentBoundEvent_0_OnCheckBoxComponentStateChanged__DelegateSignature(bool bIsChecked);
