#ifndef UE4SS_SDK_BM_DESTROYED_Windmill_HPP
#define UE4SS_SDK_BM_DESTROYED_Windmill_HPP

class ABM_DESTROYED_Windmill_C : public AStaticMeshActor
{
    class UStaticMeshComponent* Dirt_5_5;                                             // 0x02A0 (size: 0x8)
    class UStaticMeshComponent* dirt_2_6;                                             // 0x02A8 (size: 0x8)
    class UStaticMeshComponent* dirt_2_5;                                             // 0x02B0 (size: 0x8)
    class UStaticMeshComponent* Dirt_5_4;                                             // 0x02B8 (size: 0x8)
    class UStaticMeshComponent* Dirt_5_3;                                             // 0x02C0 (size: 0x8)
    class UStaticMeshComponent* Dirt_5_2;                                             // 0x02C8 (size: 0x8)
    class UStaticMeshComponent* Dirt_0_1;                                             // 0x02D0 (size: 0x8)
    class UStaticMeshComponent* MainBld_0;                                            // 0x02D8 (size: 0x8)

}; // Size: 0x2E0

#endif
