#ifndef UE4SS_SDK_BM_GeneralGoodsStall_VarB_HPP
#define UE4SS_SDK_BM_GeneralGoodsStall_VarB_HPP

class ABM_GeneralGoodsStall_VarB_C : public AStaticMeshActor
{
    class UStaticMeshComponent* res_12_3;                                             // 0x02A0 (size: 0x8)
    class UStaticMeshComponent* res_4_4;                                              // 0x02A8 (size: 0x8)
    class UStaticMeshComponent* res_4_3;                                              // 0x02B0 (size: 0x8)
    class UStaticMeshComponent* res_4_2;                                              // 0x02B8 (size: 0x8)
    class UStaticMeshComponent* clutter_19;                                           // 0x02C0 (size: 0x8)
    class UStaticMeshComponent* clutter_18;                                           // 0x02C8 (size: 0x8)
    class UStaticMeshComponent* clutter_17;                                           // 0x02D0 (size: 0x8)
    class UStaticMeshComponent* clutter_38;                                           // 0x02D8 (size: 0x8)
    class UStaticMeshComponent* clutter_15;                                           // 0x02E0 (size: 0x8)
    class UStaticMeshComponent* clutter_14;                                           // 0x02E8 (size: 0x8)
    class UStaticMeshComponent* clutter_47;                                           // 0x02F0 (size: 0x8)
    class UStaticMeshComponent* clutter_45;                                           // 0x02F8 (size: 0x8)
    class UStaticMeshComponent* clutter_41;                                           // 0x0300 (size: 0x8)
    class UStaticMeshComponent* clutter_13;                                           // 0x0308 (size: 0x8)
    class UStaticMeshComponent* clutter_12;                                           // 0x0310 (size: 0x8)
    class UStaticMeshComponent* clutter_46;                                           // 0x0318 (size: 0x8)
    class UStaticMeshComponent* clutter_44;                                           // 0x0320 (size: 0x8)
    class UStaticMeshComponent* clutter_40;                                           // 0x0328 (size: 0x8)
    class UStaticMeshComponent* clutter_36;                                           // 0x0330 (size: 0x8)
    class UStaticMeshComponent* clutter_43;                                           // 0x0338 (size: 0x8)
    class UStaticMeshComponent* clutter_42;                                           // 0x0340 (size: 0x8)
    class UStaticMeshComponent* res_13_4;                                             // 0x0348 (size: 0x8)
    class UStaticMeshComponent* res_13_3;                                             // 0x0350 (size: 0x8)
    class UStaticMeshComponent* res_13_2;                                             // 0x0358 (size: 0x8)
    class UStaticMeshComponent* res_13_1;                                             // 0x0360 (size: 0x8)
    class UStaticMeshComponent* res_13_0;                                             // 0x0368 (size: 0x8)
    class UStaticMeshComponent* res_216_4;                                            // 0x0370 (size: 0x8)
    class UStaticMeshComponent* res_216_3;                                            // 0x0378 (size: 0x8)
    class UStaticMeshComponent* res_216_2;                                            // 0x0380 (size: 0x8)
    class UStaticMeshComponent* res_216_1;                                            // 0x0388 (size: 0x8)
    class USceneComponent* gathering;                                                 // 0x0390 (size: 0x8)
    class UStaticMeshComponent* Dirt_0_1;                                             // 0x0398 (size: 0x8)
    class UStaticMeshComponent* MainBld_249;                                          // 0x03A0 (size: 0x8)

}; // Size: 0x3A8

#endif
