#ifndef UE4SS_SDK_BM_SG_DyersWorkshop_HPP
#define UE4SS_SDK_BM_SG_DyersWorkshop_HPP

class ABM_SG_DyersWorkshop_C : public AStaticMeshActor
{
    class UStaticMeshComponent* bench_171_5;                                          // 0x02A0 (size: 0x8)
    class UStaticMeshComponent* bench_171_4;                                          // 0x02A8 (size: 0x8)
    class UStaticMeshComponent* Dirt_0_4;                                             // 0x02B0 (size: 0x8)
    class UStaticMeshComponent* PS_Smoke1;                                            // 0x02B8 (size: 0x8)
    class UStaticMeshComponent* MainBld_37;                                           // 0x02C0 (size: 0x8)
    class UStaticMeshComponent* MainBld_36;                                           // 0x02C8 (size: 0x8)
    class UStaticMeshComponent* bench_171_3;                                          // 0x02D0 (size: 0x8)
    class UStaticMeshComponent* Clutter10;                                            // 0x02D8 (size: 0x8)
    class USceneComponent* ambience_fireplace;                                        // 0x02E0 (size: 0x8)
    class UStaticMeshComponent* PS_Smoke;                                             // 0x02E8 (size: 0x8)
    class UStaticMeshComponent* Bld_401_15;                                           // 0x02F0 (size: 0x8)
    class UStaticMeshComponent* fullBld_304;                                          // 0x02F8 (size: 0x8)
    class UStaticMeshComponent* Bld_401_14;                                           // 0x0300 (size: 0x8)
    class UStaticMeshComponent* Bld_401_13;                                           // 0x0308 (size: 0x8)
    class UStaticMeshComponent* Bld_401_12;                                           // 0x0310 (size: 0x8)
    class UStaticMeshComponent* Bld_401_11;                                           // 0x0318 (size: 0x8)
    class UStaticMeshComponent* Bld_401_10;                                           // 0x0320 (size: 0x8)
    class UStaticMeshComponent* Bld_401_9;                                            // 0x0328 (size: 0x8)
    class UStaticMeshComponent* Bld_401_8;                                            // 0x0330 (size: 0x8)
    class UStaticMeshComponent* Clutter9;                                             // 0x0338 (size: 0x8)
    class UStaticMeshComponent* Clutter8;                                             // 0x0340 (size: 0x8)
    class UStaticMeshComponent* MainBld_35;                                           // 0x0348 (size: 0x8)
    class UStaticMeshComponent* res_16_1;                                             // 0x0350 (size: 0x8)
    class UStaticMeshComponent* res_16_0;                                             // 0x0358 (size: 0x8)
    class UStaticMeshComponent* Clutter5;                                             // 0x0360 (size: 0x8)
    class UStaticMeshComponent* Clutter4;                                             // 0x0368 (size: 0x8)
    class UStaticMeshComponent* Clutter3;                                             // 0x0370 (size: 0x8)
    class UStaticMeshComponent* Clutter2;                                             // 0x0378 (size: 0x8)
    class UStaticMeshComponent* fullBld_303;                                          // 0x0380 (size: 0x8)
    class UStaticMeshComponent* Dirt_3_0;                                             // 0x0388 (size: 0x8)
    class UStaticMeshComponent* Dirt_0_3;                                             // 0x0390 (size: 0x8)
    class UStaticMeshComponent* Clutter1;                                             // 0x0398 (size: 0x8)
    class UStaticMeshComponent* clutter;                                              // 0x03A0 (size: 0x8)
    class UStaticMeshComponent* MainBld_22;                                           // 0x03A8 (size: 0x8)
    class USceneComponent* Scene;                                                     // 0x03B0 (size: 0x8)

}; // Size: 0x3B8

#endif
