#ifndef UE4SS_SDK_BM_Stonecutter_HPP
#define UE4SS_SDK_BM_Stonecutter_HPP

class ABM_Stonecutter_C : public AStaticMeshActor
{
    class UStaticMeshComponent* clutter_15;                                           // 0x02A0 (size: 0x8)
    class UStaticMeshComponent* clutter_14;                                           // 0x02A8 (size: 0x8)
    class UStaticMeshComponent* clutter_13;                                           // 0x02B0 (size: 0x8)
    class UStaticMeshComponent* clutter_12;                                           // 0x02B8 (size: 0x8)
    class UStaticMeshComponent* clutter_11;                                           // 0x02C0 (size: 0x8)
    class UStaticMeshComponent* clutter_10;                                           // 0x02C8 (size: 0x8)
    class UStaticMeshComponent* clutter_9;                                            // 0x02D0 (size: 0x8)
    class UStaticMeshComponent* clutter_8;                                            // 0x02D8 (size: 0x8)
    class UStaticMeshComponent* clutter_7;                                            // 0x02E0 (size: 0x8)
    class UStaticMeshComponent* clutter_4;                                            // 0x02E8 (size: 0x8)
    class UStaticMeshComponent* clutter_3;                                            // 0x02F0 (size: 0x8)
    class UStaticMeshComponent* clutter_2;                                            // 0x02F8 (size: 0x8)
    class UStaticMeshComponent* bld_0_7;                                              // 0x0300 (size: 0x8)
    class UStaticMeshComponent* res_16_5;                                             // 0x0308 (size: 0x8)
    class UStaticMeshComponent* res_16_4;                                             // 0x0310 (size: 0x8)
    class UStaticMeshComponent* res_16_3;                                             // 0x0318 (size: 0x8)
    class UStaticMeshComponent* res_16_2;                                             // 0x0320 (size: 0x8)
    class UStaticMeshComponent* Dirt_3_2;                                             // 0x0328 (size: 0x8)
    class UStaticMeshComponent* Dirt_0_1;                                             // 0x0330 (size: 0x8)
    class UStaticMeshComponent* Dirt_0_0;                                             // 0x0338 (size: 0x8)
    class UStaticMeshComponent* bld_0_6;                                              // 0x0340 (size: 0x8)
    class UStaticMeshComponent* bld_0_5;                                              // 0x0348 (size: 0x8)
    class UStaticMeshComponent* fullBld_437;                                          // 0x0350 (size: 0x8)
    class UStaticMeshComponent* Dirt_3_0;                                             // 0x0358 (size: 0x8)
    class UStaticMeshComponent* MainBld_438;                                          // 0x0360 (size: 0x8)

}; // Size: 0x368

#endif
