#ifndef UE4SS_SDK_BM_SG_Cottage_LV2_A_HPP
#define UE4SS_SDK_BM_SG_Cottage_LV2_A_HPP

class ABM_SG_Cottage_LV2_A_C : public AStaticMeshActor
{
    class UStaticMeshComponent* clutter_stones25;                                     // 0x02A0 (size: 0x8)
    class UStaticMeshComponent* clutter_stones24;                                     // 0x02A8 (size: 0x8)
    class UStaticMeshComponent* clutter_stones28;                                     // 0x02B0 (size: 0x8)
    class UStaticMeshComponent* clutter_stones27;                                     // 0x02B8 (size: 0x8)
    class UStaticMeshComponent* clutter_bush02;                                       // 0x02C0 (size: 0x8)
    class UStaticMeshComponent* clutter_bush01;                                       // 0x02C8 (size: 0x8)
    class UStaticMeshComponent* clutter_grass_04;                                     // 0x02D0 (size: 0x8)
    class UStaticMeshComponent* clutter_grass_03;                                     // 0x02D8 (size: 0x8)
    class UStaticMeshComponent* clutter_grass_02;                                     // 0x02E0 (size: 0x8)
    class UStaticMeshComponent* clutter_grass_01;                                     // 0x02E8 (size: 0x8)
    class UStaticMeshComponent* fullBld_477;                                          // 0x02F0 (size: 0x8)
    class UStaticMeshComponent* clutter_52;                                           // 0x02F8 (size: 0x8)
    class UStaticMeshComponent* Dirt_3_1;                                             // 0x0300 (size: 0x8)
    class UStaticMeshComponent* clutter_51;                                           // 0x0308 (size: 0x8)
    class UStaticMeshComponent* clutter_49;                                           // 0x0310 (size: 0x8)
    class UStaticMeshComponent* clutter_pavement6;                                    // 0x0318 (size: 0x8)
    class UStaticMeshComponent* res_16_1;                                             // 0x0320 (size: 0x8)
    class UStaticMeshComponent* res_16_0;                                             // 0x0328 (size: 0x8)
    class UStaticMeshComponent* clutter_46;                                           // 0x0330 (size: 0x8)
    class UStaticMeshComponent* clutter_45;                                           // 0x0338 (size: 0x8)
    class UStaticMeshComponent* clutter_13;                                           // 0x0340 (size: 0x8)
    class UStaticMeshComponent* clutter_12;                                           // 0x0348 (size: 0x8)
    class UStaticMeshComponent* Dirt_0_0;                                             // 0x0350 (size: 0x8)
    class UStaticMeshComponent* clutter_48;                                           // 0x0358 (size: 0x8)
    class UStaticMeshComponent* clutter_47;                                           // 0x0360 (size: 0x8)
    class UStaticMeshComponent* MainBld_27;                                           // 0x0368 (size: 0x8)

}; // Size: 0x370

#endif
