#ifndef UE4SS_SDK_BM_SG_SmallStable_HPP
#define UE4SS_SDK_BM_SG_SmallStable_HPP

class ABM_SG_SmallStable_C : public AStaticMeshActor
{
    class UStaticMeshComponent* clutter_dirt10;                                       // 0x02A0 (size: 0x8)
    class UStaticMeshComponent* clutter_dirt9;                                        // 0x02A8 (size: 0x8)
    class UStaticMeshComponent* clutter_6;                                            // 0x02B0 (size: 0x8)
    class UStaticMeshComponent* clutter_1;                                            // 0x02B8 (size: 0x8)
    class UStaticMeshComponent* clutter_48;                                           // 0x02C0 (size: 0x8)
    class UStaticMeshComponent* clutter_dirt8;                                        // 0x02C8 (size: 0x8)
    class UStaticMeshComponent* clutter_dirt7;                                        // 0x02D0 (size: 0x8)
    class UStaticMeshComponent* clutter_dirt6;                                        // 0x02D8 (size: 0x8)
    class UStaticMeshComponent* clutter_dirt5;                                        // 0x02E0 (size: 0x8)
    class UStaticMeshComponent* clutter_barrel04;                                     // 0x02E8 (size: 0x8)
    class UStaticMeshComponent* clutter_grass_011;                                    // 0x02F0 (size: 0x8)
    class UStaticMeshComponent* clutter_grass_010;                                    // 0x02F8 (size: 0x8)
    class UStaticMeshComponent* clutter_grass_09;                                     // 0x0300 (size: 0x8)
    class UStaticMeshComponent* clutter_grass_08;                                     // 0x0308 (size: 0x8)
    class UStaticMeshComponent* clutter_hay01;                                        // 0x0310 (size: 0x8)
    class UStaticMeshComponent* clutter_dirt4;                                        // 0x0318 (size: 0x8)
    class UStaticMeshComponent* clutter_dirt3;                                        // 0x0320 (size: 0x8)
    class UStaticMeshComponent* clutter_dirt2;                                        // 0x0328 (size: 0x8)
    class UStaticMeshComponent* clutter_dirt1;                                        // 0x0330 (size: 0x8)
    class UStaticMeshComponent* Dirt_3_0;                                             // 0x0338 (size: 0x8)
    class UStaticMeshComponent* MainBld_400;                                          // 0x0340 (size: 0x8)
    class UStaticMeshComponent* Dirt_0_2;                                             // 0x0348 (size: 0x8)

}; // Size: 0x350

#endif
