#ifndef UE4SS_SDK_BM_SG_Granary_Lv2_HPP
#define UE4SS_SDK_BM_SG_Granary_Lv2_HPP

class ABM_SG_Granary_Lv2_C : public AStaticMeshActor
{
    class UStaticMeshComponent* clutter_bush8;                                        // 0x02A0 (size: 0x8)
    class UStaticMeshComponent* clutter_bush7;                                        // 0x02A8 (size: 0x8)
    class UStaticMeshComponent* Dirt_1_7;                                             // 0x02B0 (size: 0x8)
    class UStaticMeshComponent* Dirt_1_6;                                             // 0x02B8 (size: 0x8)
    class UStaticMeshComponent* Dirt_1_5;                                             // 0x02C0 (size: 0x8)
    class UStaticMeshComponent* clutter_52;                                           // 0x02C8 (size: 0x8)
    class UStaticMeshComponent* clutter_51;                                           // 0x02D0 (size: 0x8)
    class UStaticMeshComponent* res_16_2;                                             // 0x02D8 (size: 0x8)
    class UStaticMeshComponent* res_16_1;                                             // 0x02E0 (size: 0x8)
    class UStaticMeshComponent* res_16_0;                                             // 0x02E8 (size: 0x8)
    class UStaticMeshComponent* clutter_grass_07;                                     // 0x02F0 (size: 0x8)
    class UStaticMeshComponent* clutter_grass_06;                                     // 0x02F8 (size: 0x8)
    class UStaticMeshComponent* clutter_grass_05;                                     // 0x0300 (size: 0x8)
    class UStaticMeshComponent* clutter_grass_04;                                     // 0x0308 (size: 0x8)
    class UStaticMeshComponent* clutter_grass_03;                                     // 0x0310 (size: 0x8)
    class UStaticMeshComponent* clutter_grass_02;                                     // 0x0318 (size: 0x8)
    class UStaticMeshComponent* clutter_grass_01;                                     // 0x0320 (size: 0x8)
    class UStaticMeshComponent* clutter_rope;                                         // 0x0328 (size: 0x8)
    class UStaticMeshComponent* clutter_dirt4;                                        // 0x0330 (size: 0x8)
    class UStaticMeshComponent* clutter_dirt3;                                        // 0x0338 (size: 0x8)
    class UStaticMeshComponent* clutter_pavement1;                                    // 0x0340 (size: 0x8)
    class UStaticMeshComponent* res_147_4;                                            // 0x0348 (size: 0x8)
    class UStaticMeshComponent* res_147_3;                                            // 0x0350 (size: 0x8)
    class UStaticMeshComponent* res_147_2;                                            // 0x0358 (size: 0x8)
    class UStaticMeshComponent* res_172_7;                                            // 0x0360 (size: 0x8)
    class UStaticMeshComponent* res_172_6;                                            // 0x0368 (size: 0x8)
    class UStaticMeshComponent* res_172_5;                                            // 0x0370 (size: 0x8)
    class UStaticMeshComponent* res_171_3;                                            // 0x0378 (size: 0x8)
    class UStaticMeshComponent* res_171_2;                                            // 0x0380 (size: 0x8)
    class UStaticMeshComponent* res_5_8;                                              // 0x0388 (size: 0x8)
    class UStaticMeshComponent* res_5_7;                                              // 0x0390 (size: 0x8)
    class UStaticMeshComponent* res_5_6;                                              // 0x0398 (size: 0x8)
    class UStaticMeshComponent* res_5_5;                                              // 0x03A0 (size: 0x8)
    class UStaticMeshComponent* res_1_4;                                              // 0x03A8 (size: 0x8)
    class UStaticMeshComponent* res_1_3;                                              // 0x03B0 (size: 0x8)
    class UStaticMeshComponent* res_1_2;                                              // 0x03B8 (size: 0x8)
    class UStaticMeshComponent* res_1_1;                                              // 0x03C0 (size: 0x8)
    class UStaticMeshComponent* res_1_0;                                              // 0x03C8 (size: 0x8)
    class USceneComponent* gathering;                                                 // 0x03D0 (size: 0x8)
    class UStaticMeshComponent* Dirt_1_0;                                             // 0x03D8 (size: 0x8)
    class UStaticMeshComponent* Dirt_3_0;                                             // 0x03E0 (size: 0x8)
    class UStaticMeshComponent* Handcart1;                                            // 0x03E8 (size: 0x8)
    class UStaticMeshComponent* handcart;                                             // 0x03F0 (size: 0x8)
    class UStaticMeshComponent* MainBld_245;                                          // 0x03F8 (size: 0x8)

}; // Size: 0x400

#endif
