#ifndef UE4SS_SDK_BM_SG_House_LV2_Bpart_B_HPP
#define UE4SS_SDK_BM_SG_House_LV2_Bpart_B_HPP

class ABM_SG_House_LV2_Bpart_B_C : public AStaticMeshActor
{
    class UStaticMeshComponent* clutter_stones02;                                     // 0x02A0 (size: 0x8)
    class UStaticMeshComponent* clutter_stones01;                                     // 0x02A8 (size: 0x8)
    class UStaticMeshComponent* clutter_bush02;                                       // 0x02B0 (size: 0x8)
    class UStaticMeshComponent* clutter_bush01;                                       // 0x02B8 (size: 0x8)
    class UStaticMeshComponent* clutter_grass_03;                                     // 0x02C0 (size: 0x8)
    class UStaticMeshComponent* clutter_grass_02;                                     // 0x02C8 (size: 0x8)
    class UStaticMeshComponent* clutter_grass_01;                                     // 0x02D0 (size: 0x8)
    class UStaticMeshComponent* clutter_hay01;                                        // 0x02D8 (size: 0x8)
    class UStaticMeshComponent* bld_0;                                                // 0x02E0 (size: 0x8)
    class UStaticMeshComponent* clutter_barrel04;                                     // 0x02E8 (size: 0x8)
    class UStaticMeshComponent* StaticMesh1;                                          // 0x02F0 (size: 0x8)
    class UStaticMeshComponent* StaticMesh;                                           // 0x02F8 (size: 0x8)
    class UStaticMeshComponent* clutter_barrel03;                                     // 0x0300 (size: 0x8)
    class UStaticMeshComponent* clutter_barrel02;                                     // 0x0308 (size: 0x8)
    class UStaticMeshComponent* clutter_pavement6;                                    // 0x0310 (size: 0x8)
    class UStaticMeshComponent* clutter_pavement5;                                    // 0x0318 (size: 0x8)
    class UStaticMeshComponent* clutter_pavement4;                                    // 0x0320 (size: 0x8)
    class UStaticMeshComponent* clutter_bag04;                                        // 0x0328 (size: 0x8)
    class UStaticMeshComponent* clutter_bag03;                                        // 0x0330 (size: 0x8)
    class UStaticMeshComponent* clutter_bag02;                                        // 0x0338 (size: 0x8)
    class UStaticMeshComponent* clutter_bale05;                                       // 0x0340 (size: 0x8)
    class UStaticMeshComponent* clutter_bale04;                                       // 0x0348 (size: 0x8)
    class UStaticMeshComponent* clutter_bale03;                                       // 0x0350 (size: 0x8)
    class UStaticMeshComponent* clutter_ladder01;                                     // 0x0358 (size: 0x8)
    class UStaticMeshComponent* clutter_bale02;                                       // 0x0360 (size: 0x8)
    class UStaticMeshComponent* dirt_4_0;                                             // 0x0368 (size: 0x8)
    class UStaticMeshComponent* clutter_bale01;                                       // 0x0370 (size: 0x8)
    class UStaticMeshComponent* res_16_0;                                             // 0x0378 (size: 0x8)
    class UStaticMeshComponent* Dirt_0_0;                                             // 0x0380 (size: 0x8)
    class UStaticMeshComponent* fullBld_483;                                          // 0x0388 (size: 0x8)

}; // Size: 0x390

#endif
