#ifndef UE4SS_SDK_BM_SG_CoopRoofed_HPP
#define UE4SS_SDK_BM_SG_CoopRoofed_HPP

class ABM_SG_CoopRoofed_C : public AStaticMeshActor
{
    class UStaticMeshComponent* clutter_4;                                            // 0x02A0 (size: 0x8)
    class UStaticMeshComponent* clutter_8;                                            // 0x02A8 (size: 0x8)
    class UStaticMeshComponent* clutter_7;                                            // 0x02B0 (size: 0x8)
    class UStaticMeshComponent* clutter_3;                                            // 0x02B8 (size: 0x8)
    class UStaticMeshComponent* clutter_2;                                            // 0x02C0 (size: 0x8)
    class UStaticMeshComponent* clutter_1;                                            // 0x02C8 (size: 0x8)
    class UStaticMeshComponent* bld_0;                                                // 0x02D0 (size: 0x8)
    class UStaticMeshComponent* Dirt_0_0;                                             // 0x02D8 (size: 0x8)

}; // Size: 0x2E0

#endif
