#ifndef UE4SS_SDK_BM_SG_Merchant_HPP
#define UE4SS_SDK_BM_SG_Merchant_HPP

class ABM_SG_Merchant_C : public AStaticMeshActor
{
    class USceneComponent* gathering;                                                 // 0x02A0 (size: 0x8)
    class UStaticMeshComponent* handcart_4;                                           // 0x02A8 (size: 0x8)
    class UStaticMeshComponent* handcart_3;                                           // 0x02B0 (size: 0x8)
    class UStaticMeshComponent* handcart_2;                                           // 0x02B8 (size: 0x8)
    class UStaticMeshComponent* handcart_1;                                           // 0x02C0 (size: 0x8)
    class UStaticMeshComponent* Dirt_3_1;                                             // 0x02C8 (size: 0x8)
    class UStaticMeshComponent* dirt_4_0;                                             // 0x02D0 (size: 0x8)
    class UStaticMeshComponent* clutter_stones15;                                     // 0x02D8 (size: 0x8)
    class UStaticMeshComponent* clutter_stones14;                                     // 0x02E0 (size: 0x8)
    class UStaticMeshComponent* clutter_stones13;                                     // 0x02E8 (size: 0x8)
    class UStaticMeshComponent* clutter_stones12;                                     // 0x02F0 (size: 0x8)
    class UStaticMeshComponent* clutter_other;                                        // 0x02F8 (size: 0x8)
    class UStaticMeshComponent* clutter_stones11;                                     // 0x0300 (size: 0x8)
    class UStaticMeshComponent* clutter_stones10;                                     // 0x0308 (size: 0x8)
    class UStaticMeshComponent* clutter_stones9;                                      // 0x0310 (size: 0x8)
    class UStaticMeshComponent* clutter_stones8;                                      // 0x0318 (size: 0x8)
    class UStaticMeshComponent* clutter_stones7;                                      // 0x0320 (size: 0x8)
    class UStaticMeshComponent* dirt_2_3;                                             // 0x0328 (size: 0x8)
    class UStaticMeshComponent* Dirt_0_2;                                             // 0x0330 (size: 0x8)
    class UStaticMeshComponent* clutter_1;                                            // 0x0338 (size: 0x8)
    class UStaticMeshComponent* clutter_0;                                            // 0x0340 (size: 0x8)
    class UStaticMeshComponent* MainBld_26;                                           // 0x0348 (size: 0x8)

}; // Size: 0x350

#endif
