#ifndef UE4SS_SDK_BM_SG_Townhouse_LV3_A_HPP
#define UE4SS_SDK_BM_SG_Townhouse_LV3_A_HPP

class ABM_SG_Townhouse_LV3_A_C : public AStaticMeshActor
{
    class UStaticMeshComponent* fullBld_477;                                          // 0x02A0 (size: 0x8)
    class USceneComponent* bounce;                                                    // 0x02A8 (size: 0x8)
    class UStaticMeshComponent* clutter_pavement3;                                    // 0x02B0 (size: 0x8)
    class UStaticMeshComponent* clutter_pavement2;                                    // 0x02B8 (size: 0x8)
    class UStaticMeshComponent* clutter_pavement1;                                    // 0x02C0 (size: 0x8)
    class UStaticMeshComponent* clutter_pavement0;                                    // 0x02C8 (size: 0x8)
    class UStaticMeshComponent* clutter_12;                                           // 0x02D0 (size: 0x8)
    class UStaticMeshComponent* clutter_46;                                           // 0x02D8 (size: 0x8)
    class UStaticMeshComponent* clutter_45;                                           // 0x02E0 (size: 0x8)
    class UStaticMeshComponent* clutter_44;                                           // 0x02E8 (size: 0x8)
    class UStaticMeshComponent* clutter_43;                                           // 0x02F0 (size: 0x8)
    class UStaticMeshComponent* clutter_36;                                           // 0x02F8 (size: 0x8)
    class UStaticMeshComponent* clutter_16;                                           // 0x0300 (size: 0x8)
    class UStaticMeshComponent* clutter_15;                                           // 0x0308 (size: 0x8)
    class UStaticMeshComponent* clutter_30;                                           // 0x0310 (size: 0x8)
    class UStaticMeshComponent* clutter_9;                                            // 0x0318 (size: 0x8)
    class UStaticMeshComponent* clutter_14;                                           // 0x0320 (size: 0x8)
    class UStaticMeshComponent* clutter_13;                                           // 0x0328 (size: 0x8)
    class UStaticMeshComponent* Dirt_0_0;                                             // 0x0330 (size: 0x8)
    class UStaticMeshComponent* dirt_4_0;                                             // 0x0338 (size: 0x8)
    class UStaticMeshComponent* MainBld_450;                                          // 0x0340 (size: 0x8)

}; // Size: 0x348

#endif
