#ifndef UE4SS_SDK_BM_SG_Ext_Forge_HPP
#define UE4SS_SDK_BM_SG_Ext_Forge_HPP

class ABM_SG_Ext_Forge_C : public AStaticMeshActor
{
    class UStaticMeshComponent* res_35_2;                                             // 0x02A0 (size: 0x8)
    class UStaticMeshComponent* res_35_1;                                             // 0x02A8 (size: 0x8)
    class UStaticMeshComponent* res_35_0;                                             // 0x02B0 (size: 0x8)
    class USceneComponent* workPos_2;                                                 // 0x02B8 (size: 0x8)
    class USceneComponent* workPos_1;                                                 // 0x02C0 (size: 0x8)
    class UStaticMeshComponent* clutter_4;                                            // 0x02C8 (size: 0x8)
    class USceneComponent* workpos2;                                                  // 0x02D0 (size: 0x8)
    class UStaticMeshComponent* res_216;                                              // 0x02D8 (size: 0x8)
    class UStaticMeshComponent* clutter23;                                            // 0x02E0 (size: 0x8)
    class UStaticMeshComponent* clutter22;                                            // 0x02E8 (size: 0x8)
    class UStaticMeshComponent* clutter21;                                            // 0x02F0 (size: 0x8)
    class UStaticMeshComponent* clutter20;                                            // 0x02F8 (size: 0x8)
    class UStaticMeshComponent* clutter_23;                                           // 0x0300 (size: 0x8)
    class UStaticMeshComponent* clutter_22;                                           // 0x0308 (size: 0x8)
    class UStaticMeshComponent* clutter_21;                                           // 0x0310 (size: 0x8)
    class UStaticMeshComponent* clutter_20;                                           // 0x0318 (size: 0x8)
    class UStaticMeshComponent* clutter19;                                            // 0x0320 (size: 0x8)
    class UStaticMeshComponent* Dirt_0_1;                                             // 0x0328 (size: 0x8)
    class UStaticMeshComponent* clutter17;                                            // 0x0330 (size: 0x8)
    class UStaticMeshComponent* Clutter15;                                            // 0x0338 (size: 0x8)
    class UStaticMeshComponent* Clutter14;                                            // 0x0340 (size: 0x8)
    class UStaticMeshComponent* Clutter13;                                            // 0x0348 (size: 0x8)
    class UStaticMeshComponent* Clutter12;                                            // 0x0350 (size: 0x8)
    class UStaticMeshComponent* Clutter11;                                            // 0x0358 (size: 0x8)
    class UStaticMeshComponent* Clutter10;                                            // 0x0360 (size: 0x8)
    class UStaticMeshComponent* clutter_9;                                            // 0x0368 (size: 0x8)
    class UStaticMeshComponent* clutter_8;                                            // 0x0370 (size: 0x8)
    class UStaticMeshComponent* clutter_2;                                            // 0x0378 (size: 0x8)
    class UStaticMeshComponent* Dirt_0_2;                                             // 0x0380 (size: 0x8)
    class UStaticMeshComponent* Dirt_3_1;                                             // 0x0388 (size: 0x8)
    class UStaticMeshComponent* bld_440;                                              // 0x0390 (size: 0x8)
    class UStaticMeshComponent* MainBld_439;                                          // 0x0398 (size: 0x8)
    class UStaticMeshComponent* Clutter4;                                             // 0x03A0 (size: 0x8)
    class UStaticMeshComponent* Clutter3;                                             // 0x03A8 (size: 0x8)
    class UStaticMeshComponent* Clutter2;                                             // 0x03B0 (size: 0x8)
    class UStaticMeshComponent* Clutter1;                                             // 0x03B8 (size: 0x8)
    class UStaticMeshComponent* clutter18;                                            // 0x03C0 (size: 0x8)
    class UStaticMeshComponent* clutter16;                                            // 0x03C8 (size: 0x8)
    class USceneComponent* Scene;                                                     // 0x03D0 (size: 0x8)

}; // Size: 0x3D8

#endif
