#ifndef UE4SS_SDK_BM_SG_Bloomery_HPP
#define UE4SS_SDK_BM_SG_Bloomery_HPP

class ABM_SG_Bloomery_C : public AStaticMeshActor
{
    class UStaticMeshComponent* bench_261_3;                                          // 0x02A0 (size: 0x8)
    class UStaticMeshComponent* bench_261_4;                                          // 0x02A8 (size: 0x8)
    class UStaticMeshComponent* res_35_11;                                            // 0x02B0 (size: 0x8)
    class UStaticMeshComponent* res_35_10;                                            // 0x02B8 (size: 0x8)
    class UStaticMeshComponent* res_35_9;                                             // 0x02C0 (size: 0x8)
    class UStaticMeshComponent* res_35_8;                                             // 0x02C8 (size: 0x8)
    class UStaticMeshComponent* res_35_7;                                             // 0x02D0 (size: 0x8)
    class UStaticMeshComponent* res_35_6;                                             // 0x02D8 (size: 0x8)
    class UStaticMeshComponent* res_35_5;                                             // 0x02E0 (size: 0x8)
    class UStaticMeshComponent* res_35_4;                                             // 0x02E8 (size: 0x8)
    class UStaticMeshComponent* res_35_3;                                             // 0x02F0 (size: 0x8)
    class UStaticMeshComponent* res_35_2;                                             // 0x02F8 (size: 0x8)
    class UStaticMeshComponent* res_35_1;                                             // 0x0300 (size: 0x8)
    class UStaticMeshComponent* res_35_0;                                             // 0x0308 (size: 0x8)
    class UStaticMeshComponent* clutter_15;                                           // 0x0310 (size: 0x8)
    class UStaticMeshComponent* bench_261_1;                                          // 0x0318 (size: 0x8)
    class UStaticMeshComponent* bench_261_0;                                          // 0x0320 (size: 0x8)
    class UStaticMeshComponent* bench_14_1;                                           // 0x0328 (size: 0x8)
    class UStaticMeshComponent* bench_14;                                             // 0x0330 (size: 0x8)
    class UStaticMeshComponent* clutter_14;                                           // 0x0338 (size: 0x8)
    class UStaticMeshComponent* clutter_13;                                           // 0x0340 (size: 0x8)
    class UStaticMeshComponent* clutter_12;                                           // 0x0348 (size: 0x8)
    class UStaticMeshComponent* clutter_11;                                           // 0x0350 (size: 0x8)
    class UStaticMeshComponent* clutter_10;                                           // 0x0358 (size: 0x8)
    class UStaticMeshComponent* clutter_9;                                            // 0x0360 (size: 0x8)
    class UStaticMeshComponent* clutter_8;                                            // 0x0368 (size: 0x8)
    class UStaticMeshComponent* clutter_7;                                            // 0x0370 (size: 0x8)
    class UStaticMeshComponent* clutter_6;                                            // 0x0378 (size: 0x8)
    class UStaticMeshComponent* clutter_5;                                            // 0x0380 (size: 0x8)
    class UStaticMeshComponent* clutter_4;                                            // 0x0388 (size: 0x8)
    class UStaticMeshComponent* clutter_3;                                            // 0x0390 (size: 0x8)
    class UStaticMeshComponent* clutter_2;                                            // 0x0398 (size: 0x8)
    class UStaticMeshComponent* clutter_1;                                            // 0x03A0 (size: 0x8)
    class UStaticMeshComponent* clutter_0;                                            // 0x03A8 (size: 0x8)
    class UStaticMeshComponent* bld_0_11;                                             // 0x03B0 (size: 0x8)
    class UStaticMeshComponent* bld_0_10;                                             // 0x03B8 (size: 0x8)
    class UStaticMeshComponent* bld_0_9;                                              // 0x03C0 (size: 0x8)
    class UStaticMeshComponent* bld_0_8;                                              // 0x03C8 (size: 0x8)
    class UStaticMeshComponent* bld_0_7;                                              // 0x03D0 (size: 0x8)
    class UStaticMeshComponent* res_16_5;                                             // 0x03D8 (size: 0x8)
    class UStaticMeshComponent* res_16_4;                                             // 0x03E0 (size: 0x8)
    class UStaticMeshComponent* res_16_3;                                             // 0x03E8 (size: 0x8)
    class UStaticMeshComponent* res_16_2;                                             // 0x03F0 (size: 0x8)
    class UStaticMeshComponent* Dirt_3_2;                                             // 0x03F8 (size: 0x8)
    class UStaticMeshComponent* Dirt_0_1;                                             // 0x0400 (size: 0x8)
    class UStaticMeshComponent* Dirt_0_0;                                             // 0x0408 (size: 0x8)
    class UStaticMeshComponent* bld_0_6;                                              // 0x0410 (size: 0x8)
    class UStaticMeshComponent* bld_0_5;                                              // 0x0418 (size: 0x8)
    class UStaticMeshComponent* fullBld_437;                                          // 0x0420 (size: 0x8)
    class UStaticMeshComponent* Dirt_3_0;                                             // 0x0428 (size: 0x8)
    class UStaticMeshComponent* MainBld_438;                                          // 0x0430 (size: 0x8)

}; // Size: 0x438

#endif
