#ifndef UE4SS_SDK_BM_Work_Camp_HPP
#define UE4SS_SDK_BM_Work_Camp_HPP

class ABM_Work_Camp_C : public AStaticMeshActor
{
    class UStaticMeshComponent* res_16_2;                                             // 0x02A0 (size: 0x8)
    class UStaticMeshComponent* Dirt_3_4;                                             // 0x02A8 (size: 0x8)
    class UStaticMeshComponent* Dirt_3_3;                                             // 0x02B0 (size: 0x8)
    class UStaticMeshComponent* Dirt_3_2;                                             // 0x02B8 (size: 0x8)
    class UStaticMeshComponent* FullBld_473_1;                                        // 0x02C0 (size: 0x8)
    class UStaticMeshComponent* FullBld_473_0;                                        // 0x02C8 (size: 0x8)
    class UStaticMeshComponent* fullBld_473;                                          // 0x02D0 (size: 0x8)
    class USceneComponent* ambience_fireplace;                                        // 0x02D8 (size: 0x8)
    class UStaticMeshComponent* lazyBld_48_2;                                         // 0x02E0 (size: 0x8)
    class UStaticMeshComponent* clutter_12;                                           // 0x02E8 (size: 0x8)
    class UStaticMeshComponent* PS_Smoke;                                             // 0x02F0 (size: 0x8)
    class UStaticMeshComponent* Bld_401_2;                                            // 0x02F8 (size: 0x8)
    class UStaticMeshComponent* lazyBld_48_0;                                         // 0x0300 (size: 0x8)
    class UStaticMeshComponent* lazyBld_48_1;                                         // 0x0308 (size: 0x8)
    class UStaticMeshComponent* MainBld_35;                                           // 0x0310 (size: 0x8)
    class UStaticMeshComponent* clutter_8;                                            // 0x0318 (size: 0x8)
    class UStaticMeshComponent* clutter_7;                                            // 0x0320 (size: 0x8)
    class UStaticMeshComponent* clutter_6;                                            // 0x0328 (size: 0x8)
    class UStaticMeshComponent* clutter_1;                                            // 0x0330 (size: 0x8)
    class UStaticMeshComponent* Dirt_0_1;                                             // 0x0338 (size: 0x8)

}; // Size: 0x340

#endif
