#ifndef UE4SS_SDK_C_House_LV2_Bpart_B_HPP
#define UE4SS_SDK_C_House_LV2_Bpart_B_HPP

class AC_House_LV2_Bpart_B_C : public AConstructionBP_C
{
    class UStaticMeshComponent* StaticMesh;                                           // 0x0550 (size: 0x8)
    class UStaticMeshComponent* ThatchRoof_sg_House_LV2_Bpart_B2_StaticMeshComponent0; // 0x0558 (size: 0x8)
    class UStaticMeshComponent* WoodRoof_sg_House_LV2_Bpart_B2_StaticMeshComponent0;  // 0x0560 (size: 0x8)
    class UStaticMeshComponent* Foundation_sg_House_LV2_Bpart_B_main2_StaticMeshComponent0; // 0x0568 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m5_StaticMeshComponent0;                  // 0x0570 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m6_StaticMeshComponent0;                  // 0x0578 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Tapered_CutE9_StaticMeshComponent0;         // 0x0580 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Tapered_CutE10_StaticMeshComponent0;        // 0x0588 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Tapered_CutE11_StaticMeshComponent0;        // 0x0590 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Tapered_CutE12_StaticMeshComponent0;        // 0x0598 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m7_StaticMeshComponent0;                  // 0x05A0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m8_StaticMeshComponent0;                  // 0x05A8 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Tapered_CutE13_StaticMeshComponent0;        // 0x05B0 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Tapered_CutE14_StaticMeshComponent0;        // 0x05B8 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Tapered_CutE15_StaticMeshComponent0;        // 0x05C0 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Tapered_CutE16_StaticMeshComponent0;        // 0x05C8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m29_StaticMeshComponent0;                 // 0x05D0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m30_StaticMeshComponent0;                 // 0x05D8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m31_StaticMeshComponent0;                 // 0x05E0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m32_StaticMeshComponent0;                 // 0x05E8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m33_StaticMeshComponent0;                 // 0x05F0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m34_StaticMeshComponent0;                 // 0x05F8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m35_StaticMeshComponent0;                 // 0x0600 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m36_StaticMeshComponent0;                 // 0x0608 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m37_StaticMeshComponent0;                 // 0x0610 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m38_StaticMeshComponent0;                 // 0x0618 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m3_StaticMeshComponent0;                       // 0x0620 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m18_StaticMeshComponent0;                      // 0x0628 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m19_StaticMeshComponent0;                      // 0x0630 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m20_StaticMeshComponent0;                      // 0x0638 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m21_StaticMeshComponent0;                      // 0x0640 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m22_StaticMeshComponent0;                      // 0x0648 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m23_StaticMeshComponent0;                      // 0x0650 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m24_StaticMeshComponent0;                      // 0x0658 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m25_StaticMeshComponent0;                      // 0x0660 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_23_StaticMeshComponent0;               // 0x0668 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_24_StaticMeshComponent0;               // 0x0670 (size: 0x8)
    class UStaticMeshComponent* UBeam_Tapered_CutE10_StaticMeshComponent0;            // 0x0678 (size: 0x8)
    class UStaticMeshComponent* UBeam_Tapered_CutE11_StaticMeshComponent0;            // 0x0680 (size: 0x8)
    class UStaticMeshComponent* UBeam_Tapered_CutE12_StaticMeshComponent0;            // 0x0688 (size: 0x8)
    class UStaticMeshComponent* UBeam_Tapered_CutE13_StaticMeshComponent0;            // 0x0690 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m26_StaticMeshComponent0;                      // 0x0698 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_25_StaticMeshComponent0;               // 0x06A0 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_26_StaticMeshComponent0;               // 0x06A8 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_27_StaticMeshComponent0;               // 0x06B0 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_28_StaticMeshComponent0;               // 0x06B8 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m27_StaticMeshComponent0;                      // 0x06C0 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_29_StaticMeshComponent0;               // 0x06C8 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_30_StaticMeshComponent0;               // 0x06D0 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_31_StaticMeshComponent0;               // 0x06D8 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg35_StaticMeshComponent0;     // 0x06E0 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg36_StaticMeshComponent0;     // 0x06E8 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg37_StaticMeshComponent0;     // 0x06F0 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg38_StaticMeshComponent0;     // 0x06F8 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg39_StaticMeshComponent0;     // 0x0700 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg40_StaticMeshComponent0;     // 0x0708 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg41_StaticMeshComponent0;     // 0x0710 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg42_StaticMeshComponent0;     // 0x0718 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_32_StaticMeshComponent0;               // 0x0720 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg43_StaticMeshComponent0;     // 0x0728 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg44_StaticMeshComponent0;     // 0x0730 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg45_StaticMeshComponent0;     // 0x0738 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg46_StaticMeshComponent0;     // 0x0740 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg47_StaticMeshComponent0;     // 0x0748 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg48_StaticMeshComponent0;     // 0x0750 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg49_StaticMeshComponent0;     // 0x0758 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg50_StaticMeshComponent0;     // 0x0760 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg51_StaticMeshComponent0;     // 0x0768 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg52_StaticMeshComponent0;     // 0x0770 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg53_StaticMeshComponent0;     // 0x0778 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg54_StaticMeshComponent0;     // 0x0780 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg55_StaticMeshComponent0;     // 0x0788 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg56_StaticMeshComponent0;     // 0x0790 (size: 0x8)
    class UStaticMeshComponent* UBeam_CrookedPlank2_StaticMeshComponent0;             // 0x0798 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg57_StaticMeshComponent0;     // 0x07A0 (size: 0x8)
    class UStaticMeshComponent* UBeam_GableSimpleA3_StaticMeshComponent0;             // 0x07A8 (size: 0x8)
    class UStaticMeshComponent* UBeam_GableSimpleA6_StaticMeshComponent0;             // 0x07B0 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m28_StaticMeshComponent0;                      // 0x07B8 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_33_StaticMeshComponent0;               // 0x07C0 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_34_StaticMeshComponent0;               // 0x07C8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m39_StaticMeshComponent0;                 // 0x07D0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m40_StaticMeshComponent0;                 // 0x07D8 (size: 0x8)
    class UStaticMeshComponent* UBeam_Tapered_CutE14_StaticMeshComponent0;            // 0x07E0 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m29_StaticMeshComponent0;                      // 0x07E8 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg58_StaticMeshComponent0;     // 0x07F0 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg59_StaticMeshComponent0;     // 0x07F8 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg60_StaticMeshComponent0;     // 0x0800 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg61_StaticMeshComponent0;     // 0x0808 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m30_StaticMeshComponent0;                      // 0x0810 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m31_StaticMeshComponent0;                      // 0x0818 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m32_StaticMeshComponent0;                      // 0x0820 (size: 0x8)
    class UStaticMeshComponent* UBeam_Tapered_CutE15_StaticMeshComponent0;            // 0x0828 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m41_StaticMeshComponent0;                 // 0x0830 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m42_StaticMeshComponent0;                 // 0x0838 (size: 0x8)
    class UStaticMeshComponent* UBeam_Tapered_CutE16_StaticMeshComponent0;            // 0x0840 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m43_StaticMeshComponent0;                 // 0x0848 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m44_StaticMeshComponent0;                 // 0x0850 (size: 0x8)
    class UStaticMeshComponent* UBeam_Tapered_CutE17_StaticMeshComponent0;            // 0x0858 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m45_StaticMeshComponent0;                 // 0x0860 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m46_StaticMeshComponent0;                 // 0x0868 (size: 0x8)
    class UStaticMeshComponent* UBeam_Tapered_CutE18_StaticMeshComponent0;            // 0x0870 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_35_StaticMeshComponent0;               // 0x0878 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_36_StaticMeshComponent0;               // 0x0880 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_5_StaticMeshComponent0;                // 0x0888 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_37_StaticMeshComponent0;               // 0x0890 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_05_Curved_B2_StaticMeshComponent0;     // 0x0898 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_38_StaticMeshComponent0;               // 0x08A0 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_39_StaticMeshComponent0;               // 0x08A8 (size: 0x8)
    class UStaticMeshComponent* UBeam_GableSimpleA7_StaticMeshComponent0;             // 0x08B0 (size: 0x8)
    class UStaticMeshComponent* UBeam_GableSimpleA8_StaticMeshComponent0;             // 0x08B8 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg62_StaticMeshComponent0;     // 0x08C0 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg63_StaticMeshComponent0;     // 0x08C8 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg64_StaticMeshComponent0;     // 0x08D0 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg65_StaticMeshComponent0;     // 0x08D8 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg66_StaticMeshComponent0;     // 0x08E0 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg67_StaticMeshComponent0;     // 0x08E8 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg68_StaticMeshComponent0;     // 0x08F0 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_TwoWindowsStandard_Wider2_StaticMeshComponent0; // 0x08F8 (size: 0x8)
    class UStaticMeshComponent* UDaub_StandardSingleWindowWide4_StaticMeshComponent0; // 0x0900 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_TwoWindowsStandard2_StaticMeshComponent0;  // 0x0908 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Standard4_StaticMeshComponent0;            // 0x0910 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Standard5_StaticMeshComponent0;            // 0x0918 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Standard6_StaticMeshComponent0;            // 0x0920 (size: 0x8)
    class UStaticMeshComponent* UDaub_StandardSingleWindowWide5_StaticMeshComponent0; // 0x0928 (size: 0x8)
    class UStaticMeshComponent* UDaub_StandardSingleWindowWide6_StaticMeshComponent0; // 0x0930 (size: 0x8)
    class UStaticMeshComponent* UBeam_WindowFrame2_StaticMeshComponent0;              // 0x0938 (size: 0x8)
    class USceneComponent* C_House_LV2_Bpart_B_DefaultSceneRoot;                      // 0x0940 (size: 0x8)

}; // Size: 0x948

#endif
