#ifndef UE4SS_SDK_c_MarketStallB_HPP
#define UE4SS_SDK_c_MarketStallB_HPP

class Ac_MarketStallB_C : public AConstructionBP_C
{
    class UStaticMeshComponent* strut_straighteneed_long11_StaticMeshComponent5;      // 0x0550 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed_long12_StaticMeshComponent6;      // 0x0558 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed_long12_StaticMeshComponent5;      // 0x0560 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed_long11_StaticMeshComponent4;      // 0x0568 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed_long11_StaticMeshComponent3;      // 0x0570 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed_long12_StaticMeshComponent4;      // 0x0578 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed_long12_StaticMeshComponent3;      // 0x0580 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed_long11_StaticMeshComponent2;      // 0x0588 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed_long12_StaticMeshComponent2;      // 0x0590 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed_long11_StaticMeshComponent1;      // 0x0598 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed_long12_StaticMeshComponent1;      // 0x05A0 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed_long12_StaticMeshComponent0;      // 0x05A8 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed_long11_StaticMeshComponent0;      // 0x05B0 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed_long14_StaticMeshComponent0;      // 0x05B8 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed_long2_StaticMeshComponent0;       // 0x05C0 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed_long16_StaticMeshComponent0;      // 0x05C8 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed_long3_StaticMeshComponent0;       // 0x05D0 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed_long9_StaticMeshComponent0;       // 0x05D8 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed_long8_StaticMeshComponent0;       // 0x05E0 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed_long10_StaticMeshComponent0;      // 0x05E8 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed_long6_StaticMeshComponent0;       // 0x05F0 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed_long15_StaticMeshComponent0;      // 0x05F8 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed_long17_StaticMeshComponent0;      // 0x0600 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed_long_StaticMeshComponent0;        // 0x0608 (size: 0x8)
    class UStaticMeshComponent* megaTableThing_StaticMeshComponent0;                  // 0x0610 (size: 0x8)
    class UStaticMeshComponent* market_RoofA_StaticMeshComponent0;                    // 0x0618 (size: 0x8)
    class USceneComponent* SharedRoot;                                                // 0x0620 (size: 0x8)

}; // Size: 0x628

#endif
