#ifndef UE4SS_SDK_C_OuthouseA_HPP
#define UE4SS_SDK_C_OuthouseA_HPP

class AC_OuthouseA_C : public AConstructionBP_C
{
    class UStaticMeshComponent* Plane73_StaticMeshComponent0;                         // 0x0550 (size: 0x8)
    class UStaticMeshComponent* poophole2_StaticMeshComponent0;                       // 0x0558 (size: 0x8)
    class UStaticMeshComponent* tkqmdbnhw_LOD10_StaticMeshComponent0;                 // 0x0560 (size: 0x8)
    class UStaticMeshComponent* tkqmdbnhw_LOD9_StaticMeshComponent0;                  // 0x0568 (size: 0x8)
    class UStaticMeshComponent* tkqmdbnhw_LOD7_StaticMeshComponent0;                  // 0x0570 (size: 0x8)
    class UStaticMeshComponent* boards94_StaticMeshComponent0;                        // 0x0578 (size: 0x8)
    class UStaticMeshComponent* boards93_StaticMeshComponent0;                        // 0x0580 (size: 0x8)
    class UStaticMeshComponent* boards92_StaticMeshComponent0;                        // 0x0588 (size: 0x8)
    class UStaticMeshComponent* boards91_StaticMeshComponent0;                        // 0x0590 (size: 0x8)
    class UStaticMeshComponent* boards90_StaticMeshComponent0;                        // 0x0598 (size: 0x8)
    class UStaticMeshComponent* boards89_StaticMeshComponent0;                        // 0x05A0 (size: 0x8)
    class UStaticMeshComponent* boards88_StaticMeshComponent0;                        // 0x05A8 (size: 0x8)
    class UStaticMeshComponent* boards87_StaticMeshComponent0;                        // 0x05B0 (size: 0x8)
    class UStaticMeshComponent* boards86_StaticMeshComponent0;                        // 0x05B8 (size: 0x8)
    class UStaticMeshComponent* boards85_StaticMeshComponent0;                        // 0x05C0 (size: 0x8)
    class UStaticMeshComponent* boards84_StaticMeshComponent0;                        // 0x05C8 (size: 0x8)
    class UStaticMeshComponent* boards83_StaticMeshComponent0;                        // 0x05D0 (size: 0x8)
    class UStaticMeshComponent* boards82_StaticMeshComponent0;                        // 0x05D8 (size: 0x8)
    class UStaticMeshComponent* boards81_StaticMeshComponent0;                        // 0x05E0 (size: 0x8)
    class UStaticMeshComponent* boards80_StaticMeshComponent0;                        // 0x05E8 (size: 0x8)
    class UStaticMeshComponent* boards79_StaticMeshComponent0;                        // 0x05F0 (size: 0x8)
    class UStaticMeshComponent* boards78_StaticMeshComponent0;                        // 0x05F8 (size: 0x8)
    class UStaticMeshComponent* boards77_StaticMeshComponent0;                        // 0x0600 (size: 0x8)
    class UStaticMeshComponent* boards76_StaticMeshComponent0;                        // 0x0608 (size: 0x8)
    class UStaticMeshComponent* boards75_StaticMeshComponent0;                        // 0x0610 (size: 0x8)
    class UStaticMeshComponent* boards74_StaticMeshComponent0;                        // 0x0618 (size: 0x8)
    class UStaticMeshComponent* boards73_StaticMeshComponent0;                        // 0x0620 (size: 0x8)
    class UStaticMeshComponent* boards72_StaticMeshComponent0;                        // 0x0628 (size: 0x8)
    class UStaticMeshComponent* boards71_StaticMeshComponent0;                        // 0x0630 (size: 0x8)
    class UStaticMeshComponent* boards70_StaticMeshComponent0;                        // 0x0638 (size: 0x8)
    class UStaticMeshComponent* boards69_StaticMeshComponent0;                        // 0x0640 (size: 0x8)
    class UStaticMeshComponent* boards68_StaticMeshComponent0;                        // 0x0648 (size: 0x8)
    class UStaticMeshComponent* boards67_StaticMeshComponent0;                        // 0x0650 (size: 0x8)
    class UStaticMeshComponent* boards66_StaticMeshComponent0;                        // 0x0658 (size: 0x8)
    class UStaticMeshComponent* boards65_StaticMeshComponent0;                        // 0x0660 (size: 0x8)
    class UStaticMeshComponent* boards64_StaticMeshComponent0;                        // 0x0668 (size: 0x8)
    class UStaticMeshComponent* boards63_StaticMeshComponent0;                        // 0x0670 (size: 0x8)
    class UStaticMeshComponent* boards62_StaticMeshComponent0;                        // 0x0678 (size: 0x8)
    class UStaticMeshComponent* boards61_StaticMeshComponent0;                        // 0x0680 (size: 0x8)
    class UStaticMeshComponent* boards60_StaticMeshComponent0;                        // 0x0688 (size: 0x8)
    class UStaticMeshComponent* boards59_StaticMeshComponent0;                        // 0x0690 (size: 0x8)
    class UStaticMeshComponent* boards58_StaticMeshComponent0;                        // 0x0698 (size: 0x8)
    class UStaticMeshComponent* boards57_StaticMeshComponent0;                        // 0x06A0 (size: 0x8)
    class UStaticMeshComponent* boards56_StaticMeshComponent0;                        // 0x06A8 (size: 0x8)
    class UStaticMeshComponent* boards55_StaticMeshComponent0;                        // 0x06B0 (size: 0x8)
    class UStaticMeshComponent* boards54_StaticMeshComponent0;                        // 0x06B8 (size: 0x8)
    class UStaticMeshComponent* boards53_StaticMeshComponent0;                        // 0x06C0 (size: 0x8)
    class UStaticMeshComponent* boards52_StaticMeshComponent0;                        // 0x06C8 (size: 0x8)
    class UStaticMeshComponent* boards51_StaticMeshComponent0;                        // 0x06D0 (size: 0x8)
    class UStaticMeshComponent* boards50_StaticMeshComponent0;                        // 0x06D8 (size: 0x8)
    class UStaticMeshComponent* boards49_StaticMeshComponent0;                        // 0x06E0 (size: 0x8)
    class UStaticMeshComponent* boards33_StaticMeshComponent0;                        // 0x06E8 (size: 0x8)
    class USceneComponent* outhouseA2_DefaultSceneRoot;                               // 0x06F0 (size: 0x8)

}; // Size: 0x6F8

#endif
