#ifndef UE4SS_SDK_C_SG_Stairs_Platform_High_HPP
#define UE4SS_SDK_C_SG_Stairs_Platform_High_HPP

class AC_SG_Stairs_Platform_High_C : public AConstructionBP_C
{
    class UStaticMeshComponent* SM_WoodBeam6m_orSth168_StaticMeshComponent0;          // 0x0550 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth167_StaticMeshComponent0;          // 0x0558 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth166_StaticMeshComponent0;          // 0x0560 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth165_StaticMeshComponent0;          // 0x0568 (size: 0x8)
    class UStaticMeshComponent* sg_beam_diagonal_curvedB39_StaticMeshComponent0;      // 0x0570 (size: 0x8)
    class UStaticMeshComponent* sg_beam_diagonal_curvedB38_StaticMeshComponent0;      // 0x0578 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth164_StaticMeshComponent0;          // 0x0580 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth163_StaticMeshComponent0;          // 0x0588 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth162_StaticMeshComponent0;          // 0x0590 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth161_StaticMeshComponent0;          // 0x0598 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth160_StaticMeshComponent0;          // 0x05A0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth159_StaticMeshComponent0;          // 0x05A8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth158_StaticMeshComponent0;          // 0x05B0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth157_StaticMeshComponent0;          // 0x05B8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth156_StaticMeshComponent0;          // 0x05C0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth155_StaticMeshComponent0;          // 0x05C8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth154_StaticMeshComponent0;          // 0x05D0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth153_StaticMeshComponent0;          // 0x05D8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth152_StaticMeshComponent0;          // 0x05E0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth151_StaticMeshComponent0;          // 0x05E8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth150_StaticMeshComponent0;          // 0x05F0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth149_StaticMeshComponent0;          // 0x05F8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth148_StaticMeshComponent0;          // 0x0600 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth147_StaticMeshComponent0;          // 0x0608 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth146_StaticMeshComponent0;          // 0x0610 (size: 0x8)
    class UStaticMeshComponent* sg_beam_diagonal_curvedB37_StaticMeshComponent0;      // 0x0618 (size: 0x8)
    class UStaticMeshComponent* sg_beam_diagonal_curvedB36_StaticMeshComponent0;      // 0x0620 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth145_StaticMeshComponent0;          // 0x0628 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth144_StaticMeshComponent0;          // 0x0630 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth143_StaticMeshComponent0;          // 0x0638 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth142_StaticMeshComponent0;          // 0x0640 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth141_StaticMeshComponent0;          // 0x0648 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth140_StaticMeshComponent0;          // 0x0650 (size: 0x8)
    class UStaticMeshComponent* sg_peg154_StaticMeshComponent0;                       // 0x0658 (size: 0x8)
    class UStaticMeshComponent* sg_peg153_StaticMeshComponent0;                       // 0x0660 (size: 0x8)
    class UStaticMeshComponent* sg_peg152_StaticMeshComponent0;                       // 0x0668 (size: 0x8)
    class UStaticMeshComponent* sg_peg151_StaticMeshComponent0;                       // 0x0670 (size: 0x8)
    class UStaticMeshComponent* sg_peg150_StaticMeshComponent0;                       // 0x0678 (size: 0x8)
    class UStaticMeshComponent* sg_peg149_StaticMeshComponent0;                       // 0x0680 (size: 0x8)
    class UStaticMeshComponent* sg_peg148_StaticMeshComponent0;                       // 0x0688 (size: 0x8)
    class UStaticMeshComponent* sg_peg147_StaticMeshComponent0;                       // 0x0690 (size: 0x8)
    class UStaticMeshComponent* sg_peg146_StaticMeshComponent0;                       // 0x0698 (size: 0x8)
    class UStaticMeshComponent* sg_peg145_StaticMeshComponent0;                       // 0x06A0 (size: 0x8)
    class UStaticMeshComponent* sg_peg144_StaticMeshComponent0;                       // 0x06A8 (size: 0x8)
    class UStaticMeshComponent* sg_peg143_StaticMeshComponent0;                       // 0x06B0 (size: 0x8)
    class UStaticMeshComponent* sg_peg142_StaticMeshComponent0;                       // 0x06B8 (size: 0x8)
    class UStaticMeshComponent* sg_peg141_StaticMeshComponent0;                       // 0x06C0 (size: 0x8)
    class UStaticMeshComponent* sg_peg140_StaticMeshComponent0;                       // 0x06C8 (size: 0x8)
    class UStaticMeshComponent* sg_peg139_StaticMeshComponent0;                       // 0x06D0 (size: 0x8)
    class UStaticMeshComponent* sg_peg138_StaticMeshComponent0;                       // 0x06D8 (size: 0x8)
    class UStaticMeshComponent* sg_peg137_StaticMeshComponent0;                       // 0x06E0 (size: 0x8)
    class UStaticMeshComponent* sg_peg136_StaticMeshComponent0;                       // 0x06E8 (size: 0x8)
    class UStaticMeshComponent* sg_peg135_StaticMeshComponent0;                       // 0x06F0 (size: 0x8)
    class UStaticMeshComponent* Cobblestone_LOD5_tjemdbyiw331_StaticMeshComponent0;   // 0x06F8 (size: 0x8)
    class UStaticMeshComponent* Cobblestone_LOD5_tjemdbyiw330_StaticMeshComponent0;   // 0x0700 (size: 0x8)
    class USceneComponent* SG_Stairs_Tall_Platform2_DefaultSceneRoot;                 // 0x0708 (size: 0x8)

}; // Size: 0x710

#endif
