#ifndef UE4SS_SDK_C_SG_Tavern_LV2_Main_HPP
#define UE4SS_SDK_C_SG_Tavern_LV2_Main_HPP

class AC_SG_Tavern_LV2_Main_C : public AConstructionBP_C
{
    class UStaticMeshComponent* UBeam_FillerBoardA27_StaticMeshComponent2;            // 0x0550 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA27_StaticMeshComponent1;            // 0x0558 (size: 0x8)
    class UStaticMeshComponent* StaticMesh;                                           // 0x0560 (size: 0x8)
    class UStaticMeshComponent* StaticMesh3;                                          // 0x0568 (size: 0x8)
    class UStaticMeshComponent* StaticMesh2;                                          // 0x0570 (size: 0x8)
    class UStaticMeshComponent* StaticMesh1;                                          // 0x0578 (size: 0x8)
    class UStaticMeshComponent* Roof_tavern_lvl2_main2_StaticMeshComponent0;          // 0x0580 (size: 0x8)
    class UStaticMeshComponent* Painted_Frise_A_1_79_StaticMeshComponent0;            // 0x0588 (size: 0x8)
    class UStaticMeshComponent* Painted_Frise_A_1_80_StaticMeshComponent0;            // 0x0590 (size: 0x8)
    class UStaticMeshComponent* Painted_Frise_A_1_81_StaticMeshComponent0;            // 0x0598 (size: 0x8)
    class UStaticMeshComponent* Painted_Window_Rectangle_Red42_StaticMeshComponent0;  // 0x05A0 (size: 0x8)
    class UStaticMeshComponent* Painted_Window_Rectangle_Red43_StaticMeshComponent0;  // 0x05A8 (size: 0x8)
    class UStaticMeshComponent* Painted_Window_Rectangle_Red44_StaticMeshComponent0;  // 0x05B0 (size: 0x8)
    class UStaticMeshComponent* Painted_Window_Rectangle_Red45_StaticMeshComponent0;  // 0x05B8 (size: 0x8)
    class UStaticMeshComponent* Painted_Window_Rectangle_Red46_StaticMeshComponent0;  // 0x05C0 (size: 0x8)
    class UStaticMeshComponent* Painted_Window_Rectangle_Red47_StaticMeshComponent0;  // 0x05C8 (size: 0x8)
    class UStaticMeshComponent* Painted_Frise_A_1_82_StaticMeshComponent0;            // 0x05D0 (size: 0x8)
    class UStaticMeshComponent* Painted_Frise_A_1_83_StaticMeshComponent0;            // 0x05D8 (size: 0x8)
    class UStaticMeshComponent* Painted_Frise_A_1_84_StaticMeshComponent0;            // 0x05E0 (size: 0x8)
    class UStaticMeshComponent* Painted_Frise_A_1_85_StaticMeshComponent0;            // 0x05E8 (size: 0x8)
    class UStaticMeshComponent* Painted_Frise_A_1_86_StaticMeshComponent0;            // 0x05F0 (size: 0x8)
    class UStaticMeshComponent* Painted_Frise_A_1_87_StaticMeshComponent0;            // 0x05F8 (size: 0x8)
    class UStaticMeshComponent* Painted_Frise_A_1_88_StaticMeshComponent0;            // 0x0600 (size: 0x8)
    class UStaticMeshComponent* Painted_Frise_A_1_89_StaticMeshComponent0;            // 0x0608 (size: 0x8)
    class UStaticMeshComponent* Painted_Frise_A_1_90_StaticMeshComponent0;            // 0x0610 (size: 0x8)
    class UStaticMeshComponent* Painted_Frise_A_1_91_StaticMeshComponent0;            // 0x0618 (size: 0x8)
    class UStaticMeshComponent* Painted_Frise_A_1_92_StaticMeshComponent0;            // 0x0620 (size: 0x8)
    class UStaticMeshComponent* Painted_Frise_A_1_93_StaticMeshComponent0;            // 0x0628 (size: 0x8)
    class UStaticMeshComponent* Painted_Frise_A_1_94_StaticMeshComponent0;            // 0x0630 (size: 0x8)
    class UStaticMeshComponent* Painted_Frise_A_1_95_StaticMeshComponent0;            // 0x0638 (size: 0x8)
    class UStaticMeshComponent* Painted_Frise_A_1_96_StaticMeshComponent0;            // 0x0640 (size: 0x8)
    class UStaticMeshComponent* Painted_Frise_A_1_97_StaticMeshComponent0;            // 0x0648 (size: 0x8)
    class UStaticMeshComponent* Painted_Frise_A_1_98_StaticMeshComponent0;            // 0x0650 (size: 0x8)
    class UStaticMeshComponent* Painted_Frise_A_1_99_StaticMeshComponent0;            // 0x0658 (size: 0x8)
    class UStaticMeshComponent* Painted_Frise_A_1_100_StaticMeshComponent0;           // 0x0660 (size: 0x8)
    class UStaticMeshComponent* Painted_Frise_A_1_101_StaticMeshComponent0;           // 0x0668 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA22_StaticMeshComponent0;            // 0x0670 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA23_StaticMeshComponent0;            // 0x0678 (size: 0x8)
    class UStaticMeshComponent* WattleOwidzTriangle7_StaticMeshComponent0;            // 0x0680 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m59_StaticMeshComponent0;                      // 0x0688 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m60_StaticMeshComponent0;                      // 0x0690 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m61_StaticMeshComponent0;                      // 0x0698 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m62_StaticMeshComponent0;                      // 0x06A0 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m63_StaticMeshComponent0;                      // 0x06A8 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m3_StaticMeshComponent0;                    // 0x06B0 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m4_StaticMeshComponent0;                    // 0x06B8 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m64_StaticMeshComponent0;                      // 0x06C0 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m65_StaticMeshComponent0;                      // 0x06C8 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m7_StaticMeshComponent0;                       // 0x06D0 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m12_StaticMeshComponent0;                      // 0x06D8 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m13_StaticMeshComponent0;                      // 0x06E0 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m14_StaticMeshComponent0;                      // 0x06E8 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m15_StaticMeshComponent0;                      // 0x06F0 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m16_StaticMeshComponent0;                      // 0x06F8 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m17_StaticMeshComponent0;                      // 0x0700 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m18_StaticMeshComponent0;                      // 0x0708 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m66_StaticMeshComponent0;                      // 0x0710 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m67_StaticMeshComponent0;                      // 0x0718 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m68_StaticMeshComponent0;                      // 0x0720 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m69_StaticMeshComponent0;                      // 0x0728 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m70_StaticMeshComponent0;                      // 0x0730 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m71_StaticMeshComponent0;                      // 0x0738 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m72_StaticMeshComponent0;                      // 0x0740 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m73_StaticMeshComponent0;                      // 0x0748 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m74_StaticMeshComponent0;                      // 0x0750 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m75_StaticMeshComponent0;                      // 0x0758 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m76_StaticMeshComponent0;                      // 0x0760 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m77_StaticMeshComponent0;                      // 0x0768 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m78_StaticMeshComponent0;                      // 0x0770 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m79_StaticMeshComponent0;                      // 0x0778 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m80_StaticMeshComponent0;                      // 0x0780 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m81_StaticMeshComponent0;                      // 0x0788 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m82_StaticMeshComponent0;                      // 0x0790 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m19_StaticMeshComponent0;                      // 0x0798 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m83_StaticMeshComponent0;                      // 0x07A0 (size: 0x8)
    class UStaticMeshComponent* UBeam_WoodenBracketA6_StaticMeshComponent0;           // 0x07A8 (size: 0x8)
    class UStaticMeshComponent* UBeam_WoodenBracketA7_StaticMeshComponent0;           // 0x07B0 (size: 0x8)
    class UStaticMeshComponent* UBeam_WoodenBracketA8_StaticMeshComponent0;           // 0x07B8 (size: 0x8)
    class UStaticMeshComponent* UBeam_WoodenBracketA9_StaticMeshComponent0;           // 0x07C0 (size: 0x8)
    class UStaticMeshComponent* UBeam_WoodenBracketA10_StaticMeshComponent0;          // 0x07C8 (size: 0x8)
    class UStaticMeshComponent* UBeam_TaperedCutB_ShorterEnds19_StaticMeshComponent0; // 0x07D0 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m20_StaticMeshComponent0;                      // 0x07D8 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m84_StaticMeshComponent0;                      // 0x07E0 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m85_StaticMeshComponent0;                      // 0x07E8 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m86_StaticMeshComponent0;                      // 0x07F0 (size: 0x8)
    class UStaticMeshComponent* UBeam_TaperedCutB_ShorterEnds20_StaticMeshComponent0; // 0x07F8 (size: 0x8)
    class UStaticMeshComponent* UBeam_TaperedCutB_ShorterEnds21_StaticMeshComponent0; // 0x0800 (size: 0x8)
    class UStaticMeshComponent* UBeam_TaperedCutB_ShorterEnds22_StaticMeshComponent0; // 0x0808 (size: 0x8)
    class UStaticMeshComponent* UBeam_TaperedCutB_ShorterEnds23_StaticMeshComponent0; // 0x0810 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m87_StaticMeshComponent0;                      // 0x0818 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m88_StaticMeshComponent0;                      // 0x0820 (size: 0x8)
    class UStaticMeshComponent* UBeam_TaperedCutB_ShorterEnds24_StaticMeshComponent0; // 0x0828 (size: 0x8)
    class UStaticMeshComponent* UBeam_TaperedCutB_ShorterEnds25_StaticMeshComponent0; // 0x0830 (size: 0x8)
    class UStaticMeshComponent* UBeam_TaperedCutB_ShorterEnds26_StaticMeshComponent0; // 0x0838 (size: 0x8)
    class UStaticMeshComponent* UBeam_TaperedCutB_ShorterEnds27_StaticMeshComponent0; // 0x0840 (size: 0x8)
    class UStaticMeshComponent* UBeam_TaperedCutB_ShorterEnds28_StaticMeshComponent0; // 0x0848 (size: 0x8)
    class UStaticMeshComponent* UBeam_TaperedCutB_ShorterEnds29_StaticMeshComponent0; // 0x0850 (size: 0x8)
    class UStaticMeshComponent* UBeam_TaperedCutB_ShorterEnds30_StaticMeshComponent0; // 0x0858 (size: 0x8)
    class UStaticMeshComponent* WattleOwidzTriangle8_StaticMeshComponent0;            // 0x0860 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m89_StaticMeshComponent0;                      // 0x0868 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m90_StaticMeshComponent0;                      // 0x0870 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m91_StaticMeshComponent0;                      // 0x0878 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m92_StaticMeshComponent0;                      // 0x0880 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m93_StaticMeshComponent0;                      // 0x0888 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m94_StaticMeshComponent0;                      // 0x0890 (size: 0x8)
    class UStaticMeshComponent* UBeam_TaperedCutB_ShorterEnds31_StaticMeshComponent0; // 0x0898 (size: 0x8)
    class UStaticMeshComponent* UBeam_TaperedCutB_ShorterEnds32_StaticMeshComponent0; // 0x08A0 (size: 0x8)
    class UStaticMeshComponent* UBeam_TaperedCutB_ShorterEnds33_StaticMeshComponent0; // 0x08A8 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Narrow47_StaticMeshComponent0;             // 0x08B0 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Narrow48_StaticMeshComponent0;             // 0x08B8 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Narrow49_StaticMeshComponent0;             // 0x08C0 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Narrow50_StaticMeshComponent0;             // 0x08C8 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Narrow51_StaticMeshComponent0;             // 0x08D0 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_TwoWindowsStandard6_StaticMeshComponent0;  // 0x08D8 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Narrow52_StaticMeshComponent0;             // 0x08E0 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Narrow53_StaticMeshComponent0;             // 0x08E8 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Narrow54_StaticMeshComponent0;             // 0x08F0 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Slit_SmokeHole_LessWide2_StaticMeshComponent0; // 0x08F8 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Narrow55_StaticMeshComponent0;             // 0x0900 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Narrow56_StaticMeshComponent0;             // 0x0908 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Narrow57_StaticMeshComponent0;             // 0x0910 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_SingleWindowNarrow3_StaticMeshComponent0;  // 0x0918 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Narrow58_StaticMeshComponent0;             // 0x0920 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Narrow59_StaticMeshComponent0;             // 0x0928 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Narrow60_StaticMeshComponent0;             // 0x0930 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Narrow61_StaticMeshComponent0;             // 0x0938 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Narrow62_StaticMeshComponent0;             // 0x0940 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Narrow63_StaticMeshComponent0;             // 0x0948 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Narrow64_StaticMeshComponent0;             // 0x0950 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Narrow65_StaticMeshComponent0;             // 0x0958 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Narrow66_StaticMeshComponent0;             // 0x0960 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Narrow67_StaticMeshComponent0;             // 0x0968 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Narrow68_StaticMeshComponent0;             // 0x0970 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Narrow69_StaticMeshComponent0;             // 0x0978 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Corner5_StaticMeshComponent0;              // 0x0980 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Corner6_StaticMeshComponent0;              // 0x0988 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m95_StaticMeshComponent0;                      // 0x0990 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m96_StaticMeshComponent0;                      // 0x0998 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m97_StaticMeshComponent0;                      // 0x09A0 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_SingleWindowNarrow4_StaticMeshComponent0;  // 0x09A8 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_10_StaticMeshComponent0;               // 0x09B0 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Corner7_StaticMeshComponent0;              // 0x09B8 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Narrow70_StaticMeshComponent0;             // 0x09C0 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Narrow71_StaticMeshComponent0;             // 0x09C8 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Narrow72_StaticMeshComponent0;             // 0x09D0 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Narrow73_StaticMeshComponent0;             // 0x09D8 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Narrow74_StaticMeshComponent0;             // 0x09E0 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Narrow75_StaticMeshComponent0;             // 0x09E8 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Narrow76_StaticMeshComponent0;             // 0x09F0 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Narrow77_StaticMeshComponent0;             // 0x09F8 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Narrow78_StaticMeshComponent0;             // 0x0A00 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Narrow79_StaticMeshComponent0;             // 0x0A08 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Narrow80_StaticMeshComponent0;             // 0x0A10 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Narrow81_StaticMeshComponent0;             // 0x0A18 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Narrow82_StaticMeshComponent0;             // 0x0A20 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_TwoWindowsStandard7_StaticMeshComponent0;  // 0x0A28 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_TwoWindowsStandard8_StaticMeshComponent0;  // 0x0A30 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_StandardSingleWindow2_StaticMeshComponent0; // 0x0A38 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Standard4_StaticMeshComponent0;            // 0x0A40 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_TwoWindowsStandard9_StaticMeshComponent0;  // 0x0A48 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Narrow83_StaticMeshComponent0;             // 0x0A50 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Narrow84_StaticMeshComponent0;             // 0x0A58 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Narrow85_StaticMeshComponent0;             // 0x0A60 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Narrow86_StaticMeshComponent0;             // 0x0A68 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_TwoWindowsStandard10_StaticMeshComponent0; // 0x0A70 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Standard5_StaticMeshComponent0;            // 0x0A78 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Standard6_StaticMeshComponent0;            // 0x0A80 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Corner8_StaticMeshComponent0;              // 0x0A88 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m103_StaticMeshComponent0;                // 0x0A90 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m104_StaticMeshComponent0;                // 0x0A98 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m109_StaticMeshComponent0;                // 0x0AA0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m110_StaticMeshComponent0;                // 0x0AA8 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_104_StaticMeshComponent0; // 0x0AB0 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_105_StaticMeshComponent0; // 0x0AB8 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_106_StaticMeshComponent0; // 0x0AC0 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_107_StaticMeshComponent0; // 0x0AC8 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_108_StaticMeshComponent0; // 0x0AD0 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_109_StaticMeshComponent0; // 0x0AD8 (size: 0x8)
    class UStaticMeshComponent* doorHeadA_angled3_StaticMeshComponent0;               // 0x0AE0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m111_StaticMeshComponent0;                // 0x0AE8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m112_StaticMeshComponent0;                // 0x0AF0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m113_StaticMeshComponent0;                // 0x0AF8 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_110_StaticMeshComponent0; // 0x0B00 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam1_5m_orSth8_StaticMeshComponent0;          // 0x0B08 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam1_5m_orSth9_StaticMeshComponent0;          // 0x0B10 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam1_5m_orSth10_StaticMeshComponent0;         // 0x0B18 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam1_5m_orSth11_StaticMeshComponent0;         // 0x0B20 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_111_StaticMeshComponent0; // 0x0B28 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_112_StaticMeshComponent0; // 0x0B30 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_113_StaticMeshComponent0; // 0x0B38 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_114_StaticMeshComponent0; // 0x0B40 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_115_StaticMeshComponent0; // 0x0B48 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_11_StaticMeshComponent0; // 0x0B50 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_12_StaticMeshComponent0; // 0x0B58 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_13_StaticMeshComponent0; // 0x0B60 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_14_StaticMeshComponent0; // 0x0B68 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_15_StaticMeshComponent0; // 0x0B70 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_16_StaticMeshComponent0; // 0x0B78 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_17_StaticMeshComponent0; // 0x0B80 (size: 0x8)
    class UStaticMeshComponent* J_SG_WoodenBracketA5_StaticMeshComponent0;            // 0x0B88 (size: 0x8)
    class UStaticMeshComponent* J_SG_WoodenBracketA6_StaticMeshComponent0;            // 0x0B90 (size: 0x8)
    class UStaticMeshComponent* J_SG_WoodenBracketA7_StaticMeshComponent0;            // 0x0B98 (size: 0x8)
    class UStaticMeshComponent* J_SG_WoodenBracketA8_StaticMeshComponent0;            // 0x0BA0 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_18_StaticMeshComponent0; // 0x0BA8 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_19_StaticMeshComponent0; // 0x0BB0 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_20_StaticMeshComponent0; // 0x0BB8 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_116_StaticMeshComponent0; // 0x0BC0 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_117_StaticMeshComponent0; // 0x0BC8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m135_StaticMeshComponent0;                // 0x0BD0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m148_StaticMeshComponent0;                // 0x0BD8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m149_StaticMeshComponent0;                // 0x0BE0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m150_StaticMeshComponent0;                // 0x0BE8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m167_StaticMeshComponent0;                // 0x0BF0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m168_StaticMeshComponent0;                // 0x0BF8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m170_StaticMeshComponent0;                // 0x0C00 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m171_StaticMeshComponent0;                // 0x0C08 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m172_StaticMeshComponent0;                // 0x0C10 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m209_StaticMeshComponent0;                // 0x0C18 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m210_StaticMeshComponent0;                // 0x0C20 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m211_StaticMeshComponent0;                // 0x0C28 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m212_StaticMeshComponent0;                // 0x0C30 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m248_StaticMeshComponent0;                // 0x0C38 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m249_StaticMeshComponent0;                // 0x0C40 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m250_StaticMeshComponent0;                // 0x0C48 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m251_StaticMeshComponent0;                // 0x0C50 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m252_StaticMeshComponent0;                // 0x0C58 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m253_StaticMeshComponent0;                // 0x0C60 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m254_StaticMeshComponent0;                // 0x0C68 (size: 0x8)
    class UStaticMeshComponent* planeDenseBeveled_ThinTinyWindow2_StaticMeshComponent0; // 0x0C70 (size: 0x8)
    class UStaticMeshComponent* LevitatingOuthouse2_StaticMeshComponent0;             // 0x0C78 (size: 0x8)
    class UStaticMeshComponent* sg_shutterA5_StaticMeshComponent0;                    // 0x0C80 (size: 0x8)
    class UStaticMeshComponent* sg_shutterA6_StaticMeshComponent0;                    // 0x0C88 (size: 0x8)
    class UStaticMeshComponent* sg_shutterA7_StaticMeshComponent0;                    // 0x0C90 (size: 0x8)
    class UStaticMeshComponent* sg_shutterA8_StaticMeshComponent0;                    // 0x0C98 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m255_StaticMeshComponent0;                // 0x0CA0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m256_StaticMeshComponent0;                // 0x0CA8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m257_StaticMeshComponent0;                // 0x0CB0 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_118_StaticMeshComponent0; // 0x0CB8 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_119_StaticMeshComponent0; // 0x0CC0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m258_StaticMeshComponent0;                // 0x0CC8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m259_StaticMeshComponent0;                // 0x0CD0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam1_5m_orSth22_StaticMeshComponent0;         // 0x0CD8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam1_5m_orSth23_StaticMeshComponent0;         // 0x0CE0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam1_5m_orSth34_StaticMeshComponent0;         // 0x0CE8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m114_StaticMeshComponent0;                // 0x0CF0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m115_StaticMeshComponent0;                // 0x0CF8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m260_StaticMeshComponent0;                // 0x0D00 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m261_StaticMeshComponent0;                // 0x0D08 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m262_StaticMeshComponent0;                // 0x0D10 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m263_StaticMeshComponent0;                // 0x0D18 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m264_StaticMeshComponent0;                // 0x0D20 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m265_StaticMeshComponent0;                // 0x0D28 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m266_StaticMeshComponent0;                // 0x0D30 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m267_StaticMeshComponent0;                // 0x0D38 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m268_StaticMeshComponent0;                // 0x0D40 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m269_StaticMeshComponent0;                // 0x0D48 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_120_StaticMeshComponent0; // 0x0D50 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_121_StaticMeshComponent0; // 0x0D58 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_122_StaticMeshComponent0; // 0x0D60 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_123_StaticMeshComponent0; // 0x0D68 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_124_StaticMeshComponent0; // 0x0D70 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_125_StaticMeshComponent0; // 0x0D78 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_126_StaticMeshComponent0; // 0x0D80 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_127_StaticMeshComponent0; // 0x0D88 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_128_StaticMeshComponent0; // 0x0D90 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_129_StaticMeshComponent0; // 0x0D98 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_130_StaticMeshComponent0; // 0x0DA0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m270_StaticMeshComponent0;                // 0x0DA8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam1_5m_orSth12_StaticMeshComponent0;         // 0x0DB0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam1_5m_orSth13_StaticMeshComponent0;         // 0x0DB8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam1_5m_orSth14_StaticMeshComponent0;         // 0x0DC0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam1_5m_orSth35_StaticMeshComponent0;         // 0x0DC8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam1_5m_orSth36_StaticMeshComponent0;         // 0x0DD0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam1_5m_orSth37_StaticMeshComponent0;         // 0x0DD8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam1_5m_orSth38_StaticMeshComponent0;         // 0x0DE0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam1_5m_orSth39_StaticMeshComponent0;         // 0x0DE8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m271_StaticMeshComponent0;                // 0x0DF0 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_131_StaticMeshComponent0; // 0x0DF8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m272_StaticMeshComponent0;                // 0x0E00 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_132_StaticMeshComponent0; // 0x0E08 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_133_StaticMeshComponent0; // 0x0E10 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_134_StaticMeshComponent0; // 0x0E18 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_135_StaticMeshComponent0; // 0x0E20 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_136_StaticMeshComponent0; // 0x0E28 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_137_StaticMeshComponent0; // 0x0E30 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m273_StaticMeshComponent0;                // 0x0E38 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m274_StaticMeshComponent0;                // 0x0E40 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam1_5m_orSth40_StaticMeshComponent0;         // 0x0E48 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam1_5m_orSth45_StaticMeshComponent0;         // 0x0E50 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam1_5m_orSth46_StaticMeshComponent0;         // 0x0E58 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam1_5m_orSth47_StaticMeshComponent0;         // 0x0E60 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam1_5m_orSth48_StaticMeshComponent0;         // 0x0E68 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam1_5m_orSth49_StaticMeshComponent0;         // 0x0E70 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m275_StaticMeshComponent0;                // 0x0E78 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam1_5m_orSth50_StaticMeshComponent0;         // 0x0E80 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam1_5m_orSth51_StaticMeshComponent0;         // 0x0E88 (size: 0x8)
    class UStaticMeshComponent* doorHeadA_angled4_StaticMeshComponent0;               // 0x0E90 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m276_StaticMeshComponent0;                // 0x0E98 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m277_StaticMeshComponent0;                // 0x0EA0 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_138_StaticMeshComponent0; // 0x0EA8 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_139_StaticMeshComponent0; // 0x0EB0 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_140_StaticMeshComponent0; // 0x0EB8 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_141_StaticMeshComponent0; // 0x0EC0 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_142_StaticMeshComponent0; // 0x0EC8 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_143_StaticMeshComponent0; // 0x0ED0 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_144_StaticMeshComponent0; // 0x0ED8 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_145_StaticMeshComponent0; // 0x0EE0 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_146_StaticMeshComponent0; // 0x0EE8 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_147_StaticMeshComponent0; // 0x0EF0 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_148_StaticMeshComponent0; // 0x0EF8 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_149_StaticMeshComponent0; // 0x0F00 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_150_StaticMeshComponent0; // 0x0F08 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_151_StaticMeshComponent0; // 0x0F10 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_152_StaticMeshComponent0; // 0x0F18 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam1_5m_orSth52_StaticMeshComponent0;         // 0x0F20 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m278_StaticMeshComponent0;                // 0x0F28 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m279_StaticMeshComponent0;                // 0x0F30 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam1_5m_orSth53_StaticMeshComponent0;         // 0x0F38 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam1_5m_orSth54_StaticMeshComponent0;         // 0x0F40 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam1_5m_orSth55_StaticMeshComponent0;         // 0x0F48 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_21_StaticMeshComponent0; // 0x0F50 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m280_StaticMeshComponent0;                // 0x0F58 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m281_StaticMeshComponent0;                // 0x0F60 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m282_StaticMeshComponent0;                // 0x0F68 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m283_StaticMeshComponent0;                // 0x0F70 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m284_StaticMeshComponent0;                // 0x0F78 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m285_StaticMeshComponent0;                // 0x0F80 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m286_StaticMeshComponent0;                // 0x0F88 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m287_StaticMeshComponent0;                // 0x0F90 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m288_StaticMeshComponent0;                // 0x0F98 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m289_StaticMeshComponent0;                // 0x0FA0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m290_StaticMeshComponent0;                // 0x0FA8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m116_StaticMeshComponent0;                // 0x0FB0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m117_StaticMeshComponent0;                // 0x0FB8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m118_StaticMeshComponent0;                // 0x0FC0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m119_StaticMeshComponent0;                // 0x0FC8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m120_StaticMeshComponent0;                // 0x0FD0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m121_StaticMeshComponent0;                // 0x0FD8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m291_StaticMeshComponent0;                // 0x0FE0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m292_StaticMeshComponent0;                // 0x0FE8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m293_StaticMeshComponent0;                // 0x0FF0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m294_StaticMeshComponent0;                // 0x0FF8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m295_StaticMeshComponent0;                // 0x1000 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m296_StaticMeshComponent0;                // 0x1008 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m297_StaticMeshComponent0;                // 0x1010 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m298_StaticMeshComponent0;                // 0x1018 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m299_StaticMeshComponent0;                // 0x1020 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m122_StaticMeshComponent0;                // 0x1028 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m300_StaticMeshComponent0;                // 0x1030 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m301_StaticMeshComponent0;                // 0x1038 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m302_StaticMeshComponent0;                // 0x1040 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m303_StaticMeshComponent0;                // 0x1048 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m304_StaticMeshComponent0;                // 0x1050 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_153_StaticMeshComponent0; // 0x1058 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_154_StaticMeshComponent0; // 0x1060 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_155_StaticMeshComponent0; // 0x1068 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_156_StaticMeshComponent0; // 0x1070 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_157_StaticMeshComponent0; // 0x1078 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_158_StaticMeshComponent0; // 0x1080 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_159_StaticMeshComponent0; // 0x1088 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_160_StaticMeshComponent0; // 0x1090 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg179_StaticMeshComponent0;    // 0x1098 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg180_StaticMeshComponent0;    // 0x10A0 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg181_StaticMeshComponent0;    // 0x10A8 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg182_StaticMeshComponent0;    // 0x10B0 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg183_StaticMeshComponent0;    // 0x10B8 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg184_StaticMeshComponent0;    // 0x10C0 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg185_StaticMeshComponent0;    // 0x10C8 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg186_StaticMeshComponent0;    // 0x10D0 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg187_StaticMeshComponent0;    // 0x10D8 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg188_StaticMeshComponent0;    // 0x10E0 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg189_StaticMeshComponent0;    // 0x10E8 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg190_StaticMeshComponent0;    // 0x10F0 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg191_StaticMeshComponent0;    // 0x10F8 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg192_StaticMeshComponent0;    // 0x1100 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg193_StaticMeshComponent0;    // 0x1108 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg194_StaticMeshComponent0;    // 0x1110 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg195_StaticMeshComponent0;    // 0x1118 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg196_StaticMeshComponent0;    // 0x1120 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg197_StaticMeshComponent0;    // 0x1128 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg198_StaticMeshComponent0;    // 0x1130 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg199_StaticMeshComponent0;    // 0x1138 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg200_StaticMeshComponent0;    // 0x1140 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg201_StaticMeshComponent0;    // 0x1148 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg202_StaticMeshComponent0;    // 0x1150 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg203_StaticMeshComponent0;    // 0x1158 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg204_StaticMeshComponent0;    // 0x1160 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg205_StaticMeshComponent0;    // 0x1168 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg206_StaticMeshComponent0;    // 0x1170 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg207_StaticMeshComponent0;    // 0x1178 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg208_StaticMeshComponent0;    // 0x1180 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg209_StaticMeshComponent0;    // 0x1188 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg210_StaticMeshComponent0;    // 0x1190 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg211_StaticMeshComponent0;    // 0x1198 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg212_StaticMeshComponent0;    // 0x11A0 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg213_StaticMeshComponent0;    // 0x11A8 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg214_StaticMeshComponent0;    // 0x11B0 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg215_StaticMeshComponent0;    // 0x11B8 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg216_StaticMeshComponent0;    // 0x11C0 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg217_StaticMeshComponent0;    // 0x11C8 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg218_StaticMeshComponent0;    // 0x11D0 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg219_StaticMeshComponent0;    // 0x11D8 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg220_StaticMeshComponent0;    // 0x11E0 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg221_StaticMeshComponent0;    // 0x11E8 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg222_StaticMeshComponent0;    // 0x11F0 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg223_StaticMeshComponent0;    // 0x11F8 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg224_StaticMeshComponent0;    // 0x1200 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg225_StaticMeshComponent0;    // 0x1208 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg226_StaticMeshComponent0;    // 0x1210 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg227_StaticMeshComponent0;    // 0x1218 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg228_StaticMeshComponent0;    // 0x1220 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg229_StaticMeshComponent0;    // 0x1228 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg230_StaticMeshComponent0;    // 0x1230 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg231_StaticMeshComponent0;    // 0x1238 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg232_StaticMeshComponent0;    // 0x1240 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg233_StaticMeshComponent0;    // 0x1248 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg234_StaticMeshComponent0;    // 0x1250 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg235_StaticMeshComponent0;    // 0x1258 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg236_StaticMeshComponent0;    // 0x1260 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg237_StaticMeshComponent0;    // 0x1268 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg238_StaticMeshComponent0;    // 0x1270 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg239_StaticMeshComponent0;    // 0x1278 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg240_StaticMeshComponent0;    // 0x1280 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg241_StaticMeshComponent0;    // 0x1288 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg242_StaticMeshComponent0;    // 0x1290 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg243_StaticMeshComponent0;    // 0x1298 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg244_StaticMeshComponent0;    // 0x12A0 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg245_StaticMeshComponent0;    // 0x12A8 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg246_StaticMeshComponent0;    // 0x12B0 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg247_StaticMeshComponent0;    // 0x12B8 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg248_StaticMeshComponent0;    // 0x12C0 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg249_StaticMeshComponent0;    // 0x12C8 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg250_StaticMeshComponent0;    // 0x12D0 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg251_StaticMeshComponent0;    // 0x12D8 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg252_StaticMeshComponent0;    // 0x12E0 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg253_StaticMeshComponent0;    // 0x12E8 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg254_StaticMeshComponent0;    // 0x12F0 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg255_StaticMeshComponent0;    // 0x12F8 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg256_StaticMeshComponent0;    // 0x1300 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg257_StaticMeshComponent0;    // 0x1308 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg258_StaticMeshComponent0;    // 0x1310 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg259_StaticMeshComponent0;    // 0x1318 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg260_StaticMeshComponent0;    // 0x1320 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg261_StaticMeshComponent0;    // 0x1328 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg262_StaticMeshComponent0;    // 0x1330 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg263_StaticMeshComponent0;    // 0x1338 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg264_StaticMeshComponent0;    // 0x1340 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg265_StaticMeshComponent0;    // 0x1348 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg266_StaticMeshComponent0;    // 0x1350 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg267_StaticMeshComponent0;    // 0x1358 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg268_StaticMeshComponent0;    // 0x1360 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg269_StaticMeshComponent0;    // 0x1368 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg270_StaticMeshComponent0;    // 0x1370 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg271_StaticMeshComponent0;    // 0x1378 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg272_StaticMeshComponent0;    // 0x1380 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg273_StaticMeshComponent0;    // 0x1388 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg274_StaticMeshComponent0;    // 0x1390 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg275_StaticMeshComponent0;    // 0x1398 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg276_StaticMeshComponent0;    // 0x13A0 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg277_StaticMeshComponent0;    // 0x13A8 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg278_StaticMeshComponent0;    // 0x13B0 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg279_StaticMeshComponent0;    // 0x13B8 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg280_StaticMeshComponent0;    // 0x13C0 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg281_StaticMeshComponent0;    // 0x13C8 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg282_StaticMeshComponent0;    // 0x13D0 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg283_StaticMeshComponent0;    // 0x13D8 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg284_StaticMeshComponent0;    // 0x13E0 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg285_StaticMeshComponent0;    // 0x13E8 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg286_StaticMeshComponent0;    // 0x13F0 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg287_StaticMeshComponent0;    // 0x13F8 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg288_StaticMeshComponent0;    // 0x1400 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg289_StaticMeshComponent0;    // 0x1408 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg290_StaticMeshComponent0;    // 0x1410 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg291_StaticMeshComponent0;    // 0x1418 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg292_StaticMeshComponent0;    // 0x1420 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg293_StaticMeshComponent0;    // 0x1428 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg294_StaticMeshComponent0;    // 0x1430 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg295_StaticMeshComponent0;    // 0x1438 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_161_StaticMeshComponent0; // 0x1440 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_162_StaticMeshComponent0; // 0x1448 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_163_StaticMeshComponent0; // 0x1450 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_164_StaticMeshComponent0; // 0x1458 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg296_StaticMeshComponent0;    // 0x1460 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg297_StaticMeshComponent0;    // 0x1468 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg298_StaticMeshComponent0;    // 0x1470 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg299_StaticMeshComponent0;    // 0x1478 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg300_StaticMeshComponent0;    // 0x1480 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg301_StaticMeshComponent0;    // 0x1488 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg302_StaticMeshComponent0;    // 0x1490 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg303_StaticMeshComponent0;    // 0x1498 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg304_StaticMeshComponent0;    // 0x14A0 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg305_StaticMeshComponent0;    // 0x14A8 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg306_StaticMeshComponent0;    // 0x14B0 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg307_StaticMeshComponent0;    // 0x14B8 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg308_StaticMeshComponent0;    // 0x14C0 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg309_StaticMeshComponent0;    // 0x14C8 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg310_StaticMeshComponent0;    // 0x14D0 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg311_StaticMeshComponent0;    // 0x14D8 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg312_StaticMeshComponent0;    // 0x14E0 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg313_StaticMeshComponent0;    // 0x14E8 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg314_StaticMeshComponent0;    // 0x14F0 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg315_StaticMeshComponent0;    // 0x14F8 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg316_StaticMeshComponent0;    // 0x1500 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg317_StaticMeshComponent0;    // 0x1508 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg318_StaticMeshComponent0;    // 0x1510 (size: 0x8)
    class UStaticMeshComponent* SG_BigWindowA_Slim9_StaticMeshComponent0;             // 0x1518 (size: 0x8)
    class UStaticMeshComponent* SG_BigWindowA_Slim10_StaticMeshComponent0;            // 0x1520 (size: 0x8)
    class UStaticMeshComponent* SG_BigWindowA_Slim11_StaticMeshComponent0;            // 0x1528 (size: 0x8)
    class UStaticMeshComponent* SG_BigWindowA_Slim12_StaticMeshComponent0;            // 0x1530 (size: 0x8)
    class UStaticMeshComponent* SG_BigWindowA_Slim13_StaticMeshComponent0;            // 0x1538 (size: 0x8)
    class UStaticMeshComponent* SG_BigWindowA_Slim14_StaticMeshComponent0;            // 0x1540 (size: 0x8)
    class UStaticMeshComponent* SG_BigWindowA_Slim15_StaticMeshComponent0;            // 0x1548 (size: 0x8)
    class UStaticMeshComponent* SG_BigWindowA_Slim16_StaticMeshComponent0;            // 0x1550 (size: 0x8)
    class UStaticMeshComponent* SG_SmallGlassWindowA2_StaticMeshComponent0;           // 0x1558 (size: 0x8)
    class UStaticMeshComponent* UBeam_WindowFrame27_StaticMeshComponent0;             // 0x1560 (size: 0x8)
    class UStaticMeshComponent* UBeam_WindowFrame28_StaticMeshComponent0;             // 0x1568 (size: 0x8)
    class UStaticMeshComponent* UBeam_WindowFrame29_StaticMeshComponent0;             // 0x1570 (size: 0x8)
    class UStaticMeshComponent* UBeam_WindowFrame30_StaticMeshComponent0;             // 0x1578 (size: 0x8)
    class UStaticMeshComponent* UBeam_WindowFrame31_StaticMeshComponent0;             // 0x1580 (size: 0x8)
    class UStaticMeshComponent* UBeam_WindowFrame32_StaticMeshComponent0;             // 0x1588 (size: 0x8)
    class UStaticMeshComponent* UBeam_WindowFrame33_StaticMeshComponent0;             // 0x1590 (size: 0x8)
    class UStaticMeshComponent* UBeam_WindowFrame34_StaticMeshComponent0;             // 0x1598 (size: 0x8)
    class UStaticMeshComponent* UBeam_WindowFrame35_StaticMeshComponent0;             // 0x15A0 (size: 0x8)
    class UStaticMeshComponent* UBeam_WindowFrame36_StaticMeshComponent0;             // 0x15A8 (size: 0x8)
    class UStaticMeshComponent* UBeam_WindowFrame37_StaticMeshComponent0;             // 0x15B0 (size: 0x8)
    class UStaticMeshComponent* UBeam_WindowFrame38_StaticMeshComponent0;             // 0x15B8 (size: 0x8)
    class UStaticMeshComponent* UBeam_WindowFrame39_StaticMeshComponent0;             // 0x15C0 (size: 0x8)
    class UStaticMeshComponent* UBeam_WindowFrame40_StaticMeshComponent0;             // 0x15C8 (size: 0x8)
    class UStaticMeshComponent* UBeam_WindowFrame41_StaticMeshComponent0;             // 0x15D0 (size: 0x8)
    class UStaticMeshComponent* UBeam_WindowFrame42_StaticMeshComponent0;             // 0x15D8 (size: 0x8)
    class UStaticMeshComponent* UBeam_WindowFrame43_StaticMeshComponent0;             // 0x15E0 (size: 0x8)
    class UStaticMeshComponent* UBeam_WindowFrame44_StaticMeshComponent0;             // 0x15E8 (size: 0x8)
    class UStaticMeshComponent* UBeam_WindowFrame45_StaticMeshComponent0;             // 0x15F0 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Narrow87_StaticMeshComponent0;             // 0x15F8 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Narrow88_StaticMeshComponent0;             // 0x1600 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA24_StaticMeshComponent0;            // 0x1608 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA25_StaticMeshComponent0;            // 0x1610 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA26_StaticMeshComponent0;            // 0x1618 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA27_StaticMeshComponent0;            // 0x1620 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA28_StaticMeshComponent0;            // 0x1628 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA29_StaticMeshComponent0;            // 0x1630 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA30_StaticMeshComponent0;            // 0x1638 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA31_StaticMeshComponent0;            // 0x1640 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Narrow89_StaticMeshComponent0;             // 0x1648 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Narrow90_StaticMeshComponent0;             // 0x1650 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA32_StaticMeshComponent0;            // 0x1658 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA33_StaticMeshComponent0;            // 0x1660 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m43_StaticMeshComponent0;                   // 0x1668 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m47_StaticMeshComponent0;                   // 0x1670 (size: 0x8)
    class UStaticMeshComponent* UBeam_WindowFrame46_StaticMeshComponent0;             // 0x1678 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m50_StaticMeshComponent0;                   // 0x1680 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m51_StaticMeshComponent0;                   // 0x1688 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m52_StaticMeshComponent0;                   // 0x1690 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m53_StaticMeshComponent0;                   // 0x1698 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Narrow91_StaticMeshComponent0;             // 0x16A0 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_165_StaticMeshComponent0; // 0x16A8 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg319_StaticMeshComponent0;    // 0x16B0 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg320_StaticMeshComponent0;    // 0x16B8 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_166_StaticMeshComponent0; // 0x16C0 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg321_StaticMeshComponent0;    // 0x16C8 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg322_StaticMeshComponent0;    // 0x16D0 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Narrow92_StaticMeshComponent0;             // 0x16D8 (size: 0x8)
    class UStaticMeshComponent* UBeam_WindowFrame47_StaticMeshComponent0;             // 0x16E0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m305_StaticMeshComponent0;                // 0x16E8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m306_StaticMeshComponent0;                // 0x16F0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m307_StaticMeshComponent0;                // 0x16F8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m308_StaticMeshComponent0;                // 0x1700 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m309_StaticMeshComponent0;                // 0x1708 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m310_StaticMeshComponent0;                // 0x1710 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m311_StaticMeshComponent0;                // 0x1718 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m312_StaticMeshComponent0;                // 0x1720 (size: 0x8)
    class UStaticMeshComponent* UBeam_WindowFrame48_StaticMeshComponent0;             // 0x1728 (size: 0x8)
    class UStaticMeshComponent* Painted_Window_Rectangle_Red48_StaticMeshComponent0;  // 0x1730 (size: 0x8)
    class UStaticMeshComponent* Painted_Window_Rectangle_Red49_StaticMeshComponent0;  // 0x1738 (size: 0x8)
    class UStaticMeshComponent* Painted_Window_Rectangle_Red50_StaticMeshComponent0;  // 0x1740 (size: 0x8)
    class UStaticMeshComponent* Painted_Window_Rectangle_Red51_StaticMeshComponent0;  // 0x1748 (size: 0x8)
    class UStaticMeshComponent* Painted_Window_Rectangle_Red52_StaticMeshComponent0;  // 0x1750 (size: 0x8)
    class UStaticMeshComponent* Painted_Window_Rectangle_Red53_StaticMeshComponent0;  // 0x1758 (size: 0x8)
    class UStaticMeshComponent* Painted_Window_Rectangle_Red54_StaticMeshComponent0;  // 0x1760 (size: 0x8)
    class UStaticMeshComponent* Painted_Window_Rectangle_Red55_StaticMeshComponent0;  // 0x1768 (size: 0x8)
    class UStaticMeshComponent* Painted_Window_Rectangle_Red56_StaticMeshComponent0;  // 0x1770 (size: 0x8)
    class UStaticMeshComponent* Painted_Window_Rectangle_Red57_StaticMeshComponent0;  // 0x1778 (size: 0x8)
    class UStaticMeshComponent* Painted_Window_Rectangle_Red58_StaticMeshComponent0;  // 0x1780 (size: 0x8)
    class UStaticMeshComponent* Painted_Window_Rectangle_Red59_StaticMeshComponent0;  // 0x1788 (size: 0x8)
    class UStaticMeshComponent* Painted_Window_Rectangle_Red60_StaticMeshComponent0;  // 0x1790 (size: 0x8)
    class UStaticMeshComponent* Painted_Window_Rectangle_Red61_StaticMeshComponent0;  // 0x1798 (size: 0x8)
    class UStaticMeshComponent* Painted_Window_Rectangle_Red62_StaticMeshComponent0;  // 0x17A0 (size: 0x8)
    class UStaticMeshComponent* Painted_Window_Rectangle_Red63_StaticMeshComponent0;  // 0x17A8 (size: 0x8)
    class UStaticMeshComponent* Painted_Window_Rectangle_Red64_StaticMeshComponent0;  // 0x17B0 (size: 0x8)
    class UStaticMeshComponent* Painted_Window_Rectangle_Red65_StaticMeshComponent0;  // 0x17B8 (size: 0x8)
    class UStaticMeshComponent* Painted_Window_Rectangle_Red66_StaticMeshComponent0;  // 0x17C0 (size: 0x8)
    class UStaticMeshComponent* Painted_Window_Rectangle_Red67_StaticMeshComponent0;  // 0x17C8 (size: 0x8)
    class UStaticMeshComponent* Painted_Window_Rectangle_Red68_StaticMeshComponent0;  // 0x17D0 (size: 0x8)
    class UStaticMeshComponent* Painted_Window_Rectangle_Red69_StaticMeshComponent0;  // 0x17D8 (size: 0x8)
    class UStaticMeshComponent* Painted_Window_Rectangle_Red70_StaticMeshComponent0;  // 0x17E0 (size: 0x8)
    class UStaticMeshComponent* Painted_Window_Rectangle_Red71_StaticMeshComponent0;  // 0x17E8 (size: 0x8)
    class UStaticMeshComponent* Painted_Window_Rectangle_Red72_StaticMeshComponent0;  // 0x17F0 (size: 0x8)
    class UStaticMeshComponent* Painted_Window_Rectangle_Red73_StaticMeshComponent0;  // 0x17F8 (size: 0x8)
    class UStaticMeshComponent* Painted_Window_Rectangle_Red74_StaticMeshComponent0;  // 0x1800 (size: 0x8)
    class UStaticMeshComponent* Painted_Window_Rectangle_Red75_StaticMeshComponent0;  // 0x1808 (size: 0x8)
    class UStaticMeshComponent* Painted_Window_Rectangle_Red76_StaticMeshComponent0;  // 0x1810 (size: 0x8)
    class UStaticMeshComponent* Painted_Window_Rectangle_Red77_StaticMeshComponent0;  // 0x1818 (size: 0x8)
    class UStaticMeshComponent* Painted_Frise_A_1_102_StaticMeshComponent0;           // 0x1820 (size: 0x8)
    class UStaticMeshComponent* Painted_Window_Rectangle_Red78_StaticMeshComponent0;  // 0x1828 (size: 0x8)
    class UStaticMeshComponent* Painted_Frise_A_1_103_StaticMeshComponent0;           // 0x1830 (size: 0x8)
    class UStaticMeshComponent* Painted_Frise_A_1_104_StaticMeshComponent0;           // 0x1838 (size: 0x8)
    class UStaticMeshComponent* Painted_Frise_A_1_105_StaticMeshComponent0;           // 0x1840 (size: 0x8)
    class UStaticMeshComponent* Painted_Frise_A_1_106_StaticMeshComponent0;           // 0x1848 (size: 0x8)
    class UStaticMeshComponent* Painted_Frise_A_1_107_StaticMeshComponent0;           // 0x1850 (size: 0x8)
    class UStaticMeshComponent* Painted_Frise_A_1_108_StaticMeshComponent0;           // 0x1858 (size: 0x8)
    class UStaticMeshComponent* Painted_Frise_A_1_109_StaticMeshComponent0;           // 0x1860 (size: 0x8)
    class UStaticMeshComponent* Painted_Frise_A_1_110_StaticMeshComponent0;           // 0x1868 (size: 0x8)
    class UStaticMeshComponent* Painted_Window_Rectangle_Red79_StaticMeshComponent0;  // 0x1870 (size: 0x8)
    class UStaticMeshComponent* Painted_Frise_A_1_111_StaticMeshComponent0;           // 0x1878 (size: 0x8)
    class UStaticMeshComponent* Painted_Frise_A_1_112_StaticMeshComponent0;           // 0x1880 (size: 0x8)
    class UStaticMeshComponent* Painted_Frise_A_1_113_StaticMeshComponent0;           // 0x1888 (size: 0x8)
    class UStaticMeshComponent* Painted_Frise_A_1_114_StaticMeshComponent0;           // 0x1890 (size: 0x8)
    class UStaticMeshComponent* Painted_Frise_A_1_115_StaticMeshComponent0;           // 0x1898 (size: 0x8)
    class UStaticMeshComponent* Painted_Frise_A_1_116_StaticMeshComponent0;           // 0x18A0 (size: 0x8)
    class UStaticMeshComponent* Painted_Frise_A_1_117_StaticMeshComponent0;           // 0x18A8 (size: 0x8)
    class UStaticMeshComponent* Painted_Frise_A_1_118_StaticMeshComponent0;           // 0x18B0 (size: 0x8)
    class UStaticMeshComponent* Painted_Frise_A_1_119_StaticMeshComponent0;           // 0x18B8 (size: 0x8)
    class UStaticMeshComponent* Painted_Frise_A_1_120_StaticMeshComponent0;           // 0x18C0 (size: 0x8)
    class UStaticMeshComponent* Painted_Frise_A_1_121_StaticMeshComponent0;           // 0x18C8 (size: 0x8)
    class UStaticMeshComponent* Painted_Frise_A_1_122_StaticMeshComponent0;           // 0x18D0 (size: 0x8)
    class UStaticMeshComponent* Painted_Frise_A_1_123_StaticMeshComponent0;           // 0x18D8 (size: 0x8)
    class UStaticMeshComponent* Painted_Frise_A_1_124_StaticMeshComponent0;           // 0x18E0 (size: 0x8)
    class UStaticMeshComponent* Painted_Frise_A_1_125_StaticMeshComponent0;           // 0x18E8 (size: 0x8)
    class UStaticMeshComponent* Painted_Frise_A_1_126_StaticMeshComponent0;           // 0x18F0 (size: 0x8)
    class UStaticMeshComponent* Painted_Frise_A_1_127_StaticMeshComponent0;           // 0x18F8 (size: 0x8)
    class UStaticMeshComponent* Painted_Frise_A_1_128_StaticMeshComponent0;           // 0x1900 (size: 0x8)
    class UStaticMeshComponent* Painted_Frise_A_1_129_StaticMeshComponent0;           // 0x1908 (size: 0x8)
    class UStaticMeshComponent* Painted_Frise_A_1_130_StaticMeshComponent0;           // 0x1910 (size: 0x8)
    class UStaticMeshComponent* Painted_Frise_A_1_131_StaticMeshComponent0;           // 0x1918 (size: 0x8)
    class UStaticMeshComponent* Painted_Frise_A_1_132_StaticMeshComponent0;           // 0x1920 (size: 0x8)
    class UStaticMeshComponent* Painted_Frise_A_1_133_StaticMeshComponent0;           // 0x1928 (size: 0x8)
    class UStaticMeshComponent* Painted_Frise_A_1_134_StaticMeshComponent0;           // 0x1930 (size: 0x8)
    class UStaticMeshComponent* Painted_Frise_A_1_135_StaticMeshComponent0;           // 0x1938 (size: 0x8)
    class UStaticMeshComponent* Painted_Frise_A_1_136_StaticMeshComponent0;           // 0x1940 (size: 0x8)
    class UStaticMeshComponent* Painted_Frise_A_1_137_StaticMeshComponent0;           // 0x1948 (size: 0x8)
    class UStaticMeshComponent* Painted_Frise_A_1_138_StaticMeshComponent0;           // 0x1950 (size: 0x8)
    class UStaticMeshComponent* Painted_Frise_A_1_139_StaticMeshComponent0;           // 0x1958 (size: 0x8)
    class UStaticMeshComponent* Painted_Frise_A_1_140_StaticMeshComponent0;           // 0x1960 (size: 0x8)
    class UStaticMeshComponent* Painted_Frise_A_1_141_StaticMeshComponent0;           // 0x1968 (size: 0x8)
    class UStaticMeshComponent* Painted_Frise_A_1_142_StaticMeshComponent0;           // 0x1970 (size: 0x8)
    class UStaticMeshComponent* Painted_Frise_A_1_143_StaticMeshComponent0;           // 0x1978 (size: 0x8)
    class UStaticMeshComponent* Painted_Frise_A_1_144_StaticMeshComponent0;           // 0x1980 (size: 0x8)
    class UStaticMeshComponent* Painted_Frise_A_1_145_StaticMeshComponent0;           // 0x1988 (size: 0x8)
    class UStaticMeshComponent* Painted_Frise_A_1_146_StaticMeshComponent0;           // 0x1990 (size: 0x8)
    class UStaticMeshComponent* Painted_Frise_A_1_147_StaticMeshComponent0;           // 0x1998 (size: 0x8)
    class UStaticMeshComponent* Painted_Window_Rectangle_Red80_StaticMeshComponent0;  // 0x19A0 (size: 0x8)
    class UStaticMeshComponent* Painted_Window_Rectangle_Red81_StaticMeshComponent0;  // 0x19A8 (size: 0x8)
    class UStaticMeshComponent* Painted_Window_Rectangle_Red82_StaticMeshComponent0;  // 0x19B0 (size: 0x8)
    class UStaticMeshComponent* Painted_Frise_A_1_148_StaticMeshComponent0;           // 0x19B8 (size: 0x8)
    class UStaticMeshComponent* Painted_Frise_A_1_149_StaticMeshComponent0;           // 0x19C0 (size: 0x8)
    class UStaticMeshComponent* Painted_Frise_A_1_150_StaticMeshComponent0;           // 0x19C8 (size: 0x8)
    class UStaticMeshComponent* Painted_Frise_A_1_151_StaticMeshComponent0;           // 0x19D0 (size: 0x8)
    class UStaticMeshComponent* Painted_Frise_A_1_152_StaticMeshComponent0;           // 0x19D8 (size: 0x8)
    class UStaticMeshComponent* Painted_Frise_A_1_153_StaticMeshComponent0;           // 0x19E0 (size: 0x8)
    class UStaticMeshComponent* Foundation_tavern_lvl2_main2_StaticMeshComponent0;    // 0x19E8 (size: 0x8)
    class UStaticMeshComponent* Painted_Frise_A_1_154_StaticMeshComponent0;           // 0x19F0 (size: 0x8)
    class USceneComponent* C_SG_Tavern_LV2_Main_DefaultSceneRoot;                     // 0x19F8 (size: 0x8)

}; // Size: 0x1A00

#endif
