#ifndef UE4SS_SDK_C_SG_Sawpit_Alt_HPP
#define UE4SS_SDK_C_SG_Sawpit_Alt_HPP

class AC_SG_Sawpit_Alt_C : public AConstructionBP_C
{
    class UStaticMeshComponent* sg_peg35_StaticMeshComponent0;                        // 0x0550 (size: 0x8)
    class UStaticMeshComponent* sg_peg34_StaticMeshComponent0;                        // 0x0558 (size: 0x8)
    class UStaticMeshComponent* sg_peg33_StaticMeshComponent0;                        // 0x0560 (size: 0x8)
    class UStaticMeshComponent* sg_peg32_StaticMeshComponent0;                        // 0x0568 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_19_StaticMeshComponent0; // 0x0570 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_18_StaticMeshComponent0; // 0x0578 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_17_StaticMeshComponent0; // 0x0580 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_16_StaticMeshComponent0; // 0x0588 (size: 0x8)
    class UStaticMeshComponent* sg_WallRough_A83_StaticMeshComponent0;                // 0x0590 (size: 0x8)
    class UStaticMeshComponent* sg_WallRough_A82_StaticMeshComponent0;                // 0x0598 (size: 0x8)
    class UStaticMeshComponent* sg_WallRough_A81_StaticMeshComponent0;                // 0x05A0 (size: 0x8)
    class UStaticMeshComponent* sg_WallRough_A27_StaticMeshComponent0;                // 0x05A8 (size: 0x8)
    class UStaticMeshComponent* sg_WallRough_A26_StaticMeshComponent0;                // 0x05B0 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise_Beveled70_StaticMeshComponent0;       // 0x05B8 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise_Beveled69_StaticMeshComponent0;       // 0x05C0 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise_Beveled68_StaticMeshComponent0;       // 0x05C8 (size: 0x8)
    class UStaticMeshComponent* sg_ubeam_gable_planks4_StaticMeshComponent0;          // 0x05D0 (size: 0x8)
    class UStaticMeshComponent* roofSingleDisplaced6_StaticMeshComponent0;            // 0x05D8 (size: 0x8)
    class UStaticMeshComponent* sg_WallRough_A80_StaticMeshComponent0;                // 0x05E0 (size: 0x8)
    class UStaticMeshComponent* sg_WallRough_A79_StaticMeshComponent0;                // 0x05E8 (size: 0x8)
    class UStaticMeshComponent* sg_WallRough_A78_StaticMeshComponent0;                // 0x05F0 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise_Beveled67_StaticMeshComponent0;       // 0x05F8 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise_Beveled66_StaticMeshComponent0;       // 0x0600 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise_Beveled65_StaticMeshComponent0;       // 0x0608 (size: 0x8)
    class UStaticMeshComponent* sg_WallRough_A77_StaticMeshComponent0;                // 0x0610 (size: 0x8)
    class UStaticMeshComponent* sg_WallRough_A76_StaticMeshComponent0;                // 0x0618 (size: 0x8)
    class UStaticMeshComponent* sg_ubeam_gable_planks3_StaticMeshComponent0;          // 0x0620 (size: 0x8)
    class UStaticMeshComponent* sg_WallRough_A75_StaticMeshComponent0;                // 0x0628 (size: 0x8)
    class UStaticMeshComponent* sg_WallRough_A74_StaticMeshComponent0;                // 0x0630 (size: 0x8)
    class UStaticMeshComponent* sg_WallRough_A73_StaticMeshComponent0;                // 0x0638 (size: 0x8)
    class UStaticMeshComponent* sg_WallRough_A72_StaticMeshComponent0;                // 0x0640 (size: 0x8)
    class UStaticMeshComponent* sg_WallRough_A71_StaticMeshComponent0;                // 0x0648 (size: 0x8)
    class UStaticMeshComponent* sg_WallRough_A70_StaticMeshComponent0;                // 0x0650 (size: 0x8)
    class UStaticMeshComponent* sg_WallRough_A69_StaticMeshComponent0;                // 0x0658 (size: 0x8)
    class UStaticMeshComponent* sg_WallRough_A68_StaticMeshComponent0;                // 0x0660 (size: 0x8)
    class UStaticMeshComponent* sg_WallRough_A67_StaticMeshComponent0;                // 0x0668 (size: 0x8)
    class UStaticMeshComponent* sg_WallRough_A66_StaticMeshComponent0;                // 0x0670 (size: 0x8)
    class UStaticMeshComponent* sg_WallRough_A25_StaticMeshComponent0;                // 0x0678 (size: 0x8)
    class UStaticMeshComponent* sg_WallRough_A65_StaticMeshComponent0;                // 0x0680 (size: 0x8)
    class UStaticMeshComponent* sg_WallRough_A64_StaticMeshComponent0;                // 0x0688 (size: 0x8)
    class UStaticMeshComponent* sg_WallRough_A24_StaticMeshComponent0;                // 0x0690 (size: 0x8)
    class UStaticMeshComponent* sg_WallRough_A63_StaticMeshComponent0;                // 0x0698 (size: 0x8)
    class UStaticMeshComponent* sg_WallRough_A62_StaticMeshComponent0;                // 0x06A0 (size: 0x8)
    class UStaticMeshComponent* sg_WallRough_A23_StaticMeshComponent0;                // 0x06A8 (size: 0x8)
    class UStaticMeshComponent* sg_WallRough_A61_StaticMeshComponent0;                // 0x06B0 (size: 0x8)
    class UStaticMeshComponent* sg_WallRough_A60_StaticMeshComponent0;                // 0x06B8 (size: 0x8)
    class UStaticMeshComponent* sg_WallRough_A22_StaticMeshComponent0;                // 0x06C0 (size: 0x8)
    class UStaticMeshComponent* sg_WallRough_A59_StaticMeshComponent0;                // 0x06C8 (size: 0x8)
    class UStaticMeshComponent* sg_WallRough_A58_StaticMeshComponent0;                // 0x06D0 (size: 0x8)
    class UStaticMeshComponent* sg_WallRough_A21_StaticMeshComponent0;                // 0x06D8 (size: 0x8)
    class UStaticMeshComponent* sg_WallRough_A20_StaticMeshComponent0;                // 0x06E0 (size: 0x8)
    class UStaticMeshComponent* sg_WallRough_A19_StaticMeshComponent0;                // 0x06E8 (size: 0x8)
    class UStaticMeshComponent* sg_peg31_StaticMeshComponent0;                        // 0x06F0 (size: 0x8)
    class UStaticMeshComponent* sg_peg30_StaticMeshComponent0;                        // 0x06F8 (size: 0x8)
    class UStaticMeshComponent* sg_peg29_StaticMeshComponent0;                        // 0x0700 (size: 0x8)
    class UStaticMeshComponent* sg_peg21_StaticMeshComponent0;                        // 0x0708 (size: 0x8)
    class UStaticMeshComponent* sg_peg19_StaticMeshComponent0;                        // 0x0710 (size: 0x8)
    class UStaticMeshComponent* roofSingleDisplaced5_StaticMeshComponent0;            // 0x0718 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_15_StaticMeshComponent0; // 0x0720 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_14_StaticMeshComponent0; // 0x0728 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_13_StaticMeshComponent0; // 0x0730 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_12_StaticMeshComponent0; // 0x0738 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_11_StaticMeshComponent0; // 0x0740 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise_Beveled64_StaticMeshComponent0;       // 0x0748 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise_Beveled63_StaticMeshComponent0;       // 0x0750 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise_Beveled62_StaticMeshComponent0;       // 0x0758 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise_Beveled61_StaticMeshComponent0;       // 0x0760 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise_Beveled60_StaticMeshComponent0;       // 0x0768 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise_Beveled59_StaticMeshComponent0;       // 0x0770 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise_Beveled58_StaticMeshComponent0;       // 0x0778 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise_Beveled57_StaticMeshComponent0;       // 0x0780 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise_Beveled56_StaticMeshComponent0;       // 0x0788 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise_Beveled55_StaticMeshComponent0;       // 0x0790 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise_Beveled54_StaticMeshComponent0;       // 0x0798 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise_Beveled53_StaticMeshComponent0;       // 0x07A0 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise_Beveled49_StaticMeshComponent0;       // 0x07A8 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise_Beveled48_StaticMeshComponent0;       // 0x07B0 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise_Beveled46_StaticMeshComponent0;       // 0x07B8 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise_Beveled45_StaticMeshComponent0;       // 0x07C0 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise_Beveled44_StaticMeshComponent0;       // 0x07C8 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise_Beveled43_StaticMeshComponent0;       // 0x07D0 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise_Beveled42_StaticMeshComponent0;       // 0x07D8 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise_Beveled16_StaticMeshComponent0;       // 0x07E0 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise_Beveled15_StaticMeshComponent0;       // 0x07E8 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise_Beveled14_StaticMeshComponent0;       // 0x07F0 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise_Beveled13_StaticMeshComponent0;       // 0x07F8 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise_Beveled12_StaticMeshComponent0;       // 0x0800 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise_Beveled11_StaticMeshComponent0;       // 0x0808 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise_Beveled8_StaticMeshComponent0;        // 0x0810 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise_Beveled7_StaticMeshComponent0;        // 0x0818 (size: 0x8)
    class UStaticMeshComponent* sg_WallRough_A18_StaticMeshComponent0;                // 0x0820 (size: 0x8)
    class USceneComponent* sawpit_ubeam_alt2_DefaultSceneRoot;                        // 0x0828 (size: 0x8)

}; // Size: 0x830

#endif
