#ifndef UE4SS_SDK_C_SG_Townhouse_Lv3_BPart_B_HPP
#define UE4SS_SDK_C_SG_Townhouse_Lv3_BPart_B_HPP

class AC_SG_Townhouse_Lv3_BPart_B_C : public AConstructionBP_C
{
    class UStaticMeshComponent* fakeInteriorA;                                        // 0x0550 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_doorHead_B_FancyCurves_StaticMeshComponent0; // 0x0558 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short51_StaticMeshComponent0;        // 0x0560 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short52_StaticMeshComponent0;        // 0x0568 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short53_StaticMeshComponent0;        // 0x0570 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short54_StaticMeshComponent0;        // 0x0578 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short55_StaticMeshComponent0;        // 0x0580 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short56_StaticMeshComponent0;        // 0x0588 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short57_StaticMeshComponent0;        // 0x0590 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth15_StaticMeshComponent0;           // 0x0598 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth16_StaticMeshComponent0;           // 0x05A0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth17_StaticMeshComponent0;           // 0x05A8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth18_StaticMeshComponent0;           // 0x05B0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth19_StaticMeshComponent0;           // 0x05B8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth20_StaticMeshComponent0;           // 0x05C0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short58_StaticMeshComponent0;        // 0x05C8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short59_StaticMeshComponent0;        // 0x05D0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth21_StaticMeshComponent0;           // 0x05D8 (size: 0x8)
    class UStaticMeshComponent* J_SG_WoodenBracketA_StaticMeshComponent0;             // 0x05E0 (size: 0x8)
    class UStaticMeshComponent* J_SG_WoodenBracketA2_StaticMeshComponent0;            // 0x05E8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth22_StaticMeshComponent0;           // 0x05F0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth23_StaticMeshComponent0;           // 0x05F8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth24_StaticMeshComponent0;           // 0x0600 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth25_StaticMeshComponent0;           // 0x0608 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth26_StaticMeshComponent0;           // 0x0610 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth27_StaticMeshComponent0;           // 0x0618 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth28_StaticMeshComponent0;           // 0x0620 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth29_StaticMeshComponent0;           // 0x0628 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_02_StaticMeshComponent0; // 0x0630 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_05_StaticMeshComponent0; // 0x0638 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_3_StaticMeshComponent0; // 0x0640 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_4_StaticMeshComponent0; // 0x0648 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_6_StaticMeshComponent0; // 0x0650 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_5_StaticMeshComponent0; // 0x0658 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth30_StaticMeshComponent0;           // 0x0660 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth31_StaticMeshComponent0;           // 0x0668 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_7_StaticMeshComponent0; // 0x0670 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_8_StaticMeshComponent0; // 0x0678 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_9_StaticMeshComponent0; // 0x0680 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_11_StaticMeshComponent0; // 0x0688 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_12_StaticMeshComponent0; // 0x0690 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_13_StaticMeshComponent0; // 0x0698 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_14_StaticMeshComponent0; // 0x06A0 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_15_StaticMeshComponent0; // 0x06A8 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_16_StaticMeshComponent0; // 0x06B0 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_17_StaticMeshComponent0; // 0x06B8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth32_StaticMeshComponent0;           // 0x06C0 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_18_StaticMeshComponent0; // 0x06C8 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_19_StaticMeshComponent0; // 0x06D0 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_20_StaticMeshComponent0; // 0x06D8 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_21_StaticMeshComponent0; // 0x06E0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth33_StaticMeshComponent0;           // 0x06E8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth34_StaticMeshComponent0;           // 0x06F0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth35_StaticMeshComponent0;           // 0x06F8 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_22_StaticMeshComponent0; // 0x0700 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_23_StaticMeshComponent0; // 0x0708 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_25_StaticMeshComponent0; // 0x0710 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_26_StaticMeshComponent0; // 0x0718 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_27_StaticMeshComponent0; // 0x0720 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_24_StaticMeshComponent0; // 0x0728 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_28_StaticMeshComponent0; // 0x0730 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_29_StaticMeshComponent0; // 0x0738 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_30_StaticMeshComponent0; // 0x0740 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_31_StaticMeshComponent0; // 0x0748 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_32_StaticMeshComponent0; // 0x0750 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth36_StaticMeshComponent0;           // 0x0758 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth37_StaticMeshComponent0;           // 0x0760 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth38_StaticMeshComponent0;           // 0x0768 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_35_StaticMeshComponent0; // 0x0770 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_36_StaticMeshComponent0; // 0x0778 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth_tapered3_StaticMeshComponent0;    // 0x0780 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_37_StaticMeshComponent0; // 0x0788 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_38_StaticMeshComponent0; // 0x0790 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_39_StaticMeshComponent0; // 0x0798 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_40_StaticMeshComponent0; // 0x07A0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short60_StaticMeshComponent0;        // 0x07A8 (size: 0x8)
    class UStaticMeshComponent* doorHeadA_angled_StaticMeshComponent0;                // 0x07B0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short61_StaticMeshComponent0;        // 0x07B8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short62_StaticMeshComponent0;        // 0x07C0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short63_StaticMeshComponent0;        // 0x07C8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m_tapered_oneSide_StaticMeshComponent0;   // 0x07D0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m_tapered_oneSide2_StaticMeshComponent0;  // 0x07D8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth39_StaticMeshComponent0;           // 0x07E0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth40_StaticMeshComponent0;           // 0x07E8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short64_StaticMeshComponent0;        // 0x07F0 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_01_StaticMeshComponent0; // 0x07F8 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_2_StaticMeshComponent0; // 0x0800 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_41_StaticMeshComponent0; // 0x0808 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_42_StaticMeshComponent0; // 0x0810 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth41_StaticMeshComponent0;           // 0x0818 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth42_StaticMeshComponent0;           // 0x0820 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth43_StaticMeshComponent0;           // 0x0828 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth44_StaticMeshComponent0;           // 0x0830 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth45_StaticMeshComponent0;           // 0x0838 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Tapered_CutE_StaticMeshComponent0;          // 0x0840 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth_tapered5_StaticMeshComponent0;    // 0x0848 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth46_StaticMeshComponent0;           // 0x0850 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth47_StaticMeshComponent0;           // 0x0858 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth48_StaticMeshComponent0;           // 0x0860 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth49_StaticMeshComponent0;           // 0x0868 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Tapered_CutE2_StaticMeshComponent0;         // 0x0870 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth_tapered6_StaticMeshComponent0;    // 0x0878 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth50_StaticMeshComponent0;           // 0x0880 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth51_StaticMeshComponent0;           // 0x0888 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth52_StaticMeshComponent0;           // 0x0890 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth53_StaticMeshComponent0;           // 0x0898 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Tapered_CutE3_StaticMeshComponent0;         // 0x08A0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth_tapered7_StaticMeshComponent0;    // 0x08A8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth54_StaticMeshComponent0;           // 0x08B0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth55_StaticMeshComponent0;           // 0x08B8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth56_StaticMeshComponent0;           // 0x08C0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth57_StaticMeshComponent0;           // 0x08C8 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Tapered_CutE4_StaticMeshComponent0;         // 0x08D0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth_tapered4_StaticMeshComponent0;    // 0x08D8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth58_StaticMeshComponent0;           // 0x08E0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth59_StaticMeshComponent0;           // 0x08E8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth60_StaticMeshComponent0;           // 0x08F0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth61_StaticMeshComponent0;           // 0x08F8 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Tapered_CutE5_StaticMeshComponent0;         // 0x0900 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth_tapered8_StaticMeshComponent0;    // 0x0908 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth62_StaticMeshComponent0;           // 0x0910 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth63_StaticMeshComponent0;           // 0x0918 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth64_StaticMeshComponent0;           // 0x0920 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth65_StaticMeshComponent0;           // 0x0928 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Tapered_CutE6_StaticMeshComponent0;         // 0x0930 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth_tapered9_StaticMeshComponent0;    // 0x0938 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth66_StaticMeshComponent0;           // 0x0940 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth67_StaticMeshComponent0;           // 0x0948 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth68_StaticMeshComponent0;           // 0x0950 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth69_StaticMeshComponent0;           // 0x0958 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Tapered_CutE7_StaticMeshComponent0;         // 0x0960 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth_tapered10_StaticMeshComponent0;   // 0x0968 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth70_StaticMeshComponent0;           // 0x0970 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth71_StaticMeshComponent0;           // 0x0978 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth72_StaticMeshComponent0;           // 0x0980 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth73_StaticMeshComponent0;           // 0x0988 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Tapered_CutE8_StaticMeshComponent0;         // 0x0990 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth_tapered11_StaticMeshComponent0;   // 0x0998 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth74_StaticMeshComponent0;           // 0x09A0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth75_StaticMeshComponent0;           // 0x09A8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth76_StaticMeshComponent0;           // 0x09B0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth77_StaticMeshComponent0;           // 0x09B8 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Tapered_CutE9_StaticMeshComponent0;         // 0x09C0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short65_StaticMeshComponent0;        // 0x09C8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth78_StaticMeshComponent0;           // 0x09D0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth79_StaticMeshComponent0;           // 0x09D8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth80_StaticMeshComponent0;           // 0x09E0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth81_StaticMeshComponent0;           // 0x09E8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth82_StaticMeshComponent0;           // 0x09F0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam1_5m_orSth_StaticMeshComponent0;           // 0x09F8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam1_5m_orSth2_StaticMeshComponent0;          // 0x0A00 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam1_5m_orSth3_StaticMeshComponent0;          // 0x0A08 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam1_5m_orSth4_StaticMeshComponent0;          // 0x0A10 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam1_5m_orSth9_StaticMeshComponent0;          // 0x0A18 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam1_5m_orSth10_StaticMeshComponent0;         // 0x0A20 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam1_5m_orSth11_StaticMeshComponent0;         // 0x0A28 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam1_5m_orSth12_StaticMeshComponent0;         // 0x0A30 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam1_5m_orSth13_StaticMeshComponent0;         // 0x0A38 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam1_5m_orSth14_StaticMeshComponent0;         // 0x0A40 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam1_5m_orSth15_StaticMeshComponent0;         // 0x0A48 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam1_5m_orSth16_StaticMeshComponent0;         // 0x0A50 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam1_5m_orSth17_StaticMeshComponent0;         // 0x0A58 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam1_5m_orSth18_StaticMeshComponent0;         // 0x0A60 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam1_5m_orSth19_StaticMeshComponent0;         // 0x0A68 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth83_StaticMeshComponent0;           // 0x0A70 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth84_StaticMeshComponent0;           // 0x0A78 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam1_5m_orSth20_StaticMeshComponent0;         // 0x0A80 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam1_5m_orSth21_StaticMeshComponent0;         // 0x0A88 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth85_StaticMeshComponent0;           // 0x0A90 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth86_StaticMeshComponent0;           // 0x0A98 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth87_StaticMeshComponent0;           // 0x0AA0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth88_StaticMeshComponent0;           // 0x0AA8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth89_StaticMeshComponent0;           // 0x0AB0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth90_StaticMeshComponent0;           // 0x0AB8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth91_StaticMeshComponent0;           // 0x0AC0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly_StaticMeshComponent0;      // 0x0AC8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly2_StaticMeshComponent0;     // 0x0AD0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly3_StaticMeshComponent0;     // 0x0AD8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly4_StaticMeshComponent0;     // 0x0AE0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly5_StaticMeshComponent0;     // 0x0AE8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly6_StaticMeshComponent0;     // 0x0AF0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly7_StaticMeshComponent0;     // 0x0AF8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly8_StaticMeshComponent0;     // 0x0B00 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly9_StaticMeshComponent0;     // 0x0B08 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly10_StaticMeshComponent0;    // 0x0B10 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly11_StaticMeshComponent0;    // 0x0B18 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly12_StaticMeshComponent0;    // 0x0B20 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly13_StaticMeshComponent0;    // 0x0B28 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly14_StaticMeshComponent0;    // 0x0B30 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly15_StaticMeshComponent0;    // 0x0B38 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth_StaticMeshComponent0;             // 0x0B40 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth2_StaticMeshComponent0;            // 0x0B48 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth3_StaticMeshComponent0;            // 0x0B50 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth4_StaticMeshComponent0;            // 0x0B58 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth5_StaticMeshComponent0;            // 0x0B60 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth6_StaticMeshComponent0;            // 0x0B68 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth7_StaticMeshComponent0;            // 0x0B70 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth8_StaticMeshComponent0;            // 0x0B78 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth9_StaticMeshComponent0;            // 0x0B80 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth10_StaticMeshComponent0;           // 0x0B88 (size: 0x8)
    class UStaticMeshComponent* J_SG_WoodenBracketA3_StaticMeshComponent0;            // 0x0B90 (size: 0x8)
    class UStaticMeshComponent* J_SG_WoodenBracketA4_StaticMeshComponent0;            // 0x0B98 (size: 0x8)
    class UStaticMeshComponent* J_SG_WoodenBracketA5_StaticMeshComponent0;            // 0x0BA0 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_33_StaticMeshComponent0; // 0x0BA8 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_34_StaticMeshComponent0; // 0x0BB0 (size: 0x8)
    class UStaticMeshComponent* SG_BigWindowA2_StaticMeshComponent0;                  // 0x0BB8 (size: 0x8)
    class UStaticMeshComponent* SG_BigWindowA3_StaticMeshComponent0;                  // 0x0BC0 (size: 0x8)
    class UStaticMeshComponent* SG_BigWindowA4_StaticMeshComponent0;                  // 0x0BC8 (size: 0x8)
    class UStaticMeshComponent* sg_shutterA_StaticMeshComponent0;                     // 0x0BD0 (size: 0x8)
    class UStaticMeshComponent* SG_SmallGlassWindowA_StaticMeshComponent0;            // 0x0BD8 (size: 0x8)
    class UStaticMeshComponent* SG_SmallGlassWindowA2_StaticMeshComponent0;           // 0x0BE0 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardC_thinner_StaticMeshComponent0;         // 0x0BE8 (size: 0x8)
    class UStaticMeshComponent* PlaneDenseSmallSegmentNarrower2_StaticMeshComponent0; // 0x0BF0 (size: 0x8)
    class UStaticMeshComponent* PlaneDenseSmallSegmentNarrower3_StaticMeshComponent0; // 0x0BF8 (size: 0x8)
    class UStaticMeshComponent* PlaneDenseSmallSegmentNarrower5_StaticMeshComponent0; // 0x0C00 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardC_thinner2_StaticMeshComponent0;        // 0x0C08 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly16_StaticMeshComponent0;    // 0x0C10 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly17_StaticMeshComponent0;    // 0x0C18 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly18_StaticMeshComponent0;    // 0x0C20 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly19_StaticMeshComponent0;    // 0x0C28 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly20_StaticMeshComponent0;    // 0x0C30 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly21_StaticMeshComponent0;    // 0x0C38 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly22_StaticMeshComponent0;    // 0x0C40 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly23_StaticMeshComponent0;    // 0x0C48 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly24_StaticMeshComponent0;    // 0x0C50 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly25_StaticMeshComponent0;    // 0x0C58 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly26_StaticMeshComponent0;    // 0x0C60 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly27_StaticMeshComponent0;    // 0x0C68 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly28_StaticMeshComponent0;    // 0x0C70 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly29_StaticMeshComponent0;    // 0x0C78 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly30_StaticMeshComponent0;    // 0x0C80 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly31_StaticMeshComponent0;    // 0x0C88 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly32_StaticMeshComponent0;    // 0x0C90 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly33_StaticMeshComponent0;    // 0x0C98 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly34_StaticMeshComponent0;    // 0x0CA0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly35_StaticMeshComponent0;    // 0x0CA8 (size: 0x8)
    class UStaticMeshComponent* SG_SmallGlassWindowA3_StaticMeshComponent0;           // 0x0CB0 (size: 0x8)
    class UStaticMeshComponent* ChimneyLP_StaticMeshComponent0;                       // 0x0CB8 (size: 0x8)
    class UStaticMeshComponent* sg_chimneyTop_StaticMeshComponent0;                   // 0x0CC0 (size: 0x8)
    class UStaticMeshComponent* sg_chimneyTop2_StaticMeshComponent0;                  // 0x0CC8 (size: 0x8)
    class UStaticMeshComponent* sg_shutterA2_StaticMeshComponent0;                    // 0x0CD0 (size: 0x8)
    class UStaticMeshComponent* SM_WindowFrame_StaticMeshComponent0;                  // 0x0CD8 (size: 0x8)
    class UStaticMeshComponent* SM_WindowFrame2_StaticMeshComponent0;                 // 0x0CE0 (size: 0x8)
    class UStaticMeshComponent* SM_WindowFrame3_StaticMeshComponent0;                 // 0x0CE8 (size: 0x8)
    class UStaticMeshComponent* sg_shutterA3_StaticMeshComponent0;                    // 0x0CF0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly36_StaticMeshComponent0;    // 0x0CF8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly37_StaticMeshComponent0;    // 0x0D00 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly38_StaticMeshComponent0;    // 0x0D08 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly39_StaticMeshComponent0;    // 0x0D10 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly40_StaticMeshComponent0;    // 0x0D18 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly41_StaticMeshComponent0;    // 0x0D20 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly42_StaticMeshComponent0;    // 0x0D28 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly43_StaticMeshComponent0;    // 0x0D30 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly44_StaticMeshComponent0;    // 0x0D38 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly45_StaticMeshComponent0;    // 0x0D40 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly46_StaticMeshComponent0;    // 0x0D48 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly47_StaticMeshComponent0;    // 0x0D50 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly48_StaticMeshComponent0;    // 0x0D58 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly49_StaticMeshComponent0;    // 0x0D60 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly50_StaticMeshComponent0;    // 0x0D68 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly51_StaticMeshComponent0;    // 0x0D70 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly52_StaticMeshComponent0;    // 0x0D78 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly53_StaticMeshComponent0;    // 0x0D80 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly54_StaticMeshComponent0;    // 0x0D88 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly55_StaticMeshComponent0;    // 0x0D90 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly56_StaticMeshComponent0;    // 0x0D98 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly57_StaticMeshComponent0;    // 0x0DA0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly58_StaticMeshComponent0;    // 0x0DA8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly59_StaticMeshComponent0;    // 0x0DB0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly60_StaticMeshComponent0;    // 0x0DB8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly61_StaticMeshComponent0;    // 0x0DC0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly62_StaticMeshComponent0;    // 0x0DC8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly63_StaticMeshComponent0;    // 0x0DD0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly64_StaticMeshComponent0;    // 0x0DD8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly65_StaticMeshComponent0;    // 0x0DE0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly66_StaticMeshComponent0;    // 0x0DE8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly67_StaticMeshComponent0;    // 0x0DF0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly68_StaticMeshComponent0;    // 0x0DF8 (size: 0x8)
    class UStaticMeshComponent* SM_WindowFrame4_StaticMeshComponent0;                 // 0x0E00 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth92_StaticMeshComponent0;           // 0x0E08 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth93_StaticMeshComponent0;           // 0x0E10 (size: 0x8)
    class UStaticMeshComponent* ClayRoofSimpleBroken_StaticMeshComponent0;            // 0x0E18 (size: 0x8)
    class UStaticMeshComponent* UBeam_GableSimpleA_StaticMeshComponent0;              // 0x0E20 (size: 0x8)
    class UStaticMeshComponent* UBeam_GableSimpleA2_StaticMeshComponent0;             // 0x0E28 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Narrow_StaticMeshComponent0;               // 0x0E30 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Narrow2_StaticMeshComponent0;              // 0x0E38 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Narrow3_StaticMeshComponent0;              // 0x0E40 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Narrow4_StaticMeshComponent0;              // 0x0E48 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Narrow5_StaticMeshComponent0;              // 0x0E50 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Narrow6_StaticMeshComponent0;              // 0x0E58 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Narrow7_StaticMeshComponent0;              // 0x0E60 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Narrow8_StaticMeshComponent0;              // 0x0E68 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Narrow9_StaticMeshComponent0;              // 0x0E70 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Narrow10_StaticMeshComponent0;             // 0x0E78 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Narrow11_StaticMeshComponent0;             // 0x0E80 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Narrow12_StaticMeshComponent0;             // 0x0E88 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Narrow13_StaticMeshComponent0;             // 0x0E90 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Narrow14_StaticMeshComponent0;             // 0x0E98 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Narrow15_StaticMeshComponent0;             // 0x0EA0 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Narrow16_StaticMeshComponent0;             // 0x0EA8 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Narrow17_StaticMeshComponent0;             // 0x0EB0 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Narrow_Var2_StaticMeshComponent0;          // 0x0EB8 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Narrow_Var3_StaticMeshComponent0;          // 0x0EC0 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Narrow_Var4_StaticMeshComponent0;          // 0x0EC8 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Narrow_Var5_StaticMeshComponent0;          // 0x0ED0 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Narrow_Var6_StaticMeshComponent0;          // 0x0ED8 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Narrow_Var7_StaticMeshComponent0;          // 0x0EE0 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Narrow_Var8_StaticMeshComponent0;          // 0x0EE8 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Narrow_Var9_StaticMeshComponent0;          // 0x0EF0 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Narrow_Var10_StaticMeshComponent0;         // 0x0EF8 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Narrow_Var11_StaticMeshComponent0;         // 0x0F00 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Narrow_Var12_StaticMeshComponent0;         // 0x0F08 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Narrow_Var13_StaticMeshComponent0;         // 0x0F10 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Narrow_Var14_StaticMeshComponent0;         // 0x0F18 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Narrow_Var15_StaticMeshComponent0;         // 0x0F20 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Narrow_Var16_StaticMeshComponent0;         // 0x0F28 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Narrow_Var17_StaticMeshComponent0;         // 0x0F30 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Narrow_Var18_StaticMeshComponent0;         // 0x0F38 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Narrow_Var20_StaticMeshComponent0;         // 0x0F40 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Narrow_Var21_StaticMeshComponent0;         // 0x0F48 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Narrow_Var22_StaticMeshComponent0;         // 0x0F50 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Narrow_Var23_StaticMeshComponent0;         // 0x0F58 (size: 0x8)
    class UStaticMeshComponent* roofWoodShed_StaticMeshComponent0;                    // 0x0F60 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Narrow_Var19_StaticMeshComponent0;         // 0x0F68 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Narrow_Var24_StaticMeshComponent0;         // 0x0F70 (size: 0x8)
    class UStaticMeshComponent* FoundationSeamless_Corner_407x180_supportGap_STEP6_StaticMeshComponent0; // 0x0F78 (size: 0x8)
    class UStaticMeshComponent* FoundationSeamless_Corner_407x180_supportGap_STEP_StaticMeshComponent0; // 0x0F80 (size: 0x8)
    class UStaticMeshComponent* FoundationSeamless_Corner_407x180_supportGap_STEP2_StaticMeshComponent0; // 0x0F88 (size: 0x8)
    class UStaticMeshComponent* FoundationSeamless_Corner_407x180_supportGap_STEP3_StaticMeshComponent0; // 0x0F90 (size: 0x8)
    class UStaticMeshComponent* FoundationSeamless_Corner_407x180_supportGap_STEP4_StaticMeshComponent0; // 0x0F98 (size: 0x8)
    class UStaticMeshComponent* FoundationSeamless_Corner_407x180_supportGap_STEP5_StaticMeshComponent0; // 0x0FA0 (size: 0x8)
    class USceneComponent* Actor_DefaultSceneRoot;                                    // 0x0FA8 (size: 0x8)

}; // Size: 0xFB0

#endif
