#ifndef UE4SS_SDK_C_SG_MineEntry_Sand_HPP
#define UE4SS_SDK_C_SG_MineEntry_Sand_HPP

class AC_SG_MineEntry_Sand_C : public AConstructionBP_C
{
    class UStaticMeshComponent* saltMine_halina14_StaticMeshComponent0;               // 0x0550 (size: 0x8)
    class UStaticMeshComponent* hromada_ridge4_StaticMeshComponent0;                  // 0x0558 (size: 0x8)
    class UStaticMeshComponent* hromada_MineEntry3_StaticMeshComponent0;              // 0x0560 (size: 0x8)
    class UStaticMeshComponent* C_SG_MineEntry3_UBeam_1_5_m_rough4_StaticMeshComponent0; // 0x0568 (size: 0x8)
    class UStaticMeshComponent* C_SG_MineEntry3_UBeam_1_5_m_rough5_StaticMeshComponent0; // 0x0570 (size: 0x8)
    class UStaticMeshComponent* C_SG_MineEntry3_UBeam_1_5_m_rough6_StaticMeshComponent0; // 0x0578 (size: 0x8)
    class UStaticMeshComponent* C_SG_MineEntry3_UBeam_FillerBoardA_Crooked22_StaticMeshComponent0; // 0x0580 (size: 0x8)
    class UStaticMeshComponent* C_SG_MineEntry3_UBeam_FillerBoardA_Crooked23_StaticMeshComponent0; // 0x0588 (size: 0x8)
    class UStaticMeshComponent* C_SG_MineEntry3_UBeam_FillerBoardA_Crooked24_StaticMeshComponent0; // 0x0590 (size: 0x8)
    class UStaticMeshComponent* C_SG_MineEntry3_UBeam_FillerBoardA_Crooked25_StaticMeshComponent0; // 0x0598 (size: 0x8)
    class UStaticMeshComponent* C_SG_MineEntry3_UBeam_FillerBoardA_Crooked26_StaticMeshComponent0; // 0x05A0 (size: 0x8)
    class UStaticMeshComponent* C_SG_MineEntry3_UBeam_FillerBoardA_Crooked27_StaticMeshComponent0; // 0x05A8 (size: 0x8)
    class UStaticMeshComponent* C_SG_MineEntry3_UBeam_FillerBoardA_Crooked28_StaticMeshComponent0; // 0x05B0 (size: 0x8)
    class UStaticMeshComponent* C_SG_MineEntry3_BlackCube5_StaticMeshComponent0;      // 0x05B8 (size: 0x8)
    class UStaticMeshComponent* C_SG_MineEntry3_UBeam_FillerBoardA_Crooked29_StaticMeshComponent0; // 0x05C0 (size: 0x8)
    class UStaticMeshComponent* C_SG_MineEntry3_UBeam_FillerBoardA_Crooked30_StaticMeshComponent0; // 0x05C8 (size: 0x8)
    class UStaticMeshComponent* C_SG_MineEntry3_UBeam_FillerBoardA_Crooked31_StaticMeshComponent0; // 0x05D0 (size: 0x8)
    class UStaticMeshComponent* C_SG_MineEntry3_UBeam_FillerBoardA_Crooked32_StaticMeshComponent0; // 0x05D8 (size: 0x8)
    class UStaticMeshComponent* C_SG_MineEntry3_UBeam_FillerBoardA_Crooked33_StaticMeshComponent0; // 0x05E0 (size: 0x8)
    class UStaticMeshComponent* C_SG_MineEntry3_UBeam_FillerBoardA_Crooked34_StaticMeshComponent0; // 0x05E8 (size: 0x8)
    class UStaticMeshComponent* C_SG_MineEntry3_UBeam_FillerBoardA_Crooked35_StaticMeshComponent0; // 0x05F0 (size: 0x8)
    class UStaticMeshComponent* C_SG_MineEntry3_UBeam_FillerBoardA_Crooked36_StaticMeshComponent0; // 0x05F8 (size: 0x8)
    class UStaticMeshComponent* C_SG_MineEntry3_UBeam_FillerBoardA_Crooked37_StaticMeshComponent0; // 0x0600 (size: 0x8)
    class UStaticMeshComponent* C_SG_MineEntry3_UBeam_FillerBoardA_Crooked38_StaticMeshComponent0; // 0x0608 (size: 0x8)
    class UStaticMeshComponent* C_SG_MineEntry3_UBeam_FillerBoardA_Crooked39_StaticMeshComponent0; // 0x0610 (size: 0x8)
    class UStaticMeshComponent* C_SG_MineEntry3_UBeam_FillerBoardA_Crooked40_StaticMeshComponent0; // 0x0618 (size: 0x8)
    class UStaticMeshComponent* C_SG_MineEntry3_UBeam_FillerBoardA_Crooked41_StaticMeshComponent0; // 0x0620 (size: 0x8)
    class UStaticMeshComponent* C_SG_MineEntry3_UBeam_FillerBoardA_Crooked42_StaticMeshComponent0; // 0x0628 (size: 0x8)
    class USceneComponent* C_SG_MineEntry3_C_SG_MineEntry_DefaultSceneRoot;           // 0x0630 (size: 0x8)
    class UPoseableMeshComponent* C_SG_MineEntry3_stoneStructure;                     // 0x0638 (size: 0x8)
    class USceneComponent* C_SG_MineEntry3_Default Root Component;                    // 0x0640 (size: 0x8)
    class USceneComponent* C_SG_MineEntry_Sand_DefaultSceneRoot;                      // 0x0648 (size: 0x8)

}; // Size: 0x650

#endif
