#ifndef UE4SS_SDK_C_SG_GranarySmol_HPP
#define UE4SS_SDK_C_SG_GranarySmol_HPP

class AC_SG_GranarySmol_C : public AConstructionBP_C
{
    class UStaticMeshComponent* clutter_door;                                         // 0x0550 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long_diagonalD54_StaticMeshComponent0; // 0x0558 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long_diagonalD53_StaticMeshComponent0; // 0x0560 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise170_StaticMeshComponent0;              // 0x0568 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise169_StaticMeshComponent0;              // 0x0570 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise168_StaticMeshComponent0;              // 0x0578 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise167_StaticMeshComponent0;              // 0x0580 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise166_StaticMeshComponent0;              // 0x0588 (size: 0x8)
    class UStaticMeshComponent* SM_Ladder_10_StaticMeshComponent0;                    // 0x0590 (size: 0x8)
    class UStaticMeshComponent* roofHalfHipSmolC_displaced4_StaticMeshComponent0;     // 0x0598 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long_diagonalD52_StaticMeshComponent0; // 0x05A0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long_diagonalD51_StaticMeshComponent0; // 0x05A8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long_diagonalD50_StaticMeshComponent0; // 0x05B0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long_diagonalD49_StaticMeshComponent0; // 0x05B8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long_diagonalD48_StaticMeshComponent0; // 0x05C0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long_diagonalD47_StaticMeshComponent0; // 0x05C8 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA332_StaticMeshComponent0;              // 0x05D0 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA331_StaticMeshComponent0;              // 0x05D8 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed_long222_StaticMeshComponent0;     // 0x05E0 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed_long221_StaticMeshComponent0;     // 0x05E8 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed_long220_StaticMeshComponent0;     // 0x05F0 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed_long219_StaticMeshComponent0;     // 0x05F8 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed_long218_StaticMeshComponent0;     // 0x0600 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed_long217_StaticMeshComponent0;     // 0x0608 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed_long216_StaticMeshComponent0;     // 0x0610 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed_long215_StaticMeshComponent0;     // 0x0618 (size: 0x8)
    class UStaticMeshComponent* sg_peg160_StaticMeshComponent0;                       // 0x0620 (size: 0x8)
    class UStaticMeshComponent* sg_peg159_StaticMeshComponent0;                       // 0x0628 (size: 0x8)
    class UStaticMeshComponent* sg_peg158_StaticMeshComponent0;                       // 0x0630 (size: 0x8)
    class UStaticMeshComponent* sg_peg157_StaticMeshComponent0;                       // 0x0638 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long_diagonalD46_StaticMeshComponent0; // 0x0640 (size: 0x8)
    class UStaticMeshComponent* pebbleWallDisplaced4_StaticMeshComponent0;            // 0x0648 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise165_StaticMeshComponent0;              // 0x0650 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise164_StaticMeshComponent0;              // 0x0658 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise163_StaticMeshComponent0;              // 0x0660 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise162_StaticMeshComponent0;              // 0x0668 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long_diagonalD45_StaticMeshComponent0; // 0x0670 (size: 0x8)
    class UStaticMeshComponent* blackness5_StaticMeshComponent0;                      // 0x0678 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA330_StaticMeshComponent0;              // 0x0680 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA329_StaticMeshComponent0;              // 0x0688 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA328_StaticMeshComponent0;              // 0x0690 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA327_StaticMeshComponent0;              // 0x0698 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA326_StaticMeshComponent0;              // 0x06A0 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA325_StaticMeshComponent0;              // 0x06A8 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA324_StaticMeshComponent0;              // 0x06B0 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA323_StaticMeshComponent0;              // 0x06B8 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA322_StaticMeshComponent0;              // 0x06C0 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA321_StaticMeshComponent0;              // 0x06C8 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA320_StaticMeshComponent0;              // 0x06D0 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA319_StaticMeshComponent0;              // 0x06D8 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA318_StaticMeshComponent0;              // 0x06E0 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA317_StaticMeshComponent0;              // 0x06E8 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA316_StaticMeshComponent0;              // 0x06F0 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA315_StaticMeshComponent0;              // 0x06F8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long_diagonalD44_StaticMeshComponent0; // 0x0700 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short371_StaticMeshComponent0;       // 0x0708 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA314_StaticMeshComponent0;              // 0x0710 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA313_StaticMeshComponent0;              // 0x0718 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA312_StaticMeshComponent0;              // 0x0720 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA311_StaticMeshComponent0;              // 0x0728 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA310_StaticMeshComponent0;              // 0x0730 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA309_StaticMeshComponent0;              // 0x0738 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA308_StaticMeshComponent0;              // 0x0740 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise161_StaticMeshComponent0;              // 0x0748 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise160_StaticMeshComponent0;              // 0x0750 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise159_StaticMeshComponent0;              // 0x0758 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise158_StaticMeshComponent0;              // 0x0760 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise157_StaticMeshComponent0;              // 0x0768 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise156_StaticMeshComponent0;              // 0x0770 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise155_StaticMeshComponent0;              // 0x0778 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short370_StaticMeshComponent0;       // 0x0780 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short369_StaticMeshComponent0;       // 0x0788 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short368_StaticMeshComponent0;       // 0x0790 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short367_StaticMeshComponent0;       // 0x0798 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise139_StaticMeshComponent0;              // 0x07A0 (size: 0x8)
    class UStaticMeshComponent* pebbleWallDisplaced27_StaticMeshComponent0;           // 0x07A8 (size: 0x8)
    class UStaticMeshComponent* pebbleWallDisplaced26_StaticMeshComponent0;           // 0x07B0 (size: 0x8)
    class UStaticMeshComponent* pebbleWallDisplaced25_StaticMeshComponent0;           // 0x07B8 (size: 0x8)
    class UStaticMeshComponent* pebbleWallDisplaced21_StaticMeshComponent0;           // 0x07C0 (size: 0x8)
    class UStaticMeshComponent* pebbleWallDisplaced20_StaticMeshComponent0;           // 0x07C8 (size: 0x8)
    class UStaticMeshComponent* pebbleWallDisplaced19_StaticMeshComponent0;           // 0x07D0 (size: 0x8)
    class UStaticMeshComponent* pebbleWallDisplaced18_StaticMeshComponent0;           // 0x07D8 (size: 0x8)
    class UStaticMeshComponent* pebbleWallDisplaced17_StaticMeshComponent0;           // 0x07E0 (size: 0x8)
    class UStaticMeshComponent* pebbleWallDisplaced2_StaticMeshComponent0;            // 0x07E8 (size: 0x8)
    class UStaticMeshComponent* doorHeadA_angled2_StaticMeshComponent0;               // 0x07F0 (size: 0x8)
    class USceneComponent* SG_GranarySmol2_DefaultSceneRoot;                          // 0x07F8 (size: 0x8)

}; // Size: 0x800

#endif
