#ifndef UE4SS_SDK_C_SG_Merchant_Storage_HPP
#define UE4SS_SDK_C_SG_Merchant_Storage_HPP

class AC_SG_Merchant_Storage_C : public AConstructionBP_C
{
    class UStaticMeshComponent* SG_fillerBoardA373_StaticMeshComponent0;              // 0x0550 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA372_StaticMeshComponent0;              // 0x0558 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long_diagonalD81_StaticMeshComponent0; // 0x0560 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long_diagonalD80_StaticMeshComponent0; // 0x0568 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long_diagonalD79_StaticMeshComponent0; // 0x0570 (size: 0x8)
    class UStaticMeshComponent* fillerBoardTinyWindow28_StaticMeshComponent0;         // 0x0578 (size: 0x8)
    class UStaticMeshComponent* fillerBoardTinyWindow27_StaticMeshComponent0;         // 0x0580 (size: 0x8)
    class UStaticMeshComponent* fillerBoardTinyWindow26_StaticMeshComponent0;         // 0x0588 (size: 0x8)
    class UStaticMeshComponent* fillerBoardTinyWindow25_StaticMeshComponent0;         // 0x0590 (size: 0x8)
    class UStaticMeshComponent* fillerBoardTinyWindow24_StaticMeshComponent0;         // 0x0598 (size: 0x8)
    class UStaticMeshComponent* planeDenseTopBevel5_StaticMeshComponent0;             // 0x05A0 (size: 0x8)
    class UStaticMeshComponent* planeDenseBeveledA45_StaticMeshComponent0;            // 0x05A8 (size: 0x8)
    class UStaticMeshComponent* planeDenseTopBevel4_StaticMeshComponent0;             // 0x05B0 (size: 0x8)
    class UStaticMeshComponent* planeDenseBeveledA44_StaticMeshComponent0;            // 0x05B8 (size: 0x8)
    class UStaticMeshComponent* fillerBoardTinyWindow23_StaticMeshComponent0;         // 0x05C0 (size: 0x8)
    class UStaticMeshComponent* fillerBoardTinyWindow22_StaticMeshComponent0;         // 0x05C8 (size: 0x8)
    class UStaticMeshComponent* fillerBoardTinyWindow21_StaticMeshComponent0;         // 0x05D0 (size: 0x8)
    class UStaticMeshComponent* fillerBoardTinyWindow20_StaticMeshComponent0;         // 0x05D8 (size: 0x8)
    class UStaticMeshComponent* fillerBoardTinyWindow19_StaticMeshComponent0;         // 0x05E0 (size: 0x8)
    class UStaticMeshComponent* fillerBoardTinyWindow18_StaticMeshComponent0;         // 0x05E8 (size: 0x8)
    class UStaticMeshComponent* fillerBoardTinyWindow17_StaticMeshComponent0;         // 0x05F0 (size: 0x8)
    class UStaticMeshComponent* fillerBoardTinyWindow16_StaticMeshComponent0;         // 0x05F8 (size: 0x8)
    class UStaticMeshComponent* fillerBoardTinyWindow15_StaticMeshComponent0;         // 0x0600 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA371_StaticMeshComponent0;              // 0x0608 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA370_StaticMeshComponent0;              // 0x0610 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA369_StaticMeshComponent0;              // 0x0618 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA368_StaticMeshComponent0;              // 0x0620 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA367_StaticMeshComponent0;              // 0x0628 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA366_StaticMeshComponent0;              // 0x0630 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA365_StaticMeshComponent0;              // 0x0638 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise329_StaticMeshComponent0;              // 0x0640 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise328_StaticMeshComponent0;              // 0x0648 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise327_StaticMeshComponent0;              // 0x0650 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA364_StaticMeshComponent0;              // 0x0658 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA363_StaticMeshComponent0;              // 0x0660 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA362_StaticMeshComponent0;              // 0x0668 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA361_StaticMeshComponent0;              // 0x0670 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA360_StaticMeshComponent0;              // 0x0678 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA359_StaticMeshComponent0;              // 0x0680 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA358_StaticMeshComponent0;              // 0x0688 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA357_StaticMeshComponent0;              // 0x0690 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA356_StaticMeshComponent0;              // 0x0698 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA355_StaticMeshComponent0;              // 0x06A0 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA354_StaticMeshComponent0;              // 0x06A8 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA353_StaticMeshComponent0;              // 0x06B0 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA352_StaticMeshComponent0;              // 0x06B8 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA351_StaticMeshComponent0;              // 0x06C0 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA350_StaticMeshComponent0;              // 0x06C8 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA349_StaticMeshComponent0;              // 0x06D0 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA348_StaticMeshComponent0;              // 0x06D8 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA347_StaticMeshComponent0;              // 0x06E0 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA346_StaticMeshComponent0;              // 0x06E8 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA345_StaticMeshComponent0;              // 0x06F0 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA344_StaticMeshComponent0;              // 0x06F8 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA343_StaticMeshComponent0;              // 0x0700 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA342_StaticMeshComponent0;              // 0x0708 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA341_StaticMeshComponent0;              // 0x0710 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise326_StaticMeshComponent0;              // 0x0718 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise325_StaticMeshComponent0;              // 0x0720 (size: 0x8)
    class UStaticMeshComponent* owidzThatch_luv_packedCentered15_StaticMeshComponent0; // 0x0728 (size: 0x8)
    class UStaticMeshComponent* owidzThatch_luv_packedCentered14_StaticMeshComponent0; // 0x0730 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise324_StaticMeshComponent0;              // 0x0738 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise323_StaticMeshComponent0;              // 0x0740 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise322_StaticMeshComponent0;              // 0x0748 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise321_StaticMeshComponent0;              // 0x0750 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise320_StaticMeshComponent0;              // 0x0758 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise319_StaticMeshComponent0;              // 0x0760 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise318_StaticMeshComponent0;              // 0x0768 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise317_StaticMeshComponent0;              // 0x0770 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise316_StaticMeshComponent0;              // 0x0778 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise315_StaticMeshComponent0;              // 0x0780 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise314_StaticMeshComponent0;              // 0x0788 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise313_StaticMeshComponent0;              // 0x0790 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise312_StaticMeshComponent0;              // 0x0798 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise311_StaticMeshComponent0;              // 0x07A0 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise310_StaticMeshComponent0;              // 0x07A8 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise309_StaticMeshComponent0;              // 0x07B0 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise308_StaticMeshComponent0;              // 0x07B8 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise307_StaticMeshComponent0;              // 0x07C0 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise306_StaticMeshComponent0;              // 0x07C8 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise305_StaticMeshComponent0;              // 0x07D0 (size: 0x8)
    class UStaticMeshComponent* pebbleWallDisplaced46_StaticMeshComponent0;           // 0x07D8 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise304_StaticMeshComponent0;              // 0x07E0 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise303_StaticMeshComponent0;              // 0x07E8 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise302_StaticMeshComponent0;              // 0x07F0 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise301_StaticMeshComponent0;              // 0x07F8 (size: 0x8)
    class UStaticMeshComponent* pebbleWallDisplaced45_StaticMeshComponent0;           // 0x0800 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise300_StaticMeshComponent0;              // 0x0808 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise299_StaticMeshComponent0;              // 0x0810 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise298_StaticMeshComponent0;              // 0x0818 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise267_StaticMeshComponent0;              // 0x0820 (size: 0x8)
    class UStaticMeshComponent* pebbleWallDisplaced44_StaticMeshComponent0;           // 0x0828 (size: 0x8)
    class UStaticMeshComponent* pebbleWallDisplaced43_StaticMeshComponent0;           // 0x0830 (size: 0x8)
    class UStaticMeshComponent* pebbleWallDisplaced42_StaticMeshComponent0;           // 0x0838 (size: 0x8)
    class UStaticMeshComponent* pebbleWallDisplaced41_StaticMeshComponent0;           // 0x0840 (size: 0x8)
    class UStaticMeshComponent* pebbleWallDisplaced40_StaticMeshComponent0;           // 0x0848 (size: 0x8)
    class UStaticMeshComponent* pebbleWallDisplaced39_StaticMeshComponent0;           // 0x0850 (size: 0x8)
    class UStaticMeshComponent* pebbleWallDisplaced38_StaticMeshComponent0;           // 0x0858 (size: 0x8)
    class UStaticMeshComponent* pebbleWallDisplaced37_StaticMeshComponent0;           // 0x0860 (size: 0x8)
    class UStaticMeshComponent* pebbleWallDisplaced36_StaticMeshComponent0;           // 0x0868 (size: 0x8)
    class USceneComponent* sg_merchant_storehouse2_DefaultSceneRoot;                  // 0x0870 (size: 0x8)

}; // Size: 0x878

#endif
