#ifndef UE4SS_SDK_C_SG_Cottage_LV2_A_UBeam_HPP
#define UE4SS_SDK_C_SG_Cottage_LV2_A_UBeam_HPP

class AC_SG_Cottage_LV2_A_UBeam_C : public AConstructionBP_C
{
    class UStaticMeshComponent* UBeam_FillerBoard_Slits_Full62_StaticMeshComponent0;  // 0x0550 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoard_Slits_Full61_StaticMeshComponent0;  // 0x0558 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoard_Slits_Full60_StaticMeshComponent0;  // 0x0560 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoard_Slits_Full59_StaticMeshComponent0;  // 0x0568 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoard_Slits_Full58_StaticMeshComponent0;  // 0x0570 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoard_Slits_Full57_StaticMeshComponent0;  // 0x0578 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoard_Slits_Full56_StaticMeshComponent0;  // 0x0580 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoard_Slits_Full55_StaticMeshComponent0;  // 0x0588 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoard_Slits_Full54_StaticMeshComponent0;  // 0x0590 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoard_Slits_Full53_StaticMeshComponent0;  // 0x0598 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoard_Slits_Full52_StaticMeshComponent0;  // 0x05A0 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoard_Slits_Full51_StaticMeshComponent0;  // 0x05A8 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoard_Slits_Full50_StaticMeshComponent0;  // 0x05B0 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoard_Slits_Full49_StaticMeshComponent0;  // 0x05B8 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoard_Slits_Full48_StaticMeshComponent0;  // 0x05C0 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoard_Slits_Full47_StaticMeshComponent0;  // 0x05C8 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoard_Slits_Full46_StaticMeshComponent0;  // 0x05D0 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoard_Slits_Full45_StaticMeshComponent0;  // 0x05D8 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoard_Slits_Full44_StaticMeshComponent0;  // 0x05E0 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoard_Slits_Full43_StaticMeshComponent0;  // 0x05E8 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoard_Slits_Full42_StaticMeshComponent0;  // 0x05F0 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoard_Slits_Full41_StaticMeshComponent0;  // 0x05F8 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoard_Slits_Full40_StaticMeshComponent0;  // 0x0600 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoard_Slits_Full39_StaticMeshComponent0;  // 0x0608 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoard_Slits_Full38_StaticMeshComponent0;  // 0x0610 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoard_Slits_Full37_StaticMeshComponent0;  // 0x0618 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoard_Slits_Full36_StaticMeshComponent0;  // 0x0620 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoard_Slits_Full35_StaticMeshComponent0;  // 0x0628 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoard_Slits_Full34_StaticMeshComponent0;  // 0x0630 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoard_Slits_Full33_StaticMeshComponent0;  // 0x0638 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoard_Slits_Full32_StaticMeshComponent0;  // 0x0640 (size: 0x8)
    class UStaticMeshComponent* Cube4_StaticMeshComponent0;                           // 0x0648 (size: 0x8)
    class UStaticMeshComponent* Foundation_DoorStepStoneFlat2_StaticMeshComponent0;   // 0x0650 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_TwoWindowsStandard_Wide8_StaticMeshComponent0; // 0x0658 (size: 0x8)
    class UStaticMeshComponent* Cube3_StaticMeshComponent0;                           // 0x0660 (size: 0x8)
    class UStaticMeshComponent* foundation_cottage_lv2_A_UBeam2_StaticMeshComponent0; // 0x0668 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m470_StaticMeshComponent0;                // 0x0670 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m469_StaticMeshComponent0;                // 0x0678 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m468_StaticMeshComponent0;                // 0x0680 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m467_StaticMeshComponent0;                // 0x0688 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m466_StaticMeshComponent0;                // 0x0690 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m465_StaticMeshComponent0;                // 0x0698 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m464_StaticMeshComponent0;                // 0x06A0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m463_StaticMeshComponent0;                // 0x06A8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m462_StaticMeshComponent0;                // 0x06B0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m461_StaticMeshComponent0;                // 0x06B8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m460_StaticMeshComponent0;                // 0x06C0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m459_StaticMeshComponent0;                // 0x06C8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m458_StaticMeshComponent0;                // 0x06D0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m457_StaticMeshComponent0;                // 0x06D8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m456_StaticMeshComponent0;                // 0x06E0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m455_StaticMeshComponent0;                // 0x06E8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m454_StaticMeshComponent0;                // 0x06F0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m453_StaticMeshComponent0;                // 0x06F8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam_DiagonalG29_StaticMeshComponent0;         // 0x0700 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m452_StaticMeshComponent0;                // 0x0708 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m451_StaticMeshComponent0;                // 0x0710 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m450_StaticMeshComponent0;                // 0x0718 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m449_StaticMeshComponent0;                // 0x0720 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m448_StaticMeshComponent0;                // 0x0728 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m447_StaticMeshComponent0;                // 0x0730 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m446_StaticMeshComponent0;                // 0x0738 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m445_StaticMeshComponent0;                // 0x0740 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m444_StaticMeshComponent0;                // 0x0748 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m443_StaticMeshComponent0;                // 0x0750 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m442_StaticMeshComponent0;                // 0x0758 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m441_StaticMeshComponent0;                // 0x0760 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m411_StaticMeshComponent0;                // 0x0768 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m410_StaticMeshComponent0;                // 0x0770 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m409_StaticMeshComponent0;                // 0x0778 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m408_StaticMeshComponent0;                // 0x0780 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m407_StaticMeshComponent0;                // 0x0788 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m406_StaticMeshComponent0;                // 0x0790 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m405_StaticMeshComponent0;                // 0x0798 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m404_StaticMeshComponent0;                // 0x07A0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m403_StaticMeshComponent0;                // 0x07A8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m402_StaticMeshComponent0;                // 0x07B0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m335_StaticMeshComponent0;                // 0x07B8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m440_StaticMeshComponent0;                // 0x07C0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m437_StaticMeshComponent0;                // 0x07C8 (size: 0x8)
    class UStaticMeshComponent* sg_shutterA_short21_StaticMeshComponent0;             // 0x07D0 (size: 0x8)
    class UStaticMeshComponent* sg_shutterA_short20_StaticMeshComponent0;             // 0x07D8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m401_StaticMeshComponent0;                // 0x07E0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m400_StaticMeshComponent0;                // 0x07E8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m399_StaticMeshComponent0;                // 0x07F0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m398_StaticMeshComponent0;                // 0x07F8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m397_StaticMeshComponent0;                // 0x0800 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m396_StaticMeshComponent0;                // 0x0808 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam_DiagonalG34_StaticMeshComponent0;         // 0x0810 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m439_StaticMeshComponent0;                // 0x0818 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m395_StaticMeshComponent0;                // 0x0820 (size: 0x8)
    class UStaticMeshComponent* sg_shutterA_short19_StaticMeshComponent0;             // 0x0828 (size: 0x8)
    class UStaticMeshComponent* sg_shutterA_short18_StaticMeshComponent0;             // 0x0830 (size: 0x8)
    class UStaticMeshComponent* WoodenRoof_BakedDisplacement106_StaticMeshComponent0; // 0x0838 (size: 0x8)
    class UStaticMeshComponent* WoodenRoof_BakedDisplacement105_StaticMeshComponent0; // 0x0840 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam_DiagonalG28_StaticMeshComponent0;         // 0x0848 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam_DiagonalG27_StaticMeshComponent0;         // 0x0850 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam_DiagonalG25_StaticMeshComponent0;         // 0x0858 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m436_StaticMeshComponent0;                // 0x0860 (size: 0x8)
    class UStaticMeshComponent* windowGlass8_StaticMeshComponent0;                    // 0x0868 (size: 0x8)
    class UStaticMeshComponent* windowGlass7_StaticMeshComponent0;                    // 0x0870 (size: 0x8)
    class UStaticMeshComponent* sg_shutterA_short13_StaticMeshComponent0;             // 0x0878 (size: 0x8)
    class UStaticMeshComponent* sg_shutterA_short12_StaticMeshComponent0;             // 0x0880 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m435_StaticMeshComponent0;                // 0x0888 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m434_StaticMeshComponent0;                // 0x0890 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m433_StaticMeshComponent0;                // 0x0898 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m432_StaticMeshComponent0;                // 0x08A0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m431_StaticMeshComponent0;                // 0x08A8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m430_StaticMeshComponent0;                // 0x08B0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m429_StaticMeshComponent0;                // 0x08B8 (size: 0x8)
    class UStaticMeshComponent* windowGlass6_StaticMeshComponent0;                    // 0x08C0 (size: 0x8)
    class UStaticMeshComponent* windowGlass5_StaticMeshComponent0;                    // 0x08C8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam_DiagonalG24_StaticMeshComponent0;         // 0x08D0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m428_StaticMeshComponent0;                // 0x08D8 (size: 0x8)
    class UStaticMeshComponent* owidzWattleTrimmed104_StaticMeshComponent0;           // 0x08E0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m394_StaticMeshComponent0;                // 0x08E8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m393_StaticMeshComponent0;                // 0x08F0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m392_StaticMeshComponent0;                // 0x08F8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m391_StaticMeshComponent0;                // 0x0900 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m390_StaticMeshComponent0;                // 0x0908 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m389_StaticMeshComponent0;                // 0x0910 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m388_StaticMeshComponent0;                // 0x0918 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m387_StaticMeshComponent0;                // 0x0920 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m386_StaticMeshComponent0;                // 0x0928 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m385_StaticMeshComponent0;                // 0x0930 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m384_StaticMeshComponent0;                // 0x0938 (size: 0x8)
    class UStaticMeshComponent* PlaneDenseWindowSlotsA_v2_Bevel8_StaticMeshComponent0; // 0x0940 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam_DiagonalG19_StaticMeshComponent0;         // 0x0948 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m383_StaticMeshComponent0;                // 0x0950 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m334_StaticMeshComponent0;                // 0x0958 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam_DiagonalG17_StaticMeshComponent0;         // 0x0960 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam_DiagonalG16_StaticMeshComponent0;         // 0x0968 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m333_StaticMeshComponent0;                // 0x0970 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m332_StaticMeshComponent0;                // 0x0978 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m331_StaticMeshComponent0;                // 0x0980 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m330_StaticMeshComponent0;                // 0x0988 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m329_StaticMeshComponent0;                // 0x0990 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg122_StaticMeshComponent0;    // 0x0998 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg121_StaticMeshComponent0;    // 0x09A0 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg120_StaticMeshComponent0;    // 0x09A8 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg119_StaticMeshComponent0;    // 0x09B0 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg118_StaticMeshComponent0;    // 0x09B8 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg117_StaticMeshComponent0;    // 0x09C0 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg116_StaticMeshComponent0;    // 0x09C8 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg115_StaticMeshComponent0;    // 0x09D0 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg114_StaticMeshComponent0;    // 0x09D8 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg113_StaticMeshComponent0;    // 0x09E0 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg112_StaticMeshComponent0;    // 0x09E8 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg111_StaticMeshComponent0;    // 0x09F0 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg110_StaticMeshComponent0;    // 0x09F8 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg109_StaticMeshComponent0;    // 0x0A00 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg108_StaticMeshComponent0;    // 0x0A08 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg107_StaticMeshComponent0;    // 0x0A10 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg106_StaticMeshComponent0;    // 0x0A18 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg105_StaticMeshComponent0;    // 0x0A20 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg104_StaticMeshComponent0;    // 0x0A28 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg103_StaticMeshComponent0;    // 0x0A30 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg102_StaticMeshComponent0;    // 0x0A38 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg101_StaticMeshComponent0;    // 0x0A40 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg100_StaticMeshComponent0;    // 0x0A48 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg99_StaticMeshComponent0;     // 0x0A50 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg98_StaticMeshComponent0;     // 0x0A58 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg97_StaticMeshComponent0;     // 0x0A60 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg96_StaticMeshComponent0;     // 0x0A68 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg95_StaticMeshComponent0;     // 0x0A70 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg94_StaticMeshComponent0;     // 0x0A78 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg93_StaticMeshComponent0;     // 0x0A80 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg92_StaticMeshComponent0;     // 0x0A88 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg91_StaticMeshComponent0;     // 0x0A90 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg90_StaticMeshComponent0;     // 0x0A98 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg89_StaticMeshComponent0;     // 0x0AA0 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg88_StaticMeshComponent0;     // 0x0AA8 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg87_StaticMeshComponent0;     // 0x0AB0 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg86_StaticMeshComponent0;     // 0x0AB8 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg85_StaticMeshComponent0;     // 0x0AC0 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg84_StaticMeshComponent0;     // 0x0AC8 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg83_StaticMeshComponent0;     // 0x0AD0 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg82_StaticMeshComponent0;     // 0x0AD8 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg81_StaticMeshComponent0;     // 0x0AE0 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg80_StaticMeshComponent0;     // 0x0AE8 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg79_StaticMeshComponent0;     // 0x0AF0 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg78_StaticMeshComponent0;     // 0x0AF8 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg77_StaticMeshComponent0;     // 0x0B00 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg76_StaticMeshComponent0;     // 0x0B08 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg75_StaticMeshComponent0;     // 0x0B10 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg74_StaticMeshComponent0;     // 0x0B18 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg73_StaticMeshComponent0;     // 0x0B20 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg72_StaticMeshComponent0;     // 0x0B28 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg71_StaticMeshComponent0;     // 0x0B30 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg70_StaticMeshComponent0;     // 0x0B38 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg69_StaticMeshComponent0;     // 0x0B40 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg68_StaticMeshComponent0;     // 0x0B48 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg67_StaticMeshComponent0;     // 0x0B50 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg66_StaticMeshComponent0;     // 0x0B58 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg65_StaticMeshComponent0;     // 0x0B60 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg64_StaticMeshComponent0;     // 0x0B68 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg63_StaticMeshComponent0;     // 0x0B70 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg62_StaticMeshComponent0;     // 0x0B78 (size: 0x8)
    class UStaticMeshComponent* UBeam_GableSimpleA2_StaticMeshComponent0;             // 0x0B80 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Corner8_StaticMeshComponent0;              // 0x0B88 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Corner7_StaticMeshComponent0;              // 0x0B90 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_TwoWindowsStandard_Wide7_StaticMeshComponent0; // 0x0B98 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_57_StaticMeshComponent0;               // 0x0BA0 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_56_StaticMeshComponent0;               // 0x0BA8 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Standard2_StaticMeshComponent0;            // 0x0BB0 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_TwoWindowsStandard8_StaticMeshComponent0;  // 0x0BB8 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_TwoWindowsStandard7_StaticMeshComponent0;  // 0x0BC0 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_StandardSingleWindow4_StaticMeshComponent0; // 0x0BC8 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_55_StaticMeshComponent0;               // 0x0BD0 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_54_StaticMeshComponent0;               // 0x0BD8 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_53_StaticMeshComponent0;               // 0x0BE0 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_52_StaticMeshComponent0;               // 0x0BE8 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_51_StaticMeshComponent0;               // 0x0BF0 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_50_StaticMeshComponent0;               // 0x0BF8 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_49_StaticMeshComponent0;               // 0x0C00 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_48_StaticMeshComponent0;               // 0x0C08 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_47_StaticMeshComponent0;               // 0x0C10 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_46_StaticMeshComponent0;               // 0x0C18 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_45_StaticMeshComponent0;               // 0x0C20 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_44_StaticMeshComponent0;               // 0x0C28 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_TwoWindowsStandard_Wide6_StaticMeshComponent0; // 0x0C30 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_43_StaticMeshComponent0;               // 0x0C38 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_42_StaticMeshComponent0;               // 0x0C40 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_41_StaticMeshComponent0;               // 0x0C48 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_TwoWindowsStandard6_StaticMeshComponent0;  // 0x0C50 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_40_StaticMeshComponent0;               // 0x0C58 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_39_StaticMeshComponent0;               // 0x0C60 (size: 0x8)
    class UStaticMeshComponent* UBeam_DoorHeadA2_StaticMeshComponent0;                // 0x0C68 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_38_StaticMeshComponent0;               // 0x0C70 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_StandardSingleWindow3_StaticMeshComponent0; // 0x0C78 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_37_StaticMeshComponent0;               // 0x0C80 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_TwoWindowsStandard_Wide5_StaticMeshComponent0; // 0x0C88 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Corner6_StaticMeshComponent0;              // 0x0C90 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Corner5_StaticMeshComponent0;              // 0x0C98 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_36_StaticMeshComponent0;               // 0x0CA0 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_35_StaticMeshComponent0;               // 0x0CA8 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_TwoWindowsStandard5_StaticMeshComponent0;  // 0x0CB0 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_34_StaticMeshComponent0;               // 0x0CB8 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_33_StaticMeshComponent0;               // 0x0CC0 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_32_StaticMeshComponent0;               // 0x0CC8 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_31_StaticMeshComponent0;               // 0x0CD0 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_30_StaticMeshComponent0;               // 0x0CD8 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_29_StaticMeshComponent0;               // 0x0CE0 (size: 0x8)
    class USceneComponent* SG_Cottage_Lv2_A_Ubeam2_DefaultSceneRoot;                  // 0x0CE8 (size: 0x8)

}; // Size: 0xCF0

#endif
