#ifndef UE4SS_SDK_C_SG_TaxCollectorProper_HPP
#define UE4SS_SDK_C_SG_TaxCollectorProper_HPP

class AC_SG_TaxCollectorProper_C : public AConstructionBP_C
{
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly96_StaticMeshComponent0;    // 0x0550 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly95_StaticMeshComponent0;    // 0x0558 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly94_StaticMeshComponent0;    // 0x0560 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly93_StaticMeshComponent0;    // 0x0568 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly92_StaticMeshComponent0;    // 0x0570 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly91_StaticMeshComponent0;    // 0x0578 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly90_StaticMeshComponent0;    // 0x0580 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly89_StaticMeshComponent0;    // 0x0588 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly88_StaticMeshComponent0;    // 0x0590 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly87_StaticMeshComponent0;    // 0x0598 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly86_StaticMeshComponent0;    // 0x05A0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly85_StaticMeshComponent0;    // 0x05A8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly84_StaticMeshComponent0;    // 0x05B0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly83_StaticMeshComponent0;    // 0x05B8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly82_StaticMeshComponent0;    // 0x05C0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly81_StaticMeshComponent0;    // 0x05C8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly80_StaticMeshComponent0;    // 0x05D0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly79_StaticMeshComponent0;    // 0x05D8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly78_StaticMeshComponent0;    // 0x05E0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly77_StaticMeshComponent0;    // 0x05E8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly76_StaticMeshComponent0;    // 0x05F0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly75_StaticMeshComponent0;    // 0x05F8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly74_StaticMeshComponent0;    // 0x0600 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly73_StaticMeshComponent0;    // 0x0608 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly72_StaticMeshComponent0;    // 0x0610 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly71_StaticMeshComponent0;    // 0x0618 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly70_StaticMeshComponent0;    // 0x0620 (size: 0x8)
    class UStaticMeshComponent* planeDenseBeveledA40_StaticMeshComponent0;            // 0x0628 (size: 0x8)
    class UStaticMeshComponent* DormerWindowPremade_V4_StaticMeshComponent0;          // 0x0630 (size: 0x8)
    class UStaticMeshComponent* DormerWindowPremade_V3_StaticMeshComponent0;          // 0x0638 (size: 0x8)
    class UStaticMeshComponent* roofSingleDisplaced_cutdownTiny2_StaticMeshComponent0; // 0x0640 (size: 0x8)
    class UStaticMeshComponent* quoinB_luv2_StaticMeshComponent0;                     // 0x0648 (size: 0x8)
    class UStaticMeshComponent* SG_SmallGlassWindowA8_StaticMeshComponent0;           // 0x0650 (size: 0x8)
    class UStaticMeshComponent* SG_SmallGlassWindowA7_StaticMeshComponent0;           // 0x0658 (size: 0x8)
    class UStaticMeshComponent* SG_SmallGlassWindowA6_StaticMeshComponent0;           // 0x0660 (size: 0x8)
    class UStaticMeshComponent* SG_SmallGlassWindowA5_StaticMeshComponent0;           // 0x0668 (size: 0x8)
    class UStaticMeshComponent* sg_chimneyTop2_StaticMeshComponent0;                  // 0x0670 (size: 0x8)
    class UStaticMeshComponent* ChimneyLP2_StaticMeshComponent0;                      // 0x0678 (size: 0x8)
    class UStaticMeshComponent* PlaneDenseCorner12_StaticMeshComponent0;              // 0x0680 (size: 0x8)
    class UStaticMeshComponent* PlaneDenseCorner11_StaticMeshComponent0;              // 0x0688 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardB_thin32_StaticMeshComponent0;          // 0x0690 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardB_thin31_StaticMeshComponent0;          // 0x0698 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardC_thinner18_StaticMeshComponent0;       // 0x06A0 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardB_thin30_StaticMeshComponent0;          // 0x06A8 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardC_thinner17_StaticMeshComponent0;       // 0x06B0 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardB_thin29_StaticMeshComponent0;          // 0x06B8 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardC_thinner16_StaticMeshComponent0;       // 0x06C0 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardB_thin28_StaticMeshComponent0;          // 0x06C8 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardB_thin27_StaticMeshComponent0;          // 0x06D0 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardB_thin26_StaticMeshComponent0;          // 0x06D8 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardB_thin25_StaticMeshComponent0;          // 0x06E0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam1_5m_orSth36_StaticMeshComponent0;         // 0x06E8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam1_5m_orSth35_StaticMeshComponent0;         // 0x06F0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam1_5m_orSth34_StaticMeshComponent0;         // 0x06F8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam1_5m_orSth33_StaticMeshComponent0;         // 0x0700 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_42_StaticMeshComponent0; // 0x0708 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_41_StaticMeshComponent0; // 0x0710 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long102_StaticMeshComponent0;        // 0x0718 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long101_StaticMeshComponent0;        // 0x0720 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long100_StaticMeshComponent0;        // 0x0728 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short16_StaticMeshComponent0;        // 0x0730 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short15_StaticMeshComponent0;        // 0x0738 (size: 0x8)
    class UStaticMeshComponent* foundationTiling_A_detailed34_StaticMeshComponent0;   // 0x0740 (size: 0x8)
    class UStaticMeshComponent* foundationTiling_A_detailed33_StaticMeshComponent0;   // 0x0748 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise22_StaticMeshComponent0;               // 0x0750 (size: 0x8)
    class UStaticMeshComponent* roofMerchantDisp2_StaticMeshComponent0;               // 0x0758 (size: 0x8)
    class UStaticMeshComponent* sg_shutterA_short12_StaticMeshComponent0;             // 0x0760 (size: 0x8)
    class UStaticMeshComponent* sg_shutterA_short11_StaticMeshComponent0;             // 0x0768 (size: 0x8)
    class UStaticMeshComponent* sg_shutterA_short10_StaticMeshComponent0;             // 0x0770 (size: 0x8)
    class UStaticMeshComponent* sg_shutterA_short9_StaticMeshComponent0;              // 0x0778 (size: 0x8)
    class UStaticMeshComponent* sg_shutterA_short8_StaticMeshComponent0;              // 0x0780 (size: 0x8)
    class UStaticMeshComponent* sg_shutterA_short7_StaticMeshComponent0;              // 0x0788 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly69_StaticMeshComponent0;    // 0x0790 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly68_StaticMeshComponent0;    // 0x0798 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly67_StaticMeshComponent0;    // 0x07A0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly66_StaticMeshComponent0;    // 0x07A8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly65_StaticMeshComponent0;    // 0x07B0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly64_StaticMeshComponent0;    // 0x07B8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly63_StaticMeshComponent0;    // 0x07C0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly62_StaticMeshComponent0;    // 0x07C8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly61_StaticMeshComponent0;    // 0x07D0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly60_StaticMeshComponent0;    // 0x07D8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly59_StaticMeshComponent0;    // 0x07E0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly58_StaticMeshComponent0;    // 0x07E8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly57_StaticMeshComponent0;    // 0x07F0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly56_StaticMeshComponent0;    // 0x07F8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly55_StaticMeshComponent0;    // 0x0800 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly54_StaticMeshComponent0;    // 0x0808 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly53_StaticMeshComponent0;    // 0x0810 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly52_StaticMeshComponent0;    // 0x0818 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly51_StaticMeshComponent0;    // 0x0820 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly50_StaticMeshComponent0;    // 0x0828 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly49_StaticMeshComponent0;    // 0x0830 (size: 0x8)
    class UStaticMeshComponent* planeDenseBeveledA39_StaticMeshComponent0;            // 0x0838 (size: 0x8)
    class UStaticMeshComponent* PlaneDenseCorner10_StaticMeshComponent0;              // 0x0840 (size: 0x8)
    class UStaticMeshComponent* planeDenseBeveledA38_StaticMeshComponent0;            // 0x0848 (size: 0x8)
    class UStaticMeshComponent* planeDenseBeveledA37_StaticMeshComponent0;            // 0x0850 (size: 0x8)
    class UStaticMeshComponent* PlaneDenseCorner9_StaticMeshComponent0;               // 0x0858 (size: 0x8)
    class UStaticMeshComponent* planeDenseBeveledA36_StaticMeshComponent0;            // 0x0860 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long99_StaticMeshComponent0;         // 0x0868 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long98_StaticMeshComponent0;         // 0x0870 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam1_5m_orSth32_StaticMeshComponent0;         // 0x0878 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam1_5m_orSth31_StaticMeshComponent0;         // 0x0880 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam1_5m_orSth30_StaticMeshComponent0;         // 0x0888 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long97_StaticMeshComponent0;         // 0x0890 (size: 0x8)
    class UStaticMeshComponent* PlaneDenseCorner8_StaticMeshComponent0;               // 0x0898 (size: 0x8)
    class UStaticMeshComponent* planeDenseBeveledA35_StaticMeshComponent0;            // 0x08A0 (size: 0x8)
    class UStaticMeshComponent* planeDenseBeveledA34_StaticMeshComponent0;            // 0x08A8 (size: 0x8)
    class UStaticMeshComponent* planeDenseBeveledA33_StaticMeshComponent0;            // 0x08B0 (size: 0x8)
    class UStaticMeshComponent* PlaneDenseCorner7_StaticMeshComponent0;               // 0x08B8 (size: 0x8)
    class UStaticMeshComponent* planeDenseBeveledA32_StaticMeshComponent0;            // 0x08C0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long96_StaticMeshComponent0;         // 0x08C8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long95_StaticMeshComponent0;         // 0x08D0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam1_5m_orSth29_StaticMeshComponent0;         // 0x08D8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam1_5m_orSth28_StaticMeshComponent0;         // 0x08E0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam1_5m_orSth27_StaticMeshComponent0;         // 0x08E8 (size: 0x8)
    class UStaticMeshComponent* planeDenseBeveledA31_StaticMeshComponent0;            // 0x08F0 (size: 0x8)
    class UStaticMeshComponent* planeDenseBeveledA30_StaticMeshComponent0;            // 0x08F8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long94_StaticMeshComponent0;         // 0x0900 (size: 0x8)
    class UStaticMeshComponent* planeDenseBeveledA29_StaticMeshComponent0;            // 0x0908 (size: 0x8)
    class UStaticMeshComponent* planeDenseBeveledA28_StaticMeshComponent0;            // 0x0910 (size: 0x8)
    class UStaticMeshComponent* planeDenseBeveledA27_StaticMeshComponent0;            // 0x0918 (size: 0x8)
    class UStaticMeshComponent* planeDenseBeveledA26_StaticMeshComponent0;            // 0x0920 (size: 0x8)
    class UStaticMeshComponent* planeDenseBeveledA25_StaticMeshComponent0;            // 0x0928 (size: 0x8)
    class UStaticMeshComponent* planeDenseBeveledA24_StaticMeshComponent0;            // 0x0930 (size: 0x8)
    class UStaticMeshComponent* planeDenseBeveledA23_StaticMeshComponent0;            // 0x0938 (size: 0x8)
    class UStaticMeshComponent* planeDenseBeveledA22_StaticMeshComponent0;            // 0x0940 (size: 0x8)
    class UStaticMeshComponent* planeDenseBeveledA21_StaticMeshComponent0;            // 0x0948 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam1_5m_orSth26_StaticMeshComponent0;         // 0x0950 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam1_5m_orSth25_StaticMeshComponent0;         // 0x0958 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam1_5m_orSth24_StaticMeshComponent0;         // 0x0960 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam1_5m_orSth23_StaticMeshComponent0;         // 0x0968 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long93_StaticMeshComponent0;         // 0x0970 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long92_StaticMeshComponent0;         // 0x0978 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long91_StaticMeshComponent0;         // 0x0980 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam1_5m_orSth22_StaticMeshComponent0;         // 0x0988 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam1_5m_orSth21_StaticMeshComponent0;         // 0x0990 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam1_5m_orSth20_StaticMeshComponent0;         // 0x0998 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam1_5m_orSth19_StaticMeshComponent0;         // 0x09A0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long90_StaticMeshComponent0;         // 0x09A8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long89_StaticMeshComponent0;         // 0x09B0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long88_StaticMeshComponent0;         // 0x09B8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long87_StaticMeshComponent0;         // 0x09C0 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardB_thin24_StaticMeshComponent0;          // 0x09C8 (size: 0x8)
    class UStaticMeshComponent* sg_fillerBoard_RoundedWindowsOnlyTwo2_StaticMeshComponent0; // 0x09D0 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardB_thin23_StaticMeshComponent0;          // 0x09D8 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardB_thin22_StaticMeshComponent0;          // 0x09E0 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardC_thinner15_StaticMeshComponent0;       // 0x09E8 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardC_thinner14_StaticMeshComponent0;       // 0x09F0 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardB_thin21_StaticMeshComponent0;          // 0x09F8 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardC_thinner13_StaticMeshComponent0;       // 0x0A00 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardB_thin16_StaticMeshComponent0;          // 0x0A08 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardB_thin15_StaticMeshComponent0;          // 0x0A10 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardC_thinner10_StaticMeshComponent0;       // 0x0A18 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardC_thinner8_StaticMeshComponent0;        // 0x0A20 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardB_thin14_StaticMeshComponent0;          // 0x0A28 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardC_thinner7_StaticMeshComponent0;        // 0x0A30 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardB_thin9_StaticMeshComponent0;           // 0x0A38 (size: 0x8)
    class UStaticMeshComponent* sg_fillerBoard_RoundedWindows2_StaticMeshComponent0;  // 0x0A40 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_doorHead_A_SpikyTop2_StaticMeshComponent0; // 0x0A48 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long86_StaticMeshComponent0;         // 0x0A50 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long85_StaticMeshComponent0;         // 0x0A58 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long84_StaticMeshComponent0;         // 0x0A60 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_40_StaticMeshComponent0; // 0x0A68 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_39_StaticMeshComponent0; // 0x0A70 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long83_StaticMeshComponent0;         // 0x0A78 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long82_StaticMeshComponent0;         // 0x0A80 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long81_StaticMeshComponent0;         // 0x0A88 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_38_StaticMeshComponent0; // 0x0A90 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_37_StaticMeshComponent0; // 0x0A98 (size: 0x8)
    class UStaticMeshComponent* sg_woodenGableA2_StaticMeshComponent0;                // 0x0AA0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long80_StaticMeshComponent0;         // 0x0AA8 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Tapered_Cut36_StaticMeshComponent0;         // 0x0AB0 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Tapered_Cut35_StaticMeshComponent0;         // 0x0AB8 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Tapered_Cut34_StaticMeshComponent0;         // 0x0AC0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long79_StaticMeshComponent0;         // 0x0AC8 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Tapered_Cut33_StaticMeshComponent0;         // 0x0AD0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long78_StaticMeshComponent0;         // 0x0AD8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long77_StaticMeshComponent0;         // 0x0AE0 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Tapered_Cut32_StaticMeshComponent0;         // 0x0AE8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long76_StaticMeshComponent0;         // 0x0AF0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long75_StaticMeshComponent0;         // 0x0AF8 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Tapered_Cut31_StaticMeshComponent0;         // 0x0B00 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long74_StaticMeshComponent0;         // 0x0B08 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long73_StaticMeshComponent0;         // 0x0B10 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Tapered_Cut30_StaticMeshComponent0;         // 0x0B18 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long72_StaticMeshComponent0;         // 0x0B20 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long71_StaticMeshComponent0;         // 0x0B28 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Tapered_Cut29_StaticMeshComponent0;         // 0x0B30 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long70_StaticMeshComponent0;         // 0x0B38 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long69_StaticMeshComponent0;         // 0x0B40 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Tapered_Cut28_StaticMeshComponent0;         // 0x0B48 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long68_StaticMeshComponent0;         // 0x0B50 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long67_StaticMeshComponent0;         // 0x0B58 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Tapered_Cut27_StaticMeshComponent0;         // 0x0B60 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long66_StaticMeshComponent0;         // 0x0B68 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long65_StaticMeshComponent0;         // 0x0B70 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Tapered_Cut26_StaticMeshComponent0;         // 0x0B78 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long64_StaticMeshComponent0;         // 0x0B80 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long63_StaticMeshComponent0;         // 0x0B88 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Tapered_Cut25_StaticMeshComponent0;         // 0x0B90 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long62_StaticMeshComponent0;         // 0x0B98 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long61_StaticMeshComponent0;         // 0x0BA0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long60_StaticMeshComponent0;         // 0x0BA8 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Tapered_Cut24_StaticMeshComponent0;         // 0x0BB0 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_36_StaticMeshComponent0; // 0x0BB8 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_35_StaticMeshComponent0; // 0x0BC0 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_34_StaticMeshComponent0; // 0x0BC8 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_33_StaticMeshComponent0; // 0x0BD0 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise21_StaticMeshComponent0;               // 0x0BD8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long59_StaticMeshComponent0;         // 0x0BE0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long58_StaticMeshComponent0;         // 0x0BE8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long57_StaticMeshComponent0;         // 0x0BF0 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_32_StaticMeshComponent0; // 0x0BF8 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_31_StaticMeshComponent0; // 0x0C00 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_30_StaticMeshComponent0; // 0x0C08 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_29_StaticMeshComponent0; // 0x0C10 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_28_StaticMeshComponent0; // 0x0C18 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_27_StaticMeshComponent0; // 0x0C20 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_26_StaticMeshComponent0; // 0x0C28 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_25_StaticMeshComponent0; // 0x0C30 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_24_StaticMeshComponent0; // 0x0C38 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long56_StaticMeshComponent0;         // 0x0C40 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long55_StaticMeshComponent0;         // 0x0C48 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_23_StaticMeshComponent0; // 0x0C50 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_22_StaticMeshComponent0; // 0x0C58 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_21_StaticMeshComponent0; // 0x0C60 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_20_StaticMeshComponent0; // 0x0C68 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long54_StaticMeshComponent0;         // 0x0C70 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long53_StaticMeshComponent0;         // 0x0C78 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Tapered_Cut23_StaticMeshComponent0;         // 0x0C80 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Tapered_Cut22_StaticMeshComponent0;         // 0x0C88 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Tapered_Cut21_StaticMeshComponent0;         // 0x0C90 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Tapered_Cut20_StaticMeshComponent0;         // 0x0C98 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Tapered_Cut19_StaticMeshComponent0;         // 0x0CA0 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise20_StaticMeshComponent0;               // 0x0CA8 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise19_StaticMeshComponent0;               // 0x0CB0 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise18_StaticMeshComponent0;               // 0x0CB8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long52_StaticMeshComponent0;         // 0x0CC0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short14_StaticMeshComponent0;        // 0x0CC8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short13_StaticMeshComponent0;        // 0x0CD0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short12_StaticMeshComponent0;        // 0x0CD8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short11_StaticMeshComponent0;        // 0x0CE0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short10_StaticMeshComponent0;        // 0x0CE8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short9_StaticMeshComponent0;         // 0x0CF0 (size: 0x8)
    class UStaticMeshComponent* foundationTiling_A_detailed32_StaticMeshComponent0;   // 0x0CF8 (size: 0x8)
    class UStaticMeshComponent* foundationTiling_A_detailed31_StaticMeshComponent0;   // 0x0D00 (size: 0x8)
    class UStaticMeshComponent* foundationTiling_A_detailed30_StaticMeshComponent0;   // 0x0D08 (size: 0x8)
    class UStaticMeshComponent* foundationTiling_A_detailed29_StaticMeshComponent0;   // 0x0D10 (size: 0x8)
    class UStaticMeshComponent* foundationTiling_A_detailed28_StaticMeshComponent0;   // 0x0D18 (size: 0x8)
    class UStaticMeshComponent* foundationTiling_A_detailed27_StaticMeshComponent0;   // 0x0D20 (size: 0x8)
    class UStaticMeshComponent* foundationTiling_A_detailed26_StaticMeshComponent0;   // 0x0D28 (size: 0x8)
    class UStaticMeshComponent* foundationTiling_A_detailed25_StaticMeshComponent0;   // 0x0D30 (size: 0x8)
    class UStaticMeshComponent* foundationTiling_A_detailed24_StaticMeshComponent0;   // 0x0D38 (size: 0x8)
    class UStaticMeshComponent* foundationTiling_A_detailed23_StaticMeshComponent0;   // 0x0D40 (size: 0x8)
    class UStaticMeshComponent* foundationTiling_A_detailed22_StaticMeshComponent0;   // 0x0D48 (size: 0x8)
    class UStaticMeshComponent* foundationTiling_A_detailed21_StaticMeshComponent0;   // 0x0D50 (size: 0x8)
    class UStaticMeshComponent* foundationTiling_A_detailed20_StaticMeshComponent0;   // 0x0D58 (size: 0x8)
    class UStaticMeshComponent* foundationTiling_A_detailed19_StaticMeshComponent0;   // 0x0D60 (size: 0x8)
    class UStaticMeshComponent* foundationTiling_A_detailed18_StaticMeshComponent0;   // 0x0D68 (size: 0x8)
    class UStaticMeshComponent* stoneCore_TaxCollector2_StaticMeshComponent0;         // 0x0D70 (size: 0x8)
    class USceneComponent* SG_TaxCollectorProper2_DefaultSceneRoot;                   // 0x0D78 (size: 0x8)

}; // Size: 0xD80

#endif
