#ifndef UE4SS_SDK_C_SG_Storehouse_LV2_Ubeam_HPP
#define UE4SS_SDK_C_SG_Storehouse_LV2_Ubeam_HPP

class AC_SG_Storehouse_LV2_Ubeam_C : public AConstructionBP_C
{
    class UStaticMeshComponent* foundation_sg_StorehouseLvl3_StaticMeshComponent0;    // 0x0550 (size: 0x8)
    class UStaticMeshComponent* roof_sg_StorehouseLvl3_StaticMeshComponent0;          // 0x0558 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg124_StaticMeshComponent0;    // 0x0560 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg123_StaticMeshComponent0;    // 0x0568 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg122_StaticMeshComponent0;    // 0x0570 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg121_StaticMeshComponent0;    // 0x0578 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg120_StaticMeshComponent0;    // 0x0580 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg119_StaticMeshComponent0;    // 0x0588 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg118_StaticMeshComponent0;    // 0x0590 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg117_StaticMeshComponent0;    // 0x0598 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg116_StaticMeshComponent0;    // 0x05A0 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg115_StaticMeshComponent0;    // 0x05A8 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg114_StaticMeshComponent0;    // 0x05B0 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg113_StaticMeshComponent0;    // 0x05B8 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg112_StaticMeshComponent0;    // 0x05C0 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg111_StaticMeshComponent0;    // 0x05C8 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg110_StaticMeshComponent0;    // 0x05D0 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg109_StaticMeshComponent0;    // 0x05D8 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg108_StaticMeshComponent0;    // 0x05E0 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg107_StaticMeshComponent0;    // 0x05E8 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg106_StaticMeshComponent0;    // 0x05F0 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg105_StaticMeshComponent0;    // 0x05F8 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg104_StaticMeshComponent0;    // 0x0600 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg103_StaticMeshComponent0;    // 0x0608 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg102_StaticMeshComponent0;    // 0x0610 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg101_StaticMeshComponent0;    // 0x0618 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg100_StaticMeshComponent0;    // 0x0620 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg99_StaticMeshComponent0;     // 0x0628 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg98_StaticMeshComponent0;     // 0x0630 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg97_StaticMeshComponent0;     // 0x0638 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg96_StaticMeshComponent0;     // 0x0640 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg95_StaticMeshComponent0;     // 0x0648 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg94_StaticMeshComponent0;     // 0x0650 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg93_StaticMeshComponent0;     // 0x0658 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg92_StaticMeshComponent0;     // 0x0660 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg91_StaticMeshComponent0;     // 0x0668 (size: 0x8)
    class UStaticMeshComponent* UBeam_TaperedCutB16_StaticMeshComponent0;             // 0x0670 (size: 0x8)
    class UStaticMeshComponent* UBeam_TaperedCutB15_StaticMeshComponent0;             // 0x0678 (size: 0x8)
    class UStaticMeshComponent* UBeam_TaperedCutB14_StaticMeshComponent0;             // 0x0680 (size: 0x8)
    class UStaticMeshComponent* UBeam_TaperedCutB13_StaticMeshComponent0;             // 0x0688 (size: 0x8)
    class UStaticMeshComponent* UBeam_TaperedCutB12_StaticMeshComponent0;             // 0x0690 (size: 0x8)
    class UStaticMeshComponent* UBeam_TaperedCutB11_StaticMeshComponent0;             // 0x0698 (size: 0x8)
    class UStaticMeshComponent* UBeam_TaperedCutB10_StaticMeshComponent0;             // 0x06A0 (size: 0x8)
    class UStaticMeshComponent* UBeam_TaperedCutB9_StaticMeshComponent0;              // 0x06A8 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg90_StaticMeshComponent0;     // 0x06B0 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg89_StaticMeshComponent0;     // 0x06B8 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg88_StaticMeshComponent0;     // 0x06C0 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg87_StaticMeshComponent0;     // 0x06C8 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg86_StaticMeshComponent0;     // 0x06D0 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg85_StaticMeshComponent0;     // 0x06D8 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg84_StaticMeshComponent0;     // 0x06E0 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg83_StaticMeshComponent0;     // 0x06E8 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg82_StaticMeshComponent0;     // 0x06F0 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg81_StaticMeshComponent0;     // 0x06F8 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg80_StaticMeshComponent0;     // 0x0700 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg79_StaticMeshComponent0;     // 0x0708 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg78_StaticMeshComponent0;     // 0x0710 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg77_StaticMeshComponent0;     // 0x0718 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg76_StaticMeshComponent0;     // 0x0720 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg75_StaticMeshComponent0;     // 0x0728 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg74_StaticMeshComponent0;     // 0x0730 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg73_StaticMeshComponent0;     // 0x0738 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m4_StaticMeshComponent0;                       // 0x0740 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m3_StaticMeshComponent0;                       // 0x0748 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg72_StaticMeshComponent0;     // 0x0750 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg71_StaticMeshComponent0;     // 0x0758 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg70_StaticMeshComponent0;     // 0x0760 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg69_StaticMeshComponent0;     // 0x0768 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg68_StaticMeshComponent0;     // 0x0770 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg67_StaticMeshComponent0;     // 0x0778 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg66_StaticMeshComponent0;     // 0x0780 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg65_StaticMeshComponent0;     // 0x0788 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg64_StaticMeshComponent0;     // 0x0790 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg63_StaticMeshComponent0;     // 0x0798 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m59_StaticMeshComponent0;                      // 0x07A0 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m58_StaticMeshComponent0;                      // 0x07A8 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m57_StaticMeshComponent0;                      // 0x07B0 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m56_StaticMeshComponent0;                      // 0x07B8 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m55_StaticMeshComponent0;                      // 0x07C0 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Narrow64_StaticMeshComponent0;             // 0x07C8 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Narrow63_StaticMeshComponent0;             // 0x07D0 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Narrow62_StaticMeshComponent0;             // 0x07D8 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Narrow61_StaticMeshComponent0;             // 0x07E0 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Narrow60_StaticMeshComponent0;             // 0x07E8 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Narrow59_StaticMeshComponent0;             // 0x07F0 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Narrow58_StaticMeshComponent0;             // 0x07F8 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Narrow57_StaticMeshComponent0;             // 0x0800 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Narrow56_StaticMeshComponent0;             // 0x0808 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Narrow55_StaticMeshComponent0;             // 0x0810 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Narrow54_StaticMeshComponent0;             // 0x0818 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Narrow53_StaticMeshComponent0;             // 0x0820 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Slit_DenseUV4_StaticMeshComponent0;        // 0x0828 (size: 0x8)
    class UStaticMeshComponent* UBeam_WindowFrame6_StaticMeshComponent0;              // 0x0830 (size: 0x8)
    class UStaticMeshComponent* UDaub_StandardSingleWindowWide4_StaticMeshComponent0; // 0x0838 (size: 0x8)
    class UStaticMeshComponent* UDaub_StandardSingleWindowWide3_StaticMeshComponent0; // 0x0840 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Narrow52_StaticMeshComponent0;             // 0x0848 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Narrow51_StaticMeshComponent0;             // 0x0850 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Narrow50_StaticMeshComponent0;             // 0x0858 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Narrow49_StaticMeshComponent0;             // 0x0860 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Narrow48_StaticMeshComponent0;             // 0x0868 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Narrow47_StaticMeshComponent0;             // 0x0870 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Narrow46_StaticMeshComponent0;             // 0x0878 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Narrow45_StaticMeshComponent0;             // 0x0880 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Narrow44_StaticMeshComponent0;             // 0x0888 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Narrow43_StaticMeshComponent0;             // 0x0890 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Narrow42_StaticMeshComponent0;             // 0x0898 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Narrow41_StaticMeshComponent0;             // 0x08A0 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Narrow40_StaticMeshComponent0;             // 0x08A8 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Narrow39_StaticMeshComponent0;             // 0x08B0 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Narrow38_StaticMeshComponent0;             // 0x08B8 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Narrow37_StaticMeshComponent0;             // 0x08C0 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Narrow36_StaticMeshComponent0;             // 0x08C8 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Narrow35_StaticMeshComponent0;             // 0x08D0 (size: 0x8)
    class UStaticMeshComponent* UBeam_WindowFrame5_StaticMeshComponent0;              // 0x08D8 (size: 0x8)
    class UStaticMeshComponent* UBeam_WindowFrame4_StaticMeshComponent0;              // 0x08E0 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Narrow34_StaticMeshComponent0;             // 0x08E8 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_TwoWindowsStandard_Wider4_StaticMeshComponent0; // 0x08F0 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_TwoWindowsStandard_Wider3_StaticMeshComponent0; // 0x08F8 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_53_StaticMeshComponent0; // 0x0900 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_52_StaticMeshComponent0; // 0x0908 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_51_StaticMeshComponent0; // 0x0910 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth78_StaticMeshComponent0;           // 0x0918 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_50_StaticMeshComponent0; // 0x0920 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_49_StaticMeshComponent0; // 0x0928 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_48_StaticMeshComponent0; // 0x0930 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_47_StaticMeshComponent0; // 0x0938 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_35_StaticMeshComponent0; // 0x0940 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_34_StaticMeshComponent0; // 0x0948 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_33_StaticMeshComponent0; // 0x0950 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_32_StaticMeshComponent0; // 0x0958 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_31_StaticMeshComponent0; // 0x0960 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_30_StaticMeshComponent0; // 0x0968 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed19_StaticMeshComponent0;           // 0x0970 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed18_StaticMeshComponent0;           // 0x0978 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed17_StaticMeshComponent0;           // 0x0980 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed16_StaticMeshComponent0;           // 0x0988 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed15_StaticMeshComponent0;           // 0x0990 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed14_StaticMeshComponent0;           // 0x0998 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed13_StaticMeshComponent0;           // 0x09A0 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_46_StaticMeshComponent0; // 0x09A8 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_45_StaticMeshComponent0; // 0x09B0 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_5_StaticMeshComponent0; // 0x09B8 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_4_StaticMeshComponent0; // 0x09C0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth77_StaticMeshComponent0;           // 0x09C8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth76_StaticMeshComponent0;           // 0x09D0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth75_StaticMeshComponent0;           // 0x09D8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth74_StaticMeshComponent0;           // 0x09E0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth73_StaticMeshComponent0;           // 0x09E8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth72_StaticMeshComponent0;           // 0x09F0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth71_StaticMeshComponent0;           // 0x09F8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth70_StaticMeshComponent0;           // 0x0A00 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth69_StaticMeshComponent0;           // 0x0A08 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth68_StaticMeshComponent0;           // 0x0A10 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth67_StaticMeshComponent0;           // 0x0A18 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth66_StaticMeshComponent0;           // 0x0A20 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth65_StaticMeshComponent0;           // 0x0A28 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth64_StaticMeshComponent0;           // 0x0A30 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth63_StaticMeshComponent0;           // 0x0A38 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth62_StaticMeshComponent0;           // 0x0A40 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth61_StaticMeshComponent0;           // 0x0A48 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth60_StaticMeshComponent0;           // 0x0A50 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth59_StaticMeshComponent0;           // 0x0A58 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth58_StaticMeshComponent0;           // 0x0A60 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth57_StaticMeshComponent0;           // 0x0A68 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth56_StaticMeshComponent0;           // 0x0A70 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth55_StaticMeshComponent0;           // 0x0A78 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth54_StaticMeshComponent0;           // 0x0A80 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth53_StaticMeshComponent0;           // 0x0A88 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth52_StaticMeshComponent0;           // 0x0A90 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth51_StaticMeshComponent0;           // 0x0A98 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth50_StaticMeshComponent0;           // 0x0AA0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth49_StaticMeshComponent0;           // 0x0AA8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth48_StaticMeshComponent0;           // 0x0AB0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth47_StaticMeshComponent0;           // 0x0AB8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth46_StaticMeshComponent0;           // 0x0AC0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth45_StaticMeshComponent0;           // 0x0AC8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth44_StaticMeshComponent0;           // 0x0AD0 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_29_StaticMeshComponent0; // 0x0AD8 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_28_StaticMeshComponent0; // 0x0AE0 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_15_StaticMeshComponent0; // 0x0AE8 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_14_StaticMeshComponent0; // 0x0AF0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth43_StaticMeshComponent0;           // 0x0AF8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth42_StaticMeshComponent0;           // 0x0B00 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Tapered_Cut20_StaticMeshComponent0;         // 0x0B08 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Tapered_Cut19_StaticMeshComponent0;         // 0x0B10 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Tapered_Cut18_StaticMeshComponent0;         // 0x0B18 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Tapered_Cut17_StaticMeshComponent0;         // 0x0B20 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Tapered_Cut16_StaticMeshComponent0;         // 0x0B28 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Tapered_Cut15_StaticMeshComponent0;         // 0x0B30 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Tapered_Cut14_StaticMeshComponent0;         // 0x0B38 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Tapered_Cut13_StaticMeshComponent0;         // 0x0B40 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Tapered_Cut12_StaticMeshComponent0;         // 0x0B48 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Tapered_Cut11_StaticMeshComponent0;         // 0x0B50 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth41_StaticMeshComponent0;           // 0x0B58 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth2_StaticMeshComponent0;            // 0x0B60 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Slit_DenseUV3_StaticMeshComponent0;        // 0x0B68 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Narrow33_StaticMeshComponent0;             // 0x0B70 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_39_StaticMeshComponent0;               // 0x0B78 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_38_StaticMeshComponent0;               // 0x0B80 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_37_StaticMeshComponent0;               // 0x0B88 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m54_StaticMeshComponent0;                      // 0x0B90 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m53_StaticMeshComponent0;                      // 0x0B98 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m52_StaticMeshComponent0;                      // 0x0BA0 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m51_StaticMeshComponent0;                      // 0x0BA8 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m50_StaticMeshComponent0;                      // 0x0BB0 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_36_StaticMeshComponent0;               // 0x0BB8 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_35_StaticMeshComponent0;               // 0x0BC0 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m49_StaticMeshComponent0;                      // 0x0BC8 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m48_StaticMeshComponent0;                      // 0x0BD0 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_34_StaticMeshComponent0;               // 0x0BD8 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_33_StaticMeshComponent0;               // 0x0BE0 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m47_StaticMeshComponent0;                      // 0x0BE8 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_32_StaticMeshComponent0;               // 0x0BF0 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m46_StaticMeshComponent0;                      // 0x0BF8 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m45_StaticMeshComponent0;                      // 0x0C00 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m44_StaticMeshComponent0;                      // 0x0C08 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m43_StaticMeshComponent0;                      // 0x0C10 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_31_StaticMeshComponent0;               // 0x0C18 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_30_StaticMeshComponent0;               // 0x0C20 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_29_StaticMeshComponent0;               // 0x0C28 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_28_StaticMeshComponent0;               // 0x0C30 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_27_StaticMeshComponent0;               // 0x0C38 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m42_StaticMeshComponent0;                      // 0x0C40 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m41_StaticMeshComponent0;                      // 0x0C48 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m40_StaticMeshComponent0;                      // 0x0C50 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m39_StaticMeshComponent0;                      // 0x0C58 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m38_StaticMeshComponent0;                      // 0x0C60 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m37_StaticMeshComponent0;                      // 0x0C68 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_26_StaticMeshComponent0;               // 0x0C70 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_25_StaticMeshComponent0;               // 0x0C78 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m36_StaticMeshComponent0;                      // 0x0C80 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_24_StaticMeshComponent0;               // 0x0C88 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m35_StaticMeshComponent0;                      // 0x0C90 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_23_StaticMeshComponent0;               // 0x0C98 (size: 0x8)
    class USceneComponent* Actor3_DefaultSceneRoot;                                   // 0x0CA0 (size: 0x8)

}; // Size: 0xCA8

#endif
