#ifndef UE4SS_SDK_C_SG_Townhouse_lv3_BPart_A_HPP
#define UE4SS_SDK_C_SG_Townhouse_lv3_BPart_A_HPP

class AC_SG_Townhouse_lv3_BPart_A_C : public AConstructionBP_C
{
    class UStaticMeshComponent* ClayRoofSingleSheet2_StaticMeshComponent0;            // 0x0550 (size: 0x8)
    class UStaticMeshComponent* StoneGateArch_LUV_SuppEdgesResym2_StaticMeshComponent0; // 0x0558 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam1_5m_orSth150_StaticMeshComponent0;        // 0x0560 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam1_5m_orSth149_StaticMeshComponent0;        // 0x0568 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam1_5m_orSth148_StaticMeshComponent0;        // 0x0570 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam1_5m_orSth147_StaticMeshComponent0;        // 0x0578 (size: 0x8)
    class UStaticMeshComponent* chimney2_StaticMeshComponent0;                        // 0x0580 (size: 0x8)
    class UStaticMeshComponent* J_SG_WoodenDoorA2_StaticMeshComponent0;               // 0x0588 (size: 0x8)
    class UStaticMeshComponent* fake_interior_3_StaticMeshComponent0;                 // 0x0590 (size: 0x8)
    class UStaticMeshComponent* fake_interior2_StaticMeshComponent0;                  // 0x0598 (size: 0x8)
    class UStaticMeshComponent* FoundationPrecise18_StaticMeshComponent0;             // 0x05A0 (size: 0x8)
    class UStaticMeshComponent* sg_fillerBoardB18_StaticMeshComponent0;               // 0x05A8 (size: 0x8)
    class UStaticMeshComponent* FoundationPrecise17_StaticMeshComponent0;             // 0x05B0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly134_StaticMeshComponent0;   // 0x05B8 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_112_StaticMeshComponent0; // 0x05C0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth135_StaticMeshComponent0;          // 0x05C8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth134_StaticMeshComponent0;          // 0x05D0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly133_StaticMeshComponent0;   // 0x05D8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly132_StaticMeshComponent0;   // 0x05E0 (size: 0x8)
    class UStaticMeshComponent* SG_SmallGlassWindowB_Frame8_StaticMeshComponent0;     // 0x05E8 (size: 0x8)
    class UStaticMeshComponent* SG_SmallGlassWindowB_Frame7_StaticMeshComponent0;     // 0x05F0 (size: 0x8)
    class UStaticMeshComponent* SG_SmallGlassWindowB_Frame6_StaticMeshComponent0;     // 0x05F8 (size: 0x8)
    class UStaticMeshComponent* SG_SmallGlassWindowB_Frame5_StaticMeshComponent0;     // 0x0600 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly131_StaticMeshComponent0;   // 0x0608 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly130_StaticMeshComponent0;   // 0x0610 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly129_StaticMeshComponent0;   // 0x0618 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly128_StaticMeshComponent0;   // 0x0620 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly127_StaticMeshComponent0;   // 0x0628 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly126_StaticMeshComponent0;   // 0x0630 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly125_StaticMeshComponent0;   // 0x0638 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly124_StaticMeshComponent0;   // 0x0640 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly123_StaticMeshComponent0;   // 0x0648 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly122_StaticMeshComponent0;   // 0x0650 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly121_StaticMeshComponent0;   // 0x0658 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly120_StaticMeshComponent0;   // 0x0660 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly119_StaticMeshComponent0;   // 0x0668 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly118_StaticMeshComponent0;   // 0x0670 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly117_StaticMeshComponent0;   // 0x0678 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly116_StaticMeshComponent0;   // 0x0680 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly115_StaticMeshComponent0;   // 0x0688 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly114_StaticMeshComponent0;   // 0x0690 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly113_StaticMeshComponent0;   // 0x0698 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly112_StaticMeshComponent0;   // 0x06A0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly111_StaticMeshComponent0;   // 0x06A8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly110_StaticMeshComponent0;   // 0x06B0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly109_StaticMeshComponent0;   // 0x06B8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly108_StaticMeshComponent0;   // 0x06C0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly107_StaticMeshComponent0;   // 0x06C8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly106_StaticMeshComponent0;   // 0x06D0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly105_StaticMeshComponent0;   // 0x06D8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly104_StaticMeshComponent0;   // 0x06E0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly103_StaticMeshComponent0;   // 0x06E8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly102_StaticMeshComponent0;   // 0x06F0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly101_StaticMeshComponent0;   // 0x06F8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly100_StaticMeshComponent0;   // 0x0700 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly99_StaticMeshComponent0;    // 0x0708 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly98_StaticMeshComponent0;    // 0x0710 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly97_StaticMeshComponent0;    // 0x0718 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly96_StaticMeshComponent0;    // 0x0720 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly95_StaticMeshComponent0;    // 0x0728 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly94_StaticMeshComponent0;    // 0x0730 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly93_StaticMeshComponent0;    // 0x0738 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly92_StaticMeshComponent0;    // 0x0740 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly91_StaticMeshComponent0;    // 0x0748 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly90_StaticMeshComponent0;    // 0x0750 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly89_StaticMeshComponent0;    // 0x0758 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly88_StaticMeshComponent0;    // 0x0760 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly87_StaticMeshComponent0;    // 0x0768 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly86_StaticMeshComponent0;    // 0x0770 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly85_StaticMeshComponent0;    // 0x0778 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly84_StaticMeshComponent0;    // 0x0780 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly83_StaticMeshComponent0;    // 0x0788 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly82_StaticMeshComponent0;    // 0x0790 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly81_StaticMeshComponent0;    // 0x0798 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly80_StaticMeshComponent0;    // 0x07A0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly79_StaticMeshComponent0;    // 0x07A8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly78_StaticMeshComponent0;    // 0x07B0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly77_StaticMeshComponent0;    // 0x07B8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly76_StaticMeshComponent0;    // 0x07C0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly75_StaticMeshComponent0;    // 0x07C8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly74_StaticMeshComponent0;    // 0x07D0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly73_StaticMeshComponent0;    // 0x07D8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly72_StaticMeshComponent0;    // 0x07E0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly71_StaticMeshComponent0;    // 0x07E8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly70_StaticMeshComponent0;    // 0x07F0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly69_StaticMeshComponent0;    // 0x07F8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly68_StaticMeshComponent0;    // 0x0800 (size: 0x8)
    class UStaticMeshComponent* PlaneDenseSmallSegment7_StaticMeshComponent0;         // 0x0808 (size: 0x8)
    class UStaticMeshComponent* doorHeadA_angled4_StaticMeshComponent0;               // 0x0810 (size: 0x8)
    class UStaticMeshComponent* sg_fillerBoardB17_StaticMeshComponent0;               // 0x0818 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA14_StaticMeshComponent0;               // 0x0820 (size: 0x8)
    class UStaticMeshComponent* sg_fillerBoardB16_StaticMeshComponent0;               // 0x0828 (size: 0x8)
    class UStaticMeshComponent* sg_fillerBoardB15_StaticMeshComponent0;               // 0x0830 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA13_StaticMeshComponent0;               // 0x0838 (size: 0x8)
    class UStaticMeshComponent* sg_fillerBoardB14_StaticMeshComponent0;               // 0x0840 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA12_StaticMeshComponent0;               // 0x0848 (size: 0x8)
    class UStaticMeshComponent* sg_fillerBoardB13_StaticMeshComponent0;               // 0x0850 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA11_StaticMeshComponent0;               // 0x0858 (size: 0x8)
    class UStaticMeshComponent* sg_fillerBoardB12_StaticMeshComponent0;               // 0x0860 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA10_StaticMeshComponent0;               // 0x0868 (size: 0x8)
    class UStaticMeshComponent* sg_fillerBoardB11_StaticMeshComponent0;               // 0x0870 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA9_StaticMeshComponent0;                // 0x0878 (size: 0x8)
    class UStaticMeshComponent* sg_fillerBoardB10_StaticMeshComponent0;               // 0x0880 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA8_StaticMeshComponent0;                // 0x0888 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short87_StaticMeshComponent0;        // 0x0890 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short86_StaticMeshComponent0;        // 0x0898 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short85_StaticMeshComponent0;        // 0x08A0 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed4_StaticMeshComponent0;            // 0x08A8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short84_StaticMeshComponent0;        // 0x08B0 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed3_StaticMeshComponent0;            // 0x08B8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam1_5m_orSth146_StaticMeshComponent0;        // 0x08C0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam1_5m_orSth145_StaticMeshComponent0;        // 0x08C8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam1_5m_orSth144_StaticMeshComponent0;        // 0x08D0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth133_StaticMeshComponent0;          // 0x08D8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam1_5m_orSth143_StaticMeshComponent0;        // 0x08E0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam1_5m_orSth142_StaticMeshComponent0;        // 0x08E8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam1_5m_orSth141_StaticMeshComponent0;        // 0x08F0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth132_StaticMeshComponent0;          // 0x08F8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam1_5m_orSth140_StaticMeshComponent0;        // 0x0900 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam1_5m_orSth139_StaticMeshComponent0;        // 0x0908 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam1_5m_orSth138_StaticMeshComponent0;        // 0x0910 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam1_5m_orSth137_StaticMeshComponent0;        // 0x0918 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam1_5m_orSth136_StaticMeshComponent0;        // 0x0920 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam1_5m_orSth135_StaticMeshComponent0;        // 0x0928 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam1_5m_orSth134_StaticMeshComponent0;        // 0x0930 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam1_5m_orSth133_StaticMeshComponent0;        // 0x0938 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam1_5m_orSth132_StaticMeshComponent0;        // 0x0940 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam1_5m_orSth131_StaticMeshComponent0;        // 0x0948 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam1_5m_orSth130_StaticMeshComponent0;        // 0x0950 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam1_5m_orSth129_StaticMeshComponent0;        // 0x0958 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam1_5m_orSth128_StaticMeshComponent0;        // 0x0960 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam1_5m_orSth127_StaticMeshComponent0;        // 0x0968 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam1_5m_orSth126_StaticMeshComponent0;        // 0x0970 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam1_5m_orSth125_StaticMeshComponent0;        // 0x0978 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam1_5m_orSth124_StaticMeshComponent0;        // 0x0980 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam1_5m_orSth123_StaticMeshComponent0;        // 0x0988 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam1_5m_orSth122_StaticMeshComponent0;        // 0x0990 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam1_5m_orSth121_StaticMeshComponent0;        // 0x0998 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam1_5m_orSth120_StaticMeshComponent0;        // 0x09A0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam1_5m_orSth119_StaticMeshComponent0;        // 0x09A8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth131_StaticMeshComponent0;          // 0x09B0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth130_StaticMeshComponent0;          // 0x09B8 (size: 0x8)
    class UStaticMeshComponent* sg_woodenGableA4_StaticMeshComponent0;                // 0x09C0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth129_StaticMeshComponent0;          // 0x09C8 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_111_StaticMeshComponent0; // 0x09D0 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_110_StaticMeshComponent0; // 0x09D8 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_109_StaticMeshComponent0; // 0x09E0 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_108_StaticMeshComponent0; // 0x09E8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam1_5m_orSth118_StaticMeshComponent0;        // 0x09F0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam1_5m_orSth117_StaticMeshComponent0;        // 0x09F8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam1_5m_orSth116_StaticMeshComponent0;        // 0x0A00 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam1_5m_orSth115_StaticMeshComponent0;        // 0x0A08 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_107_StaticMeshComponent0; // 0x0A10 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth128_StaticMeshComponent0;          // 0x0A18 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth127_StaticMeshComponent0;          // 0x0A20 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_106_StaticMeshComponent0; // 0x0A28 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short83_StaticMeshComponent0;        // 0x0A30 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_105_StaticMeshComponent0; // 0x0A38 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam1_5m_orSth114_StaticMeshComponent0;        // 0x0A40 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam1_5m_orSth113_StaticMeshComponent0;        // 0x0A48 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short82_StaticMeshComponent0;        // 0x0A50 (size: 0x8)
    class UStaticMeshComponent* J_SG_WoodenBracketA2_StaticMeshComponent0;            // 0x0A58 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_104_StaticMeshComponent0; // 0x0A60 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_103_StaticMeshComponent0; // 0x0A68 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth126_StaticMeshComponent0;          // 0x0A70 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_102_StaticMeshComponent0; // 0x0A78 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_101_StaticMeshComponent0; // 0x0A80 (size: 0x8)
    class UStaticMeshComponent* sg_woodenGableA3_StaticMeshComponent0;                // 0x0A88 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_100_StaticMeshComponent0; // 0x0A90 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_99_StaticMeshComponent0; // 0x0A98 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short81_StaticMeshComponent0;        // 0x0AA0 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_98_StaticMeshComponent0; // 0x0AA8 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_97_StaticMeshComponent0; // 0x0AB0 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_96_StaticMeshComponent0; // 0x0AB8 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_95_StaticMeshComponent0; // 0x0AC0 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_94_StaticMeshComponent0; // 0x0AC8 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_93_StaticMeshComponent0; // 0x0AD0 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_92_StaticMeshComponent0; // 0x0AD8 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_91_StaticMeshComponent0; // 0x0AE0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth125_StaticMeshComponent0;          // 0x0AE8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth124_StaticMeshComponent0;          // 0x0AF0 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_90_StaticMeshComponent0; // 0x0AF8 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_89_StaticMeshComponent0; // 0x0B00 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_88_StaticMeshComponent0; // 0x0B08 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_87_StaticMeshComponent0; // 0x0B10 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_86_StaticMeshComponent0; // 0x0B18 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_85_StaticMeshComponent0; // 0x0B20 (size: 0x8)
    class UStaticMeshComponent* doorHeadA_angled3_StaticMeshComponent0;               // 0x0B28 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_84_StaticMeshComponent0; // 0x0B30 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_83_StaticMeshComponent0; // 0x0B38 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_82_StaticMeshComponent0; // 0x0B40 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_81_StaticMeshComponent0; // 0x0B48 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_80_StaticMeshComponent0; // 0x0B50 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_79_StaticMeshComponent0; // 0x0B58 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth123_StaticMeshComponent0;          // 0x0B60 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth122_StaticMeshComponent0;          // 0x0B68 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_78_StaticMeshComponent0; // 0x0B70 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_77_StaticMeshComponent0; // 0x0B78 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_76_StaticMeshComponent0; // 0x0B80 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_38_StaticMeshComponent0; // 0x0B88 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_36_StaticMeshComponent0; // 0x0B90 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam1_5m_orSth112_StaticMeshComponent0;        // 0x0B98 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam1_5m_orSth111_StaticMeshComponent0;        // 0x0BA0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam1_5m_orSth110_StaticMeshComponent0;        // 0x0BA8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam1_5m_orSth109_StaticMeshComponent0;        // 0x0BB0 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Tapered_CutE14_StaticMeshComponent0;        // 0x0BB8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam1_5m_orSth108_StaticMeshComponent0;        // 0x0BC0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam1_5m_orSth107_StaticMeshComponent0;        // 0x0BC8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam1_5m_orSth106_StaticMeshComponent0;        // 0x0BD0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam1_5m_orSth105_StaticMeshComponent0;        // 0x0BD8 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Tapered_CutE13_StaticMeshComponent0;        // 0x0BE0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam1_5m_orSth104_StaticMeshComponent0;        // 0x0BE8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam1_5m_orSth103_StaticMeshComponent0;        // 0x0BF0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam1_5m_orSth102_StaticMeshComponent0;        // 0x0BF8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam1_5m_orSth101_StaticMeshComponent0;        // 0x0C00 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Tapered_CutE12_StaticMeshComponent0;        // 0x0C08 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam1_5m_orSth100_StaticMeshComponent0;        // 0x0C10 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam1_5m_orSth99_StaticMeshComponent0;         // 0x0C18 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam1_5m_orSth98_StaticMeshComponent0;         // 0x0C20 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam1_5m_orSth97_StaticMeshComponent0;         // 0x0C28 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Tapered_CutE11_StaticMeshComponent0;        // 0x0C30 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam1_5m_orSth96_StaticMeshComponent0;         // 0x0C38 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam1_5m_orSth95_StaticMeshComponent0;         // 0x0C40 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam1_5m_orSth94_StaticMeshComponent0;         // 0x0C48 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam1_5m_orSth93_StaticMeshComponent0;         // 0x0C50 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Tapered_CutE10_StaticMeshComponent0;        // 0x0C58 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam1_5m_orSth92_StaticMeshComponent0;         // 0x0C60 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam1_5m_orSth91_StaticMeshComponent0;         // 0x0C68 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam1_5m_orSth90_StaticMeshComponent0;         // 0x0C70 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam1_5m_orSth89_StaticMeshComponent0;         // 0x0C78 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Tapered_CutE9_StaticMeshComponent0;         // 0x0C80 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam1_5m_orSth88_StaticMeshComponent0;         // 0x0C88 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam1_5m_orSth87_StaticMeshComponent0;         // 0x0C90 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam1_5m_orSth86_StaticMeshComponent0;         // 0x0C98 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam1_5m_orSth85_StaticMeshComponent0;         // 0x0CA0 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Tapered_CutE8_StaticMeshComponent0;         // 0x0CA8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short80_StaticMeshComponent0;        // 0x0CB0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short79_StaticMeshComponent0;        // 0x0CB8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short78_StaticMeshComponent0;        // 0x0CC0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth121_StaticMeshComponent0;          // 0x0CC8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth120_StaticMeshComponent0;          // 0x0CD0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam1_5m_orSth84_StaticMeshComponent0;         // 0x0CD8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam1_5m_orSth83_StaticMeshComponent0;         // 0x0CE0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam1_5m_orSth82_StaticMeshComponent0;         // 0x0CE8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth119_StaticMeshComponent0;          // 0x0CF0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam1_5m_orSth81_StaticMeshComponent0;         // 0x0CF8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam1_5m_orSth80_StaticMeshComponent0;         // 0x0D00 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam1_5m_orSth79_StaticMeshComponent0;         // 0x0D08 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth110_StaticMeshComponent0;          // 0x0D10 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam1_5m_orSth78_StaticMeshComponent0;         // 0x0D18 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam1_5m_orSth77_StaticMeshComponent0;         // 0x0D20 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth15_StaticMeshComponent0;           // 0x0D28 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam1_5m_orSth76_StaticMeshComponent0;         // 0x0D30 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short77_StaticMeshComponent0;        // 0x0D38 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short76_StaticMeshComponent0;        // 0x0D40 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short75_StaticMeshComponent0;        // 0x0D48 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short74_StaticMeshComponent0;        // 0x0D50 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short73_StaticMeshComponent0;        // 0x0D58 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short52_StaticMeshComponent0;        // 0x0D60 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short51_StaticMeshComponent0;        // 0x0D68 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Standard90_StaticMeshComponent0;           // 0x0D70 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Standard89_StaticMeshComponent0;           // 0x0D78 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Standard88_StaticMeshComponent0;           // 0x0D80 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Standard87_StaticMeshComponent0;           // 0x0D88 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Standard86_StaticMeshComponent0;           // 0x0D90 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Standard85_StaticMeshComponent0;           // 0x0D98 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Standard84_StaticMeshComponent0;           // 0x0DA0 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Standard83_StaticMeshComponent0;           // 0x0DA8 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Standard82_StaticMeshComponent0;           // 0x0DB0 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Standard81_StaticMeshComponent0;           // 0x0DB8 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Standard80_StaticMeshComponent0;           // 0x0DC0 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Standard79_StaticMeshComponent0;           // 0x0DC8 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Standard78_StaticMeshComponent0;           // 0x0DD0 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Standard77_StaticMeshComponent0;           // 0x0DD8 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Standard76_StaticMeshComponent0;           // 0x0DE0 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_TwoWindowsStandard6_StaticMeshComponent0;  // 0x0DE8 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Standard75_StaticMeshComponent0;           // 0x0DF0 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_TwoWindowsStandard5_StaticMeshComponent0;  // 0x0DF8 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Standard74_StaticMeshComponent0;           // 0x0E00 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Standard73_StaticMeshComponent0;           // 0x0E08 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Standard72_StaticMeshComponent0;           // 0x0E10 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Standard71_StaticMeshComponent0;           // 0x0E18 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Standard70_StaticMeshComponent0;           // 0x0E20 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Standard69_StaticMeshComponent0;           // 0x0E28 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_TwoWindowsStandard4_StaticMeshComponent0;  // 0x0E30 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Standard68_StaticMeshComponent0;           // 0x0E38 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Standard67_StaticMeshComponent0;           // 0x0E40 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Standard66_StaticMeshComponent0;           // 0x0E48 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Standard65_StaticMeshComponent0;           // 0x0E50 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Standard64_StaticMeshComponent0;           // 0x0E58 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Standard63_StaticMeshComponent0;           // 0x0E60 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Standard62_StaticMeshComponent0;           // 0x0E68 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Standard61_StaticMeshComponent0;           // 0x0E70 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Standard60_StaticMeshComponent0;           // 0x0E78 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Standard59_StaticMeshComponent0;           // 0x0E80 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Standard58_StaticMeshComponent0;           // 0x0E88 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Standard57_StaticMeshComponent0;           // 0x0E90 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Standard56_StaticMeshComponent0;           // 0x0E98 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Standard55_StaticMeshComponent0;           // 0x0EA0 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Standard54_StaticMeshComponent0;           // 0x0EA8 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Standard53_StaticMeshComponent0;           // 0x0EB0 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Standard52_StaticMeshComponent0;           // 0x0EB8 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Standard51_StaticMeshComponent0;           // 0x0EC0 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Standard50_StaticMeshComponent0;           // 0x0EC8 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Standard49_StaticMeshComponent0;           // 0x0ED0 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Standard48_StaticMeshComponent0;           // 0x0ED8 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Standard47_StaticMeshComponent0;           // 0x0EE0 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Standard46_StaticMeshComponent0;           // 0x0EE8 (size: 0x8)
    class UStaticMeshComponent* FoundationPrecise16_StaticMeshComponent0;             // 0x0EF0 (size: 0x8)
    class UStaticMeshComponent* FoundationPrecise15_StaticMeshComponent0;             // 0x0EF8 (size: 0x8)
    class UStaticMeshComponent* FoundationPrecise14_StaticMeshComponent0;             // 0x0F00 (size: 0x8)
    class UStaticMeshComponent* FoundationPrecise13_StaticMeshComponent0;             // 0x0F08 (size: 0x8)
    class UStaticMeshComponent* FoundationPrecise12_StaticMeshComponent0;             // 0x0F10 (size: 0x8)
    class UStaticMeshComponent* FoundationPrecise11_StaticMeshComponent0;             // 0x0F18 (size: 0x8)
    class UStaticMeshComponent* FoundationPrecise10_StaticMeshComponent0;             // 0x0F20 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardC_thinner4_StaticMeshComponent0;        // 0x0F28 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardC_thinner3_StaticMeshComponent0;        // 0x0F30 (size: 0x8)
    class UStaticMeshComponent* sg_shutterA_short8_StaticMeshComponent0;              // 0x0F38 (size: 0x8)
    class UStaticMeshComponent* sg_shutterA_short7_StaticMeshComponent0;              // 0x0F40 (size: 0x8)
    class UStaticMeshComponent* sg_shutterA_short6_StaticMeshComponent0;              // 0x0F48 (size: 0x8)
    class UStaticMeshComponent* sg_shutterA_short5_StaticMeshComponent0;              // 0x0F50 (size: 0x8)
    class USceneComponent* Actor2_DefaultSceneRoot;                                   // 0x0F58 (size: 0x8)

}; // Size: 0xF60

#endif
