#ifndef UE4SS_SDK_C_SG_Well_HPP
#define UE4SS_SDK_C_SG_Well_HPP

class AC_SG_Well_C : public AConstructionBP_C
{
    class UStaticMeshComponent* sg_metal_partA18_StaticMeshComponent0;                // 0x0550 (size: 0x8)
    class UStaticMeshComponent* sg_metal_partA4_StaticMeshComponent0;                 // 0x0558 (size: 0x8)
    class UStaticMeshComponent* Modular_Fence_3_M_LOD5_ufflaitdw_1_Ultralong35_StaticMeshComponent0; // 0x0560 (size: 0x8)
    class UStaticMeshComponent* sg_metal_partA17_StaticMeshComponent0;                // 0x0568 (size: 0x8)
    class UStaticMeshComponent* Modular_Fence_3_M_LOD5_ufflaitdw_236_StaticMeshComponent0; // 0x0570 (size: 0x8)
    class UStaticMeshComponent* woodenTubHoops4_StaticMeshComponent0;                 // 0x0578 (size: 0x8)
    class UStaticMeshComponent* Modular_Fence_3_M_LOD5_ufflaitdw_234_StaticMeshComponent0; // 0x0580 (size: 0x8)
    class UStaticMeshComponent* SM_Rope_3_StaticMeshComponent0;                       // 0x0588 (size: 0x8)
    class UStaticMeshComponent* Modular_Fence_3_M_LOD5_ufflaitdw_235_StaticMeshComponent0; // 0x0590 (size: 0x8)
    class UStaticMeshComponent* sg_metal_partA2_StaticMeshComponent0;                 // 0x0598 (size: 0x8)
    class UStaticMeshComponent* Modular_Fence_3_M_LOD5_ufflaitdw_1_Ultralong36_StaticMeshComponent0; // 0x05A0 (size: 0x8)
    class UStaticMeshComponent* bl13_StaticMeshComponent0;                            // 0x05A8 (size: 0x8)
    class UStaticMeshComponent* blackness5_StaticMeshComponent0;                      // 0x05B0 (size: 0x8)
    class UStaticMeshComponent* Modular_Fence_3_M_LOD5_ufflaitdw_1_Ultralong34_StaticMeshComponent0; // 0x05B8 (size: 0x8)
    class UStaticMeshComponent* Modular_Fence_3_M_LOD5_ufflaitdw_258_StaticMeshComponent0; // 0x05C0 (size: 0x8)
    class UStaticMeshComponent* Modular_Fence_3_M_LOD5_ufflaitdw_257_StaticMeshComponent0; // 0x05C8 (size: 0x8)
    class UStaticMeshComponent* Modular_Fence_3_M_LOD5_ufflaitdw_256_StaticMeshComponent0; // 0x05D0 (size: 0x8)
    class UStaticMeshComponent* Modular_Fence_3_M_LOD5_ufflaitdw_255_StaticMeshComponent0; // 0x05D8 (size: 0x8)
    class UStaticMeshComponent* Modular_Fence_3_M_LOD5_ufflaitdw_254_StaticMeshComponent0; // 0x05E0 (size: 0x8)
    class UStaticMeshComponent* Modular_Fence_3_M_LOD5_ufflaitdw_253_StaticMeshComponent0; // 0x05E8 (size: 0x8)
    class UStaticMeshComponent* Modular_Fence_3_M_LOD5_ufflaitdw_252_StaticMeshComponent0; // 0x05F0 (size: 0x8)
    class UStaticMeshComponent* Modular_Fence_3_M_LOD5_ufflaitdw_251_StaticMeshComponent0; // 0x05F8 (size: 0x8)
    class UStaticMeshComponent* Modular_Fence_3_M_LOD5_ufflaitdw_250_StaticMeshComponent0; // 0x0600 (size: 0x8)
    class UStaticMeshComponent* Modular_Fence_3_M_LOD5_ufflaitdw_249_StaticMeshComponent0; // 0x0608 (size: 0x8)
    class UStaticMeshComponent* all_aboard_pivot_boardA108_StaticMeshComponent0;      // 0x0610 (size: 0x8)
    class UStaticMeshComponent* all_aboard_pivot_boardA107_StaticMeshComponent0;      // 0x0618 (size: 0x8)
    class UStaticMeshComponent* all_aboard_pivot_boardA106_StaticMeshComponent0;      // 0x0620 (size: 0x8)
    class UStaticMeshComponent* all_aboard_pivot_boardA105_StaticMeshComponent0;      // 0x0628 (size: 0x8)
    class UStaticMeshComponent* Modular_Fence_3_M_LOD5_ufflaitdw_248_StaticMeshComponent0; // 0x0630 (size: 0x8)
    class UStaticMeshComponent* Modular_Fence_3_M_LOD5_ufflaitdw_247_StaticMeshComponent0; // 0x0638 (size: 0x8)
    class UStaticMeshComponent* Modular_Fence_3_M_LOD5_ufflaitdw_246_StaticMeshComponent0; // 0x0640 (size: 0x8)
    class UStaticMeshComponent* Modular_Fence_3_M_LOD5_ufflaitdw_245_StaticMeshComponent0; // 0x0648 (size: 0x8)
    class UStaticMeshComponent* Modular_Fence_3_M_LOD5_ufflaitdw_244_StaticMeshComponent0; // 0x0650 (size: 0x8)
    class UStaticMeshComponent* Modular_Fence_3_M_LOD5_ufflaitdw_243_StaticMeshComponent0; // 0x0658 (size: 0x8)
    class UStaticMeshComponent* Modular_Fence_3_M_LOD5_ufflaitdw_242_StaticMeshComponent0; // 0x0660 (size: 0x8)
    class UStaticMeshComponent* Modular_Fence_3_M_LOD5_ufflaitdw_241_StaticMeshComponent0; // 0x0668 (size: 0x8)
    class UStaticMeshComponent* Modular_Fence_3_M_LOD5_ufflaitdw_240_StaticMeshComponent0; // 0x0670 (size: 0x8)
    class UStaticMeshComponent* Modular_Fence_3_M_LOD5_ufflaitdw_239_StaticMeshComponent0; // 0x0678 (size: 0x8)
    class UStaticMeshComponent* Modular_Fence_3_M_LOD5_ufflaitdw_238_StaticMeshComponent0; // 0x0680 (size: 0x8)
    class UStaticMeshComponent* Modular_Fence_3_M_LOD5_ufflaitdw_237_StaticMeshComponent0; // 0x0688 (size: 0x8)
    class USceneComponent* sg_well2_DefaultSceneRoot;                                 // 0x0690 (size: 0x8)

}; // Size: 0x698

#endif
