#ifndef UE4SS_SDK_C_SG_EmptyBPart_1_HPP
#define UE4SS_SDK_C_SG_EmptyBPart_1_HPP

class AC_SG_EmptyBPart_1_C : public AConstructionBP_C
{
    class UStaticMeshComponent* foundations_Lv3_clutterA2_StaticMeshComponent0;       // 0x0550 (size: 0x8)
    class UStaticMeshComponent* roofSingleDisplaced_cutdown2_StaticMeshComponent0;    // 0x0558 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg111_StaticMeshComponent0;    // 0x0560 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg110_StaticMeshComponent0;    // 0x0568 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg109_StaticMeshComponent0;    // 0x0570 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg108_StaticMeshComponent0;    // 0x0578 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg107_StaticMeshComponent0;    // 0x0580 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg106_StaticMeshComponent0;    // 0x0588 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg105_StaticMeshComponent0;    // 0x0590 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg104_StaticMeshComponent0;    // 0x0598 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg103_StaticMeshComponent0;    // 0x05A0 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg102_StaticMeshComponent0;    // 0x05A8 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg101_StaticMeshComponent0;    // 0x05B0 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg100_StaticMeshComponent0;    // 0x05B8 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg99_StaticMeshComponent0;     // 0x05C0 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg98_StaticMeshComponent0;     // 0x05C8 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg97_StaticMeshComponent0;     // 0x05D0 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg96_StaticMeshComponent0;     // 0x05D8 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg95_StaticMeshComponent0;     // 0x05E0 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_47_StaticMeshComponent0;               // 0x05E8 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg94_StaticMeshComponent0;     // 0x05F0 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg93_StaticMeshComponent0;     // 0x05F8 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg92_StaticMeshComponent0;     // 0x0600 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_46_StaticMeshComponent0;               // 0x0608 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA64_StaticMeshComponent0;            // 0x0610 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA63_StaticMeshComponent0;            // 0x0618 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA62_StaticMeshComponent0;            // 0x0620 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA61_StaticMeshComponent0;            // 0x0628 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA60_StaticMeshComponent0;            // 0x0630 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA59_StaticMeshComponent0;            // 0x0638 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA58_StaticMeshComponent0;            // 0x0640 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA57_StaticMeshComponent0;            // 0x0648 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA56_StaticMeshComponent0;            // 0x0650 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA55_StaticMeshComponent0;            // 0x0658 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA54_StaticMeshComponent0;            // 0x0660 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA53_StaticMeshComponent0;            // 0x0668 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA52_StaticMeshComponent0;            // 0x0670 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA51_StaticMeshComponent0;            // 0x0678 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA50_StaticMeshComponent0;            // 0x0680 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA49_StaticMeshComponent0;            // 0x0688 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA48_StaticMeshComponent0;            // 0x0690 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA47_StaticMeshComponent0;            // 0x0698 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg91_StaticMeshComponent0;     // 0x06A0 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg90_StaticMeshComponent0;     // 0x06A8 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg89_StaticMeshComponent0;     // 0x06B0 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg88_StaticMeshComponent0;     // 0x06B8 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg87_StaticMeshComponent0;     // 0x06C0 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg86_StaticMeshComponent0;     // 0x06C8 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg85_StaticMeshComponent0;     // 0x06D0 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg84_StaticMeshComponent0;     // 0x06D8 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg83_StaticMeshComponent0;     // 0x06E0 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg82_StaticMeshComponent0;     // 0x06E8 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg81_StaticMeshComponent0;     // 0x06F0 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg80_StaticMeshComponent0;     // 0x06F8 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg79_StaticMeshComponent0;     // 0x0700 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg78_StaticMeshComponent0;     // 0x0708 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg77_StaticMeshComponent0;     // 0x0710 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg76_StaticMeshComponent0;     // 0x0718 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg75_StaticMeshComponent0;     // 0x0720 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_45_StaticMeshComponent0;               // 0x0728 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA46_StaticMeshComponent0;            // 0x0730 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA45_StaticMeshComponent0;            // 0x0738 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA44_StaticMeshComponent0;            // 0x0740 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA43_StaticMeshComponent0;            // 0x0748 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA42_StaticMeshComponent0;            // 0x0750 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA41_StaticMeshComponent0;            // 0x0758 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA40_StaticMeshComponent0;            // 0x0760 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA21_StaticMeshComponent0;            // 0x0768 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA20_StaticMeshComponent0;            // 0x0770 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA19_StaticMeshComponent0;            // 0x0778 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA18_StaticMeshComponent0;            // 0x0780 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA17_StaticMeshComponent0;            // 0x0788 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA16_StaticMeshComponent0;            // 0x0790 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA15_StaticMeshComponent0;            // 0x0798 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m64_StaticMeshComponent0;                   // 0x07A0 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m63_StaticMeshComponent0;                   // 0x07A8 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m62_StaticMeshComponent0;                   // 0x07B0 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m61_StaticMeshComponent0;                   // 0x07B8 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m60_StaticMeshComponent0;                   // 0x07C0 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m59_StaticMeshComponent0;                   // 0x07C8 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m58_StaticMeshComponent0;                   // 0x07D0 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m57_StaticMeshComponent0;                   // 0x07D8 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m56_StaticMeshComponent0;                   // 0x07E0 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m55_StaticMeshComponent0;                   // 0x07E8 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m54_StaticMeshComponent0;                   // 0x07F0 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m53_StaticMeshComponent0;                   // 0x07F8 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m52_StaticMeshComponent0;                   // 0x0800 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m51_StaticMeshComponent0;                   // 0x0808 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_44_StaticMeshComponent0;               // 0x0810 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_43_StaticMeshComponent0;               // 0x0818 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m50_StaticMeshComponent0;                   // 0x0820 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m49_StaticMeshComponent0;                   // 0x0828 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg74_StaticMeshComponent0;     // 0x0830 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg73_StaticMeshComponent0;     // 0x0838 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg72_StaticMeshComponent0;     // 0x0840 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg71_StaticMeshComponent0;     // 0x0848 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg70_StaticMeshComponent0;     // 0x0850 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg69_StaticMeshComponent0;     // 0x0858 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg68_StaticMeshComponent0;     // 0x0860 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg67_StaticMeshComponent0;     // 0x0868 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg66_StaticMeshComponent0;     // 0x0870 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg65_StaticMeshComponent0;     // 0x0878 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg64_StaticMeshComponent0;     // 0x0880 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg63_StaticMeshComponent0;     // 0x0888 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg62_StaticMeshComponent0;     // 0x0890 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg61_StaticMeshComponent0;     // 0x0898 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg60_StaticMeshComponent0;     // 0x08A0 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg59_StaticMeshComponent0;     // 0x08A8 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg58_StaticMeshComponent0;     // 0x08B0 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg57_StaticMeshComponent0;     // 0x08B8 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardB16_StaticMeshComponent0;            // 0x08C0 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardB15_StaticMeshComponent0;            // 0x08C8 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardB14_StaticMeshComponent0;            // 0x08D0 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardB13_StaticMeshComponent0;            // 0x08D8 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardB12_StaticMeshComponent0;            // 0x08E0 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardB11_StaticMeshComponent0;            // 0x08E8 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardB10_StaticMeshComponent0;            // 0x08F0 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardB9_StaticMeshComponent0;             // 0x08F8 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_42_StaticMeshComponent0;               // 0x0900 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_41_StaticMeshComponent0;               // 0x0908 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_40_StaticMeshComponent0;               // 0x0910 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_39_StaticMeshComponent0;               // 0x0918 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_38_StaticMeshComponent0;               // 0x0920 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_37_StaticMeshComponent0;               // 0x0928 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m48_StaticMeshComponent0;                   // 0x0930 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_36_StaticMeshComponent0;               // 0x0938 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m47_StaticMeshComponent0;                   // 0x0940 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_35_StaticMeshComponent0;               // 0x0948 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_34_StaticMeshComponent0;               // 0x0950 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_33_StaticMeshComponent0;               // 0x0958 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_32_StaticMeshComponent0;               // 0x0960 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_31_StaticMeshComponent0;               // 0x0968 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_30_StaticMeshComponent0;               // 0x0970 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_29_StaticMeshComponent0;               // 0x0978 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_01_2_StaticMeshComponent0;             // 0x0980 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_28_StaticMeshComponent0;               // 0x0988 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_27_StaticMeshComponent0;               // 0x0990 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_26_StaticMeshComponent0;               // 0x0998 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_25_StaticMeshComponent0;               // 0x09A0 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_24_StaticMeshComponent0;               // 0x09A8 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m4_StaticMeshComponent0;                       // 0x09B0 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m3_StaticMeshComponent0;                       // 0x09B8 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m46_StaticMeshComponent0;                   // 0x09C0 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m45_StaticMeshComponent0;                   // 0x09C8 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m44_StaticMeshComponent0;                   // 0x09D0 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m43_StaticMeshComponent0;                   // 0x09D8 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m42_StaticMeshComponent0;                   // 0x09E0 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m41_StaticMeshComponent0;                   // 0x09E8 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m40_StaticMeshComponent0;                   // 0x09F0 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m39_StaticMeshComponent0;                   // 0x09F8 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m38_StaticMeshComponent0;                   // 0x0A00 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m37_StaticMeshComponent0;                   // 0x0A08 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m36_StaticMeshComponent0;                   // 0x0A10 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m35_StaticMeshComponent0;                   // 0x0A18 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m34_StaticMeshComponent0;                   // 0x0A20 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m33_StaticMeshComponent0;                   // 0x0A28 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m12_StaticMeshComponent0;                      // 0x0A30 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m11_StaticMeshComponent0;                      // 0x0A38 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m10_StaticMeshComponent0;                      // 0x0A40 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m9_StaticMeshComponent0;                       // 0x0A48 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m8_StaticMeshComponent0;                       // 0x0A50 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m7_StaticMeshComponent0;                       // 0x0A58 (size: 0x8)
    class USceneComponent* Actor3_DefaultSceneRoot;                                   // 0x0A60 (size: 0x8)

}; // Size: 0xA68

#endif
