#ifndef UE4SS_SDK_C_SG_Gate_Lv2_Ubeam_A_HPP
#define UE4SS_SDK_C_SG_Gate_Lv2_Ubeam_A_HPP

class AC_SG_Gate_Lv2_Ubeam_A_C : public AConstructionBP_C
{
    class UStaticMeshComponent* UBeam_3m_rough3_StaticMeshComponent0;                 // 0x0550 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m_rough4_StaticMeshComponent0;                 // 0x0558 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m_rough2_StaticMeshComponent0;              // 0x0560 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_8_StaticMeshComponent0;                // 0x0568 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_9_StaticMeshComponent0;                // 0x0570 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m10_StaticMeshComponent0;                   // 0x0578 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m11_StaticMeshComponent0;                   // 0x0580 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m12_StaticMeshComponent0;                   // 0x0588 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m13_StaticMeshComponent0;                   // 0x0590 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m14_StaticMeshComponent0;                   // 0x0598 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m15_StaticMeshComponent0;                   // 0x05A0 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m16_StaticMeshComponent0;                   // 0x05A8 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m17_StaticMeshComponent0;                   // 0x05B0 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m18_StaticMeshComponent0;                   // 0x05B8 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_10_StaticMeshComponent0;               // 0x05C0 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_11_StaticMeshComponent0;               // 0x05C8 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_12_StaticMeshComponent0;               // 0x05D0 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_13_StaticMeshComponent0;               // 0x05D8 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg13_StaticMeshComponent0;     // 0x05E0 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg14_StaticMeshComponent0;     // 0x05E8 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg15_StaticMeshComponent0;     // 0x05F0 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg16_StaticMeshComponent0;     // 0x05F8 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg17_StaticMeshComponent0;     // 0x0600 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg18_StaticMeshComponent0;     // 0x0608 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg19_StaticMeshComponent0;     // 0x0610 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg20_StaticMeshComponent0;     // 0x0618 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg21_StaticMeshComponent0;     // 0x0620 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg22_StaticMeshComponent0;     // 0x0628 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg23_StaticMeshComponent0;     // 0x0630 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg24_StaticMeshComponent0;     // 0x0638 (size: 0x8)
    class UStaticMeshComponent* UGable_Smaller2_StaticMeshComponent0;                 // 0x0640 (size: 0x8)
    class UStaticMeshComponent* UGable_Smaller4_StaticMeshComponent0;                 // 0x0648 (size: 0x8)
    class UStaticMeshComponent* roof_SM_SG_Gate_Lv2_Ubeam_A2_StaticMeshComponent0;    // 0x0650 (size: 0x8)
    class USceneComponent* C_SG_Gate_Lv2_Ubeam_A_DefaultSceneRoot;                    // 0x0658 (size: 0x8)

}; // Size: 0x660

#endif
