#ifndef UE4SS_SDK_C_SG_Cottage_LV1_BPart_C_UBeam_HPP
#define UE4SS_SDK_C_SG_Cottage_LV1_BPart_C_UBeam_HPP

class AC_SG_Cottage_LV1_BPart_C_UBeam_C : public AConstructionBP_C
{
    class UStaticMeshComponent* Box;                                                  // 0x0550 (size: 0x8)
    class UStaticMeshComponent* UBeam_Strut_Straight23_StaticMeshComponent0;          // 0x0558 (size: 0x8)
    class UStaticMeshComponent* UBeam_Strut_Straight24_StaticMeshComponent0;          // 0x0560 (size: 0x8)
    class UStaticMeshComponent* UBeam_Strut_Straight25_StaticMeshComponent0;          // 0x0568 (size: 0x8)
    class UStaticMeshComponent* UBeam_Strut_Straight26_StaticMeshComponent0;          // 0x0570 (size: 0x8)
    class UStaticMeshComponent* UBeam_Strut_Straight27_StaticMeshComponent0;          // 0x0578 (size: 0x8)
    class UStaticMeshComponent* UBeam_Strut_Straight28_StaticMeshComponent0;          // 0x0580 (size: 0x8)
    class UStaticMeshComponent* UBeam_Strut_Straight29_StaticMeshComponent0;          // 0x0588 (size: 0x8)
    class UStaticMeshComponent* UBeam_Strut_Straight30_StaticMeshComponent0;          // 0x0590 (size: 0x8)
    class UStaticMeshComponent* UBeam_Strut_Straight31_StaticMeshComponent0;          // 0x0598 (size: 0x8)
    class UStaticMeshComponent* UBeam_Strut_Straight32_StaticMeshComponent0;          // 0x05A0 (size: 0x8)
    class UStaticMeshComponent* UBeam_Strut_Straight33_StaticMeshComponent0;          // 0x05A8 (size: 0x8)
    class UStaticMeshComponent* UBeam_Strut_Straight34_StaticMeshComponent0;          // 0x05B0 (size: 0x8)
    class UStaticMeshComponent* UBeam_Strut_Straight35_StaticMeshComponent0;          // 0x05B8 (size: 0x8)
    class UStaticMeshComponent* UBeam_Strut_Straight36_StaticMeshComponent0;          // 0x05C0 (size: 0x8)
    class UStaticMeshComponent* UBeam_Strut_Straight37_StaticMeshComponent0;          // 0x05C8 (size: 0x8)
    class UStaticMeshComponent* UBeam_Strut_Straight38_StaticMeshComponent0;          // 0x05D0 (size: 0x8)
    class UStaticMeshComponent* UBeam_Strut_Straight39_StaticMeshComponent0;          // 0x05D8 (size: 0x8)
    class UStaticMeshComponent* UBeam_Strut_Straight40_StaticMeshComponent0;          // 0x05E0 (size: 0x8)
    class UStaticMeshComponent* UBeam_Strut_Straight41_StaticMeshComponent0;          // 0x05E8 (size: 0x8)
    class UStaticMeshComponent* UBeam_Strut_Straight42_StaticMeshComponent0;          // 0x05F0 (size: 0x8)
    class UStaticMeshComponent* UBeam_Strut_Straight43_StaticMeshComponent0;          // 0x05F8 (size: 0x8)
    class UStaticMeshComponent* UBeam_Strut_Straight44_StaticMeshComponent0;          // 0x0600 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m9_StaticMeshComponent0;                  // 0x0608 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m10_StaticMeshComponent0;                 // 0x0610 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m11_StaticMeshComponent0;                 // 0x0618 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m12_StaticMeshComponent0;                 // 0x0620 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Tapered_CutE5_StaticMeshComponent0;         // 0x0628 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed46_StaticMeshComponent0;           // 0x0630 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed47_StaticMeshComponent0;           // 0x0638 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed48_StaticMeshComponent0;           // 0x0640 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed49_StaticMeshComponent0;           // 0x0648 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed50_StaticMeshComponent0;           // 0x0650 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed51_StaticMeshComponent0;           // 0x0658 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed52_StaticMeshComponent0;           // 0x0660 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed53_StaticMeshComponent0;           // 0x0668 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed54_StaticMeshComponent0;           // 0x0670 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed55_StaticMeshComponent0;           // 0x0678 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed56_StaticMeshComponent0;           // 0x0680 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed57_StaticMeshComponent0;           // 0x0688 (size: 0x8)
    class UStaticMeshComponent* sg_fillerBoardB10_StaticMeshComponent0;               // 0x0690 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA4_StaticMeshComponent0;                // 0x0698 (size: 0x8)
    class UStaticMeshComponent* sg_fillerBoardB11_StaticMeshComponent0;               // 0x06A0 (size: 0x8)
    class UStaticMeshComponent* planeDenseBeveledA5_StaticMeshComponent0;             // 0x06A8 (size: 0x8)
    class UStaticMeshComponent* PlaneDenseWindowSlotSingleB_secondFloor_beveled_taperedMore_BothNoWindow2_StaticMeshComponent0; // 0x06B0 (size: 0x8)
    class UStaticMeshComponent* WattleOwidzTriangle2_StaticMeshComponent0;            // 0x06B8 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed58_StaticMeshComponent0;           // 0x06C0 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed59_StaticMeshComponent0;           // 0x06C8 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed60_StaticMeshComponent0;           // 0x06D0 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed61_StaticMeshComponent0;           // 0x06D8 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed62_StaticMeshComponent0;           // 0x06E0 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed63_StaticMeshComponent0;           // 0x06E8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly41_StaticMeshComponent0;    // 0x06F0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly42_StaticMeshComponent0;    // 0x06F8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly43_StaticMeshComponent0;    // 0x0700 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly44_StaticMeshComponent0;    // 0x0708 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly45_StaticMeshComponent0;    // 0x0710 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly46_StaticMeshComponent0;    // 0x0718 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly47_StaticMeshComponent0;    // 0x0720 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly48_StaticMeshComponent0;    // 0x0728 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly49_StaticMeshComponent0;    // 0x0730 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly50_StaticMeshComponent0;    // 0x0738 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly51_StaticMeshComponent0;    // 0x0740 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly52_StaticMeshComponent0;    // 0x0748 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly53_StaticMeshComponent0;    // 0x0750 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly54_StaticMeshComponent0;    // 0x0758 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly55_StaticMeshComponent0;    // 0x0760 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly56_StaticMeshComponent0;    // 0x0768 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly57_StaticMeshComponent0;    // 0x0770 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly58_StaticMeshComponent0;    // 0x0778 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly59_StaticMeshComponent0;    // 0x0780 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly60_StaticMeshComponent0;    // 0x0788 (size: 0x8)
    class UStaticMeshComponent* Thatch_SG_BPart_LV1_C2_StaticMeshComponent0;          // 0x0790 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Tapered_CutE15_StaticMeshComponent0;        // 0x0798 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Tapered_CutE16_StaticMeshComponent0;        // 0x07A0 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Tapered_CutE17_StaticMeshComponent0;        // 0x07A8 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Tapered_CutE18_StaticMeshComponent0;        // 0x07B0 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Tapered_CutE19_StaticMeshComponent0;        // 0x07B8 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Tapered_CutE20_StaticMeshComponent0;        // 0x07C0 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Tapered_CutE21_StaticMeshComponent0;        // 0x07C8 (size: 0x8)
    class UStaticMeshComponent* planeDenseBeveledA6_StaticMeshComponent0;             // 0x07D0 (size: 0x8)
    class UStaticMeshComponent* PlaneDenseWindowPaintedSingle4_StaticMeshComponent0;  // 0x07D8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m13_StaticMeshComponent0;                 // 0x07E0 (size: 0x8)
    class UStaticMeshComponent* PlaneDenseWindowPaintedSingle5_StaticMeshComponent0;  // 0x07E8 (size: 0x8)
    class UStaticMeshComponent* SG_windowBoardE_double7_StaticMeshComponent0;         // 0x07F0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly61_StaticMeshComponent0;    // 0x07F8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly62_StaticMeshComponent0;    // 0x0800 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly63_StaticMeshComponent0;    // 0x0808 (size: 0x8)
    class UStaticMeshComponent* sg_fillerBoardB29_StaticMeshComponent0;               // 0x0810 (size: 0x8)
    class UStaticMeshComponent* sg_fillerBoardB30_StaticMeshComponent0;               // 0x0818 (size: 0x8)
    class UStaticMeshComponent* sg_fillerBoardB12_StaticMeshComponent0;               // 0x0820 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA5_StaticMeshComponent0;                // 0x0828 (size: 0x8)
    class UStaticMeshComponent* sg_fillerBoardB31_StaticMeshComponent0;               // 0x0830 (size: 0x8)
    class UStaticMeshComponent* SG_windowBoardE_double8_StaticMeshComponent0;         // 0x0838 (size: 0x8)
    class UStaticMeshComponent* sg_fillerBoardB32_StaticMeshComponent0;               // 0x0840 (size: 0x8)
    class UStaticMeshComponent* sg_fillerBoardB33_StaticMeshComponent0;               // 0x0848 (size: 0x8)
    class UStaticMeshComponent* sg_fillerBoardB16_StaticMeshComponent0;               // 0x0850 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA7_StaticMeshComponent0;                // 0x0858 (size: 0x8)
    class UStaticMeshComponent* sg_fillerBoardB17_StaticMeshComponent0;               // 0x0860 (size: 0x8)
    class UStaticMeshComponent* SG_windowBoardE_double9_StaticMeshComponent0;         // 0x0868 (size: 0x8)
    class UStaticMeshComponent* sg_fillerBoardB34_StaticMeshComponent0;               // 0x0870 (size: 0x8)
    class UStaticMeshComponent* sg_fillerBoardB35_StaticMeshComponent0;               // 0x0878 (size: 0x8)
    class UStaticMeshComponent* sg_fillerBoardB18_StaticMeshComponent0;               // 0x0880 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA8_StaticMeshComponent0;                // 0x0888 (size: 0x8)
    class UStaticMeshComponent* sg_fillerBoardB36_StaticMeshComponent0;               // 0x0890 (size: 0x8)
    class UStaticMeshComponent* SG_windowBoardE_double10_StaticMeshComponent0;        // 0x0898 (size: 0x8)
    class UStaticMeshComponent* sg_fillerBoardB37_StaticMeshComponent0;               // 0x08A0 (size: 0x8)
    class UStaticMeshComponent* sg_fillerBoardB38_StaticMeshComponent0;               // 0x08A8 (size: 0x8)
    class UStaticMeshComponent* Foundation_SG_Cottage_LV1_BPart_C2_StaticMeshComponent0; // 0x08B0 (size: 0x8)
    class USceneComponent* C_SG_Cottage_LV1_BPart_C_UBeam_DefaultSceneRoot;           // 0x08B8 (size: 0x8)

}; // Size: 0x8C0

#endif
