#ifndef UE4SS_SDK_C_SG_Weaver_Workshop_Ubeam_HPP
#define UE4SS_SDK_C_SG_Weaver_Workshop_Ubeam_HPP

class AC_SG_Weaver_Workshop_Ubeam_C : public AConstructionBP_C
{
    class UStaticMeshComponent* UBeam_1_5_m72_StaticMeshComponent0;                   // 0x0550 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m73_StaticMeshComponent0;                   // 0x0558 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m74_StaticMeshComponent0;                   // 0x0560 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m75_StaticMeshComponent0;                   // 0x0568 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m76_StaticMeshComponent0;                   // 0x0570 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m77_StaticMeshComponent0;                   // 0x0578 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m78_StaticMeshComponent0;                   // 0x0580 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m79_StaticMeshComponent0;                   // 0x0588 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m80_StaticMeshComponent0;                   // 0x0590 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m81_StaticMeshComponent0;                   // 0x0598 (size: 0x8)
    class UStaticMeshComponent* UBeam_DoorHeadA3_StaticMeshComponent0;                // 0x05A0 (size: 0x8)
    class UStaticMeshComponent* UBeam_DoorHeadA4_StaticMeshComponent0;                // 0x05A8 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m82_StaticMeshComponent0;                   // 0x05B0 (size: 0x8)
    class UStaticMeshComponent* UBeam_brace6_StaticMeshComponent0;                    // 0x05B8 (size: 0x8)
    class UStaticMeshComponent* UBeam_brace8_StaticMeshComponent0;                    // 0x05C0 (size: 0x8)
    class UStaticMeshComponent* UBeam_brace9_StaticMeshComponent0;                    // 0x05C8 (size: 0x8)
    class UStaticMeshComponent* UBeam_brace10_StaticMeshComponent0;                   // 0x05D0 (size: 0x8)
    class UStaticMeshComponent* UBeam_brace11_StaticMeshComponent0;                   // 0x05D8 (size: 0x8)
    class UStaticMeshComponent* UBeam_brace12_StaticMeshComponent0;                   // 0x05E0 (size: 0x8)
    class UStaticMeshComponent* UBeam_brace13_StaticMeshComponent0;                   // 0x05E8 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m83_StaticMeshComponent0;                   // 0x05F0 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m84_StaticMeshComponent0;                   // 0x05F8 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m85_StaticMeshComponent0;                   // 0x0600 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m86_StaticMeshComponent0;                   // 0x0608 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m87_StaticMeshComponent0;                   // 0x0610 (size: 0x8)
    class UStaticMeshComponent* UBeam_brace14_StaticMeshComponent0;                   // 0x0618 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m88_StaticMeshComponent0;                   // 0x0620 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m89_StaticMeshComponent0;                   // 0x0628 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m90_StaticMeshComponent0;                   // 0x0630 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m91_StaticMeshComponent0;                   // 0x0638 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m92_StaticMeshComponent0;                   // 0x0640 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m93_StaticMeshComponent0;                   // 0x0648 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m94_StaticMeshComponent0;                   // 0x0650 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m95_StaticMeshComponent0;                   // 0x0658 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m96_StaticMeshComponent0;                   // 0x0660 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m97_StaticMeshComponent0;                   // 0x0668 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m98_StaticMeshComponent0;                   // 0x0670 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_TwoWindowsStandard_Lower5_StaticMeshComponent0; // 0x0678 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_TwoWindowsStandard_Lower6_StaticMeshComponent0; // 0x0680 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_TwoWindowsStandard_Lower7_StaticMeshComponent0; // 0x0688 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m99_StaticMeshComponent0;                   // 0x0690 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m100_StaticMeshComponent0;                  // 0x0698 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m101_StaticMeshComponent0;                  // 0x06A0 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m102_StaticMeshComponent0;                  // 0x06A8 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m103_StaticMeshComponent0;                  // 0x06B0 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m104_StaticMeshComponent0;                  // 0x06B8 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m105_StaticMeshComponent0;                  // 0x06C0 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m106_StaticMeshComponent0;                  // 0x06C8 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m107_StaticMeshComponent0;                  // 0x06D0 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m108_StaticMeshComponent0;                  // 0x06D8 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m109_StaticMeshComponent0;                  // 0x06E0 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m110_StaticMeshComponent0;                  // 0x06E8 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m111_StaticMeshComponent0;                  // 0x06F0 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m112_StaticMeshComponent0;                  // 0x06F8 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m113_StaticMeshComponent0;                  // 0x0700 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg43_StaticMeshComponent0;     // 0x0708 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg44_StaticMeshComponent0;     // 0x0710 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg45_StaticMeshComponent0;     // 0x0718 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg46_StaticMeshComponent0;     // 0x0720 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg47_StaticMeshComponent0;     // 0x0728 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg48_StaticMeshComponent0;     // 0x0730 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg49_StaticMeshComponent0;     // 0x0738 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg50_StaticMeshComponent0;     // 0x0740 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m114_StaticMeshComponent0;                  // 0x0748 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m115_StaticMeshComponent0;                  // 0x0750 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m116_StaticMeshComponent0;                  // 0x0758 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_TwoWindowsStandard_Lower8_StaticMeshComponent0; // 0x0760 (size: 0x8)
    class UStaticMeshComponent* UGable_Standard3_StaticMeshComponent0;                // 0x0768 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m117_StaticMeshComponent0;                  // 0x0770 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m118_StaticMeshComponent0;                  // 0x0778 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m119_StaticMeshComponent0;                  // 0x0780 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m120_StaticMeshComponent0;                  // 0x0788 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m121_StaticMeshComponent0;                  // 0x0790 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m122_StaticMeshComponent0;                  // 0x0798 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m123_StaticMeshComponent0;                  // 0x07A0 (size: 0x8)
    class UStaticMeshComponent* Foundation_SG_WeaverWorkshop_Ubeam2_StaticMeshComponent0; // 0x07A8 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m124_StaticMeshComponent0;                  // 0x07B0 (size: 0x8)
    class UStaticMeshComponent* Cube5_StaticMeshComponent0;                           // 0x07B8 (size: 0x8)
    class UStaticMeshComponent* Cube6_StaticMeshComponent0;                           // 0x07C0 (size: 0x8)
    class UStaticMeshComponent* Thatch_SG_WeaverWorkshop_Ubeam2_StaticMeshComponent0; // 0x07C8 (size: 0x8)
    class UStaticMeshComponent* WattleOwidzTriangle4_StaticMeshComponent0;            // 0x07D0 (size: 0x8)
    class UStaticMeshComponent* UBeam_Strut_Wonky9_StaticMeshComponent0;              // 0x07D8 (size: 0x8)
    class UStaticMeshComponent* UBeam_Strut_Wonky10_StaticMeshComponent0;             // 0x07E0 (size: 0x8)
    class UStaticMeshComponent* UBeam_Strut_Wonky11_StaticMeshComponent0;             // 0x07E8 (size: 0x8)
    class UStaticMeshComponent* UBeam_Strut_Wonky12_StaticMeshComponent0;             // 0x07F0 (size: 0x8)
    class UStaticMeshComponent* UBeam_Strut_Wonky13_StaticMeshComponent0;             // 0x07F8 (size: 0x8)
    class UStaticMeshComponent* UBeam_Strut_Wonky14_StaticMeshComponent0;             // 0x0800 (size: 0x8)
    class UStaticMeshComponent* UBeam_Strut_Wonky15_StaticMeshComponent0;             // 0x0808 (size: 0x8)
    class UStaticMeshComponent* UBeam_Strut_Wonky16_StaticMeshComponent0;             // 0x0810 (size: 0x8)
    class USceneComponent* C_SG_Weaver_Workshop_Ubeam_DefaultSceneRoot;               // 0x0818 (size: 0x8)

}; // Size: 0x820

#endif
