#ifndef UE4SS_SDK_C_SG_Manor_Keep_Lv1_HPP
#define UE4SS_SDK_C_SG_Manor_Keep_Lv1_HPP

class AC_SG_Manor_Keep_Lv1_C : public AConstructionBP_C
{
    class UStaticMeshComponent* sg_peg170_StaticMeshComponent0;                       // 0x0550 (size: 0x8)
    class UStaticMeshComponent* sg_peg169_StaticMeshComponent0;                       // 0x0558 (size: 0x8)
    class UStaticMeshComponent* sg_peg168_StaticMeshComponent0;                       // 0x0560 (size: 0x8)
    class UStaticMeshComponent* sg_peg167_StaticMeshComponent0;                       // 0x0568 (size: 0x8)
    class UStaticMeshComponent* sg_peg166_StaticMeshComponent0;                       // 0x0570 (size: 0x8)
    class UStaticMeshComponent* sg_peg165_StaticMeshComponent0;                       // 0x0578 (size: 0x8)
    class UStaticMeshComponent* sg_peg164_StaticMeshComponent0;                       // 0x0580 (size: 0x8)
    class UStaticMeshComponent* sg_peg163_StaticMeshComponent0;                       // 0x0588 (size: 0x8)
    class UStaticMeshComponent* sg_peg162_StaticMeshComponent0;                       // 0x0590 (size: 0x8)
    class UStaticMeshComponent* sg_peg161_StaticMeshComponent0;                       // 0x0598 (size: 0x8)
    class UStaticMeshComponent* sg_peg160_StaticMeshComponent0;                       // 0x05A0 (size: 0x8)
    class UStaticMeshComponent* sg_peg159_StaticMeshComponent0;                       // 0x05A8 (size: 0x8)
    class UStaticMeshComponent* sg_peg158_StaticMeshComponent0;                       // 0x05B0 (size: 0x8)
    class UStaticMeshComponent* sg_peg157_StaticMeshComponent0;                       // 0x05B8 (size: 0x8)
    class UStaticMeshComponent* sg_peg156_StaticMeshComponent0;                       // 0x05C0 (size: 0x8)
    class UStaticMeshComponent* sg_peg155_StaticMeshComponent0;                       // 0x05C8 (size: 0x8)
    class UStaticMeshComponent* sg_peg154_StaticMeshComponent0;                       // 0x05D0 (size: 0x8)
    class UStaticMeshComponent* sg_peg153_StaticMeshComponent0;                       // 0x05D8 (size: 0x8)
    class UStaticMeshComponent* SM_Beam_DiagonalD_Long40_StaticMeshComponent0;        // 0x05E0 (size: 0x8)
    class UStaticMeshComponent* SM_Beam_DiagonalD_Long39_StaticMeshComponent0;        // 0x05E8 (size: 0x8)
    class UStaticMeshComponent* SM_Beam_DiagonalD_Long38_StaticMeshComponent0;        // 0x05F0 (size: 0x8)
    class UStaticMeshComponent* SM_Beam_DiagonalD_Long37_StaticMeshComponent0;        // 0x05F8 (size: 0x8)
    class UStaticMeshComponent* SM_Beam_DiagonalD_Long36_StaticMeshComponent0;        // 0x0600 (size: 0x8)
    class UStaticMeshComponent* SM_Beam_DiagonalD_Long35_StaticMeshComponent0;        // 0x0608 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise211_StaticMeshComponent0;              // 0x0610 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise210_StaticMeshComponent0;              // 0x0618 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise209_StaticMeshComponent0;              // 0x0620 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise208_StaticMeshComponent0;              // 0x0628 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise207_StaticMeshComponent0;              // 0x0630 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise206_StaticMeshComponent0;              // 0x0638 (size: 0x8)
    class UStaticMeshComponent* woodenShinglesMega_anotherSculpt_Narrower4_StaticMeshComponent0; // 0x0640 (size: 0x8)
    class UStaticMeshComponent* SM_Beam_DiagonalD_Long34_StaticMeshComponent0;        // 0x0648 (size: 0x8)
    class UStaticMeshComponent* SM_Beam_DiagonalD_Long33_StaticMeshComponent0;        // 0x0650 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA373_StaticMeshComponent0;              // 0x0658 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA372_StaticMeshComponent0;              // 0x0660 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA371_StaticMeshComponent0;              // 0x0668 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA370_StaticMeshComponent0;              // 0x0670 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA369_StaticMeshComponent0;              // 0x0678 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA368_StaticMeshComponent0;              // 0x0680 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA367_StaticMeshComponent0;              // 0x0688 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA366_StaticMeshComponent0;              // 0x0690 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA365_StaticMeshComponent0;              // 0x0698 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA364_StaticMeshComponent0;              // 0x06A0 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA363_StaticMeshComponent0;              // 0x06A8 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA362_StaticMeshComponent0;              // 0x06B0 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA361_StaticMeshComponent0;              // 0x06B8 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA360_StaticMeshComponent0;              // 0x06C0 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA359_StaticMeshComponent0;              // 0x06C8 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA358_StaticMeshComponent0;              // 0x06D0 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA357_StaticMeshComponent0;              // 0x06D8 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise205_StaticMeshComponent0;              // 0x06E0 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA356_StaticMeshComponent0;              // 0x06E8 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA355_StaticMeshComponent0;              // 0x06F0 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA354_StaticMeshComponent0;              // 0x06F8 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA353_StaticMeshComponent0;              // 0x0700 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA352_StaticMeshComponent0;              // 0x0708 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA351_StaticMeshComponent0;              // 0x0710 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA350_StaticMeshComponent0;              // 0x0718 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA349_StaticMeshComponent0;              // 0x0720 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA348_StaticMeshComponent0;              // 0x0728 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA347_StaticMeshComponent0;              // 0x0730 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA346_StaticMeshComponent0;              // 0x0738 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA345_StaticMeshComponent0;              // 0x0740 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA344_StaticMeshComponent0;              // 0x0748 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA343_StaticMeshComponent0;              // 0x0750 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA342_StaticMeshComponent0;              // 0x0758 (size: 0x8)
    class UStaticMeshComponent* black39_StaticMeshComponent0;                         // 0x0760 (size: 0x8)
    class UStaticMeshComponent* black38_StaticMeshComponent0;                         // 0x0768 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA341_StaticMeshComponent0;              // 0x0770 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA340_StaticMeshComponent0;              // 0x0778 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA339_StaticMeshComponent0;              // 0x0780 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA338_StaticMeshComponent0;              // 0x0788 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA337_StaticMeshComponent0;              // 0x0790 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA336_StaticMeshComponent0;              // 0x0798 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA335_StaticMeshComponent0;              // 0x07A0 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA334_StaticMeshComponent0;              // 0x07A8 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA333_StaticMeshComponent0;              // 0x07B0 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA332_StaticMeshComponent0;              // 0x07B8 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA331_StaticMeshComponent0;              // 0x07C0 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA330_StaticMeshComponent0;              // 0x07C8 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA329_StaticMeshComponent0;              // 0x07D0 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA328_StaticMeshComponent0;              // 0x07D8 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA327_StaticMeshComponent0;              // 0x07E0 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA326_StaticMeshComponent0;              // 0x07E8 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA325_StaticMeshComponent0;              // 0x07F0 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA324_StaticMeshComponent0;              // 0x07F8 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA323_StaticMeshComponent0;              // 0x0800 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA322_StaticMeshComponent0;              // 0x0808 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA321_StaticMeshComponent0;              // 0x0810 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA320_StaticMeshComponent0;              // 0x0818 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA319_StaticMeshComponent0;              // 0x0820 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA318_StaticMeshComponent0;              // 0x0828 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA317_StaticMeshComponent0;              // 0x0830 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA316_StaticMeshComponent0;              // 0x0838 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise204_StaticMeshComponent0;              // 0x0840 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA315_StaticMeshComponent0;              // 0x0848 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA314_StaticMeshComponent0;              // 0x0850 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise203_StaticMeshComponent0;              // 0x0858 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise202_StaticMeshComponent0;              // 0x0860 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise201_StaticMeshComponent0;              // 0x0868 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise200_StaticMeshComponent0;              // 0x0870 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise199_StaticMeshComponent0;              // 0x0878 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise198_StaticMeshComponent0;              // 0x0880 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise197_StaticMeshComponent0;              // 0x0888 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise196_StaticMeshComponent0;              // 0x0890 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise195_StaticMeshComponent0;              // 0x0898 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise194_StaticMeshComponent0;              // 0x08A0 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise193_StaticMeshComponent0;              // 0x08A8 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise192_StaticMeshComponent0;              // 0x08B0 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA313_StaticMeshComponent0;              // 0x08B8 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise191_StaticMeshComponent0;              // 0x08C0 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA312_StaticMeshComponent0;              // 0x08C8 (size: 0x8)
    class UStaticMeshComponent* LevitatingOuthouse3_StaticMeshComponent0;             // 0x08D0 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise190_StaticMeshComponent0;              // 0x08D8 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise189_StaticMeshComponent0;              // 0x08E0 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise188_StaticMeshComponent0;              // 0x08E8 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise187_StaticMeshComponent0;              // 0x08F0 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise186_StaticMeshComponent0;              // 0x08F8 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise185_StaticMeshComponent0;              // 0x0900 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise184_StaticMeshComponent0;              // 0x0908 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise183_StaticMeshComponent0;              // 0x0910 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise182_StaticMeshComponent0;              // 0x0918 (size: 0x8)
    class UStaticMeshComponent* SM_Beam_DiagonalD_Long32_StaticMeshComponent0;        // 0x0920 (size: 0x8)
    class UStaticMeshComponent* SM_Beam_DiagonalD_Long31_StaticMeshComponent0;        // 0x0928 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise181_StaticMeshComponent0;              // 0x0930 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise180_StaticMeshComponent0;              // 0x0938 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA311_StaticMeshComponent0;              // 0x0940 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise179_StaticMeshComponent0;              // 0x0948 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA310_StaticMeshComponent0;              // 0x0950 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA309_StaticMeshComponent0;              // 0x0958 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA308_StaticMeshComponent0;              // 0x0960 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA307_StaticMeshComponent0;              // 0x0968 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise178_StaticMeshComponent0;              // 0x0970 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA306_StaticMeshComponent0;              // 0x0978 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA305_StaticMeshComponent0;              // 0x0980 (size: 0x8)
    class UStaticMeshComponent* sg_fancyFence71_StaticMeshComponent0;                 // 0x0988 (size: 0x8)
    class UStaticMeshComponent* sg_fancyFence70_StaticMeshComponent0;                 // 0x0990 (size: 0x8)
    class UStaticMeshComponent* sg_fancyFence69_StaticMeshComponent0;                 // 0x0998 (size: 0x8)
    class UStaticMeshComponent* sg_fancyFence68_StaticMeshComponent0;                 // 0x09A0 (size: 0x8)
    class UStaticMeshComponent* sg_fancyFence67_StaticMeshComponent0;                 // 0x09A8 (size: 0x8)
    class UStaticMeshComponent* SM_Beam_DiagonalD_Long30_StaticMeshComponent0;        // 0x09B0 (size: 0x8)
    class UStaticMeshComponent* SM_Beam_DiagonalD_Long29_StaticMeshComponent0;        // 0x09B8 (size: 0x8)
    class UStaticMeshComponent* SM_Beam_DiagonalD_Long28_StaticMeshComponent0;        // 0x09C0 (size: 0x8)
    class UStaticMeshComponent* SM_Beam_DiagonalD_Long27_StaticMeshComponent0;        // 0x09C8 (size: 0x8)
    class UStaticMeshComponent* SM_Beam_DiagonalD_Long26_StaticMeshComponent0;        // 0x09D0 (size: 0x8)
    class UStaticMeshComponent* SM_Beam_DiagonalD_Long25_StaticMeshComponent0;        // 0x09D8 (size: 0x8)
    class UStaticMeshComponent* SM_Beam_DiagonalD_Long24_StaticMeshComponent0;        // 0x09E0 (size: 0x8)
    class UStaticMeshComponent* SM_Beam_DiagonalD_Long23_StaticMeshComponent0;        // 0x09E8 (size: 0x8)
    class UStaticMeshComponent* sg_fancyFence66_StaticMeshComponent0;                 // 0x09F0 (size: 0x8)
    class UStaticMeshComponent* sg_fancyFence65_StaticMeshComponent0;                 // 0x09F8 (size: 0x8)
    class UStaticMeshComponent* sg_fancyFence64_StaticMeshComponent0;                 // 0x0A00 (size: 0x8)
    class UStaticMeshComponent* sg_fancyFence63_StaticMeshComponent0;                 // 0x0A08 (size: 0x8)
    class UStaticMeshComponent* sg_fancyFence62_StaticMeshComponent0;                 // 0x0A10 (size: 0x8)
    class UStaticMeshComponent* sg_fancyFence61_StaticMeshComponent0;                 // 0x0A18 (size: 0x8)
    class UStaticMeshComponent* sg_fancyFence60_StaticMeshComponent0;                 // 0x0A20 (size: 0x8)
    class UStaticMeshComponent* sg_fancyFence59_StaticMeshComponent0;                 // 0x0A28 (size: 0x8)
    class UStaticMeshComponent* sg_fancyFence58_StaticMeshComponent0;                 // 0x0A30 (size: 0x8)
    class UStaticMeshComponent* sg_fancyFence57_StaticMeshComponent0;                 // 0x0A38 (size: 0x8)
    class UStaticMeshComponent* sg_fancyFence56_StaticMeshComponent0;                 // 0x0A40 (size: 0x8)
    class UStaticMeshComponent* sg_fancyFence55_StaticMeshComponent0;                 // 0x0A48 (size: 0x8)
    class UStaticMeshComponent* sg_fancyFence54_StaticMeshComponent0;                 // 0x0A50 (size: 0x8)
    class UStaticMeshComponent* sg_fancyFence53_StaticMeshComponent0;                 // 0x0A58 (size: 0x8)
    class UStaticMeshComponent* sg_fancyFence52_StaticMeshComponent0;                 // 0x0A60 (size: 0x8)
    class UStaticMeshComponent* sg_fancyFence51_StaticMeshComponent0;                 // 0x0A68 (size: 0x8)
    class UStaticMeshComponent* sg_fancyFence50_StaticMeshComponent0;                 // 0x0A70 (size: 0x8)
    class UStaticMeshComponent* sg_fancyFence49_StaticMeshComponent0;                 // 0x0A78 (size: 0x8)
    class UStaticMeshComponent* sg_fancyFence48_StaticMeshComponent0;                 // 0x0A80 (size: 0x8)
    class UStaticMeshComponent* sg_fancyFence47_StaticMeshComponent0;                 // 0x0A88 (size: 0x8)
    class UStaticMeshComponent* sg_fancyFence46_StaticMeshComponent0;                 // 0x0A90 (size: 0x8)
    class UStaticMeshComponent* sg_fancyFence45_StaticMeshComponent0;                 // 0x0A98 (size: 0x8)
    class UStaticMeshComponent* sg_fancyFence44_StaticMeshComponent0;                 // 0x0AA0 (size: 0x8)
    class UStaticMeshComponent* sg_fancyFence43_StaticMeshComponent0;                 // 0x0AA8 (size: 0x8)
    class UStaticMeshComponent* sg_fancyFence42_StaticMeshComponent0;                 // 0x0AB0 (size: 0x8)
    class UStaticMeshComponent* sg_fancyFence41_StaticMeshComponent0;                 // 0x0AB8 (size: 0x8)
    class UStaticMeshComponent* sg_fancyFence40_StaticMeshComponent0;                 // 0x0AC0 (size: 0x8)
    class UStaticMeshComponent* sg_fancyFence39_StaticMeshComponent0;                 // 0x0AC8 (size: 0x8)
    class UStaticMeshComponent* sg_fancyFence38_StaticMeshComponent0;                 // 0x0AD0 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise177_StaticMeshComponent0;              // 0x0AD8 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise176_StaticMeshComponent0;              // 0x0AE0 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise175_StaticMeshComponent0;              // 0x0AE8 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise174_StaticMeshComponent0;              // 0x0AF0 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise173_StaticMeshComponent0;              // 0x0AF8 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise172_StaticMeshComponent0;              // 0x0B00 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise171_StaticMeshComponent0;              // 0x0B08 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise170_StaticMeshComponent0;              // 0x0B10 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise169_StaticMeshComponent0;              // 0x0B18 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise168_StaticMeshComponent0;              // 0x0B20 (size: 0x8)
    class UStaticMeshComponent* sg_fancyFence3_StaticMeshComponent0;                  // 0x0B28 (size: 0x8)
    class UStaticMeshComponent* shinglesMega_turret_spiky2_StaticMeshComponent0;      // 0x0B30 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA304_StaticMeshComponent0;              // 0x0B38 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA303_StaticMeshComponent0;              // 0x0B40 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA302_StaticMeshComponent0;              // 0x0B48 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA301_StaticMeshComponent0;              // 0x0B50 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA300_StaticMeshComponent0;              // 0x0B58 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA299_StaticMeshComponent0;              // 0x0B60 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise167_StaticMeshComponent0;              // 0x0B68 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise166_StaticMeshComponent0;              // 0x0B70 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise165_StaticMeshComponent0;              // 0x0B78 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise164_StaticMeshComponent0;              // 0x0B80 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise163_StaticMeshComponent0;              // 0x0B88 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise162_StaticMeshComponent0;              // 0x0B90 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise161_StaticMeshComponent0;              // 0x0B98 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise160_StaticMeshComponent0;              // 0x0BA0 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise159_StaticMeshComponent0;              // 0x0BA8 (size: 0x8)
    class UStaticMeshComponent* black37_StaticMeshComponent0;                         // 0x0BB0 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA298_StaticMeshComponent0;              // 0x0BB8 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA297_StaticMeshComponent0;              // 0x0BC0 (size: 0x8)
    class UStaticMeshComponent* SM_Beam_DiagonalD_Long22_StaticMeshComponent0;        // 0x0BC8 (size: 0x8)
    class UStaticMeshComponent* SM_Beam_DiagonalD_Long21_StaticMeshComponent0;        // 0x0BD0 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise158_StaticMeshComponent0;              // 0x0BD8 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise157_StaticMeshComponent0;              // 0x0BE0 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise156_StaticMeshComponent0;              // 0x0BE8 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise155_StaticMeshComponent0;              // 0x0BF0 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA296_StaticMeshComponent0;              // 0x0BF8 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA295_StaticMeshComponent0;              // 0x0C00 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA294_StaticMeshComponent0;              // 0x0C08 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA293_StaticMeshComponent0;              // 0x0C10 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA292_StaticMeshComponent0;              // 0x0C18 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA291_StaticMeshComponent0;              // 0x0C20 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA290_StaticMeshComponent0;              // 0x0C28 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA289_StaticMeshComponent0;              // 0x0C30 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA288_StaticMeshComponent0;              // 0x0C38 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA287_StaticMeshComponent0;              // 0x0C40 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA286_StaticMeshComponent0;              // 0x0C48 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA285_StaticMeshComponent0;              // 0x0C50 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA284_StaticMeshComponent0;              // 0x0C58 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA283_StaticMeshComponent0;              // 0x0C60 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA282_StaticMeshComponent0;              // 0x0C68 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA281_StaticMeshComponent0;              // 0x0C70 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA280_StaticMeshComponent0;              // 0x0C78 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA279_StaticMeshComponent0;              // 0x0C80 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA278_StaticMeshComponent0;              // 0x0C88 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA277_StaticMeshComponent0;              // 0x0C90 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA276_StaticMeshComponent0;              // 0x0C98 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA275_StaticMeshComponent0;              // 0x0CA0 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA274_StaticMeshComponent0;              // 0x0CA8 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA273_StaticMeshComponent0;              // 0x0CB0 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA272_StaticMeshComponent0;              // 0x0CB8 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA271_StaticMeshComponent0;              // 0x0CC0 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA270_StaticMeshComponent0;              // 0x0CC8 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA269_StaticMeshComponent0;              // 0x0CD0 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA268_StaticMeshComponent0;              // 0x0CD8 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA267_StaticMeshComponent0;              // 0x0CE0 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA266_StaticMeshComponent0;              // 0x0CE8 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA265_StaticMeshComponent0;              // 0x0CF0 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA264_StaticMeshComponent0;              // 0x0CF8 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA263_StaticMeshComponent0;              // 0x0D00 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA262_StaticMeshComponent0;              // 0x0D08 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA261_StaticMeshComponent0;              // 0x0D10 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA260_StaticMeshComponent0;              // 0x0D18 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA259_StaticMeshComponent0;              // 0x0D20 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA191_StaticMeshComponent0;              // 0x0D28 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA128_StaticMeshComponent0;              // 0x0D30 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA127_StaticMeshComponent0;              // 0x0D38 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA126_StaticMeshComponent0;              // 0x0D40 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise154_StaticMeshComponent0;              // 0x0D48 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise153_StaticMeshComponent0;              // 0x0D50 (size: 0x8)
    class UStaticMeshComponent* doorHeadA_short7_StaticMeshComponent0;                // 0x0D58 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise152_StaticMeshComponent0;              // 0x0D60 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise151_StaticMeshComponent0;              // 0x0D68 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise150_StaticMeshComponent0;              // 0x0D70 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise149_StaticMeshComponent0;              // 0x0D78 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise148_StaticMeshComponent0;              // 0x0D80 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise147_StaticMeshComponent0;              // 0x0D88 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise146_StaticMeshComponent0;              // 0x0D90 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise145_StaticMeshComponent0;              // 0x0D98 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise144_StaticMeshComponent0;              // 0x0DA0 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise143_StaticMeshComponent0;              // 0x0DA8 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise142_StaticMeshComponent0;              // 0x0DB0 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise141_StaticMeshComponent0;              // 0x0DB8 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise140_StaticMeshComponent0;              // 0x0DC0 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise139_StaticMeshComponent0;              // 0x0DC8 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise138_StaticMeshComponent0;              // 0x0DD0 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise137_StaticMeshComponent0;              // 0x0DD8 (size: 0x8)
    class UStaticMeshComponent* quoinB_luv92_StaticMeshComponent0;                    // 0x0DE0 (size: 0x8)
    class UStaticMeshComponent* quoinB_luv91_StaticMeshComponent0;                    // 0x0DE8 (size: 0x8)
    class UStaticMeshComponent* quoinB_luv90_StaticMeshComponent0;                    // 0x0DF0 (size: 0x8)
    class UStaticMeshComponent* quoinB_luv89_StaticMeshComponent0;                    // 0x0DF8 (size: 0x8)
    class UStaticMeshComponent* foundationTiling_A_detailed212_StaticMeshComponent0;  // 0x0E00 (size: 0x8)
    class UStaticMeshComponent* foundationTiling_A_detailed211_StaticMeshComponent0;  // 0x0E08 (size: 0x8)
    class UStaticMeshComponent* foundationTiling_A_detailed210_StaticMeshComponent0;  // 0x0E10 (size: 0x8)
    class UStaticMeshComponent* foundationTiling_A_detailed209_StaticMeshComponent0;  // 0x0E18 (size: 0x8)
    class UStaticMeshComponent* foundationTiling_A_detailed208_StaticMeshComponent0;  // 0x0E20 (size: 0x8)
    class UStaticMeshComponent* foundationTiling_A_detailed207_StaticMeshComponent0;  // 0x0E28 (size: 0x8)
    class UStaticMeshComponent* foundationTiling_A_detailed206_StaticMeshComponent0;  // 0x0E30 (size: 0x8)
    class UStaticMeshComponent* foundationTiling_A_detailed205_StaticMeshComponent0;  // 0x0E38 (size: 0x8)
    class UStaticMeshComponent* foundationTiling_A_detailed204_StaticMeshComponent0;  // 0x0E40 (size: 0x8)
    class UStaticMeshComponent* foundationTiling_A_detailed203_StaticMeshComponent0;  // 0x0E48 (size: 0x8)
    class UStaticMeshComponent* foundationTiling_A_detailed202_StaticMeshComponent0;  // 0x0E50 (size: 0x8)
    class UStaticMeshComponent* foundationTiling_A_detailed201_StaticMeshComponent0;  // 0x0E58 (size: 0x8)
    class UStaticMeshComponent* woodenShinglesMega_anotherSculpt_Narrower3_StaticMeshComponent0; // 0x0E60 (size: 0x8)
    class USceneComponent* SG_Tower_Lv2_DefaultSceneRoot;                             // 0x0E68 (size: 0x8)

}; // Size: 0xE70

#endif
