#ifndef UE4SS_SDK_C_Smithy_01_HPP
#define UE4SS_SDK_C_Smithy_01_HPP

class AC_Smithy_01_C : public AConstructionBP_C
{
    class UStaticMeshComponent* StaticMeshComponent115;                               // 0x0550 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent114;                               // 0x0558 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent113;                               // 0x0560 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent112;                               // 0x0568 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent111;                               // 0x0570 (size: 0x8)
    class USceneComponent* SharedRoot;                                                // 0x0578 (size: 0x8)
    class USceneComponent* Scene;                                                     // 0x0580 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent110;                               // 0x0588 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent109;                               // 0x0590 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent108;                               // 0x0598 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent107;                               // 0x05A0 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent106;                               // 0x05A8 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent105;                               // 0x05B0 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent104;                               // 0x05B8 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent102;                               // 0x05C0 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent101;                               // 0x05C8 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent100;                               // 0x05D0 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent99;                                // 0x05D8 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent98;                                // 0x05E0 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent97;                                // 0x05E8 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent96;                                // 0x05F0 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent95;                                // 0x05F8 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent94;                                // 0x0600 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent93;                                // 0x0608 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent92;                                // 0x0610 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent91;                                // 0x0618 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent90;                                // 0x0620 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent89;                                // 0x0628 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent88;                                // 0x0630 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent87;                                // 0x0638 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent86;                                // 0x0640 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent85;                                // 0x0648 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent84;                                // 0x0650 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent83;                                // 0x0658 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent82;                                // 0x0660 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent81;                                // 0x0668 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent80;                                // 0x0670 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent79;                                // 0x0678 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent78;                                // 0x0680 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent77;                                // 0x0688 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent76;                                // 0x0690 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent75;                                // 0x0698 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent74;                                // 0x06A0 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent72;                                // 0x06A8 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent71;                                // 0x06B0 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent70;                                // 0x06B8 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent69;                                // 0x06C0 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent68;                                // 0x06C8 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent67;                                // 0x06D0 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent66;                                // 0x06D8 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent65;                                // 0x06E0 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent64;                                // 0x06E8 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent63;                                // 0x06F0 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent62;                                // 0x06F8 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent61;                                // 0x0700 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent60;                                // 0x0708 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent59;                                // 0x0710 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent58;                                // 0x0718 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent57;                                // 0x0720 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent56;                                // 0x0728 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent55;                                // 0x0730 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent54;                                // 0x0738 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent53;                                // 0x0740 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent52;                                // 0x0748 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent51;                                // 0x0750 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent50;                                // 0x0758 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent49;                                // 0x0760 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent48;                                // 0x0768 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent47;                                // 0x0770 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent46;                                // 0x0778 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent45;                                // 0x0780 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent44;                                // 0x0788 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent43;                                // 0x0790 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent42;                                // 0x0798 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent41;                                // 0x07A0 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent40;                                // 0x07A8 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent39;                                // 0x07B0 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent38;                                // 0x07B8 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent37;                                // 0x07C0 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent36;                                // 0x07C8 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent35;                                // 0x07D0 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent34;                                // 0x07D8 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent33;                                // 0x07E0 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent32;                                // 0x07E8 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent31;                                // 0x07F0 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent30;                                // 0x07F8 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent29;                                // 0x0800 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent28;                                // 0x0808 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent27;                                // 0x0810 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent24;                                // 0x0818 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent23;                                // 0x0820 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent22;                                // 0x0828 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent21;                                // 0x0830 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent20;                                // 0x0838 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent19;                                // 0x0840 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent18;                                // 0x0848 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent17;                                // 0x0850 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent16;                                // 0x0858 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent15;                                // 0x0860 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent14;                                // 0x0868 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent13;                                // 0x0870 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent12;                                // 0x0878 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent11;                                // 0x0880 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent10;                                // 0x0888 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent9;                                 // 0x0890 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent8;                                 // 0x0898 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent7;                                 // 0x08A0 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent6;                                 // 0x08A8 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent5;                                 // 0x08B0 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent4;                                 // 0x08B8 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent3;                                 // 0x08C0 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent2;                                 // 0x08C8 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent1;                                 // 0x08D0 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent0;                                 // 0x08D8 (size: 0x8)
    class USceneComponent* DefaultSceneRoot;                                          // 0x08E0 (size: 0x8)

}; // Size: 0x8E8

#endif
