#ifndef UE4SS_SDK_Engine_HPP
#define UE4SS_SDK_Engine_HPP

#include "Engine_enums.hpp"

struct FA2CSPose : public FA2Pose
{
    TArray<uint8> ComponentSpaceFlags;                                                // 0x0018 (size: 0x10)

}; // Size: 0x28

struct FA2Pose
{
    TArray<FTransform> Bones;                                                         // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FActivateDevicePropertyParams
{
    FPlatformUserId UserId;                                                           // 0x0000 (size: 0x4)
    FInputDeviceId DeviceID;                                                          // 0x0004 (size: 0x4)
    uint8 bLooping;                                                                   // 0x0008 (size: 0x1)
    uint8 bIgnoreTimeDilation;                                                        // 0x0008 (size: 0x1)
    uint8 bPlayWhilePaused;                                                           // 0x0008 (size: 0x1)

}; // Size: 0xC

struct FActivatedCells
{
    TSet<UWorldPartitionRuntimeCell*> Cells;                                          // 0x0000 (size: 0x50)

}; // Size: 0xA0

struct FActiveCameraShakeInfo
{
    class UCameraShakeBase* ShakeInstance;                                            // 0x0000 (size: 0x8)
    TWeakObjectPtr<class UCameraShakeSourceComponent> ShakeSource;                    // 0x0008 (size: 0x8)
    bool bIsCustomInitialized;                                                        // 0x0010 (size: 0x1)

}; // Size: 0x18

struct FActiveDeviceProperty
{
    TWeakObjectPtr<class UInputDeviceProperty> Property;                              // 0x0000 (size: 0x8)

}; // Size: 0x20

struct FActiveForceFeedbackEffect
{
    class UForceFeedbackEffect* ForceFeedbackEffect;                                  // 0x0000 (size: 0x8)
    TSet<FInputDevicePropertyHandle> ActiveDeviceProperties;                          // 0x0020 (size: 0x50)

}; // Size: 0x70

struct FActiveHapticFeedbackEffect
{
    class UHapticFeedbackEffect_Base* HapticEffect;                                   // 0x0000 (size: 0x8)

}; // Size: 0x48

struct FActorComponentInstanceData : public FInstanceCacheDataBase
{
    class UObject* SourceComponentTemplate;                                           // 0x0058 (size: 0x8)
    EComponentCreationMethod SourceComponentCreationMethod;                           // 0x0060 (size: 0x1)
    int32 SourceComponentTypeSerializedIndex;                                         // 0x0064 (size: 0x4)

}; // Size: 0x68

struct FActorComponentInstanceSourceInfo
{
    class UObject* SourceComponentTemplate;                                           // 0x0000 (size: 0x8)
    EComponentCreationMethod SourceComponentCreationMethod;                           // 0x0008 (size: 0x1)
    int32 SourceComponentTypeSerializedIndex;                                         // 0x000C (size: 0x4)

}; // Size: 0x10

struct FActorComponentTickFunction : public FTickFunction
{
}; // Size: 0x30

struct FActorContainerID
{
    FGuid Guid;                                                                       // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FActorDataLayer
{
    FName Name;                                                                       // 0x0000 (size: 0x8)

}; // Size: 0x8

struct FActorDesc
{
    FGuid Guid;                                                                       // 0x0000 (size: 0x10)
    UClass* NativeClass;                                                              // 0x0010 (size: 0x8)
    FSoftObjectPath Class;                                                            // 0x0018 (size: 0x20)
    FName Name;                                                                       // 0x0038 (size: 0x8)
    FName Label;                                                                      // 0x0040 (size: 0x8)
    FBox Bounds;                                                                      // 0x0048 (size: 0x38)
    FName RuntimeGrid;                                                                // 0x0080 (size: 0x8)
    bool bIsSpatiallyLoaded;                                                          // 0x0088 (size: 0x1)
    bool bActorIsEditorOnly;                                                          // 0x0089 (size: 0x1)
    FName ActorPackage;                                                               // 0x008C (size: 0x8)
    FName ActorPath;                                                                  // 0x0094 (size: 0x8)
    TArray<FSoftObjectPath> DataLayerAssets;                                          // 0x00A0 (size: 0x10)

}; // Size: 0xB0

struct FActorFolderSet
{
    TSet<UActorFolder*> ActorFolders;                                                 // 0x0000 (size: 0x50)

}; // Size: 0x50

struct FActorInstanceData : public FInstanceCacheDataBase
{
    TSubclassOf<class AActor> ActorClass;                                             // 0x0058 (size: 0x8)

}; // Size: 0x60

struct FActorInstanceHandle
{
    TWeakObjectPtr<class UObject> ReferenceObject;                                    // 0x0000 (size: 0x8)

}; // Size: 0x20

struct FActorLocatorFragment
{
    FSoftObjectPath Path;                                                             // 0x0000 (size: 0x20)

}; // Size: 0x20

struct FActorLocatorFragmentResolveParameter
{
    class UWorld* StreamingWorld;                                                     // 0x0000 (size: 0x8)
    FActorContainerID ContainerID;                                                    // 0x0008 (size: 0x10)
    FTopLevelAssetPath SourceAssetPath;                                               // 0x0018 (size: 0x10)

}; // Size: 0x28

struct FActorPlacementDataLayers
{
    TArray<FName> DataLayerInstanceNames;                                             // 0x0000 (size: 0x10)
    FName ExternalDataLayerName;                                                      // 0x0010 (size: 0x8)
    FName CurrentColorizedDataLayerInstanceName;                                      // 0x0018 (size: 0x8)
    int32 ContextID;                                                                  // 0x0020 (size: 0x4)

}; // Size: 0x28

struct FActorTickFunction : public FTickFunction
{
}; // Size: 0x30

struct FAlphaBlend
{
    class UCurveFloat* CustomCurve;                                                   // 0x0000 (size: 0x8)
    float BlendTime;                                                                  // 0x0008 (size: 0x4)
    EAlphaBlendOption BlendOption;                                                    // 0x0024 (size: 0x1)

}; // Size: 0x30

struct FAlphaBlendArgs
{
    class UCurveFloat* CustomCurve;                                                   // 0x0000 (size: 0x8)
    float BlendTime;                                                                  // 0x0008 (size: 0x4)
    EAlphaBlendOption BlendOption;                                                    // 0x000C (size: 0x1)

}; // Size: 0x10

struct FAngularDriveConstraint
{
    FConstraintDrive TwistDrive;                                                      // 0x0000 (size: 0x10)
    FConstraintDrive SwingDrive;                                                      // 0x0010 (size: 0x10)
    FConstraintDrive SlerpDrive;                                                      // 0x0020 (size: 0x10)
    FRotator OrientationTarget;                                                       // 0x0030 (size: 0x18)
    FVector AngularVelocityTarget;                                                    // 0x0048 (size: 0x18)
    TEnumAsByte<EAngularDriveMode::Type> AngularDriveMode;                            // 0x0060 (size: 0x1)

}; // Size: 0x68

struct FAnimBlueprintConstantData
{
}; // Size: 0x1

struct FAnimBlueprintDebugData
{
}; // Size: 0x1

struct FAnimBlueprintFunction
{
    FName Name;                                                                       // 0x0000 (size: 0x8)
    FName Group;                                                                      // 0x0008 (size: 0x8)
    int32 OutputPoseNodeIndex;                                                        // 0x0010 (size: 0x4)
    TArray<FName> InputPoseNames;                                                     // 0x0018 (size: 0x10)
    TArray<int32> InputPoseNodeIndices;                                               // 0x0028 (size: 0x10)
    bool bImplemented;                                                                // 0x0070 (size: 0x1)

}; // Size: 0x78

struct FAnimBlueprintMutableData
{
}; // Size: 0x1

struct FAnimComponentSpacePoseContext : public FAnimExecutionContext
{
}; // Size: 0x10

struct FAnimCompressedCurveIndexedName
{
    FName CurveName;                                                                  // 0x0000 (size: 0x8)

}; // Size: 0xC

struct FAnimCurveBase
{
    FName CurveName;                                                                  // 0x0000 (size: 0x8)
    int32 CurveTypeFlags;                                                             // 0x0008 (size: 0x4)

}; // Size: 0xC

struct FAnimCurveParam
{
    FName Name;                                                                       // 0x0000 (size: 0x8)

}; // Size: 0xC

struct FAnimCurveType
{
    bool bMaterial;                                                                   // 0x0000 (size: 0x1)
    bool bMorphtarget;                                                                // 0x0001 (size: 0x1)

}; // Size: 0x2

struct FAnimDataModelNotifPayload
{
}; // Size: 0x10

struct FAnimExecutionContext
{
}; // Size: 0x10

struct FAnimGraphBlendOptions
{
    float BlendInTime;                                                                // 0x0000 (size: 0x4)
    class UBlendProfile* BlendInProfile;                                              // 0x0008 (size: 0x8)
    float BlendOutTime;                                                               // 0x0010 (size: 0x4)
    class UBlendProfile* BlendOutProfile;                                             // 0x0018 (size: 0x8)

}; // Size: 0x20

struct FAnimGroupInfo
{
    FName Name;                                                                       // 0x0000 (size: 0x8)
    FLinearColor Color;                                                               // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FAnimGroupInstance
{
}; // Size: 0x78

struct FAnimInitializationContext : public FAnimExecutionContext
{
}; // Size: 0x10

struct FAnimInstanceLocatorFragment
{
    EAnimInstanceLocatorFragmentType Type;                                            // 0x0000 (size: 0x4)

}; // Size: 0x4

struct FAnimInstanceProxy
{
}; // Size: 0x740

struct FAnimLinkableElement
{
    class UAnimMontage* LinkedMontage;                                                // 0x0008 (size: 0x8)
    int32 SlotIndex;                                                                  // 0x0010 (size: 0x4)
    int32 SegmentIndex;                                                               // 0x0014 (size: 0x4)
    TEnumAsByte<EAnimLinkMethod::Type> LinkMethod;                                    // 0x0018 (size: 0x1)
    TEnumAsByte<EAnimLinkMethod::Type> CachedLinkMethod;                              // 0x0019 (size: 0x1)
    float SegmentBeginTime;                                                           // 0x001C (size: 0x4)
    float SegmentLength;                                                              // 0x0020 (size: 0x4)
    float LinkValue;                                                                  // 0x0024 (size: 0x4)
    class UAnimSequenceBase* LinkedSequence;                                          // 0x0028 (size: 0x8)

}; // Size: 0x30

struct FAnimMontageInstance
{
    class UAnimMontage* Montage;                                                      // 0x0000 (size: 0x8)
    bool bPlaying;                                                                    // 0x0038 (size: 0x1)
    float DefaultBlendTimeMultiplier;                                                 // 0x003C (size: 0x4)
    TArray<int32> NextSections;                                                       // 0x0108 (size: 0x10)
    TArray<int32> PrevSections;                                                       // 0x0118 (size: 0x10)
    TArray<FAnimNotifyEvent> ActiveStateBranchingPoints;                              // 0x0138 (size: 0x10)
    float Position;                                                                   // 0x0148 (size: 0x4)
    float PlayRate;                                                                   // 0x014C (size: 0x4)
    FAlphaBlend Blend;                                                                // 0x0150 (size: 0x30)
    int32 DisableRootMotionCount;                                                     // 0x01B4 (size: 0x4)

}; // Size: 0x1D8

struct FAnimNodeConstantData
{
    TScriptInterface<class IAnimClassInterface> AnimClassInterface;                   // 0x0000 (size: 0x10)
    int32 NodeIndex;                                                                  // 0x0010 (size: 0x4)

}; // Size: 0x18

struct FAnimNodeData
{
    TScriptInterface<class IAnimClassInterface> AnimClassInterface;                   // 0x0000 (size: 0x10)
    TArray<uint32> Entries;                                                           // 0x0010 (size: 0x10)
    int32 NodeIndex;                                                                  // 0x0020 (size: 0x4)
    uint32 Flags;                                                                     // 0x0024 (size: 0x4)

}; // Size: 0x28

struct FAnimNodeExposedValueHandler
{
}; // Size: 0x8

struct FAnimNodeExposedValueHandler_Base : public FAnimNodeExposedValueHandler
{
    class UFunction* Function;                                                        // 0x0008 (size: 0x8)
    FName BoundFunction;                                                              // 0x0010 (size: 0x8)

}; // Size: 0x18

struct FAnimNodeExposedValueHandler_PropertyAccess : public FAnimNodeExposedValueHandler_Base
{
    TArray<FExposedValueCopyRecord> CopyRecords;                                      // 0x0018 (size: 0x10)

}; // Size: 0x30

struct FAnimNodeFunctionRef
{
    FName ClassName;                                                                  // 0x0000 (size: 0x8)
    FName FunctionName;                                                               // 0x0008 (size: 0x8)
    UClass* Class;                                                                    // 0x0010 (size: 0x8)
    class UFunction* Function;                                                        // 0x0018 (size: 0x8)

}; // Size: 0x20

struct FAnimNodeReference
{
}; // Size: 0x10

struct FAnimNodeStructData
{
    TMap<FName, int32> NameToIndexMap;                                                // 0x0000 (size: 0x50)
    int32 NumProperties;                                                              // 0x0050 (size: 0x4)

}; // Size: 0x58

struct FAnimNode_ApplyMeshSpaceAdditive : public FAnimNode_Base
{
    FPoseLink base;                                                                   // 0x0010 (size: 0x10)
    FPoseLink Additive;                                                               // 0x0020 (size: 0x10)
    EAnimAlphaInputType AlphaInputType;                                               // 0x0030 (size: 0x1)
    float Alpha;                                                                      // 0x0034 (size: 0x4)
    uint8 bAlphaBoolEnabled;                                                          // 0x0038 (size: 0x1)
    FInputAlphaBoolBlend AlphaBoolBlend;                                              // 0x0040 (size: 0x48)
    FName AlphaCurveName;                                                             // 0x0088 (size: 0x8)
    FInputScaleBias AlphaScaleBias;                                                   // 0x0090 (size: 0x8)
    FInputScaleBiasClamp AlphaScaleBiasClamp;                                         // 0x0098 (size: 0x30)
    int32 LODThreshold;                                                               // 0x00C8 (size: 0x4)

}; // Size: 0xD0

struct FAnimNode_AssetPlayerBase : public FAnimNode_AssetPlayerRelevancyBase
{
    float BlendWeight;                                                                // 0x0020 (size: 0x4)
    float InternalTimeAccumulator;                                                    // 0x0024 (size: 0x4)

}; // Size: 0x38

struct FAnimNode_AssetPlayerRelevancyBase : public FAnimNode_Base
{
}; // Size: 0x10

struct FAnimNode_Base
{
}; // Size: 0x10

struct FAnimNode_ConvertComponentToLocalSpace : public FAnimNode_Base
{
    FComponentSpacePoseLink ComponentPose;                                            // 0x0010 (size: 0x10)

}; // Size: 0x20

struct FAnimNode_ConvertLocalToComponentSpace : public FAnimNode_Base
{
    FPoseLink LocalPose;                                                              // 0x0010 (size: 0x10)

}; // Size: 0x20

struct FAnimNode_CustomProperty : public FAnimNode_Base
{
    TArray<FName> SourcePropertyNames;                                                // 0x0010 (size: 0x10)
    TArray<FName> DestPropertyNames;                                                  // 0x0020 (size: 0x10)
    class UObject* TargetInstance;                                                    // 0x0030 (size: 0x8)

}; // Size: 0x58

struct FAnimNode_DeadBlending : public FAnimNode_Base
{
    FPoseLink Source;                                                                 // 0x0018 (size: 0x10)
    bool bAlwaysUseDefaultBlendSettings;                                              // 0x0028 (size: 0x1)
    float DefaultBlendDuration;                                                       // 0x002C (size: 0x4)
    class UBlendProfile* DefaultBlendProfile;                                         // 0x0030 (size: 0x8)
    EAlphaBlendOption DefaultBlendMode;                                               // 0x0038 (size: 0x1)
    class UCurveFloat* DefaultCustomBlendCurve;                                       // 0x0040 (size: 0x8)
    float BlendTimeMultiplier;                                                        // 0x0048 (size: 0x4)
    bool bLinearlyInterpolateScales;                                                  // 0x004C (size: 0x1)
    TArray<FName> FilteredCurves;                                                     // 0x0050 (size: 0x10)
    TArray<FName> ExtrapolationFilteredCurves;                                        // 0x0060 (size: 0x10)
    TArray<FBoneReference> FilteredBones;                                             // 0x0070 (size: 0x10)
    float ExtrapolationHalfLife;                                                      // 0x0080 (size: 0x4)
    float ExtrapolationHalfLifeMin;                                                   // 0x0084 (size: 0x4)
    float ExtrapolationHalfLifeMax;                                                   // 0x0088 (size: 0x4)
    float MaximumTranslationVelocity;                                                 // 0x008C (size: 0x4)
    float MaximumRotationVelocity;                                                    // 0x0090 (size: 0x4)
    float MaximumScaleVelocity;                                                       // 0x0094 (size: 0x4)
    float MaximumCurveVelocity;                                                       // 0x0098 (size: 0x4)
    bool bResetOnBecomingRelevant;                                                    // 0x009C (size: 0x1)
    TArray<FInertializationRequest> RequestQueue;                                     // 0x02D0 (size: 0x10)
    class UCurveFloat* InertializationCustomBlendCurve;                               // 0x0548 (size: 0x8)
    class UObject* InertializationRequestAnimInstance;                                // 0x0568 (size: 0x8)

}; // Size: 0x570

struct FAnimNode_Inertialization : public FAnimNode_Base
{
    FPoseLink Source;                                                                 // 0x0018 (size: 0x10)
    class UBlendProfile* DefaultBlendProfile;                                         // 0x0028 (size: 0x8)
    TArray<FName> FilteredCurves;                                                     // 0x0030 (size: 0x10)
    TArray<FBoneReference> FilteredBones;                                             // 0x0040 (size: 0x10)
    bool bResetOnBecomingRelevant;                                                    // 0x0050 (size: 0x1)
    bool bForwardRequestsThroughSkippedCachedPoseNodes;                               // 0x0051 (size: 0x1)
    TArray<FInertializationRequest> RequestQueue;                                     // 0x0228 (size: 0x10)
    class UObject* InertializationRequestAnimInstance;                                // 0x0438 (size: 0x8)

}; // Size: 0x440

struct FAnimNode_LinkedAnimGraph : public FAnimNode_CustomProperty
{
    TArray<FPoseLink> InputPoses;                                                     // 0x0058 (size: 0x10)
    TArray<FName> InputPoseNames;                                                     // 0x0068 (size: 0x10)
    TSubclassOf<class UAnimInstance> InstanceClass;                                   // 0x0078 (size: 0x8)
    class UBlendProfile* PendingBlendOutProfile;                                      // 0x0098 (size: 0x8)
    class UBlendProfile* PendingBlendInProfile;                                       // 0x00A8 (size: 0x8)
    uint8 bReceiveNotifiesFromLinkedInstances;                                        // 0x00B0 (size: 0x1)
    uint8 bPropagateNotifiesToLinkedInstances;                                        // 0x00B0 (size: 0x1)

}; // Size: 0xB8

struct FAnimNode_LinkedAnimLayer : public FAnimNode_LinkedAnimGraph
{
    TSubclassOf<class UAnimLayerInterface> Interface;                                 // 0x00B8 (size: 0x8)
    FName Layer;                                                                      // 0x00C0 (size: 0x8)

}; // Size: 0xC8

struct FAnimNode_LinkedInputPose : public FAnimNode_Base
{
    FName Name;                                                                       // 0x0010 (size: 0x8)
    FName Graph;                                                                      // 0x0018 (size: 0x8)
    FPoseLink InputPose;                                                              // 0x0020 (size: 0x10)

}; // Size: 0xB8

struct FAnimNode_Root : public FAnimNode_Base
{
    FPoseLink Result;                                                                 // 0x0010 (size: 0x10)

}; // Size: 0x20

struct FAnimNode_SaveCachedPose : public FAnimNode_Base
{
    FPoseLink Pose;                                                                   // 0x0010 (size: 0x10)
    FName CachePoseName;                                                              // 0x0020 (size: 0x8)

}; // Size: 0x80

struct FAnimNode_SequencePlayer : public FAnimNode_SequencePlayerBase
{
    class UAnimSequenceBase* Sequence;                                                // 0x0040 (size: 0x8)

}; // Size: 0x48

struct FAnimNode_SequencePlayerBase : public FAnimNode_AssetPlayerBase
{
    FInputScaleBiasClampState PlayRateScaleBiasClampState;                            // 0x0038 (size: 0x8)

}; // Size: 0x40

struct FAnimNode_SequencePlayer_Standalone : public FAnimNode_SequencePlayerBase
{
    FName GroupName;                                                                  // 0x0040 (size: 0x8)
    TEnumAsByte<EAnimGroupRole::Type> GroupRole;                                      // 0x0048 (size: 0x1)
    EAnimSyncMethod Method;                                                           // 0x0049 (size: 0x1)
    bool bIgnoreForRelevancyTest;                                                     // 0x004A (size: 0x1)
    class UAnimSequenceBase* Sequence;                                                // 0x0050 (size: 0x8)
    float PlayRateBasis;                                                              // 0x0058 (size: 0x4)
    float PlayRate;                                                                   // 0x005C (size: 0x4)
    FInputScaleBiasClampConstants PlayRateScaleBiasClampConstants;                    // 0x0060 (size: 0x2C)
    float StartPosition;                                                              // 0x008C (size: 0x4)
    bool bLoopAnimation;                                                              // 0x0090 (size: 0x1)
    bool bStartFromMatchingPose;                                                      // 0x0091 (size: 0x1)

}; // Size: 0x98

struct FAnimNode_SingleNode : public FAnimNode_Base
{
    FPoseLink SourcePose;                                                             // 0x0010 (size: 0x10)

}; // Size: 0x30

struct FAnimNode_StateMachine : public FAnimNode_Base
{
    int32 StateMachineIndexInClass;                                                   // 0x0010 (size: 0x4)
    int32 MaxTransitionsPerFrame;                                                     // 0x0014 (size: 0x4)
    int32 MaxTransitionsRequests;                                                     // 0x0018 (size: 0x4)
    bool bSkipFirstUpdateTransition;                                                  // 0x001C (size: 0x1)
    bool bReinitializeOnBecomingRelevant;                                             // 0x001D (size: 0x1)
    bool bCreateNotifyMetaData;                                                       // 0x001E (size: 0x1)
    bool bAllowConduitEntryStates;                                                    // 0x001F (size: 0x1)

}; // Size: 0xC8

struct FAnimNode_StateResult : public FAnimNode_Root
{
}; // Size: 0x20

struct FAnimNode_TransitionPoseEvaluator : public FAnimNode_Base
{
    int32 FramesToCachePose;                                                          // 0x0088 (size: 0x4)
    TEnumAsByte<EEvaluatorDataSource::Type> DataSource;                               // 0x0090 (size: 0x1)
    TEnumAsByte<EEvaluatorMode::Type> EvaluatorMode;                                  // 0x0091 (size: 0x1)

}; // Size: 0xA8

struct FAnimNode_TransitionResult : public FAnimNode_Base
{
    bool bCanEnterTransition;                                                         // 0x0010 (size: 0x1)

}; // Size: 0x28

struct FAnimNode_UseCachedPose : public FAnimNode_Base
{
    FPoseLink LinkToCachingNode;                                                      // 0x0010 (size: 0x10)
    FName CachePoseName;                                                              // 0x0020 (size: 0x8)

}; // Size: 0x28

struct FAnimNotifyArray
{
    TArray<FAnimNotifyEventReference> Notifies;                                       // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FAnimNotifyContext
{
}; // Size: 0x18

struct FAnimNotifyEvent : public FAnimLinkableElement
{
    float TriggerTimeOffset;                                                          // 0x0030 (size: 0x4)
    float EndTriggerTimeOffset;                                                       // 0x0034 (size: 0x4)
    float TriggerWeightThreshold;                                                     // 0x0038 (size: 0x4)
    FName NotifyName;                                                                 // 0x003C (size: 0x8)
    class UAnimNotify* Notify;                                                        // 0x0048 (size: 0x8)
    class UAnimNotifyState* NotifyStateClass;                                         // 0x0050 (size: 0x8)
    float Duration;                                                                   // 0x0058 (size: 0x4)
    FAnimLinkableElement EndLink;                                                     // 0x0060 (size: 0x30)
    bool bConvertedFromBranchingPoint;                                                // 0x0090 (size: 0x1)
    TEnumAsByte<EMontageNotifyTickType::Type> MontageTickType;                        // 0x0091 (size: 0x1)
    float NotifyTriggerChance;                                                        // 0x0094 (size: 0x4)
    TEnumAsByte<ENotifyFilterType::Type> NotifyFilterType;                            // 0x0098 (size: 0x1)
    int32 NotifyFilterLOD;                                                            // 0x009C (size: 0x4)
    bool bCanBeFilteredViaRequest;                                                    // 0x00A0 (size: 0x1)
    bool bTriggerOnDedicatedServer;                                                   // 0x00A1 (size: 0x1)
    bool bTriggerOnFollower;                                                          // 0x00A2 (size: 0x1)
    int32 TrackIndex;                                                                 // 0x00A4 (size: 0x4)

}; // Size: 0xB8

struct FAnimNotifyEventReference
{
    class UMirrorDataTable* MirrorTable;                                              // 0x0018 (size: 0x8)
    class UObject* NotifySource;                                                      // 0x0020 (size: 0x8)

}; // Size: 0x30

struct FAnimNotifyQueue
{
    TArray<FAnimNotifyEventReference> AnimNotifies;                                   // 0x0010 (size: 0x10)
    TMap<class FName, class FAnimNotifyArray> UnfilteredMontageAnimNotifies;          // 0x0020 (size: 0x50)

}; // Size: 0x70

struct FAnimNotifyTrack
{
    FName TrackName;                                                                  // 0x0000 (size: 0x8)
    FLinearColor TrackColor;                                                          // 0x0008 (size: 0x10)

}; // Size: 0x38

struct FAnimParentNodeAssetOverride
{
    class UAnimationAsset* NewAsset;                                                  // 0x0000 (size: 0x8)
    FGuid ParentNodeGuid;                                                             // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FAnimPoseContext : public FAnimExecutionContext
{
}; // Size: 0x10

struct FAnimSegment
{
    class UAnimSequenceBase* AnimReference;                                           // 0x0000 (size: 0x8)
    float StartPos;                                                                   // 0x0008 (size: 0x4)
    float AnimStartTime;                                                              // 0x000C (size: 0x4)
    float AnimEndTime;                                                                // 0x0010 (size: 0x4)
    float AnimPlayRate;                                                               // 0x0014 (size: 0x4)
    int32 LoopingCount;                                                               // 0x0018 (size: 0x4)

}; // Size: 0x20

struct FAnimSequenceTrackContainer
{
    TArray<FRawAnimSequenceTrack> AnimationTracks;                                    // 0x0000 (size: 0x10)
    TArray<FName> TrackNames;                                                         // 0x0010 (size: 0x10)

}; // Size: 0x20

struct FAnimSetMeshLinkup
{
    TArray<int32> BoneToTrackTable;                                                   // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FAnimSingleNodeInstanceProxy : public FAnimInstanceProxy
{
}; // Size: 0x840

struct FAnimSlotDesc
{
    FName SlotName;                                                                   // 0x0000 (size: 0x8)
    int32 NumChannels;                                                                // 0x0008 (size: 0x4)

}; // Size: 0xC

struct FAnimSlotGroup
{
    FName GroupName;                                                                  // 0x0000 (size: 0x8)
    TArray<FName> SlotNames;                                                          // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FAnimSubsystem
{
}; // Size: 0x8

struct FAnimSubsystemInstance
{
}; // Size: 0x8

struct FAnimSubsystemInstance_NodeRelevancy : public FAnimSubsystemInstance
{
}; // Size: 0xA8

struct FAnimSubsystem_Base : public FAnimSubsystem
{
}; // Size: 0x18

struct FAnimSubsystem_BlendSpaceGraph : public FAnimSubsystem
{
    TArray<class UBlendSpace*> BlendSpaces;                                           // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FAnimSubsystem_PropertyAccess : public FAnimSubsystem
{
    FPropertyAccessLibrary Library;                                                   // 0x0008 (size: 0x78)

}; // Size: 0x80

struct FAnimSubsystem_SharedLinkedAnimLayers : public FAnimSubsystemInstance
{
    TArray<FLinkedAnimLayerClassData> ClassesData;                                    // 0x0008 (size: 0x10)
    TArray<class TSubclassOf<UAnimInstance>> PersistentClasses;                       // 0x0018 (size: 0x10)

}; // Size: 0x28

struct FAnimSubsystem_Tag : public FAnimSubsystem
{
    TMap<FName, int32> NodeIndices;                                                   // 0x0008 (size: 0x50)

}; // Size: 0x60

struct FAnimSyncMarker
{
    FName MarkerName;                                                                 // 0x0000 (size: 0x8)
    float Time;                                                                       // 0x0008 (size: 0x4)

}; // Size: 0xC

struct FAnimTickRecord
{
    class UAnimationAsset* SourceAsset;                                               // 0x0000 (size: 0x8)

}; // Size: 0x70

struct FAnimTrack
{
    TArray<FAnimSegment> AnimSegments;                                                // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FAnimUpdateContext : public FAnimExecutionContext
{
}; // Size: 0x10

struct FAnimUpdateRateParameters
{
    EUpdateRateShiftBucket ShiftBucket;                                               // 0x0001 (size: 0x1)
    uint8 bInterpolateSkippedFrames;                                                  // 0x0002 (size: 0x1)
    uint8 bShouldUseLodMap;                                                           // 0x0002 (size: 0x1)
    uint8 bShouldUseMinLod;                                                           // 0x0002 (size: 0x1)
    uint8 bSkipUpdate;                                                                // 0x0002 (size: 0x1)
    uint8 bSkipEvaluation;                                                            // 0x0002 (size: 0x1)
    int32 UpdateRate;                                                                 // 0x0004 (size: 0x4)
    int32 EvaluationRate;                                                             // 0x0008 (size: 0x4)
    float TickedPoseOffestTime;                                                       // 0x000C (size: 0x4)
    float AdditionalTime;                                                             // 0x0010 (size: 0x4)
    int32 BaseNonRenderedUpdateRate;                                                  // 0x0018 (size: 0x4)
    int32 MaxEvalRateForInterpolation;                                                // 0x001C (size: 0x4)
    TArray<float> BaseVisibleDistanceFactorThesholds;                                 // 0x0020 (size: 0x10)
    TMap<int32, int32> LODToFrameSkipMap;                                             // 0x0030 (size: 0x50)
    int32 SkippedUpdateFrames;                                                        // 0x0080 (size: 0x4)
    int32 SkippedEvalFrames;                                                          // 0x0084 (size: 0x4)

}; // Size: 0x88

struct FAnimatedBoneAttribute
{
    FAnimationAttributeIdentifier Identifier;                                         // 0x0000 (size: 0x40)
    FAttributeCurve Curve;                                                            // 0x0040 (size: 0xB0)

}; // Size: 0xF0

struct FAnimationActiveTransitionEntry
{
    class UBlendProfile* BlendProfile;                                                // 0x00B8 (size: 0x8)

}; // Size: 0xC8

struct FAnimationAttributeIdentifier
{
    FName Name;                                                                       // 0x0000 (size: 0x8)
    FName BoneName;                                                                   // 0x0008 (size: 0x8)
    int32 BoneIndex;                                                                  // 0x0010 (size: 0x4)
    class UScriptStruct* ScriptStruct;                                                // 0x0018 (size: 0x8)
    FSoftObjectPath ScriptStructPath;                                                 // 0x0020 (size: 0x20)

}; // Size: 0x40

struct FAnimationCurveData
{
    TArray<FFloatCurve> FloatCurves;                                                  // 0x0000 (size: 0x10)
    TArray<FTransformCurve> TransformCurves;                                          // 0x0010 (size: 0x10)

}; // Size: 0x20

struct FAnimationCurveIdentifier
{
    FName CurveName;                                                                  // 0x0000 (size: 0x8)
    ERawCurveTrackTypes CurveType;                                                    // 0x0008 (size: 0x1)
    ETransformCurveChannel Channel;                                                   // 0x0009 (size: 0x1)
    EVectorCurveChannel Axis;                                                         // 0x000A (size: 0x1)

}; // Size: 0xC

struct FAnimationErrorStats
{
}; // Size: 0x10

struct FAnimationFrameSnapshot
{
}; // Size: 0x1

struct FAnimationGroupReference
{
    EAnimSyncMethod Method;                                                           // 0x0000 (size: 0x1)
    FName GroupName;                                                                  // 0x0004 (size: 0x8)
    TEnumAsByte<EAnimGroupRole::Type> GroupRole;                                      // 0x000C (size: 0x1)

}; // Size: 0x10

struct FAnimationPotentialTransition
{
}; // Size: 0x30

struct FAnimationRecordingSettings
{
    bool bRecordInWorldSpace;                                                         // 0x0000 (size: 0x1)
    bool bRemoveRootAnimation;                                                        // 0x0001 (size: 0x1)
    bool bAutoSaveAsset;                                                              // 0x0002 (size: 0x1)
    FFrameRate SampleFrameRate;                                                       // 0x0004 (size: 0x8)
    float Length;                                                                     // 0x000C (size: 0x4)
    EAnimInterpolationType Interpolation;                                             // 0x0010 (size: 0x1)
    TEnumAsByte<ERichCurveInterpMode> InterpMode;                                     // 0x0011 (size: 0x1)
    TEnumAsByte<ERichCurveTangentMode> TangentMode;                                   // 0x0012 (size: 0x1)
    bool bRecordTransforms;                                                           // 0x0014 (size: 0x1)
    bool bRecordMorphTargets;                                                         // 0x0015 (size: 0x1)
    bool bRecordAttributeCurves;                                                      // 0x0016 (size: 0x1)
    bool bRecordMaterialCurves;                                                       // 0x0017 (size: 0x1)
    bool bTransactRecording;                                                          // 0x0018 (size: 0x1)
    TArray<FString> IncludeAnimationNames;                                            // 0x0020 (size: 0x10)
    TArray<FString> ExcludeAnimationNames;                                            // 0x0030 (size: 0x10)

}; // Size: 0x40

struct FAnimationState : public FAnimationStateBase
{
    TArray<FAnimationTransitionRule> Transitions;                                     // 0x0008 (size: 0x10)
    int32 StateRootNodeIndex;                                                         // 0x0018 (size: 0x4)
    int32 StartNotify;                                                                // 0x001C (size: 0x4)
    int32 EndNotify;                                                                  // 0x0020 (size: 0x4)
    int32 FullyBlendedNotify;                                                         // 0x0024 (size: 0x4)

}; // Size: 0x28

struct FAnimationStateBase
{
    FName StateName;                                                                  // 0x0000 (size: 0x8)

}; // Size: 0x8

struct FAnimationTrackAddedPayload : public FAnimationTrackPayload
{
    int32 TrackIndex;                                                                 // 0x0008 (size: 0x4)

}; // Size: 0xC

struct FAnimationTrackPayload : public FEmptyPayload
{
    FName Name;                                                                       // 0x0000 (size: 0x8)

}; // Size: 0x8

struct FAnimationTransitionBetweenStates : public FAnimationStateBase
{
    int32 PreviousState;                                                              // 0x0008 (size: 0x4)
    int32 NextState;                                                                  // 0x000C (size: 0x4)
    float CrossfadeDuration;                                                          // 0x0010 (size: 0x4)
    int32 StartNotify;                                                                // 0x0014 (size: 0x4)
    int32 EndNotify;                                                                  // 0x0018 (size: 0x4)
    int32 InterruptNotify;                                                            // 0x001C (size: 0x4)
    EAlphaBlendOption BlendMode;                                                      // 0x0020 (size: 0x1)
    class UCurveFloat* CustomCurve;                                                   // 0x0028 (size: 0x8)
    class UBlendProfile* BlendProfile;                                                // 0x0030 (size: 0x8)
    TEnumAsByte<ETransitionLogicType::Type> LogicType;                                // 0x0038 (size: 0x1)

}; // Size: 0x40

struct FAnimationTransitionRule
{
    FName RuleToExecute;                                                              // 0x0000 (size: 0x8)
    bool TransitionReturnVal;                                                         // 0x0008 (size: 0x1)
    int32 TransitionIndex;                                                            // 0x000C (size: 0x4)

}; // Size: 0x10

struct FAssetCompileData
{
    TWeakObjectPtr<class UObject> Asset;                                              // 0x0000 (size: 0x8)

}; // Size: 0x8

struct FAssetEditorOrbitCameraPosition
{
    bool bIsSet;                                                                      // 0x0000 (size: 0x1)
    FVector CamOrbitPoint;                                                            // 0x0008 (size: 0x18)
    FVector CamOrbitZoom;                                                             // 0x0020 (size: 0x18)
    FRotator CamOrbitRotation;                                                        // 0x0038 (size: 0x18)

}; // Size: 0x50

struct FAssetImportInfo
{
}; // Size: 0x1

struct FAssetLocatorFragment
{
    FTopLevelAssetPath Path;                                                          // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FAssetManagerRedirect
{
    FString Old;                                                                      // 0x0000 (size: 0x10)
    FString New;                                                                      // 0x0010 (size: 0x10)

}; // Size: 0x20

struct FAssetManagerSearchRules
{
    TArray<FString> AssetScanPaths;                                                   // 0x0000 (size: 0x10)
    TArray<FString> IncludePatterns;                                                  // 0x0010 (size: 0x10)
    TArray<FString> ExcludePatterns;                                                  // 0x0020 (size: 0x10)
    UClass* AssetBaseClass;                                                           // 0x0030 (size: 0x8)
    bool bHasBlueprintClasses;                                                        // 0x0038 (size: 0x1)
    bool bForceSynchronousScan;                                                       // 0x0039 (size: 0x1)
    bool bSkipVirtualPathExpansion;                                                   // 0x003A (size: 0x1)
    bool bSkipManagerIncludeCheck;                                                    // 0x003B (size: 0x1)

}; // Size: 0x50

struct FAssetMapping
{
    class UAnimationAsset* SourceAsset;                                               // 0x0000 (size: 0x8)
    class UAnimationAsset* TargetAsset;                                               // 0x0008 (size: 0x8)

}; // Size: 0x10

struct FAsyncPhysicsTimestamp
{
    int32 ServerFrame;                                                                // 0x0000 (size: 0x4)
    int32 LocalFrame;                                                                 // 0x0004 (size: 0x4)

}; // Size: 0x8

struct FAttenuationSubmixSendSettings : public FSoundSubmixSendInfoBase
{
}; // Size: 0xB0

struct FAttributeCurve : public FIndexedCurve
{
    TArray<FAttributeKey> keys;                                                       // 0x0068 (size: 0x10)
    FSoftObjectPath ScriptStructPath;                                                 // 0x0078 (size: 0x20)
    class UScriptStruct* ScriptStruct;                                                // 0x0098 (size: 0x8)
    bool bShouldInterpolate;                                                          // 0x00A0 (size: 0x1)

}; // Size: 0xB0

struct FAttributeKey
{
    float Time;                                                                       // 0x0000 (size: 0x4)

}; // Size: 0x18

struct FAttributePayload : public FEmptyPayload
{
    FAnimationAttributeIdentifier Identifier;                                         // 0x0000 (size: 0x40)

}; // Size: 0x40

struct FAudioBasedVibrationData
{
    class USoundBase* Sound;                                                          // 0x0000 (size: 0x8)

}; // Size: 0x8

struct FAudioComponentParam : public FAudioParameter
{
    class USoundWave* SoundWaveParam;                                                 // 0x00A0 (size: 0x8)

}; // Size: 0xA8

struct FAudioEQEffect : public FAudioEffectParameters
{
    float FrequencyCenter0;                                                           // 0x0010 (size: 0x4)
    float Gain0;                                                                      // 0x0014 (size: 0x4)
    float Bandwidth0;                                                                 // 0x0018 (size: 0x4)
    float FrequencyCenter1;                                                           // 0x001C (size: 0x4)
    float Gain1;                                                                      // 0x0020 (size: 0x4)
    float Bandwidth1;                                                                 // 0x0024 (size: 0x4)
    float FrequencyCenter2;                                                           // 0x0028 (size: 0x4)
    float Gain2;                                                                      // 0x002C (size: 0x4)
    float Bandwidth2;                                                                 // 0x0030 (size: 0x4)
    float FrequencyCenter3;                                                           // 0x0034 (size: 0x4)
    float Gain3;                                                                      // 0x0038 (size: 0x4)
    float Bandwidth3;                                                                 // 0x003C (size: 0x4)

}; // Size: 0x40

struct FAudioEffectParameters
{
}; // Size: 0x8

struct FAudioQualitySettings
{
    FText DisplayName;                                                                // 0x0000 (size: 0x10)
    int32 MaxChannels;                                                                // 0x0010 (size: 0x4)

}; // Size: 0x18

struct FAudioReverbEffect : public FAudioEffectParameters
{
}; // Size: 0x48

struct FAudioVolumeSubmixOverrideSettings
{
    class USoundSubmix* Submix;                                                       // 0x0000 (size: 0x8)
    TArray<class USoundEffectSubmixPreset*> SubmixEffectChain;                        // 0x0008 (size: 0x10)
    float CrossfadeTime;                                                              // 0x0018 (size: 0x4)

}; // Size: 0x20

struct FAudioVolumeSubmixSendSettings
{
    EAudioVolumeLocationState ListenerLocationState;                                  // 0x0000 (size: 0x1)
    EAudioVolumeLocationState SourceLocationState;                                    // 0x0001 (size: 0x1)
    TArray<FSoundSubmixSendInfo> SubmixSends;                                         // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FAutoCompleteNode
{
    int32 IndexChar;                                                                  // 0x0000 (size: 0x4)
    TArray<int32> AutoCompleteListIndices;                                            // 0x0008 (size: 0x10)

}; // Size: 0x28

struct FBPComponentClassOverride
{
    FName ComponentName;                                                              // 0x0000 (size: 0x8)
    UClass* ComponentClass;                                                           // 0x0008 (size: 0x8)

}; // Size: 0x10

struct FBPEditorBookmarkNode
{
    FGuid NodeGuid;                                                                   // 0x0000 (size: 0x10)
    FGuid ParentGuid;                                                                 // 0x0010 (size: 0x10)
    FText DisplayName;                                                                // 0x0020 (size: 0x10)

}; // Size: 0x30

struct FBPInterfaceDescription
{
    TSubclassOf<class UInterface> Interface;                                          // 0x0000 (size: 0x8)
    TArray<class UEdGraph*> Graphs;                                                   // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FBPVariableDescription
{
    FName VarName;                                                                    // 0x0000 (size: 0x8)
    FGuid VarGuid;                                                                    // 0x0008 (size: 0x10)
    FEdGraphPinType VarType;                                                          // 0x0018 (size: 0x58)
    FString FriendlyName;                                                             // 0x0070 (size: 0x10)
    FText Category;                                                                   // 0x0080 (size: 0x10)
    uint64 PropertyFlags;                                                             // 0x0090 (size: 0x8)
    FName RepNotifyFunc;                                                              // 0x0098 (size: 0x8)
    TEnumAsByte<ELifetimeCondition> ReplicationCondition;                             // 0x00A0 (size: 0x1)
    TArray<FBPVariableMetaDataEntry> MetaDataArray;                                   // 0x00A8 (size: 0x10)
    FString DefaultValue;                                                             // 0x00B8 (size: 0x10)

}; // Size: 0xC8

struct FBPVariableMetaDataEntry
{
    FName DataKey;                                                                    // 0x0000 (size: 0x8)
    FString DataValue;                                                                // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FBakedAnimationState
{
    FName StateName;                                                                  // 0x0000 (size: 0x8)
    TArray<FBakedStateExitTransition> Transitions;                                    // 0x0008 (size: 0x10)
    int32 StateRootNodeIndex;                                                         // 0x0018 (size: 0x4)
    int32 StartNotify;                                                                // 0x001C (size: 0x4)
    int32 EndNotify;                                                                  // 0x0020 (size: 0x4)
    int32 FullyBlendedNotify;                                                         // 0x0024 (size: 0x4)
    bool bIsAConduit;                                                                 // 0x0028 (size: 0x1)
    int32 EntryRuleNodeIndex;                                                         // 0x002C (size: 0x4)
    TArray<int32> PlayerNodeIndices;                                                  // 0x0030 (size: 0x10)
    TArray<int32> LayerNodeIndices;                                                   // 0x0040 (size: 0x10)
    bool bAlwaysResetOnEntry;                                                         // 0x0050 (size: 0x1)

}; // Size: 0x58

struct FBakedAnimationStateMachine
{
    FName MachineName;                                                                // 0x0000 (size: 0x8)
    int32 InitialState;                                                               // 0x0008 (size: 0x4)
    TArray<FBakedAnimationState> States;                                              // 0x0010 (size: 0x10)
    TArray<FAnimationTransitionBetweenStates> Transitions;                            // 0x0020 (size: 0x10)

}; // Size: 0x30

struct FBakedCustomAttributePerBoneData
{
}; // Size: 0x1

struct FBakedFloatCustomAttribute
{
}; // Size: 0x1

struct FBakedIntegerCustomAttribute
{
}; // Size: 0x1

struct FBakedStateExitTransition
{
    int32 CanTakeDelegateIndex;                                                       // 0x0000 (size: 0x4)
    int32 CustomResultNodeIndex;                                                      // 0x0004 (size: 0x4)
    int32 TransitionIndex;                                                            // 0x0008 (size: 0x4)
    bool bDesiredTransitionReturnValue;                                               // 0x000C (size: 0x1)
    bool bAutomaticRemainingTimeRule;                                                 // 0x000D (size: 0x1)
    float AutomaticRuleTriggerTime;                                                   // 0x0010 (size: 0x4)
    FName SyncGroupNameToRequireValidMarkersRule;                                     // 0x0014 (size: 0x8)
    TArray<int32> PoseEvaluatorLinks;                                                 // 0x0020 (size: 0x10)

}; // Size: 0x30

struct FBakedStringCustomAttribute
{
}; // Size: 0x1

struct FBandwidthTestGenerator
{
    TArray<FBandwidthTestItem> ReplicatedBuffers;                                     // 0x0000 (size: 0x10)

}; // Size: 0x20

struct FBandwidthTestItem
{
    TArray<uint8> Kilobyte;                                                           // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FBaseAttenuationSettings
{
    EAttenuationDistanceModel DistanceAlgorithm;                                      // 0x0008 (size: 0x1)
    TEnumAsByte<EAttenuationShape::Type> AttenuationShape;                            // 0x0009 (size: 0x1)
    ENaturalSoundFalloffMode FalloffMode;                                             // 0x000A (size: 0x1)
    float dBAttenuationAtMax;                                                         // 0x000C (size: 0x4)
    FVector AttenuationShapeExtents;                                                  // 0x0010 (size: 0x18)
    float ConeOffset;                                                                 // 0x0028 (size: 0x4)
    float FalloffDistance;                                                            // 0x002C (size: 0x4)
    float ConeSphereRadius;                                                           // 0x0030 (size: 0x4)
    float ConeSphereFalloffDistance;                                                  // 0x0034 (size: 0x4)
    FRuntimeFloatCurve CustomAttenuationCurve;                                        // 0x0038 (size: 0x88)

}; // Size: 0xC0

struct FBaseComponentReference
{
    FName ComponentProperty;                                                          // 0x0000 (size: 0x8)
    FString PathToComponent;                                                          // 0x0008 (size: 0x10)

}; // Size: 0x20

struct FBasedMovementInfo
{
    uint16 BaseID;                                                                    // 0x0000 (size: 0x2)
    class UPrimitiveComponent* MovementBase;                                          // 0x0008 (size: 0x8)
    FName BoneName;                                                                   // 0x0010 (size: 0x8)
    FVector_NetQuantize100 Location;                                                  // 0x0018 (size: 0x18)
    FRotator Rotation;                                                                // 0x0030 (size: 0x18)
    bool bServerHasBaseComponent;                                                     // 0x0048 (size: 0x1)
    bool bRelativeRotation;                                                           // 0x0049 (size: 0x1)
    bool bServerHasVelocity;                                                          // 0x004A (size: 0x1)

}; // Size: 0x50

struct FBasedPosition
{
    class AActor* base;                                                               // 0x0000 (size: 0x8)
    FVector Position;                                                                 // 0x0008 (size: 0x18)
    FVector CachedBaseLocation;                                                       // 0x0020 (size: 0x18)
    FRotator CachedBaseRotation;                                                      // 0x0038 (size: 0x18)
    FVector CachedTransPosition;                                                      // 0x0050 (size: 0x18)

}; // Size: 0x68

struct FBatchedLine
{
    FVector Start;                                                                    // 0x0000 (size: 0x18)
    FVector End;                                                                      // 0x0018 (size: 0x18)
    FLinearColor Color;                                                               // 0x0030 (size: 0x10)
    float Thickness;                                                                  // 0x0040 (size: 0x4)
    float RemainingLifeTime;                                                          // 0x0044 (size: 0x4)
    uint8 DepthPriority;                                                              // 0x0048 (size: 0x1)
    uint32 BatchID;                                                                   // 0x004C (size: 0x4)

}; // Size: 0x50

struct FBatchedPoint
{
    FVector Position;                                                                 // 0x0000 (size: 0x18)
    FLinearColor Color;                                                               // 0x0018 (size: 0x10)
    float PointSize;                                                                  // 0x0028 (size: 0x4)
    float RemainingLifeTime;                                                          // 0x002C (size: 0x4)
    uint8 DepthPriority;                                                              // 0x0030 (size: 0x1)
    uint32 BatchID;                                                                   // 0x0034 (size: 0x4)

}; // Size: 0x38

struct FBeamModifierOptions
{
    uint8 bModify;                                                                    // 0x0000 (size: 0x1)
    uint8 bScale;                                                                     // 0x0000 (size: 0x1)
    uint8 bLock;                                                                      // 0x0000 (size: 0x1)

}; // Size: 0x4

struct FBeamTargetData
{
    FName TargetName;                                                                 // 0x0000 (size: 0x8)
    float TargetPercentage;                                                           // 0x0008 (size: 0x4)

}; // Size: 0xC

struct FBlendFilter
{
}; // Size: 0x10

struct FBlendParameter
{
    FString DisplayName;                                                              // 0x0000 (size: 0x10)
    float Min;                                                                        // 0x0010 (size: 0x4)
    float Max;                                                                        // 0x0014 (size: 0x4)
    int32 GridNum;                                                                    // 0x0018 (size: 0x4)
    bool bSnapToGrid;                                                                 // 0x001C (size: 0x1)
    bool bWrapInput;                                                                  // 0x001D (size: 0x1)

}; // Size: 0x20

struct FBlendProfileBoneEntry
{
    FBoneReference BoneReference;                                                     // 0x0000 (size: 0x10)
    float BlendScale;                                                                 // 0x0010 (size: 0x4)

}; // Size: 0x14

struct FBlendSample
{
    class UAnimSequence* Animation;                                                   // 0x0000 (size: 0x8)
    FVector SampleValue;                                                              // 0x0008 (size: 0x18)
    float RateScale;                                                                  // 0x0020 (size: 0x4)

}; // Size: 0x28

struct FBlendSampleData
{
    int32 SampleDataIndex;                                                            // 0x0000 (size: 0x4)
    class UAnimSequence* Animation;                                                   // 0x0008 (size: 0x8)
    float TotalWeight;                                                                // 0x0010 (size: 0x4)
    float WeightRate;                                                                 // 0x0014 (size: 0x4)
    float Time;                                                                       // 0x0018 (size: 0x4)
    float PreviousTime;                                                               // 0x001C (size: 0x4)
    float SamplePlayRate;                                                             // 0x0020 (size: 0x4)

}; // Size: 0x60

struct FBlendSpaceBlendProfile
{
    class UBlendProfile* BlendProfile;                                                // 0x0000 (size: 0x8)
    float TargetWeightInterpolationSpeedPerSec;                                       // 0x0008 (size: 0x4)

}; // Size: 0x10

struct FBlendSpaceData
{
    TArray<FBlendSpaceSegment> Segments;                                              // 0x0000 (size: 0x10)
    TArray<FBlendSpaceTriangle> Triangles;                                            // 0x0010 (size: 0x10)

}; // Size: 0x20

struct FBlendSpaceSegment
{
    int32 SampleIndices;                                                              // 0x0000 (size: 0x8)
    float Vertices;                                                                   // 0x0008 (size: 0x8)

}; // Size: 0x10

struct FBlendSpaceTriangle
{
    int32 SampleIndices;                                                              // 0x0000 (size: 0xC)
    FVector2D Vertices;                                                               // 0x0010 (size: 0x30)
    FBlendSpaceTriangleEdgeInfo EdgeInfo;                                             // 0x0040 (size: 0x78)

}; // Size: 0xB8

struct FBlendSpaceTriangleEdgeInfo
{
    FVector2D Normal;                                                                 // 0x0000 (size: 0x10)
    int32 NeighbourTriangleIndex;                                                     // 0x0010 (size: 0x4)
    int32 AdjacentPerimeterTriangleIndices;                                           // 0x0014 (size: 0x8)
    int32 AdjacentPerimeterVertexIndices;                                             // 0x001C (size: 0x8)

}; // Size: 0x28

struct FBlueprintComponentChangedPropertyInfo
{
    FName PropertyName;                                                               // 0x0000 (size: 0x8)
    int32 ArrayIndex;                                                                 // 0x0008 (size: 0x4)
    class UStruct* PropertyScope;                                                     // 0x0010 (size: 0x8)

}; // Size: 0x18

struct FBlueprintComponentDelegateBinding
{
    FName ComponentPropertyName;                                                      // 0x0000 (size: 0x8)
    FName DelegatePropertyName;                                                       // 0x0008 (size: 0x8)
    FName FunctionNameToBind;                                                         // 0x0010 (size: 0x8)

}; // Size: 0x18

struct FBlueprintCookedComponentInstancingData
{
    TArray<FBlueprintComponentChangedPropertyInfo> ChangedPropertyList;               // 0x0000 (size: 0x10)
    bool bHasValidCookedData;                                                         // 0x0021 (size: 0x1)

}; // Size: 0x48

struct FBlueprintDebugData
{
}; // Size: 0x1

struct FBlueprintEditorPromotionSettings
{
    FFilePath FirstMeshPath;                                                          // 0x0000 (size: 0x10)
    FFilePath SecondMeshPath;                                                         // 0x0010 (size: 0x10)
    FFilePath DefaultParticleAsset;                                                   // 0x0020 (size: 0x10)

}; // Size: 0x30

struct FBlueprintInputActionDelegateBinding : public FBlueprintInputDelegateBinding
{
    FName InputActionName;                                                            // 0x0004 (size: 0x8)
    TEnumAsByte<EInputEvent> InputKeyEvent;                                           // 0x000C (size: 0x1)
    FName FunctionNameToBind;                                                         // 0x0010 (size: 0x8)

}; // Size: 0x18

struct FBlueprintInputAxisDelegateBinding : public FBlueprintInputDelegateBinding
{
    FName InputAxisName;                                                              // 0x0004 (size: 0x8)
    FName FunctionNameToBind;                                                         // 0x000C (size: 0x8)

}; // Size: 0x14

struct FBlueprintInputAxisKeyDelegateBinding : public FBlueprintInputDelegateBinding
{
    FKey AxisKey;                                                                     // 0x0008 (size: 0x18)
    FName FunctionNameToBind;                                                         // 0x0020 (size: 0x8)

}; // Size: 0x28

struct FBlueprintInputDelegateBinding
{
    uint8 bConsumeInput;                                                              // 0x0000 (size: 0x1)
    uint8 bExecuteWhenPaused;                                                         // 0x0000 (size: 0x1)
    uint8 bOverrideParentBinding;                                                     // 0x0000 (size: 0x1)

}; // Size: 0x4

struct FBlueprintInputKeyDelegateBinding : public FBlueprintInputDelegateBinding
{
    FInputChord InputChord;                                                           // 0x0008 (size: 0x20)
    TEnumAsByte<EInputEvent> InputKeyEvent;                                           // 0x0028 (size: 0x1)
    FName FunctionNameToBind;                                                         // 0x002C (size: 0x8)

}; // Size: 0x38

struct FBlueprintInputTouchDelegateBinding : public FBlueprintInputDelegateBinding
{
    TEnumAsByte<EInputEvent> InputKeyEvent;                                           // 0x0004 (size: 0x1)
    FName FunctionNameToBind;                                                         // 0x0008 (size: 0x8)

}; // Size: 0x10

struct FBlueprintMacroCosmeticInfo
{
}; // Size: 0x1

struct FBodyInstance : public FBodyInstanceCore
{
    TEnumAsByte<ECollisionChannel> ObjectType;                                        // 0x001E (size: 0x1)
    TEnumAsByte<ECollisionEnabled::Type> CollisionEnabled;                            // 0x0020 (size: 0x1)
    ESleepFamily SleepFamily;                                                         // 0x0059 (size: 0x1)
    TEnumAsByte<EDOFMode::Type> DOFMode;                                              // 0x005A (size: 0x1)
    uint8 bUseCCD;                                                                    // 0x005B (size: 0x1)
    uint8 bUseMACD;                                                                   // 0x005B (size: 0x1)
    uint8 bIgnoreAnalyticCollisions;                                                  // 0x005B (size: 0x1)
    uint8 bNotifyRigidBodyCollision;                                                  // 0x005B (size: 0x1)
    uint8 bSmoothEdgeCollisions;                                                      // 0x005B (size: 0x1)
    uint8 bLockTranslation;                                                           // 0x005B (size: 0x1)
    uint8 bLockRotation;                                                              // 0x005B (size: 0x1)
    uint8 bLockXTranslation;                                                          // 0x005C (size: 0x1)
    uint8 bLockYTranslation;                                                          // 0x005C (size: 0x1)
    uint8 bLockZTranslation;                                                          // 0x005C (size: 0x1)
    uint8 bLockXRotation;                                                             // 0x005C (size: 0x1)
    uint8 bLockYRotation;                                                             // 0x005C (size: 0x1)
    uint8 bLockZRotation;                                                             // 0x005C (size: 0x1)
    uint8 bOverrideMaxAngularVelocity;                                                // 0x005C (size: 0x1)
    uint8 bOverrideMaxDepenetrationVelocity;                                          // 0x005D (size: 0x1)
    uint8 bOverrideWalkableSlopeOnInstance;                                           // 0x005D (size: 0x1)
    uint8 bInterpolateWhenSubStepping;                                                // 0x005D (size: 0x1)
    uint8 bInertiaConditioning;                                                       // 0x005D (size: 0x1)
    uint8 bOneWayInteraction;                                                         // 0x005D (size: 0x1)
    uint8 bOverrideSolverAsyncDeltaTime;                                              // 0x005D (size: 0x1)
    float SolverAsyncDeltaTime;                                                       // 0x0060 (size: 0x4)
    FName CollisionProfileName;                                                       // 0x0080 (size: 0x8)
    uint8 PositionSolverIterationCount;                                               // 0x0088 (size: 0x1)
    uint8 VelocitySolverIterationCount;                                               // 0x0089 (size: 0x1)
    FCollisionResponse CollisionResponses;                                            // 0x0090 (size: 0x30)
    float MaxDepenetrationVelocity;                                                   // 0x00C0 (size: 0x4)
    float MassInKgOverride;                                                           // 0x00C4 (size: 0x4)
    float LinearDamping;                                                              // 0x00D0 (size: 0x4)
    float AngularDamping;                                                             // 0x00D4 (size: 0x4)
    FVector CustomDOFPlaneNormal;                                                     // 0x00D8 (size: 0x18)
    FVector COMNudge;                                                                 // 0x00F0 (size: 0x18)
    float MassScale;                                                                  // 0x0108 (size: 0x4)
    FVector InertiaTensorScale;                                                       // 0x0110 (size: 0x18)
    FWalkableSlopeOverride WalkableSlopeOverride;                                     // 0x0138 (size: 0x10)
    class UPhysicalMaterial* PhysMaterialOverride;                                    // 0x0148 (size: 0x8)
    float MaxAngularVelocity;                                                         // 0x0150 (size: 0x4)
    float CustomSleepThresholdMultiplier;                                             // 0x0154 (size: 0x4)
    float StabilizationThresholdMultiplier;                                           // 0x0158 (size: 0x4)
    float PhysicsBlendWeight;                                                         // 0x015C (size: 0x4)

}; // Size: 0x198

struct FBodyInstanceAsyncPhysicsTickHandle
{
}; // Size: 0x8

struct FBoneAnimationTrack
{
    FRawAnimSequenceTrack InternalTrackData;                                          // 0x0000 (size: 0x30)
    int32 BoneTreeIndex;                                                              // 0x0030 (size: 0x4)
    FName Name;                                                                       // 0x0034 (size: 0x8)

}; // Size: 0x40

struct FBoneFilter
{
    bool bExcludeSelf;                                                                // 0x0000 (size: 0x1)
    FName BoneName;                                                                   // 0x0004 (size: 0x8)

}; // Size: 0xC

struct FBoneMirrorExport
{
    FName BoneName;                                                                   // 0x0000 (size: 0x8)
    FName SourceBoneName;                                                             // 0x0008 (size: 0x8)
    TEnumAsByte<EAxis::Type> BoneFlipAxis;                                            // 0x0010 (size: 0x1)

}; // Size: 0x14

struct FBoneMirrorInfo
{
    int32 SourceIndex;                                                                // 0x0000 (size: 0x4)
    TEnumAsByte<EAxis::Type> BoneFlipAxis;                                            // 0x0004 (size: 0x1)

}; // Size: 0x8

struct FBoneNode
{
    TEnumAsByte<EBoneTranslationRetargetingMode::Type> TranslationRetargetingMode;    // 0x0000 (size: 0x1)

}; // Size: 0x1

struct FBoneReductionSetting
{
    TArray<FName> BonesToRemove;                                                      // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FBoneReference
{
    FName BoneName;                                                                   // 0x0000 (size: 0x8)

}; // Size: 0x10

struct FBoneSocketTarget
{
    bool bUseSocket;                                                                  // 0x0000 (size: 0x1)
    FBoneReference BoneReference;                                                     // 0x0004 (size: 0x10)
    FSocketReference SocketReference;                                                 // 0x0020 (size: 0x70)

}; // Size: 0x90

struct FBookmark2DJumpToSettings
{
}; // Size: 0x1

struct FBookmarkBaseJumpToSettings
{
}; // Size: 0x1

struct FBookmarkJumpToSettings : public FBookmarkBaseJumpToSettings
{
}; // Size: 0x1

struct FBracketPayload : public FEmptyPayload
{
    FString Description;                                                              // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FBranchFilter
{
    FName BoneName;                                                                   // 0x0000 (size: 0x8)
    int32 BlendDepth;                                                                 // 0x0008 (size: 0x4)

}; // Size: 0xC

struct FBranchingPoint : public FAnimLinkableElement
{
    FName EventName;                                                                  // 0x0030 (size: 0x8)
    float TriggerTimeOffset;                                                          // 0x0038 (size: 0x4)

}; // Size: 0x40

struct FBranchingPointMarker
{
    int32 NotifyIndex;                                                                // 0x0000 (size: 0x4)
    float TriggerTime;                                                                // 0x0004 (size: 0x4)
    TEnumAsByte<EAnimNotifyEventType::Type> NotifyEventType;                          // 0x0008 (size: 0x1)

}; // Size: 0xC

struct FBranchingPointNotifyPayload
{
}; // Size: 0x20

struct FBroadphaseSettings
{
    bool bUseMBPOnClient;                                                             // 0x0000 (size: 0x1)
    bool bUseMBPOnServer;                                                             // 0x0001 (size: 0x1)
    bool bUseMBPOuterBounds;                                                          // 0x0002 (size: 0x1)
    FBox MBPBounds;                                                                   // 0x0008 (size: 0x38)
    FBox MBPOuterBounds;                                                              // 0x0040 (size: 0x38)
    uint32 MBPNumSubdivs;                                                             // 0x0078 (size: 0x4)

}; // Size: 0x80

struct FBuildPromotionImportWorkflowSettings
{
    FEditorImportWorkflowDefinition Diffuse;                                          // 0x0000 (size: 0x20)
    FEditorImportWorkflowDefinition Normal;                                           // 0x0020 (size: 0x20)
    FEditorImportWorkflowDefinition StaticMesh;                                       // 0x0040 (size: 0x20)
    FEditorImportWorkflowDefinition ReimportStaticMesh;                               // 0x0060 (size: 0x20)
    FEditorImportWorkflowDefinition BlendShapeMesh;                                   // 0x0080 (size: 0x20)
    FEditorImportWorkflowDefinition MorphMesh;                                        // 0x00A0 (size: 0x20)
    FEditorImportWorkflowDefinition SkeletalMesh;                                     // 0x00C0 (size: 0x20)
    FEditorImportWorkflowDefinition Animation;                                        // 0x00E0 (size: 0x20)
    FEditorImportWorkflowDefinition Sound;                                            // 0x0100 (size: 0x20)
    FEditorImportWorkflowDefinition SurroundSound;                                    // 0x0120 (size: 0x20)
    TArray<FEditorImportWorkflowDefinition> OtherAssetsToImport;                      // 0x0140 (size: 0x10)

}; // Size: 0x150

struct FBuildPromotionNewProjectSettings
{
    FDirectoryPath NewProjectFolderOverride;                                          // 0x0000 (size: 0x10)
    FString NewProjectNameOverride;                                                   // 0x0010 (size: 0x10)

}; // Size: 0x20

struct FBuildPromotionOpenAssetSettings
{
    FFilePath BlueprintAsset;                                                         // 0x0000 (size: 0x10)
    FFilePath MaterialAsset;                                                          // 0x0010 (size: 0x10)
    FFilePath ParticleSystemAsset;                                                    // 0x0020 (size: 0x10)
    FFilePath SkeletalMeshAsset;                                                      // 0x0030 (size: 0x10)
    FFilePath StaticMeshAsset;                                                        // 0x0040 (size: 0x10)
    FFilePath TextureAsset;                                                           // 0x0050 (size: 0x10)

}; // Size: 0x60

struct FBuildPromotionTestSettings
{
    FFilePath DefaultStaticMeshAsset;                                                 // 0x0000 (size: 0x10)
    FBuildPromotionImportWorkflowSettings ImportWorkflow;                             // 0x0010 (size: 0x150)
    FBuildPromotionOpenAssetSettings OpenAssets;                                      // 0x0160 (size: 0x60)
    FBuildPromotionNewProjectSettings NewProjectSettings;                             // 0x01C0 (size: 0x20)
    FFilePath SourceControlMaterial;                                                  // 0x01E0 (size: 0x10)

}; // Size: 0x1F0

struct FBuilderPoly
{
    TArray<int32> VertexIndices;                                                      // 0x0000 (size: 0x10)
    int32 Direction;                                                                  // 0x0010 (size: 0x4)
    FName ItemName;                                                                   // 0x0014 (size: 0x8)
    int32 PolyFlags;                                                                  // 0x001C (size: 0x4)

}; // Size: 0x20

struct FCachedAnimAssetPlayerData
{
    FName StateMachineName;                                                           // 0x0000 (size: 0x8)
    FName StateName;                                                                  // 0x0008 (size: 0x8)

}; // Size: 0x18

struct FCachedAnimRelevancyData
{
    FName StateMachineName;                                                           // 0x0000 (size: 0x8)
    FName StateName;                                                                  // 0x0008 (size: 0x8)

}; // Size: 0x1C

struct FCachedAnimStateArray
{
    TArray<FCachedAnimStateData> States;                                              // 0x0000 (size: 0x10)

}; // Size: 0x18

struct FCachedAnimStateData
{
    FName StateMachineName;                                                           // 0x0000 (size: 0x8)
    FName StateName;                                                                  // 0x0008 (size: 0x8)

}; // Size: 0x1C

struct FCachedAnimTransitionData
{
    FName StateMachineName;                                                           // 0x0000 (size: 0x8)
    FName FromStateName;                                                              // 0x0008 (size: 0x8)
    FName ToStateName;                                                                // 0x0010 (size: 0x8)

}; // Size: 0x24

struct FCachedFloatCurve
{
    FName CurveName;                                                                  // 0x0000 (size: 0x8)

}; // Size: 0x8

struct FCachedKeyToActionInfo
{
    TWeakObjectPtr<class UPlayerInput> PlayerInput;                                   // 0x0000 (size: 0x8)

}; // Size: 0x70

struct FCachedPoseIndices
{
    TArray<int32> OrderedSavedPoseNodeIndices;                                        // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FCameraCacheEntry
{
    float Timestamp;                                                                  // 0x0000 (size: 0x4)
    FMinimalViewInfo POV;                                                             // 0x0010 (size: 0x800)

}; // Size: 0x810

struct FCameraExposureSettings
{
    TEnumAsByte<EAutoExposureMethod> Method;                                          // 0x0000 (size: 0x1)
    float LowPercent;                                                                 // 0x0004 (size: 0x4)
    float HighPercent;                                                                // 0x0008 (size: 0x4)
    float MinBrightness;                                                              // 0x000C (size: 0x4)
    float MaxBrightness;                                                              // 0x0010 (size: 0x4)
    float SpeedUp;                                                                    // 0x0014 (size: 0x4)
    float SpeedDown;                                                                  // 0x0018 (size: 0x4)
    float Bias;                                                                       // 0x001C (size: 0x4)
    class UCurveFloat* BiasCurve;                                                     // 0x0020 (size: 0x8)
    class UTexture* MeterMask;                                                        // 0x0028 (size: 0x8)
    float HistogramLogMin;                                                            // 0x0030 (size: 0x4)
    float HistogramLogMax;                                                            // 0x0034 (size: 0x4)
    float CalibrationConstant;                                                        // 0x0038 (size: 0x4)
    uint8 ApplyPhysicalCameraExposure;                                                // 0x003C (size: 0x1)

}; // Size: 0x40

struct FCameraLensInterfaceClassSupport
{
    TSubclassOf<class AActor> Class;                                                  // 0x0000 (size: 0x8)

}; // Size: 0x8

struct FCameraShakeDuration
{
    float Duration;                                                                   // 0x0000 (size: 0x4)
    ECameraShakeDurationType Type;                                                    // 0x0004 (size: 0x1)

}; // Size: 0x8

struct FCameraShakeInfo
{
    FCameraShakeDuration Duration;                                                    // 0x0000 (size: 0x8)
    float BlendIn;                                                                    // 0x0008 (size: 0x4)
    float BlendOut;                                                                   // 0x000C (size: 0x4)

}; // Size: 0x10

struct FCameraShakePatternScrubParams
{
    float AbsoluteTime;                                                               // 0x0000 (size: 0x4)
    float ShakeScale;                                                                 // 0x0004 (size: 0x4)
    float DynamicScale;                                                               // 0x0008 (size: 0x4)
    FMinimalViewInfo POV;                                                             // 0x0010 (size: 0x800)

}; // Size: 0x810

struct FCameraShakePatternStartParams
{
    bool bIsRestarting;                                                               // 0x0000 (size: 0x1)
    bool bOverrideDuration;                                                           // 0x0001 (size: 0x1)
    float DurationOverride;                                                           // 0x0004 (size: 0x4)

}; // Size: 0x8

struct FCameraShakePatternStopParams
{
    bool bImmediately;                                                                // 0x0000 (size: 0x1)

}; // Size: 0x1

struct FCameraShakePatternUpdateParams
{
    float DeltaTime;                                                                  // 0x0000 (size: 0x4)
    float ShakeScale;                                                                 // 0x0004 (size: 0x4)
    float DynamicScale;                                                               // 0x0008 (size: 0x4)
    FMinimalViewInfo POV;                                                             // 0x0010 (size: 0x800)

}; // Size: 0x810

struct FCameraShakePatternUpdateResult
{
}; // Size: 0x740

struct FCanvasIcon
{
    class UTexture* Texture;                                                          // 0x0000 (size: 0x8)
    float U;                                                                          // 0x0008 (size: 0x4)
    float V;                                                                          // 0x000C (size: 0x4)
    float UL;                                                                         // 0x0010 (size: 0x4)
    float VL;                                                                         // 0x0014 (size: 0x4)

}; // Size: 0x18

struct FCanvasUVTri
{
    FVector2D V0_Pos;                                                                 // 0x0000 (size: 0x10)
    FVector2D V0_UV;                                                                  // 0x0010 (size: 0x10)
    FLinearColor V0_Color;                                                            // 0x0020 (size: 0x10)
    FVector2D V1_Pos;                                                                 // 0x0030 (size: 0x10)
    FVector2D V1_UV;                                                                  // 0x0040 (size: 0x10)
    FLinearColor V1_Color;                                                            // 0x0050 (size: 0x10)
    FVector2D V2_Pos;                                                                 // 0x0060 (size: 0x10)
    FVector2D V2_UV;                                                                  // 0x0070 (size: 0x10)
    FLinearColor V2_Color;                                                            // 0x0080 (size: 0x10)

}; // Size: 0x90

struct FChannelDefinition
{
    FName ChannelName;                                                                // 0x0000 (size: 0x8)
    FName ClassName;                                                                  // 0x0008 (size: 0x8)
    UClass* ChannelClass;                                                             // 0x0010 (size: 0x8)
    int32 StaticChannelIndex;                                                         // 0x0018 (size: 0x4)
    uint8 bTickOnCreate;                                                              // 0x001C (size: 0x1)
    uint8 bServerOpen;                                                                // 0x001C (size: 0x1)
    uint8 bClientOpen;                                                                // 0x001C (size: 0x1)
    uint8 bInitialServer;                                                             // 0x001C (size: 0x1)
    uint8 bInitialClient;                                                             // 0x001C (size: 0x1)

}; // Size: 0x20

struct FChaosBreakEvent
{
    class UPrimitiveComponent* Component;                                             // 0x0000 (size: 0x8)
    FVector Location;                                                                 // 0x0008 (size: 0x18)
    FVector Velocity;                                                                 // 0x0020 (size: 0x18)
    FVector AngularVelocity;                                                          // 0x0038 (size: 0x18)
    FVector Extents;                                                                  // 0x0050 (size: 0x18)
    float Mass;                                                                       // 0x0068 (size: 0x4)
    int32 Index;                                                                      // 0x006C (size: 0x4)
    bool bFromCrumble;                                                                // 0x0070 (size: 0x1)

}; // Size: 0x78

struct FChaosCrumblingEvent
{
    class UPrimitiveComponent* Component;                                             // 0x0000 (size: 0x8)
    FVector Location;                                                                 // 0x0008 (size: 0x18)
    FQuat Orientation;                                                                // 0x0020 (size: 0x20)
    FVector LinearVelocity;                                                           // 0x0040 (size: 0x18)
    FVector AngularVelocity;                                                          // 0x0058 (size: 0x18)
    float Mass;                                                                       // 0x0070 (size: 0x4)
    FBox LocalBounds;                                                                 // 0x0078 (size: 0x38)
    TArray<int32> Children;                                                           // 0x00B0 (size: 0x10)

}; // Size: 0xC0

struct FChaosPhysicsSettings
{
    EChaosThreadingMode DefaultThreadingModel;                                        // 0x0000 (size: 0x1)
    EChaosSolverTickMode DedicatedThreadTickMode;                                     // 0x0001 (size: 0x1)
    EChaosBufferMode DedicatedThreadBufferMode;                                       // 0x0002 (size: 0x1)

}; // Size: 0x3

struct FChaosRemovalEvent
{
    class UPrimitiveComponent* Component;                                             // 0x0000 (size: 0x8)
    FVector Location;                                                                 // 0x0008 (size: 0x18)
    float Mass;                                                                       // 0x0020 (size: 0x4)

}; // Size: 0x28

struct FCharacterMoveResponsePackedBits : public FCharacterNetworkSerializationPackedBits
{
}; // Size: 0xC8

struct FCharacterMovementComponentPostPhysicsTickFunction : public FTickFunction
{
}; // Size: 0x30

struct FCharacterMovementComponentPrePhysicsTickFunction : public FTickFunction
{
}; // Size: 0x30

struct FCharacterNetworkSerializationPackedBits
{
}; // Size: 0xC8

struct FCharacterNetworkSerializationPackedBitsNetSerializerConfig : public FNetSerializerConfig
{
    uint32 MaxAllowedDataBits;                                                        // 0x0010 (size: 0x4)
    uint32 MaxAllowedObjectReferences;                                                // 0x0014 (size: 0x4)

}; // Size: 0x18

struct FCharacterServerMovePackedBits : public FCharacterNetworkSerializationPackedBits
{
}; // Size: 0xC8

struct FChildActorAttachedActorInfo
{
    TWeakObjectPtr<class AActor> Actor;                                               // 0x0000 (size: 0x8)
    FName SocketName;                                                                 // 0x0008 (size: 0x8)
    FTransform RelativeTransform;                                                     // 0x0010 (size: 0x60)

}; // Size: 0x70

struct FChildActorComponentInstanceData : public FSceneComponentInstanceData
{
    TSubclassOf<class AActor> ChildActorClass;                                        // 0x00B8 (size: 0x8)
    FName ChildActorName;                                                             // 0x00C0 (size: 0x8)
    TArray<FChildActorAttachedActorInfo> AttachedActors;                              // 0x00C8 (size: 0x10)

}; // Size: 0xF8

struct FClassRedirect
{
    FName ObjectName;                                                                 // 0x0000 (size: 0x8)
    FName OldClassName;                                                               // 0x0008 (size: 0x8)
    FName NewClassName;                                                               // 0x0010 (size: 0x8)
    FName OldSubobjName;                                                              // 0x0018 (size: 0x8)
    FName NewSubobjName;                                                              // 0x0020 (size: 0x8)
    FName NewClassClass;                                                              // 0x0028 (size: 0x8)
    FName NewClassPackage;                                                            // 0x0030 (size: 0x8)
    bool InstanceOnly;                                                                // 0x0038 (size: 0x1)

}; // Size: 0x3C

struct FClientReceiveData
{
    class APlayerController* LocalPC;                                                 // 0x0000 (size: 0x8)
    FName MessageType;                                                                // 0x0008 (size: 0x8)
    int32 MessageIndex;                                                               // 0x0010 (size: 0x4)
    FString MessageString;                                                            // 0x0018 (size: 0x10)
    class APlayerState* RelatedPlayerState_1;                                         // 0x0028 (size: 0x8)
    class APlayerState* RelatedPlayerState_2;                                         // 0x0030 (size: 0x8)
    class UObject* OptionalObject;                                                    // 0x0038 (size: 0x8)

}; // Size: 0x40

struct FClothPhysicsProperties_Legacy
{
    float VerticalResistance;                                                         // 0x0000 (size: 0x4)
    float HorizontalResistance;                                                       // 0x0004 (size: 0x4)
    float BendResistance;                                                             // 0x0008 (size: 0x4)
    float ShearResistance;                                                            // 0x000C (size: 0x4)
    float Friction;                                                                   // 0x0010 (size: 0x4)
    float Damping;                                                                    // 0x0014 (size: 0x4)
    float TetherStiffness;                                                            // 0x0018 (size: 0x4)
    float TetherLimit;                                                                // 0x001C (size: 0x4)
    float Drag;                                                                       // 0x0020 (size: 0x4)
    float StiffnessFrequency;                                                         // 0x0024 (size: 0x4)
    float GravityScale;                                                               // 0x0028 (size: 0x4)
    float MassScale;                                                                  // 0x002C (size: 0x4)
    float InertiaBlend;                                                               // 0x0030 (size: 0x4)
    float SelfCollisionThickness;                                                     // 0x0034 (size: 0x4)
    float SelfCollisionSquashScale;                                                   // 0x0038 (size: 0x4)
    float SelfCollisionStiffness;                                                     // 0x003C (size: 0x4)
    float SolverFrequency;                                                            // 0x0040 (size: 0x4)
    float FiberCompression;                                                           // 0x0044 (size: 0x4)
    float FiberExpansion;                                                             // 0x0048 (size: 0x4)
    float FiberResistance;                                                            // 0x004C (size: 0x4)

}; // Size: 0x50

struct FClothingAssetData_Legacy
{
    FName AssetName;                                                                  // 0x0000 (size: 0x8)
    FString ApexFileName;                                                             // 0x0008 (size: 0x10)
    bool bClothPropertiesChanged;                                                     // 0x0018 (size: 0x1)
    FClothPhysicsProperties_Legacy PhysicsProperties;                                 // 0x001C (size: 0x50)

}; // Size: 0x70

struct FClusterNode
{
    FVector3f BoundMin;                                                               // 0x0000 (size: 0xC)
    int32 FirstChild;                                                                 // 0x000C (size: 0x4)
    FVector3f BoundMax;                                                               // 0x0010 (size: 0xC)
    int32 LastChild;                                                                  // 0x001C (size: 0x4)
    int32 FirstInstance;                                                              // 0x0020 (size: 0x4)
    int32 LastInstance;                                                               // 0x0024 (size: 0x4)
    FVector3f MinInstanceScale;                                                       // 0x0028 (size: 0xC)
    FVector3f MaxInstanceScale;                                                       // 0x0034 (size: 0xC)

}; // Size: 0x40

struct FClusterNode_DEPRECATED
{
    FVector3f BoundMin;                                                               // 0x0000 (size: 0xC)
    int32 FirstChild;                                                                 // 0x000C (size: 0x4)
    FVector3f BoundMax;                                                               // 0x0010 (size: 0xC)
    int32 LastChild;                                                                  // 0x001C (size: 0x4)
    int32 FirstInstance;                                                              // 0x0020 (size: 0x4)
    int32 LastInstance;                                                               // 0x0024 (size: 0x4)

}; // Size: 0x28

struct FClusterUnionBoneData
{
}; // Size: 0x8

struct FClusterUnionInitializationData
{
    class UClusterUnionComponent* ClusterUnionComponent;                              // 0x0000 (size: 0x8)
    TArray<class UPrimitiveComponent*> ProcessedComponents;                           // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FClusterUnionPendingAddData
{
    TSet<FClusterUnionBoneData> BonesData;                                            // 0x0000 (size: 0x50)

}; // Size: 0x50

struct FClusterUnionReplicatedData
{
    uint8 ObjectState;                                                                // 0x0000 (size: 0x1)
    bool bIsAnchored;                                                                 // 0x0001 (size: 0x1)

}; // Size: 0x2

struct FClusteredActorData
{
    bool bWasReplicatingMovement;                                                     // 0x0050 (size: 0x1)

}; // Size: 0x58

struct FClusteredComponentData
{
    TWeakObjectPtr<class UClusterUnionReplicatedProxyComponent> ReplicatedProxyComponent; // 0x0010 (size: 0x8)
    TWeakObjectPtr<class AActor> Owner;                                               // 0x0018 (size: 0x8)
    bool bWasReplicating;                                                             // 0x0020 (size: 0x1)
    bool bPendingDeletion;                                                            // 0x0021 (size: 0x1)

}; // Size: 0x28

struct FCollectionParameterBase
{
    FName ParameterName;                                                              // 0x0000 (size: 0x8)
    FGuid ID;                                                                         // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FCollectionReference
{
    FName CollectionName;                                                             // 0x0000 (size: 0x8)

}; // Size: 0x8

struct FCollectionScalarParameter : public FCollectionParameterBase
{
    float DefaultValue;                                                               // 0x0018 (size: 0x4)

}; // Size: 0x1C

struct FCollectionVectorParameter : public FCollectionParameterBase
{
    FLinearColor DefaultValue;                                                        // 0x0018 (size: 0x10)

}; // Size: 0x28

struct FCollisionChaosEvent
{
    FVector Location;                                                                 // 0x0000 (size: 0x18)
    FVector AccumulatedImpulse;                                                       // 0x0018 (size: 0x18)
    FVector Normal;                                                                   // 0x0030 (size: 0x18)
    float PenetrationDepth;                                                           // 0x0048 (size: 0x4)
    FCollisionChaosEventBodyInfo Body1;                                               // 0x0050 (size: 0x70)
    FCollisionChaosEventBodyInfo Body2;                                               // 0x00C0 (size: 0x70)

}; // Size: 0x130

struct FCollisionChaosEventBodyInfo
{
    FVector Velocity;                                                                 // 0x0000 (size: 0x18)
    FVector DeltaVelocity;                                                            // 0x0018 (size: 0x18)
    FVector AngularVelocity;                                                          // 0x0030 (size: 0x18)
    float Mass;                                                                       // 0x0048 (size: 0x4)
    class UPhysicalMaterial* PhysMaterial;                                            // 0x0050 (size: 0x8)
    TWeakObjectPtr<class UPrimitiveComponent> Component;                              // 0x0058 (size: 0x8)
    int32 BodyIndex;                                                                  // 0x0060 (size: 0x4)
    FName BoneName;                                                                   // 0x0064 (size: 0x8)

}; // Size: 0x70

struct FCollisionImpactData
{
    TArray<FRigidBodyContactInfo> ContactInfos;                                       // 0x0000 (size: 0x10)
    FVector TotalNormalImpulse;                                                       // 0x0010 (size: 0x18)
    FVector TotalFrictionImpulse;                                                     // 0x0028 (size: 0x18)
    bool bIsVelocityDeltaUnderThreshold;                                              // 0x0040 (size: 0x1)

}; // Size: 0x48

struct FCollisionProfileName
{
    FName Name;                                                                       // 0x0000 (size: 0x8)

}; // Size: 0x8

struct FCollisionResponse
{
    FCollisionResponseContainer ResponseToChannels;                                   // 0x0000 (size: 0x20)
    TArray<FResponseChannel> ResponseArray;                                           // 0x0020 (size: 0x10)

}; // Size: 0x30

struct FCollisionResponseContainer
{
    TEnumAsByte<ECollisionResponse> WorldStatic;                                      // 0x0000 (size: 0x1)
    TEnumAsByte<ECollisionResponse> WorldDynamic;                                     // 0x0001 (size: 0x1)
    TEnumAsByte<ECollisionResponse> Pawn;                                             // 0x0002 (size: 0x1)
    TEnumAsByte<ECollisionResponse> Visibility;                                       // 0x0003 (size: 0x1)
    TEnumAsByte<ECollisionResponse> Camera;                                           // 0x0004 (size: 0x1)
    TEnumAsByte<ECollisionResponse> PhysicsBody;                                      // 0x0005 (size: 0x1)
    TEnumAsByte<ECollisionResponse> Vehicle;                                          // 0x0006 (size: 0x1)
    TEnumAsByte<ECollisionResponse> Destructible;                                     // 0x0007 (size: 0x1)
    TEnumAsByte<ECollisionResponse> EngineTraceChannel1;                              // 0x0008 (size: 0x1)
    TEnumAsByte<ECollisionResponse> EngineTraceChannel2;                              // 0x0009 (size: 0x1)
    TEnumAsByte<ECollisionResponse> EngineTraceChannel3;                              // 0x000A (size: 0x1)
    TEnumAsByte<ECollisionResponse> EngineTraceChannel4;                              // 0x000B (size: 0x1)
    TEnumAsByte<ECollisionResponse> EngineTraceChannel5;                              // 0x000C (size: 0x1)
    TEnumAsByte<ECollisionResponse> EngineTraceChannel6;                              // 0x000D (size: 0x1)
    TEnumAsByte<ECollisionResponse> GameTraceChannel1;                                // 0x000E (size: 0x1)
    TEnumAsByte<ECollisionResponse> GameTraceChannel2;                                // 0x000F (size: 0x1)
    TEnumAsByte<ECollisionResponse> GameTraceChannel3;                                // 0x0010 (size: 0x1)
    TEnumAsByte<ECollisionResponse> GameTraceChannel4;                                // 0x0011 (size: 0x1)
    TEnumAsByte<ECollisionResponse> GameTraceChannel5;                                // 0x0012 (size: 0x1)
    TEnumAsByte<ECollisionResponse> GameTraceChannel6;                                // 0x0013 (size: 0x1)
    TEnumAsByte<ECollisionResponse> GameTraceChannel7;                                // 0x0014 (size: 0x1)
    TEnumAsByte<ECollisionResponse> GameTraceChannel8;                                // 0x0015 (size: 0x1)
    TEnumAsByte<ECollisionResponse> GameTraceChannel9;                                // 0x0016 (size: 0x1)
    TEnumAsByte<ECollisionResponse> GameTraceChannel10;                               // 0x0017 (size: 0x1)
    TEnumAsByte<ECollisionResponse> GameTraceChannel11;                               // 0x0018 (size: 0x1)
    TEnumAsByte<ECollisionResponse> GameTraceChannel12;                               // 0x0019 (size: 0x1)
    TEnumAsByte<ECollisionResponse> GameTraceChannel13;                               // 0x001A (size: 0x1)
    TEnumAsByte<ECollisionResponse> GameTraceChannel14;                               // 0x001B (size: 0x1)
    TEnumAsByte<ECollisionResponse> GameTraceChannel15;                               // 0x001C (size: 0x1)
    TEnumAsByte<ECollisionResponse> GameTraceChannel16;                               // 0x001D (size: 0x1)
    TEnumAsByte<ECollisionResponse> GameTraceChannel17;                               // 0x001E (size: 0x1)
    TEnumAsByte<ECollisionResponse> GameTraceChannel18;                               // 0x001F (size: 0x1)

}; // Size: 0x20

struct FCollisionResponseTemplate
{
    FName Name;                                                                       // 0x0000 (size: 0x8)
    TEnumAsByte<ECollisionEnabled::Type> CollisionEnabled;                            // 0x0008 (size: 0x1)
    bool bCanModify;                                                                  // 0x000A (size: 0x1)
    FName ObjectTypeName;                                                             // 0x002C (size: 0x8)
    TArray<FResponseChannel> CustomResponses;                                         // 0x0038 (size: 0x10)

}; // Size: 0x48

struct FColorGradePerRangeSettings
{
    FVector4 Saturation;                                                              // 0x0000 (size: 0x20)
    FVector4 Contrast;                                                                // 0x0020 (size: 0x20)
    FVector4 Gamma;                                                                   // 0x0040 (size: 0x20)
    FVector4 Gain;                                                                    // 0x0060 (size: 0x20)
    FVector4 Offset;                                                                  // 0x0080 (size: 0x20)

}; // Size: 0xA0

struct FColorGradingSettings
{
    FColorGradePerRangeSettings Global;                                               // 0x0000 (size: 0xA0)
    FColorGradePerRangeSettings Shadows;                                              // 0x00A0 (size: 0xA0)
    FColorGradePerRangeSettings Midtones;                                             // 0x0140 (size: 0xA0)
    FColorGradePerRangeSettings Highlights;                                           // 0x01E0 (size: 0xA0)
    float ShadowsMax;                                                                 // 0x0280 (size: 0x4)
    float HighlightsMin;                                                              // 0x0284 (size: 0x4)
    float HighlightsMax;                                                              // 0x0288 (size: 0x4)

}; // Size: 0x290

struct FColorMaterialInput : public FMaterialInput
{
    uint8 UseConstant;                                                                // 0x0028 (size: 0x1)
    FColor Constant;                                                                  // 0x002C (size: 0x4)

}; // Size: 0x30

struct FComponentKey
{
    UClass* OwnerClass;                                                               // 0x0000 (size: 0x8)
    FName SCSVariableName;                                                            // 0x0008 (size: 0x8)
    FGuid AssociatedGuid;                                                             // 0x0010 (size: 0x10)

}; // Size: 0x20

struct FComponentOverrideRecord
{
    UClass* ComponentClass;                                                           // 0x0000 (size: 0x8)
    class UActorComponent* ComponentTemplate;                                         // 0x0008 (size: 0x8)
    FComponentKey ComponentKey;                                                       // 0x0010 (size: 0x20)
    FBlueprintCookedComponentInstancingData CookedComponentInstancingData;            // 0x0030 (size: 0x48)

}; // Size: 0x78

struct FComponentReference : public FBaseComponentReference
{
    TWeakObjectPtr<class AActor> OtherActor;                                          // 0x0020 (size: 0x8)

}; // Size: 0x28

struct FComponentSpacePose
{
    TArray<FTransform> Transforms;                                                    // 0x0000 (size: 0x10)
    TArray<FName> Names;                                                              // 0x0010 (size: 0x10)

}; // Size: 0x20

struct FComponentSpacePoseLink : public FPoseLinkBase
{
}; // Size: 0x10

struct FComponentSync
{
    FName Name;                                                                       // 0x0000 (size: 0x8)
    ESyncOption SyncOption;                                                           // 0x0008 (size: 0x1)

}; // Size: 0xC

struct FCompositeReroute
{
    FName Name;                                                                       // 0x0000 (size: 0x8)
    class UMaterialExpressionReroute* Expression;                                     // 0x0008 (size: 0x8)

}; // Size: 0x10

struct FCompositeSection : public FAnimLinkableElement
{
    FName SectionName;                                                                // 0x0030 (size: 0x8)
    FName NextSectionName;                                                            // 0x0038 (size: 0x8)
    TArray<class UAnimMetaData*> MetaData;                                            // 0x0040 (size: 0x10)

}; // Size: 0x50

struct FCompressedRichCurve
{
}; // Size: 0x18

struct FCompressedTrack
{
    TArray<uint8> ByteStream;                                                         // 0x0000 (size: 0x10)
    TArray<float> Times;                                                              // 0x0010 (size: 0x10)
    float Mins;                                                                       // 0x0020 (size: 0xC)
    float Ranges;                                                                     // 0x002C (size: 0xC)

}; // Size: 0x38

struct FConeConstraint : public FConstraintBaseParams
{
    float Swing1LimitDegrees;                                                         // 0x0014 (size: 0x4)
    float Swing2LimitDegrees;                                                         // 0x0018 (size: 0x4)
    TEnumAsByte<EAngularConstraintMotion> Swing1Motion;                               // 0x001C (size: 0x1)
    TEnumAsByte<EAngularConstraintMotion> Swing2Motion;                               // 0x001D (size: 0x1)

}; // Size: 0x20

struct FConstrainComponentPropName
{
    FName ComponentName;                                                              // 0x0000 (size: 0x8)

}; // Size: 0x8

struct FConstraintBaseParams
{
    float Stiffness;                                                                  // 0x0000 (size: 0x4)
    float Damping;                                                                    // 0x0004 (size: 0x4)
    float Restitution;                                                                // 0x0008 (size: 0x4)
    float ContactDistance;                                                            // 0x000C (size: 0x4)
    uint8 bSoftConstraint;                                                            // 0x0010 (size: 0x1)

}; // Size: 0x14

struct FConstraintDrive
{
    float Stiffness;                                                                  // 0x0000 (size: 0x4)
    float Damping;                                                                    // 0x0004 (size: 0x4)
    float MaxForce;                                                                   // 0x0008 (size: 0x4)
    uint8 bEnablePositionDrive;                                                       // 0x000C (size: 0x1)
    uint8 bEnableVelocityDrive;                                                       // 0x000C (size: 0x1)

}; // Size: 0x10

struct FConstraintInstance : public FConstraintInstanceBase
{
    FName JointName;                                                                  // 0x0038 (size: 0x8)
    FName ConstraintBone1;                                                            // 0x0040 (size: 0x8)
    FName ConstraintBone2;                                                            // 0x0048 (size: 0x8)
    FVector Pos1;                                                                     // 0x0058 (size: 0x18)
    FVector PriAxis1;                                                                 // 0x0070 (size: 0x18)
    FVector SecAxis1;                                                                 // 0x0088 (size: 0x18)
    FVector Pos2;                                                                     // 0x00A0 (size: 0x18)
    FVector PriAxis2;                                                                 // 0x00B8 (size: 0x18)
    FVector SecAxis2;                                                                 // 0x00D0 (size: 0x18)
    FRotator AngularRotationOffset;                                                   // 0x00E8 (size: 0x18)
    uint8 bScaleLinearLimits;                                                         // 0x0100 (size: 0x1)
    FConstraintProfileProperties ProfileInstance;                                     // 0x0108 (size: 0x158)

}; // Size: 0x270

struct FConstraintInstanceAccessor
{
    TWeakObjectPtr<class UObject> Owner;                                              // 0x0000 (size: 0x8)
    uint32 Index;                                                                     // 0x0008 (size: 0x4)

}; // Size: 0xC

struct FConstraintInstanceBase
{
}; // Size: 0x38

struct FConstraintProfileProperties
{
    float ProjectionLinearTolerance;                                                  // 0x0000 (size: 0x4)
    float ProjectionAngularTolerance;                                                 // 0x0004 (size: 0x4)
    float ProjectionLinearAlpha;                                                      // 0x0008 (size: 0x4)
    float ProjectionAngularAlpha;                                                     // 0x000C (size: 0x4)
    float ShockPropagationAlpha;                                                      // 0x0010 (size: 0x4)
    float LinearBreakThreshold;                                                       // 0x0014 (size: 0x4)
    float LinearPlasticityThreshold;                                                  // 0x0018 (size: 0x4)
    float AngularBreakThreshold;                                                      // 0x001C (size: 0x4)
    float AngularPlasticityThreshold;                                                 // 0x0020 (size: 0x4)
    float ContactTransferScale;                                                       // 0x0024 (size: 0x4)
    FLinearConstraint LinearLimit;                                                    // 0x0028 (size: 0x1C)
    FConeConstraint ConeLimit;                                                        // 0x0044 (size: 0x20)
    FTwistConstraint TwistLimit;                                                      // 0x0064 (size: 0x1C)
    uint8 bDisableCollision;                                                          // 0x0080 (size: 0x1)
    uint8 bParentDominates;                                                           // 0x0080 (size: 0x1)
    uint8 bEnableShockPropagation;                                                    // 0x0080 (size: 0x1)
    uint8 bEnableProjection;                                                          // 0x0080 (size: 0x1)
    uint8 bEnableMassConditioning;                                                    // 0x0080 (size: 0x1)
    uint8 bAngularBreakable;                                                          // 0x0080 (size: 0x1)
    uint8 bAngularPlasticity;                                                         // 0x0080 (size: 0x1)
    uint8 bLinearBreakable;                                                           // 0x0080 (size: 0x1)
    uint8 bLinearPlasticity;                                                          // 0x0081 (size: 0x1)
    FLinearDriveConstraint LinearDrive;                                               // 0x0088 (size: 0x60)
    FAngularDriveConstraint AngularDrive;                                             // 0x00E8 (size: 0x68)
    TEnumAsByte<EConstraintPlasticityType> LinearPlasticityType;                      // 0x0150 (size: 0x1)

}; // Size: 0x158

struct FConvolutionBloomSettings
{
    class UTexture2D* Texture;                                                        // 0x0000 (size: 0x8)
    float ScatterDispersion;                                                          // 0x0008 (size: 0x4)
    float Size;                                                                       // 0x000C (size: 0x4)
    FVector2D CenterUV;                                                               // 0x0010 (size: 0x10)
    float PreFilterMin;                                                               // 0x0020 (size: 0x4)
    float PreFilterMax;                                                               // 0x0024 (size: 0x4)
    float PreFilterMult;                                                              // 0x0028 (size: 0x4)
    float BufferScale;                                                                // 0x002C (size: 0x4)

}; // Size: 0x30

struct FCullDistanceSizePair
{
    float Size;                                                                       // 0x0000 (size: 0x4)
    float CullDistance;                                                               // 0x0004 (size: 0x4)

}; // Size: 0x8

struct FCurveAtlasColorAdjustments
{
    uint8 bChromaKeyTexture;                                                          // 0x0000 (size: 0x1)
    float AdjustBrightness;                                                           // 0x0004 (size: 0x4)
    float AdjustBrightnessCurve;                                                      // 0x0008 (size: 0x4)
    float AdjustVibrance;                                                             // 0x000C (size: 0x4)
    float AdjustSaturation;                                                           // 0x0010 (size: 0x4)
    float AdjustRGBCurve;                                                             // 0x0014 (size: 0x4)
    float AdjustHue;                                                                  // 0x0018 (size: 0x4)
    float AdjustMinAlpha;                                                             // 0x001C (size: 0x4)
    float AdjustMaxAlpha;                                                             // 0x0020 (size: 0x4)

}; // Size: 0x24

struct FCurveEdEntry
{
    class UObject* CurveObject;                                                       // 0x0000 (size: 0x8)
    FColor CurveColor;                                                                // 0x0008 (size: 0x4)
    FString CurveName;                                                                // 0x0010 (size: 0x10)
    int32 bHideCurve;                                                                 // 0x0020 (size: 0x4)
    int32 bColorCurve;                                                                // 0x0024 (size: 0x4)
    int32 bFloatingPointColorCurve;                                                   // 0x0028 (size: 0x4)
    int32 bClamp;                                                                     // 0x002C (size: 0x4)
    float ClampLow;                                                                   // 0x0030 (size: 0x4)
    float ClampHigh;                                                                  // 0x0034 (size: 0x4)

}; // Size: 0x38

struct FCurveEdTab
{
    FString TabName;                                                                  // 0x0000 (size: 0x10)
    TArray<FCurveEdEntry> Curves;                                                     // 0x0010 (size: 0x10)
    float ViewStartInput;                                                             // 0x0020 (size: 0x4)
    float ViewEndInput;                                                               // 0x0024 (size: 0x4)
    float ViewStartOutput;                                                            // 0x0028 (size: 0x4)
    float ViewEndOutput;                                                              // 0x002C (size: 0x4)

}; // Size: 0x30

struct FCurveFlagsChangedPayload : public FCurvePayload
{
    int32 OldFlags;                                                                   // 0x000C (size: 0x4)

}; // Size: 0x10

struct FCurveMetaData
{
    TArray<FBoneReference> LinkedBones;                                               // 0x0000 (size: 0x10)
    uint8 MaxLOD;                                                                     // 0x0010 (size: 0x1)
    FAnimCurveType Type;                                                              // 0x0011 (size: 0x2)

}; // Size: 0x18

struct FCurvePayload : public FEmptyPayload
{
    FAnimationCurveIdentifier Identifier;                                             // 0x0000 (size: 0xC)

}; // Size: 0xC

struct FCurveRenamedPayload : public FCurvePayload
{
    FAnimationCurveIdentifier NewIdentifier;                                          // 0x000C (size: 0xC)

}; // Size: 0x18

struct FCurveScaledPayload : public FCurvePayload
{
    float Factor;                                                                     // 0x000C (size: 0x4)
    float Origin;                                                                     // 0x0010 (size: 0x4)

}; // Size: 0x14

struct FCurveTableRowHandle
{
    class UCurveTable* CurveTable;                                                    // 0x0000 (size: 0x8)
    FName RowName;                                                                    // 0x0008 (size: 0x8)

}; // Size: 0x10

struct FCurveTrack
{
    FName CurveName;                                                                  // 0x0000 (size: 0x8)
    TArray<float> CurveWeights;                                                       // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FCustomAttribute
{
}; // Size: 0x1

struct FCustomAttributePerBoneData
{
}; // Size: 0x1

struct FCustomAttributeSetting
{
    FString Name;                                                                     // 0x0000 (size: 0x10)
    FString Meaning;                                                                  // 0x0010 (size: 0x10)

}; // Size: 0x20

struct FCustomChannelSetup
{
    TEnumAsByte<ECollisionChannel> Channel;                                           // 0x0000 (size: 0x1)
    TEnumAsByte<ECollisionResponse> DefaultResponse;                                  // 0x0001 (size: 0x1)
    bool bTraceType;                                                                  // 0x0002 (size: 0x1)
    bool bStaticObject;                                                               // 0x0003 (size: 0x1)
    FName Name;                                                                       // 0x0004 (size: 0x8)

}; // Size: 0xC

struct FCustomDefine
{
    FString DefineName;                                                               // 0x0000 (size: 0x10)
    FString DefineValue;                                                              // 0x0010 (size: 0x10)

}; // Size: 0x20

struct FCustomInput
{
    FName InputName;                                                                  // 0x0000 (size: 0x8)
    FExpressionInput Input;                                                           // 0x0008 (size: 0x28)

}; // Size: 0x30

struct FCustomOutput
{
    FName OutputName;                                                                 // 0x0000 (size: 0x8)
    TEnumAsByte<ECustomMaterialOutputType> OutputType;                                // 0x0008 (size: 0x1)

}; // Size: 0xC

struct FCustomPrimitiveData
{
    TArray<float> Data;                                                               // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FCustomProfile
{
    FName Name;                                                                       // 0x0000 (size: 0x8)
    TArray<FResponseChannel> CustomResponses;                                         // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FDPMatchingIfCondition
{
    FName Operator;                                                                   // 0x0000 (size: 0x8)
    FString Arg1;                                                                     // 0x0008 (size: 0x10)
    FString Arg2;                                                                     // 0x0018 (size: 0x10)

}; // Size: 0x28

struct FDPMatchingRulestruct : public FDPMatchingRulestructBase
{
    TArray<FDPMatchingRulestructE> OnTrue;                                            // 0x0048 (size: 0x10)
    TArray<FDPMatchingRulestructE> OnFalse;                                           // 0x0058 (size: 0x10)

}; // Size: 0x68

struct FDPMatchingRulestructA : public FDPMatchingRulestructBase
{
    TArray<FDPMatchingRulestructBase> OnTrue;                                         // 0x0048 (size: 0x10)
    TArray<FDPMatchingRulestructBase> OnFalse;                                        // 0x0058 (size: 0x10)

}; // Size: 0x68

struct FDPMatchingRulestructB : public FDPMatchingRulestructBase
{
    TArray<FDPMatchingRulestructA> OnTrue;                                            // 0x0048 (size: 0x10)
    TArray<FDPMatchingRulestructA> OnFalse;                                           // 0x0058 (size: 0x10)

}; // Size: 0x68

struct FDPMatchingRulestructBase
{
    FString RuleName;                                                                 // 0x0008 (size: 0x10)
    TArray<FDPMatchingIfCondition> IfConditions;                                      // 0x0018 (size: 0x10)
    FString AppendFragments;                                                          // 0x0028 (size: 0x10)
    FString SetUserVar;                                                               // 0x0038 (size: 0x10)

}; // Size: 0x48

struct FDPMatchingRulestructC : public FDPMatchingRulestructBase
{
    TArray<FDPMatchingRulestructB> OnTrue;                                            // 0x0048 (size: 0x10)
    TArray<FDPMatchingRulestructB> OnFalse;                                           // 0x0058 (size: 0x10)

}; // Size: 0x68

struct FDPMatchingRulestructD : public FDPMatchingRulestructBase
{
    TArray<FDPMatchingRulestructC> OnTrue;                                            // 0x0048 (size: 0x10)
    TArray<FDPMatchingRulestructC> OnFalse;                                           // 0x0058 (size: 0x10)

}; // Size: 0x68

struct FDPMatchingRulestructE : public FDPMatchingRulestructBase
{
    TArray<FDPMatchingRulestructD> OnTrue;                                            // 0x0048 (size: 0x10)
    TArray<FDPMatchingRulestructD> OnFalse;                                           // 0x0058 (size: 0x10)

}; // Size: 0x68

struct FDamageEvent
{
    TSubclassOf<class UDamageType> DamageTypeClass;                                   // 0x0008 (size: 0x8)

}; // Size: 0x10

struct FDataCacheDuplicatedObjectData
{
}; // Size: 0x10

struct FDataDrivenConsoleVariable
{
    FDataDrivenCVarType Type;                                                         // 0x0000 (size: 0x1)
    FString Name;                                                                     // 0x0008 (size: 0x10)
    FString ToolTip;                                                                  // 0x0018 (size: 0x10)
    float DefaultValueFloat;                                                          // 0x0028 (size: 0x4)
    int32 DefaultValueInt;                                                            // 0x002C (size: 0x4)
    bool DefaultValueBool;                                                            // 0x0030 (size: 0x1)

}; // Size: 0x60

struct FDataDrivenShaderPlatformInfoInput
{
    FName InputName;                                                                  // 0x0000 (size: 0x8)
    TEnumAsByte<EDataDrivenShaderPlatformInfoCondition> PropertyCondition;            // 0x0008 (size: 0x1)

}; // Size: 0xC

struct FDataLayerInstanceNames
{
    bool bIsFirstDataLayerExternal;                                                   // 0x0000 (size: 0x1)
    TArray<FName> DataLayers;                                                         // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FDataTableCategoryHandle
{
    class UDataTable* DataTable;                                                      // 0x0000 (size: 0x8)
    FName ColumnName;                                                                 // 0x0008 (size: 0x8)
    FName RowContents;                                                                // 0x0010 (size: 0x8)

}; // Size: 0x18

struct FDataTableRowHandle
{
    class UDataTable* DataTable;                                                      // 0x0000 (size: 0x8)
    FName RowName;                                                                    // 0x0008 (size: 0x8)

}; // Size: 0x10

struct FDebugCameraControllerSettingsViewModeIndex
{
    TEnumAsByte<EViewModeIndex> ViewModeIndex;                                        // 0x0008 (size: 0x1)

}; // Size: 0x10

struct FDebugDisplayProperty
{
    class UObject* Obj;                                                               // 0x0000 (size: 0x8)
    UClass* WithinClass;                                                              // 0x0008 (size: 0x8)

}; // Size: 0x20

struct FDebugFloatHistory
{
    TArray<float> Samples;                                                            // 0x0000 (size: 0x10)
    int32 MaxSamples;                                                                 // 0x0010 (size: 0x4)
    float MinValue;                                                                   // 0x0014 (size: 0x4)
    float MaxValue;                                                                   // 0x0018 (size: 0x4)
    bool bAutoAdjustMinMax;                                                           // 0x001C (size: 0x1)

}; // Size: 0x20

struct FDebugTextInfo
{
    class AActor* SrcActor;                                                           // 0x0000 (size: 0x8)
    FVector SrcActorOffset;                                                           // 0x0008 (size: 0x18)
    FVector SrcActorDesiredOffset;                                                    // 0x0020 (size: 0x18)
    FString DebugText;                                                                // 0x0038 (size: 0x10)
    float TimeRemaining;                                                              // 0x0048 (size: 0x4)
    float Duration;                                                                   // 0x004C (size: 0x4)
    FColor TextColor;                                                                 // 0x0050 (size: 0x4)
    uint8 bAbsoluteLocation;                                                          // 0x0054 (size: 0x1)
    uint8 bKeepAttachedToActor;                                                       // 0x0054 (size: 0x1)
    uint8 bDrawShadow;                                                                // 0x0054 (size: 0x1)
    FVector OrigActorLocation;                                                        // 0x0058 (size: 0x18)
    class UFont* Font;                                                                // 0x0070 (size: 0x8)
    float FontScale;                                                                  // 0x0078 (size: 0x4)

}; // Size: 0x80

struct FDebuggingInfoForSingleFunction
{
}; // Size: 0x190

struct FDefaultAudioBusSettings
{
    FSoftObjectPath AudioBus;                                                         // 0x0000 (size: 0x20)

}; // Size: 0x20

struct FDefault__AnimBlueprintGeneratedStruct
{
}; // Size: 0x0

struct FDefault__UserDefinedStruct
{
}; // Size: 0x0

struct FDelegateArray
{
    TArray<FDelegateArrayDelegates> Delegates;                                        // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FDepthFieldGlowInfo
{
    uint8 bEnableGlow;                                                                // 0x0000 (size: 0x1)
    FLinearColor GlowColor;                                                           // 0x0004 (size: 0x10)
    FVector2D GlowOuterRadius;                                                        // 0x0018 (size: 0x10)
    FVector2D GlowInnerRadius;                                                        // 0x0028 (size: 0x10)

}; // Size: 0x38

struct FDeviceColorCurveData
{
    bool bEnable;                                                                     // 0x0000 (size: 0x1)
    bool bResetAfterCompletion;                                                       // 0x0001 (size: 0x1)
    class UCurveLinearColor* DeviceColorCurve;                                        // 0x0008 (size: 0x8)

}; // Size: 0x10

struct FDeviceColorData
{
    bool bEnable;                                                                     // 0x0000 (size: 0x1)
    bool bResetAfterCompletion;                                                       // 0x0001 (size: 0x1)
    FColor LightColor;                                                                // 0x0004 (size: 0x4)

}; // Size: 0x8

struct FDeviceTriggerBaseData
{
    EInputDeviceTriggerMask AffectedTriggers;                                         // 0x0000 (size: 0x1)
    bool bResetUponCompletion;                                                        // 0x0001 (size: 0x1)

}; // Size: 0x2

struct FDeviceTriggerFeedbackData
{
    class UCurveFloat* FeedbackPositionCurve;                                         // 0x0000 (size: 0x8)
    class UCurveFloat* FeedbackStrenghCurve;                                          // 0x0008 (size: 0x8)

}; // Size: 0x10

struct FDeviceTriggerTriggerResistanceData
{
    int32 StartPosition;                                                              // 0x0000 (size: 0x4)
    int32 StartStrengh;                                                               // 0x0004 (size: 0x4)
    int32 EndPosition;                                                                // 0x0008 (size: 0x4)
    int32 EndStrengh;                                                                 // 0x000C (size: 0x4)

}; // Size: 0x10

struct FDeviceTriggerTriggerVibrationData
{
    class UCurveFloat* TriggerPositionCurve;                                          // 0x0000 (size: 0x8)
    class UCurveFloat* VibrationFrequencyCurve;                                       // 0x0008 (size: 0x8)
    class UCurveFloat* VibrationAmplitudeCurve;                                       // 0x0010 (size: 0x8)

}; // Size: 0x18

struct FDialogueContext
{
    class UDialogueVoice* Speaker;                                                    // 0x0000 (size: 0x8)
    TArray<class UDialogueVoice*> Targets;                                            // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FDialogueContextMapping
{
    FDialogueContext Context;                                                         // 0x0000 (size: 0x18)
    class USoundWave* SoundWave;                                                      // 0x0018 (size: 0x8)
    FString LocalizationKeyFormat;                                                    // 0x0020 (size: 0x10)
    class UDialogueSoundWaveProxy* Proxy;                                             // 0x0030 (size: 0x8)

}; // Size: 0x38

struct FDialogueWaveParameter
{
    class UDialogueWave* DialogueWave;                                                // 0x0000 (size: 0x8)
    FDialogueContext Context;                                                         // 0x0008 (size: 0x18)

}; // Size: 0x20

struct FDisplacementScaling
{
    float Magnitude;                                                                  // 0x0000 (size: 0x4)
    float Center;                                                                     // 0x0004 (size: 0x4)

}; // Size: 0x8

struct FDistanceDatum
{
    float FadeInDistanceStart;                                                        // 0x0000 (size: 0x4)
    float FadeInDistanceEnd;                                                          // 0x0004 (size: 0x4)
    float FadeOutDistanceStart;                                                       // 0x0008 (size: 0x4)
    float FadeOutDistanceEnd;                                                         // 0x000C (size: 0x4)
    float Volume;                                                                     // 0x0010 (size: 0x4)

}; // Size: 0x14

struct FDistributionLookupTable
{
    float TimeScale;                                                                  // 0x0000 (size: 0x4)
    float TimeBias;                                                                   // 0x0004 (size: 0x4)
    TArray<float> Values;                                                             // 0x0008 (size: 0x10)
    uint8 Op;                                                                         // 0x0018 (size: 0x1)
    uint8 EntryCount;                                                                 // 0x0019 (size: 0x1)
    uint8 EntryStride;                                                                // 0x001A (size: 0x1)
    uint8 SubEntryStride;                                                             // 0x001B (size: 0x1)
    uint8 LockFlag;                                                                   // 0x001C (size: 0x1)

}; // Size: 0x20

struct FDoubleVectorParameterValue
{
    FMaterialParameterInfo ParameterInfo;                                             // 0x0000 (size: 0x10)
    FVector4d ParameterValue;                                                         // 0x0010 (size: 0x20)
    FGuid ExpressionGUID;                                                             // 0x0030 (size: 0x10)

}; // Size: 0x40

struct FDrawToRenderTargetContext
{
    class UTextureRenderTarget2D* RenderTarget;                                       // 0x0000 (size: 0x8)

}; // Size: 0x8

struct FDropNoteInfo
{
    FVector Location;                                                                 // 0x0000 (size: 0x18)
    FRotator Rotation;                                                                // 0x0018 (size: 0x18)
    FString Comment;                                                                  // 0x0030 (size: 0x10)

}; // Size: 0x40

struct FDummySpacerCameraTypes
{
}; // Size: 0x1

struct FDynamicChildSubmix
{
    TArray<class USoundSubmixBase*> ChildSubmixes;                                    // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FDynamicTextureInstance : public FStreamableTextureInstance
{
    class UTexture2D* Texture;                                                        // 0x0048 (size: 0x8)
    bool bAttached;                                                                   // 0x0050 (size: 0x1)
    float OriginalRadius;                                                             // 0x0054 (size: 0x4)

}; // Size: 0x58

struct FEdGraphPinReference
{
    TWeakObjectPtr<class UEdGraphNode> OwningNode;                                    // 0x0000 (size: 0x8)
    FGuid PinId;                                                                      // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FEdGraphPinType
{
    FName PinCategory;                                                                // 0x0000 (size: 0x8)
    FName PinSubCategory;                                                             // 0x0008 (size: 0x8)
    TWeakObjectPtr<class UObject> PinSubCategoryObject;                               // 0x0010 (size: 0x8)
    FSimpleMemberReference PinSubCategoryMemberReference;                             // 0x0018 (size: 0x20)
    FEdGraphTerminalType PinValueType;                                                // 0x0038 (size: 0x1C)
    EPinContainerType ContainerType;                                                  // 0x0054 (size: 0x1)
    uint8 bIsArray;                                                                   // 0x0055 (size: 0x1)
    uint8 bIsReference;                                                               // 0x0055 (size: 0x1)
    uint8 bIsConst;                                                                   // 0x0055 (size: 0x1)
    uint8 bIsWeakPointer;                                                             // 0x0055 (size: 0x1)
    uint8 bIsUObjectWrapper;                                                          // 0x0055 (size: 0x1)
    uint8 bSerializeAsSinglePrecisionFloat;                                           // 0x0055 (size: 0x1)

}; // Size: 0x58

struct FEdGraphSchemaAction
{
    FText MenuDescription;                                                            // 0x0008 (size: 0x10)
    FText TooltipDescription;                                                         // 0x0018 (size: 0x10)
    FText Category;                                                                   // 0x0028 (size: 0x10)
    FText Keywords;                                                                   // 0x0038 (size: 0x10)
    int32 Grouping;                                                                   // 0x0048 (size: 0x4)
    int32 SectionID;                                                                  // 0x004C (size: 0x4)
    TArray<FString> MenuDescriptionArray;                                             // 0x0050 (size: 0x10)
    TArray<FString> FullSearchTitlesArray;                                            // 0x0060 (size: 0x10)
    TArray<FString> FullSearchKeywordsArray;                                          // 0x0070 (size: 0x10)
    TArray<FString> FullSearchCategoryArray;                                          // 0x0080 (size: 0x10)
    TArray<FString> LocalizedMenuDescriptionArray;                                    // 0x0090 (size: 0x10)
    TArray<FString> LocalizedFullSearchTitlesArray;                                   // 0x00A0 (size: 0x10)
    TArray<FString> LocalizedFullSearchKeywordsArray;                                 // 0x00B0 (size: 0x10)
    TArray<FString> LocalizedFullSearchCategoryArray;                                 // 0x00C0 (size: 0x10)
    FString SearchText;                                                               // 0x00D0 (size: 0x10)

}; // Size: 0xE0

struct FEdGraphSchemaAction_NewNode : public FEdGraphSchemaAction
{
    class UEdGraphNode* NodeTemplate;                                                 // 0x00E0 (size: 0x8)

}; // Size: 0xE8

struct FEdGraphTerminalType
{
    FName TerminalCategory;                                                           // 0x0000 (size: 0x8)
    FName TerminalSubCategory;                                                        // 0x0008 (size: 0x8)
    TWeakObjectPtr<class UObject> TerminalSubCategoryObject;                          // 0x0010 (size: 0x8)
    bool bTerminalIsConst;                                                            // 0x0018 (size: 0x1)
    bool bTerminalIsWeakPointer;                                                      // 0x0019 (size: 0x1)
    bool bTerminalIsUObjectWrapper;                                                   // 0x001A (size: 0x1)

}; // Size: 0x1C

struct FEditedDocumentInfo
{
    FSoftObjectPath EditedObjectPath;                                                 // 0x0000 (size: 0x20)
    FVector2D SavedViewOffset;                                                        // 0x0020 (size: 0x10)
    float SavedZoomAmount;                                                            // 0x0030 (size: 0x4)
    class UObject* EditedObject;                                                      // 0x0038 (size: 0x8)

}; // Size: 0x40

struct FEditorElement
{
    int32 Indices;                                                                    // 0x0000 (size: 0xC)
    float Weights;                                                                    // 0x000C (size: 0xC)

}; // Size: 0x18

struct FEditorImportExportTestDefinition
{
    FFilePath ImportFilePath;                                                         // 0x0000 (size: 0x10)
    FString ExportFileExtension;                                                      // 0x0010 (size: 0x10)
    bool bSkipExport;                                                                 // 0x0020 (size: 0x1)
    TArray<FImportFactorySettingValues> FactorySettings;                              // 0x0028 (size: 0x10)

}; // Size: 0x38

struct FEditorImportWorkflowDefinition
{
    FFilePath ImportFilePath;                                                         // 0x0000 (size: 0x10)
    TArray<FImportFactorySettingValues> FactorySettings;                              // 0x0010 (size: 0x10)

}; // Size: 0x20

struct FEditorMapPerformanceTestDefinition
{
    FSoftObjectPath PerformanceTestmap;                                               // 0x0000 (size: 0x20)
    int32 TestTimer;                                                                  // 0x0020 (size: 0x4)

}; // Size: 0x28

struct FEmitterDynamicParameter
{
    FName ParamName;                                                                  // 0x0000 (size: 0x8)
    uint8 bUseEmitterTime;                                                            // 0x0008 (size: 0x1)
    uint8 bSpawnTimeOnly;                                                             // 0x0008 (size: 0x1)
    TEnumAsByte<EEmitterDynamicParameterValue> ValueMethod;                           // 0x000C (size: 0x1)
    uint8 bScaleVelocityByParamValue;                                                 // 0x0010 (size: 0x1)
    FRawDistributionFloat ParamValue;                                                 // 0x0018 (size: 0x30)

}; // Size: 0x48

struct FEmptyPayload
{
}; // Size: 0x1

struct FEncounteredStateMachineStack
{
}; // Size: 0x30

struct FEndPhysicsTickFunction : public FTickFunction
{
}; // Size: 0x30

struct FEngineShowFlagsSetting
{
    FString ShowFlagName;                                                             // 0x0000 (size: 0x10)
    bool Enabled;                                                                     // 0x0010 (size: 0x1)

}; // Size: 0x18

struct FEquirectProps
{
    FBox2D LeftUVRect;                                                                // 0x0000 (size: 0x28)
    FBox2D RightUVRect;                                                               // 0x0028 (size: 0x28)
    FVector2D LeftScale;                                                              // 0x0050 (size: 0x10)
    FVector2D RightScale;                                                             // 0x0060 (size: 0x10)
    FVector2D LeftBias;                                                               // 0x0070 (size: 0x10)
    FVector2D RightBias;                                                              // 0x0080 (size: 0x10)
    float Radius;                                                                     // 0x0090 (size: 0x4)

}; // Size: 0x98

struct FEventGraphFastCallPair
{
    class UFunction* FunctionToPatch;                                                 // 0x0000 (size: 0x8)
    int32 EventGraphCallOffset;                                                       // 0x0008 (size: 0x4)

}; // Size: 0x10

struct FExponentialHeightFogData
{
    float FogDensity;                                                                 // 0x0000 (size: 0x4)
    float FogHeightFalloff;                                                           // 0x0004 (size: 0x4)
    float FogHeightOffset;                                                            // 0x0008 (size: 0x4)

}; // Size: 0xC

struct FExposedValueCopyRecord
{
    int32 CopyIndex;                                                                  // 0x0000 (size: 0x4)
    EPostCopyOperation PostCopyOperation;                                             // 0x0004 (size: 0x1)
    bool bOnlyUpdateWhenActive;                                                       // 0x0005 (size: 0x1)

}; // Size: 0x8

struct FExposedValueHandler
{
}; // Size: 0x10

struct FExposureSettings
{
    float FixedEV100;                                                                 // 0x0000 (size: 0x4)
    bool bFixed;                                                                      // 0x0004 (size: 0x1)

}; // Size: 0x8

struct FExpressionExecOutput
{
    class UMaterialExpression* Expression;                                            // 0x0000 (size: 0x8)

}; // Size: 0x8

struct FExpressionInput
{
    class UMaterialExpression* Expression;                                            // 0x0000 (size: 0x8)
    int32 OutputIndex;                                                                // 0x0008 (size: 0x4)
    FName InputName;                                                                  // 0x000C (size: 0x8)
    int32 Mask;                                                                       // 0x0014 (size: 0x4)
    int32 MaskR;                                                                      // 0x0018 (size: 0x4)
    int32 MaskG;                                                                      // 0x001C (size: 0x4)
    int32 MaskB;                                                                      // 0x0020 (size: 0x4)
    int32 MaskA;                                                                      // 0x0024 (size: 0x4)

}; // Size: 0x28

struct FExpressionOutput
{
    FName OutputName;                                                                 // 0x0000 (size: 0x8)
    int32 Mask;                                                                       // 0x0008 (size: 0x4)
    int32 MaskR;                                                                      // 0x000C (size: 0x4)
    int32 MaskG;                                                                      // 0x0010 (size: 0x4)
    int32 MaskB;                                                                      // 0x0014 (size: 0x4)
    int32 MaskA;                                                                      // 0x0018 (size: 0x4)

}; // Size: 0x1C

struct FExternalDataLayerUID
{
    uint32 Value;                                                                     // 0x0000 (size: 0x4)

}; // Size: 0x4

struct FExternalSpatialAccelerationPayload
{
}; // Size: 0x10

struct FExternalToolDefinition
{
    FString ToolName;                                                                 // 0x0000 (size: 0x10)
    FFilePath ExecutablePath;                                                         // 0x0010 (size: 0x10)
    FString CommandLineOptions;                                                       // 0x0020 (size: 0x10)
    FDirectoryPath WorkingDirectory;                                                  // 0x0030 (size: 0x10)
    FString ScriptExtension;                                                          // 0x0040 (size: 0x10)
    FDirectoryPath ScriptDirectory;                                                   // 0x0050 (size: 0x10)

}; // Size: 0x60

struct FFXSystemSpawnParameters
{
    class UObject* WorldContextObject;                                                // 0x0000 (size: 0x8)
    class UFXSystemAsset* SystemTemplate;                                             // 0x0008 (size: 0x8)
    FVector Location;                                                                 // 0x0010 (size: 0x18)
    FRotator Rotation;                                                                // 0x0028 (size: 0x18)
    FVector Scale;                                                                    // 0x0040 (size: 0x18)
    class USceneComponent* AttachToComponent;                                         // 0x0058 (size: 0x8)
    FName AttachPointName;                                                            // 0x0060 (size: 0x8)
    TEnumAsByte<EAttachLocation::Type> LocationType;                                  // 0x0068 (size: 0x1)
    bool bAutoDestroy;                                                                // 0x0069 (size: 0x1)
    bool bAutoActivate;                                                               // 0x006A (size: 0x1)
    EPSCPoolMethod PoolingMethod;                                                     // 0x006B (size: 0x1)
    bool bPreCullCheck;                                                               // 0x006C (size: 0x1)
    bool bIsPlayerEffect;                                                             // 0x006D (size: 0x1)

}; // Size: 0x70

struct FFilmStockSettings
{
    float Slope;                                                                      // 0x0000 (size: 0x4)
    float Toe;                                                                        // 0x0004 (size: 0x4)
    float Shoulder;                                                                   // 0x0008 (size: 0x4)
    float BlackClip;                                                                  // 0x000C (size: 0x4)
    float WhiteClip;                                                                  // 0x0010 (size: 0x4)

}; // Size: 0x14

struct FFindFloorResult
{
    uint8 bBlockingHit;                                                               // 0x0000 (size: 0x1)
    uint8 bWalkableFloor;                                                             // 0x0000 (size: 0x1)
    uint8 bLineTrace;                                                                 // 0x0000 (size: 0x1)
    float FloorDist;                                                                  // 0x0004 (size: 0x4)
    float LineDist;                                                                   // 0x0008 (size: 0x4)
    FHitResult HitResult;                                                             // 0x0010 (size: 0xF8)

}; // Size: 0x108

struct FFloatAnimationAttribute
{
    float Value;                                                                      // 0x0000 (size: 0x4)

}; // Size: 0x4

struct FFloatCurve : public FAnimCurveBase
{
    FRichCurve FloatCurve;                                                            // 0x0010 (size: 0x80)

}; // Size: 0x90

struct FFloatDistribution
{
    FDistributionLookupTable Table;                                                   // 0x0000 (size: 0x20)

}; // Size: 0x20

struct FFloatRK4SpringInterpolator
{
    float StiffnessConstant;                                                          // 0x0000 (size: 0x4)
    float DampeningRatio;                                                             // 0x0004 (size: 0x4)

}; // Size: 0x8

struct FFloatSpringState
{
}; // Size: 0xC

struct FFontCharacter
{
    int32 StartU;                                                                     // 0x0000 (size: 0x4)
    int32 StartV;                                                                     // 0x0004 (size: 0x4)
    int32 USize;                                                                      // 0x0008 (size: 0x4)
    int32 VSize;                                                                      // 0x000C (size: 0x4)
    uint8 TextureIndex;                                                               // 0x0010 (size: 0x1)
    int32 VerticalOffset;                                                             // 0x0014 (size: 0x4)

}; // Size: 0x18

struct FFontImportOptionsData
{
    FString FontName;                                                                 // 0x0000 (size: 0x10)
    float Height;                                                                     // 0x0010 (size: 0x4)
    uint8 bEnableAntialiasing;                                                        // 0x0014 (size: 0x1)
    uint8 bEnableBold;                                                                // 0x0014 (size: 0x1)
    uint8 bEnableItalic;                                                              // 0x0014 (size: 0x1)
    uint8 bEnableUnderline;                                                           // 0x0014 (size: 0x1)
    uint8 bAlphaOnly;                                                                 // 0x0014 (size: 0x1)
    TEnumAsByte<EFontImportCharacterSet> CharacterSet;                                // 0x0018 (size: 0x1)
    FString Chars;                                                                    // 0x0020 (size: 0x10)
    FString UnicodeRange;                                                             // 0x0030 (size: 0x10)
    FString CharsFilePath;                                                            // 0x0040 (size: 0x10)
    FString CharsFileWildcard;                                                        // 0x0050 (size: 0x10)
    uint8 bCreatePrintableOnly;                                                       // 0x0060 (size: 0x1)
    uint8 bIncludeASCIIRange;                                                         // 0x0060 (size: 0x1)
    FLinearColor ForegroundColor;                                                     // 0x0064 (size: 0x10)
    uint8 bEnableDropShadow;                                                          // 0x0074 (size: 0x1)
    int32 TexturePageWidth;                                                           // 0x0078 (size: 0x4)
    int32 TexturePageMaxHeight;                                                       // 0x007C (size: 0x4)
    int32 XPadding;                                                                   // 0x0080 (size: 0x4)
    int32 YPadding;                                                                   // 0x0084 (size: 0x4)
    int32 ExtendBoxTop;                                                               // 0x0088 (size: 0x4)
    int32 ExtendBoxBottom;                                                            // 0x008C (size: 0x4)
    int32 ExtendBoxRight;                                                             // 0x0090 (size: 0x4)
    int32 ExtendBoxLeft;                                                              // 0x0094 (size: 0x4)
    uint8 bEnableLegacyMode;                                                          // 0x0098 (size: 0x1)
    int32 Kerning;                                                                    // 0x009C (size: 0x4)
    uint8 bUseDistanceFieldAlpha;                                                     // 0x00A0 (size: 0x1)
    int32 DistanceFieldScaleFactor;                                                   // 0x00A4 (size: 0x4)
    float DistanceFieldScanRadiusScale;                                               // 0x00A8 (size: 0x4)

}; // Size: 0xB0

struct FFontParameterValue
{
    FMaterialParameterInfo ParameterInfo;                                             // 0x0000 (size: 0x10)
    class UFont* FontValue;                                                           // 0x0010 (size: 0x8)
    int32 FontPage;                                                                   // 0x0018 (size: 0x4)
    FGuid ExpressionGUID;                                                             // 0x001C (size: 0x10)

}; // Size: 0x30

struct FFontRenderInfo
{
    uint8 bClipText;                                                                  // 0x0000 (size: 0x1)
    uint8 bEnableShadow;                                                              // 0x0000 (size: 0x1)
    FDepthFieldGlowInfo GlowInfo;                                                     // 0x0008 (size: 0x38)

}; // Size: 0x40

struct FForceFeedbackAttenuationSettings : public FBaseAttenuationSettings
{
}; // Size: 0xC0

struct FForceFeedbackChannelDetails
{
    uint8 bAffectsLeftLarge;                                                          // 0x0000 (size: 0x1)
    uint8 bAffectsLeftSmall;                                                          // 0x0000 (size: 0x1)
    uint8 bAffectsRightLarge;                                                         // 0x0000 (size: 0x1)
    uint8 bAffectsRightSmall;                                                         // 0x0000 (size: 0x1)
    FRuntimeFloatCurve Curve;                                                         // 0x0008 (size: 0x88)

}; // Size: 0x90

struct FForceFeedbackEffectOverridenChannelDetails
{
    TArray<FForceFeedbackChannelDetails> ChannelDetails;                              // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FForceFeedbackParameters
{
    FName Tag;                                                                        // 0x0000 (size: 0x8)
    bool bLooping;                                                                    // 0x0008 (size: 0x1)
    bool bIgnoreTimeDilation;                                                         // 0x0009 (size: 0x1)
    bool bPlayWhilePaused;                                                            // 0x000A (size: 0x1)

}; // Size: 0xC

struct FFormatArgumentData
{
    FString ArgumentName;                                                             // 0x0000 (size: 0x10)
    TEnumAsByte<EFormatArgumentType::Type> ArgumentValueType;                         // 0x0010 (size: 0x1)
    FText ArgumentValue;                                                              // 0x0018 (size: 0x10)
    int64 ArgumentValueInt;                                                           // 0x0028 (size: 0x8)
    float ArgumentValueFloat;                                                         // 0x0030 (size: 0x4)
    double ArgumentValueDouble;                                                       // 0x0038 (size: 0x8)
    ETextGender ArgumentValueGender;                                                  // 0x0040 (size: 0x1)

}; // Size: 0x48

struct FFractureEffect
{
    class UParticleSystem* ParticleSystem;                                            // 0x0000 (size: 0x8)
    class USoundBase* Sound;                                                          // 0x0008 (size: 0x8)

}; // Size: 0x10

struct FFrameRateChangedPayload : public FEmptyPayload
{
    FFrameRate PreviousFrameRate;                                                     // 0x0000 (size: 0x8)

}; // Size: 0x8

struct FFreezablePerPlatformInt
{
}; // Size: 0x4

struct FFullyLoadedPackagesInfo
{
    TEnumAsByte<EFullyLoadPackageType> FullyLoadType;                                 // 0x0000 (size: 0x1)
    FString Tag;                                                                      // 0x0008 (size: 0x10)
    TArray<FName> PackagesToLoad;                                                     // 0x0018 (size: 0x10)
    TArray<class UObject*> LoadedObjects;                                             // 0x0028 (size: 0x10)

}; // Size: 0x38

struct FFunctionExpressionInput
{
    class UMaterialExpressionFunctionInput* ExpressionInput;                          // 0x0000 (size: 0x8)
    FGuid ExpressionInputId;                                                          // 0x0008 (size: 0x10)
    FExpressionInput Input;                                                           // 0x0018 (size: 0x28)

}; // Size: 0x40

struct FFunctionExpressionOutput
{
    class UMaterialExpressionFunctionOutput* ExpressionOutput;                        // 0x0000 (size: 0x8)
    FGuid ExpressionOutputId;                                                         // 0x0008 (size: 0x10)
    FExpressionOutput Output;                                                         // 0x0018 (size: 0x1C)

}; // Size: 0x38

struct FGPUSpriteEmitterInfo
{
    class UParticleModuleRequired* RequiredModule;                                    // 0x0000 (size: 0x8)
    class UParticleModuleSpawn* SpawnModule;                                          // 0x0008 (size: 0x8)
    class UParticleModuleSpawnPerUnit* SpawnPerUnitModule;                            // 0x0010 (size: 0x8)
    TArray<class UParticleModule*> SpawnModules;                                      // 0x0018 (size: 0x10)
    FGPUSpriteLocalVectorFieldInfo LocalVectorField;                                  // 0x0030 (size: 0xD0)
    FFloatDistribution VectorFieldScale;                                              // 0x0100 (size: 0x20)
    FFloatDistribution DragCoefficient;                                               // 0x0120 (size: 0x20)
    FFloatDistribution PointAttractorStrength;                                        // 0x0140 (size: 0x20)
    FFloatDistribution Resilience;                                                    // 0x0160 (size: 0x20)
    FVector ConstantAcceleration;                                                     // 0x0180 (size: 0x18)
    FVector PointAttractorPosition;                                                   // 0x0198 (size: 0x18)
    float PointAttractorRadiusSq;                                                     // 0x01B0 (size: 0x4)
    FVector OrbitOffsetBase;                                                          // 0x01B8 (size: 0x18)
    FVector OrbitOffsetRange;                                                         // 0x01D0 (size: 0x18)
    FVector2D InvMaxSize;                                                             // 0x01E8 (size: 0x10)
    float InvRotationRateScale;                                                       // 0x01F8 (size: 0x4)
    float MaxLifetime;                                                                // 0x01FC (size: 0x4)
    int32 MaxParticleCount;                                                           // 0x0200 (size: 0x4)
    TEnumAsByte<EParticleScreenAlignment> ScreenAlignment;                            // 0x0204 (size: 0x1)
    TEnumAsByte<EParticleAxisLock> LockAxisFlag;                                      // 0x0205 (size: 0x1)
    uint8 bEnableCollision;                                                           // 0x0208 (size: 0x1)
    TEnumAsByte<EParticleCollisionMode::Type> CollisionMode;                          // 0x020C (size: 0x1)
    uint8 bUseVelocityForMotionBlur;                                                  // 0x0210 (size: 0x1)
    uint8 bRemoveHMDRoll;                                                             // 0x0210 (size: 0x1)
    float MinFacingCameraBlendDistance;                                               // 0x0214 (size: 0x4)
    float MaxFacingCameraBlendDistance;                                               // 0x0218 (size: 0x4)
    FRawDistributionVector DynamicColor;                                              // 0x0220 (size: 0x60)
    FRawDistributionFloat DynamicAlpha;                                               // 0x0280 (size: 0x30)
    FRawDistributionVector DynamicColorScale;                                         // 0x02B0 (size: 0x60)
    FRawDistributionFloat DynamicAlphaScale;                                          // 0x0310 (size: 0x30)

}; // Size: 0x350

struct FGPUSpriteLocalVectorFieldInfo
{
    class UVectorField* Field;                                                        // 0x0000 (size: 0x8)
    FTransform Transform;                                                             // 0x0010 (size: 0x60)
    FRotator MinInitialRotation;                                                      // 0x0070 (size: 0x18)
    FRotator MaxInitialRotation;                                                      // 0x0088 (size: 0x18)
    FRotator RotationRate;                                                            // 0x00A0 (size: 0x18)
    float Intensity;                                                                  // 0x00B8 (size: 0x4)
    float Tightness;                                                                  // 0x00BC (size: 0x4)
    uint8 bIgnoreComponentTransform;                                                  // 0x00C0 (size: 0x1)
    uint8 bTileX;                                                                     // 0x00C0 (size: 0x1)
    uint8 bTileY;                                                                     // 0x00C0 (size: 0x1)
    uint8 bTileZ;                                                                     // 0x00C0 (size: 0x1)
    uint8 bUseFixDT;                                                                  // 0x00C0 (size: 0x1)

}; // Size: 0xD0

struct FGPUSpriteResourceData
{
    TArray<FColor> QuantizedColorSamples;                                             // 0x0000 (size: 0x10)
    TArray<FColor> QuantizedMiscSamples;                                              // 0x0010 (size: 0x10)
    TArray<FColor> QuantizedSimulationAttrSamples;                                    // 0x0020 (size: 0x10)
    FVector4 ColorScale;                                                              // 0x0030 (size: 0x20)
    FVector4 ColorBias;                                                               // 0x0050 (size: 0x20)
    FVector4 MiscScale;                                                               // 0x0070 (size: 0x20)
    FVector4 MiscBias;                                                                // 0x0090 (size: 0x20)
    FVector4 SimulationAttrCurveScale;                                                // 0x00B0 (size: 0x20)
    FVector4 SimulationAttrCurveBias;                                                 // 0x00D0 (size: 0x20)
    FVector4 SubImageSize;                                                            // 0x00F0 (size: 0x20)
    FVector4 SizeBySpeed;                                                             // 0x0110 (size: 0x20)
    FVector ConstantAcceleration;                                                     // 0x0130 (size: 0x18)
    FVector OrbitOffsetBase;                                                          // 0x0148 (size: 0x18)
    FVector OrbitOffsetRange;                                                         // 0x0160 (size: 0x18)
    FVector OrbitFrequencyBase;                                                       // 0x0178 (size: 0x18)
    FVector OrbitFrequencyRange;                                                      // 0x0190 (size: 0x18)
    FVector OrbitPhaseBase;                                                           // 0x01A8 (size: 0x18)
    FVector OrbitPhaseRange;                                                          // 0x01C0 (size: 0x18)
    float GlobalVectorFieldScale;                                                     // 0x01D8 (size: 0x4)
    float GlobalVectorFieldTightness;                                                 // 0x01DC (size: 0x4)
    float PerParticleVectorFieldScale;                                                // 0x01E0 (size: 0x4)
    float PerParticleVectorFieldBias;                                                 // 0x01E4 (size: 0x4)
    float DragCoefficientScale;                                                       // 0x01E8 (size: 0x4)
    float DragCoefficientBias;                                                        // 0x01EC (size: 0x4)
    float ResilienceScale;                                                            // 0x01F0 (size: 0x4)
    float ResilienceBias;                                                             // 0x01F4 (size: 0x4)
    float CollisionRadiusScale;                                                       // 0x01F8 (size: 0x4)
    float CollisionRadiusBias;                                                        // 0x01FC (size: 0x4)
    float CollisionTimeBias;                                                          // 0x0200 (size: 0x4)
    float CollisionRandomSpread;                                                      // 0x0204 (size: 0x4)
    float CollisionRandomDistribution;                                                // 0x0208 (size: 0x4)
    float OneMinusFriction;                                                           // 0x020C (size: 0x4)
    float RotationRateScale;                                                          // 0x0210 (size: 0x4)
    float CameraMotionBlurAmount;                                                     // 0x0214 (size: 0x4)
    TEnumAsByte<EParticleScreenAlignment> ScreenAlignment;                            // 0x0218 (size: 0x1)
    TEnumAsByte<EParticleAxisLock> LockAxisFlag;                                      // 0x0219 (size: 0x1)
    FVector2D PivotOffset;                                                            // 0x0220 (size: 0x10)
    uint8 bUseVelocityForMotionBlur;                                                  // 0x0230 (size: 0x1)
    uint8 bRemoveHMDRoll;                                                             // 0x0230 (size: 0x1)
    float MinFacingCameraBlendDistance;                                               // 0x0234 (size: 0x4)
    float MaxFacingCameraBlendDistance;                                               // 0x0238 (size: 0x4)

}; // Size: 0x240

struct FGameNameRedirect
{
    FName OldGameName;                                                                // 0x0000 (size: 0x8)
    FName NewGameName;                                                                // 0x0008 (size: 0x8)

}; // Size: 0x10

struct FGaussianSumBloomSettings
{
    float Intensity;                                                                  // 0x0000 (size: 0x4)
    float Threshold;                                                                  // 0x0004 (size: 0x4)
    float SizeScale;                                                                  // 0x0008 (size: 0x4)
    float Filter1Size;                                                                // 0x000C (size: 0x4)
    float Filter2Size;                                                                // 0x0010 (size: 0x4)
    float Filter3Size;                                                                // 0x0014 (size: 0x4)
    float Filter4Size;                                                                // 0x0018 (size: 0x4)
    float Filter5Size;                                                                // 0x001C (size: 0x4)
    float Filter6Size;                                                                // 0x0020 (size: 0x4)
    FLinearColor Filter1Tint;                                                         // 0x0024 (size: 0x10)
    FLinearColor Filter2Tint;                                                         // 0x0034 (size: 0x10)
    FLinearColor Filter3Tint;                                                         // 0x0044 (size: 0x10)
    FLinearColor Filter4Tint;                                                         // 0x0054 (size: 0x10)
    FLinearColor Filter5Tint;                                                         // 0x0064 (size: 0x10)
    FLinearColor Filter6Tint;                                                         // 0x0074 (size: 0x10)

}; // Size: 0x84

struct FGenericStruct
{
    int32 Data;                                                                       // 0x0000 (size: 0x4)

}; // Size: 0x4

struct FGeomSelection
{
    int32 Type;                                                                       // 0x0000 (size: 0x4)
    int32 Index;                                                                      // 0x0004 (size: 0x4)
    int32 SelectionIndex;                                                             // 0x0008 (size: 0x4)

}; // Size: 0xC

struct FGraphAssetPlayerInformation
{
    TArray<int32> PlayerNodeIndices;                                                  // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FGraphReference
{
    class UEdGraph* MacroGraph;                                                       // 0x0000 (size: 0x8)
    class UBlueprint* GraphBlueprint;                                                 // 0x0008 (size: 0x8)
    FGuid GraphGuid;                                                                  // 0x0010 (size: 0x10)

}; // Size: 0x20

struct FGridBlendSample
{
    FEditorElement GridElement;                                                       // 0x0000 (size: 0x18)
    float BlendWeight;                                                                // 0x0018 (size: 0x4)

}; // Size: 0x1C

struct FHLODISMComponentDesc
{
    class UStaticMesh* StaticMesh;                                                    // 0x0000 (size: 0x8)
    class UMaterialInterface* Material;                                               // 0x0008 (size: 0x8)
    TArray<FTransform> Instances;                                                     // 0x0010 (size: 0x10)
    TArray<FCustomPrimitiveData> InstancesCustomPrimitiveData;                        // 0x0020 (size: 0x10)

}; // Size: 0x30

struct FHLODISMComponentDescriptor : public FISMComponentDescriptor
{
}; // Size: 0x218

struct FHLODInstancingKey
{
    class UStaticMesh* StaticMesh;                                                    // 0x0000 (size: 0x8)
    class UMaterialInterface* Material;                                               // 0x0008 (size: 0x8)

}; // Size: 0x10

struct FHLODProxyMesh
{
    TLazyObjectPtr<class ALODActor> LODActor;                                         // 0x0000 (size: 0x18)
    class UStaticMesh* StaticMesh;                                                    // 0x0018 (size: 0x8)
    FName Key;                                                                        // 0x0020 (size: 0x8)

}; // Size: 0x28

struct FHapticFeedbackDetails_Curve
{
    FRuntimeFloatCurve Frequency;                                                     // 0x0000 (size: 0x88)
    FRuntimeFloatCurve Amplitude;                                                     // 0x0088 (size: 0x88)

}; // Size: 0x110

struct FHardwareCursorReference
{
    FName CursorPath;                                                                 // 0x0000 (size: 0x8)
    FVector2D HotSpot;                                                                // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FHardwareDeviceIdentifier
{
    FName InputClassName;                                                             // 0x0000 (size: 0x8)
    FName HardwareDeviceIdentifier;                                                   // 0x0008 (size: 0x8)
    EHardwareDevicePrimaryType PrimaryDeviceType;                                     // 0x0010 (size: 0x1)
    int32 SupportedFeaturesMask;                                                      // 0x0014 (size: 0x4)

}; // Size: 0x18

struct FHierarchicalSimplification
{
    float TransitionScreenSize;                                                       // 0x0000 (size: 0x4)
    float OverrideDrawDistance;                                                       // 0x0004 (size: 0x4)
    uint8 bUseOverrideDrawDistance;                                                   // 0x0008 (size: 0x1)
    uint8 bAllowSpecificExclusion;                                                    // 0x0008 (size: 0x1)
    uint8 bOnlyGenerateClustersForVolumes;                                            // 0x0008 (size: 0x1)
    uint8 bReusePreviousLevelClusters;                                                // 0x0008 (size: 0x1)
    EHierarchicalSimplificationMethod SimplificationMethod;                           // 0x0009 (size: 0x1)
    FMeshProxySettings ProxySetting;                                                  // 0x0010 (size: 0x100)
    FMeshMergingSettings MergeSetting;                                                // 0x0110 (size: 0x108)
    FMeshApproximationSettings ApproximateSettings;                                   // 0x0218 (size: 0x128)
    float DesiredBoundRadius;                                                         // 0x0340 (size: 0x4)
    float DesiredFillingPercentage;                                                   // 0x0344 (size: 0x4)
    int32 MinNumberOfActorsToBuild;                                                   // 0x0348 (size: 0x4)

}; // Size: 0x350

struct FHitResult
{
    int32 FaceIndex;                                                                  // 0x0000 (size: 0x4)
    float Time;                                                                       // 0x0004 (size: 0x4)
    float Distance;                                                                   // 0x0008 (size: 0x4)
    FVector_NetQuantize Location;                                                     // 0x0010 (size: 0x18)
    FVector_NetQuantize ImpactPoint;                                                  // 0x0028 (size: 0x18)
    FVector_NetQuantizeNormal Normal;                                                 // 0x0040 (size: 0x18)
    FVector_NetQuantizeNormal ImpactNormal;                                           // 0x0058 (size: 0x18)
    FVector_NetQuantize TraceStart;                                                   // 0x0070 (size: 0x18)
    FVector_NetQuantize TraceEnd;                                                     // 0x0088 (size: 0x18)
    float PenetrationDepth;                                                           // 0x00A0 (size: 0x4)
    int32 MyItem;                                                                     // 0x00A4 (size: 0x4)
    int32 Item;                                                                       // 0x00A8 (size: 0x4)
    uint8 ElementIndex;                                                               // 0x00AC (size: 0x1)
    uint8 bBlockingHit;                                                               // 0x00AD (size: 0x1)
    uint8 bStartPenetrating;                                                          // 0x00AD (size: 0x1)
    TWeakObjectPtr<class UPhysicalMaterial> PhysMaterial;                             // 0x00B0 (size: 0x8)
    FActorInstanceHandle HitObjectHandle;                                             // 0x00B8 (size: 0x20)
    TWeakObjectPtr<class UPrimitiveComponent> Component;                              // 0x00D8 (size: 0x8)
    FName BoneName;                                                                   // 0x00E8 (size: 0x8)
    FName MyBoneName;                                                                 // 0x00F0 (size: 0x8)

}; // Size: 0xF8

struct FHitResultNetSerializerConfig : public FNetSerializerConfig
{
}; // Size: 0x10

struct FISMClientData
{
    TArray<FISMClientInstance> Instances;                                             // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FISMClientHandle
{
    int32 Index;                                                                      // 0x0000 (size: 0x4)
    FGuid Guid;                                                                       // 0x0004 (size: 0x10)

}; // Size: 0x14

struct FISMClientInstance
{
    TArray<int32> ComponentIndices;                                                   // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FISMClientInstanceManagerData
{
}; // Size: 0x10

struct FISMComponentData
{
}; // Size: 0x1

struct FISMComponentDescriptor : public FISMComponentDescriptorBase
{
    class UStaticMesh* StaticMesh;                                                    // 0x01E8 (size: 0x8)
    TArray<class UMaterialInterface*> OverrideMaterials;                              // 0x01F0 (size: 0x10)
    class UMaterialInterface* OverlayMaterial;                                        // 0x0200 (size: 0x8)
    TArray<class URuntimeVirtualTexture*> RuntimeVirtualTextures;                     // 0x0208 (size: 0x10)

}; // Size: 0x218

struct FISMComponentDescriptorBase
{
    uint32 Hash;                                                                      // 0x0008 (size: 0x4)
    TSubclassOf<class UInstancedStaticMeshComponent> ComponentClass;                  // 0x0010 (size: 0x8)
    TEnumAsByte<EComponentMobility::Type> Mobility;                                   // 0x0018 (size: 0x1)
    ERuntimeVirtualTextureMainPassType VirtualTextureRenderPassType;                  // 0x0019 (size: 0x1)
    ELightmapType LightmapType;                                                       // 0x001A (size: 0x1)
    FLightingChannels LightingChannels;                                               // 0x001B (size: 0x1)
    int32 RayTracingGroupId;                                                          // 0x001C (size: 0x4)
    ERayTracingGroupCullingPriority RayTracingGroupCullingPriority;                   // 0x0020 (size: 0x1)
    TEnumAsByte<EHasCustomNavigableGeometry::Type> bHasCustomNavigableGeometry;       // 0x0021 (size: 0x1)
    ERendererStencilMask CustomDepthStencilWriteMask;                                 // 0x0022 (size: 0x1)
    FBodyInstance BodyInstance;                                                       // 0x0028 (size: 0x198)
    int32 InstanceStartCullDistance;                                                  // 0x01C0 (size: 0x4)
    int32 InstanceEndCullDistance;                                                    // 0x01C4 (size: 0x4)
    float InstanceLODDistanceScale;                                                   // 0x01C8 (size: 0x4)
    int32 VirtualTextureCullMips;                                                     // 0x01CC (size: 0x4)
    int32 TranslucencySortPriority;                                                   // 0x01D0 (size: 0x4)
    int32 OverriddenLightMapRes;                                                      // 0x01D4 (size: 0x4)
    int32 CustomDepthStencilValue;                                                    // 0x01D8 (size: 0x4)
    uint8 bCastShadow;                                                                // 0x01DC (size: 0x1)
    uint8 bEmissiveLightSource;                                                       // 0x01DC (size: 0x1)
    uint8 bCastDynamicShadow;                                                         // 0x01DC (size: 0x1)
    uint8 bCastStaticShadow;                                                          // 0x01DC (size: 0x1)
    uint8 bCastContactShadow;                                                         // 0x01DC (size: 0x1)
    uint8 bCastShadowAsTwoSided;                                                      // 0x01DC (size: 0x1)
    uint8 bCastHiddenShadow;                                                          // 0x01DC (size: 0x1)
    uint8 bAffectDynamicIndirectLighting;                                             // 0x01DC (size: 0x1)
    uint8 bAffectDynamicIndirectLightingWhileHidden;                                  // 0x01DD (size: 0x1)
    uint8 bAffectDistanceFieldLighting;                                               // 0x01DD (size: 0x1)
    uint8 bReceivesDecals;                                                            // 0x01DD (size: 0x1)
    uint8 bOverrideLightMapRes;                                                       // 0x01DD (size: 0x1)
    uint8 bUseAsOccluder;                                                             // 0x01DD (size: 0x1)
    uint8 bEnableDensityScaling;                                                      // 0x01DD (size: 0x1)
    uint8 bEnableDiscardOnLoad;                                                       // 0x01DD (size: 0x1)
    uint8 bRenderCustomDepth;                                                         // 0x01DD (size: 0x1)
    uint8 bVisibleInRayTracing;                                                       // 0x01DE (size: 0x1)
    uint8 bHiddenInGame;                                                              // 0x01DE (size: 0x1)
    uint8 bIsEditorOnly;                                                              // 0x01DE (size: 0x1)
    uint8 bVisible;                                                                   // 0x01DE (size: 0x1)
    uint8 bEvaluateWorldPositionOffset;                                               // 0x01DE (size: 0x1)
    uint8 bReverseCulling;                                                            // 0x01DE (size: 0x1)
    uint8 bUseGpuLodSelection;                                                        // 0x01DE (size: 0x1)
    uint8 bUseDefaultCollision;                                                       // 0x01DE (size: 0x1)
    uint8 bGenerateOverlapEvents;                                                     // 0x01DF (size: 0x1)
    uint8 bOverrideNavigationExport;                                                  // 0x01DF (size: 0x1)
    uint8 bForceNavigationObstacle;                                                   // 0x01DF (size: 0x1)
    uint8 bFillCollisionUnderneathForNavmesh;                                         // 0x01DF (size: 0x1)
    int32 WorldPositionOffsetDisableDistance;                                         // 0x01E0 (size: 0x4)
    EShadowCacheInvalidationBehavior ShadowCacheInvalidationBehavior;                 // 0x01E4 (size: 0x1)
    TEnumAsByte<EDetailMode> DetailMode;                                              // 0x01E5 (size: 0x1)

}; // Size: 0x1E8

struct FISMComponentInstance
{
    int32 ClientIndex;                                                                // 0x0000 (size: 0x4)
    int32 InstanceIndex;                                                              // 0x0004 (size: 0x4)
    int32 InstanceSubIndex;                                                           // 0x0008 (size: 0x4)

}; // Size: 0xC

struct FImportFactorySettingValues
{
    FString SettingName;                                                              // 0x0000 (size: 0x10)
    FString Value;                                                                    // 0x0010 (size: 0x10)

}; // Size: 0x20

struct FImportanceTexture
{
    FIntPoint Size;                                                                   // 0x0000 (size: 0x8)
    int32 NumMips;                                                                    // 0x0008 (size: 0x4)
    TArray<float> MarginalCDF;                                                        // 0x0010 (size: 0x10)
    TArray<float> ConditionalCDF;                                                     // 0x0020 (size: 0x10)
    TArray<FColor> TextureData;                                                       // 0x0030 (size: 0x10)
    TWeakObjectPtr<class UTexture2D> Texture;                                         // 0x0040 (size: 0x8)
    TEnumAsByte<EImportanceWeight::Type> Weighting;                                   // 0x0048 (size: 0x1)

}; // Size: 0x50

struct FIndexedCurve
{
    FKeyHandleMap KeyHandlesToIndices;                                                // 0x0008 (size: 0x60)

}; // Size: 0x68

struct FInertializationBoneDiff
{
}; // Size: 0x60

struct FInertializationPose
{
}; // Size: 0xC0

struct FInertializationPoseDiff
{
}; // Size: 0x38

struct FInertializationRequest
{
    float Duration;                                                                   // 0x0000 (size: 0x4)
    class UBlendProfile* BlendProfile;                                                // 0x0008 (size: 0x8)
    bool bUseBlendMode;                                                               // 0x0010 (size: 0x1)
    EAlphaBlendOption BlendMode;                                                      // 0x0011 (size: 0x1)
    class UCurveFloat* CustomBlendCurve;                                              // 0x0018 (size: 0x8)
    FText Description;                                                                // 0x0020 (size: 0x10)
    FString DescriptionString;                                                        // 0x0030 (size: 0x10)
    int32 NodeID;                                                                     // 0x0040 (size: 0x4)
    class UObject* AnimInstance;                                                      // 0x0048 (size: 0x8)

}; // Size: 0x50

struct FInputActionKeyMapping
{
    FName ActionName;                                                                 // 0x0000 (size: 0x8)
    uint8 bShift;                                                                     // 0x0008 (size: 0x1)
    uint8 bCtrl;                                                                      // 0x0008 (size: 0x1)
    uint8 bAlt;                                                                       // 0x0008 (size: 0x1)
    uint8 bCmd;                                                                       // 0x0008 (size: 0x1)
    FKey Key;                                                                         // 0x0010 (size: 0x18)

}; // Size: 0x28

struct FInputActionSpeechMapping
{
    FName ActionName;                                                                 // 0x0000 (size: 0x8)
    FName SpeechKeyword;                                                              // 0x0008 (size: 0x8)

}; // Size: 0x10

struct FInputAlphaBoolBlend
{
    float BlendInTime;                                                                // 0x0000 (size: 0x4)
    float BlendOutTime;                                                               // 0x0004 (size: 0x4)
    EAlphaBlendOption BlendOption;                                                    // 0x0008 (size: 0x1)
    bool bInitialized;                                                                // 0x0009 (size: 0x1)
    class UCurveFloat* CustomCurve;                                                   // 0x0010 (size: 0x8)
    FAlphaBlend AlphaBlend;                                                           // 0x0018 (size: 0x30)

}; // Size: 0x48

struct FInputAxisConfigEntry
{
    FName AxisKeyName;                                                                // 0x0000 (size: 0x8)
    FInputAxisProperties AxisProperties;                                              // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FInputAxisKeyMapping
{
    FName AxisName;                                                                   // 0x0000 (size: 0x8)
    float Scale;                                                                      // 0x0008 (size: 0x4)
    FKey Key;                                                                         // 0x0010 (size: 0x18)

}; // Size: 0x28

struct FInputAxisProperties
{
    float DeadZone;                                                                   // 0x0000 (size: 0x4)
    float Sensitivity;                                                                // 0x0004 (size: 0x4)
    float Exponent;                                                                   // 0x0008 (size: 0x4)
    uint8 bInvert;                                                                    // 0x000C (size: 0x1)

}; // Size: 0x10

struct FInputBlendPose
{
    TArray<FBranchFilter> BranchFilters;                                              // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FInputClampConstants
{
    bool bClampResult;                                                                // 0x0000 (size: 0x1)
    bool bInterpResult;                                                               // 0x0001 (size: 0x1)
    float ClampMin;                                                                   // 0x0004 (size: 0x4)
    float ClampMax;                                                                   // 0x0008 (size: 0x4)
    float InterpSpeedIncreasing;                                                      // 0x000C (size: 0x4)
    float InterpSpeedDecreasing;                                                      // 0x0010 (size: 0x4)

}; // Size: 0x14

struct FInputClampState
{
}; // Size: 0x8

struct FInputDevicePropertyHandle
{
    uint32 InternalId;                                                                // 0x0000 (size: 0x4)

}; // Size: 0x4

struct FInputRange
{
    float Min;                                                                        // 0x0000 (size: 0x4)
    float Max;                                                                        // 0x0004 (size: 0x4)

}; // Size: 0x8

struct FInputScaleBias
{
    float Scale;                                                                      // 0x0000 (size: 0x4)
    float Bias;                                                                       // 0x0004 (size: 0x4)

}; // Size: 0x8

struct FInputScaleBiasClamp
{
    bool bMapRange;                                                                   // 0x0000 (size: 0x1)
    bool bClampResult;                                                                // 0x0001 (size: 0x1)
    bool bInterpResult;                                                               // 0x0002 (size: 0x1)
    FInputRange InRange;                                                              // 0x0004 (size: 0x8)
    FInputRange OutRange;                                                             // 0x000C (size: 0x8)
    float Scale;                                                                      // 0x0014 (size: 0x4)
    float Bias;                                                                       // 0x0018 (size: 0x4)
    float ClampMin;                                                                   // 0x001C (size: 0x4)
    float ClampMax;                                                                   // 0x0020 (size: 0x4)
    float InterpSpeedIncreasing;                                                      // 0x0024 (size: 0x4)
    float InterpSpeedDecreasing;                                                      // 0x0028 (size: 0x4)

}; // Size: 0x30

struct FInputScaleBiasClampConstants
{
    bool bMapRange;                                                                   // 0x0000 (size: 0x1)
    bool bClampResult;                                                                // 0x0001 (size: 0x1)
    bool bInterpResult;                                                               // 0x0002 (size: 0x1)
    FInputRange InRange;                                                              // 0x0004 (size: 0x8)
    FInputRange OutRange;                                                             // 0x000C (size: 0x8)
    float Scale;                                                                      // 0x0014 (size: 0x4)
    float Bias;                                                                       // 0x0018 (size: 0x4)
    float ClampMin;                                                                   // 0x001C (size: 0x4)
    float ClampMax;                                                                   // 0x0020 (size: 0x4)
    float InterpSpeedIncreasing;                                                      // 0x0024 (size: 0x4)
    float InterpSpeedDecreasing;                                                      // 0x0028 (size: 0x4)

}; // Size: 0x2C

struct FInputScaleBiasClampState
{
}; // Size: 0x8

struct FInstanceCacheDataBase
{
    TArray<uint8> SavedProperties;                                                    // 0x0008 (size: 0x10)
    FDataCacheDuplicatedObjectData UniqueTransientPackage;                            // 0x0018 (size: 0x10)
    TArray<FDataCacheDuplicatedObjectData> DuplicatedObjects;                         // 0x0028 (size: 0x10)
    TArray<class UObject*> ReferencedObjects;                                         // 0x0038 (size: 0x10)
    TArray<FName> ReferencedNames;                                                    // 0x0048 (size: 0x10)

}; // Size: 0x58

struct FInstancedStaticMeshComponentInstanceData : public FSceneComponentInstanceData
{
    class UStaticMesh* StaticMesh;                                                    // 0x00B8 (size: 0x8)
    FInstancedStaticMeshLightMapInstanceData CachedStaticLighting;                    // 0x00C0 (size: 0x70)
    TArray<FInstancedStaticMeshInstanceData> PerInstanceSMData;                       // 0x0130 (size: 0x10)
    int32 InstancingRandomSeed;                                                       // 0x0160 (size: 0x4)
    TArray<FInstancedStaticMeshRandomSeed> AdditionalRandomSeeds;                     // 0x0168 (size: 0x10)
    bool bHasPerInstanceHitProxies;                                                   // 0x0178 (size: 0x1)

}; // Size: 0x180

struct FInstancedStaticMeshInstanceData
{
    FMatrix Transform;                                                                // 0x0000 (size: 0x80)

}; // Size: 0x80

struct FInstancedStaticMeshLightMapInstanceData
{
    FTransform Transform;                                                             // 0x0000 (size: 0x60)
    TArray<FGuid> MapBuildDataIds;                                                    // 0x0060 (size: 0x10)

}; // Size: 0x70

struct FInstancedStaticMeshMappingInfo
{
}; // Size: 0x8

struct FInstancedStaticMeshRandomSeed
{
    int32 StartInstanceIndex;                                                         // 0x0000 (size: 0x4)
    int32 RandomSeed;                                                                 // 0x0004 (size: 0x4)

}; // Size: 0x8

struct FIntegerAnimationAttribute
{
    int32 Value;                                                                      // 0x0000 (size: 0x4)

}; // Size: 0x4

struct FIntegralCurve : public FIndexedCurve
{
    TArray<FIntegralKey> keys;                                                        // 0x0068 (size: 0x10)
    int32 DefaultValue;                                                               // 0x0078 (size: 0x4)
    bool bUseDefaultValueBeforeFirstKey;                                              // 0x007C (size: 0x1)

}; // Size: 0x80

struct FIntegralKey
{
    float Time;                                                                       // 0x0000 (size: 0x4)
    int32 Value;                                                                      // 0x0004 (size: 0x4)

}; // Size: 0x8

struct FInteriorSettings
{
    bool bIsWorldSettings;                                                            // 0x0000 (size: 0x1)
    float ExteriorVolume;                                                             // 0x0004 (size: 0x4)
    float ExteriorTime;                                                               // 0x0008 (size: 0x4)
    float ExteriorLPF;                                                                // 0x000C (size: 0x4)
    float ExteriorLPFTime;                                                            // 0x0010 (size: 0x4)
    float InteriorVolume;                                                             // 0x0014 (size: 0x4)
    float InteriorTime;                                                               // 0x0018 (size: 0x4)
    float InteriorLPF;                                                                // 0x001C (size: 0x4)
    float InteriorLPFTime;                                                            // 0x0020 (size: 0x4)

}; // Size: 0x24

struct FInterpControlPoint
{
    FVector PositionControlPoint;                                                     // 0x0000 (size: 0x18)
    bool bPositionIsRelative;                                                         // 0x0018 (size: 0x1)

}; // Size: 0x28

struct FInterpolationParameter
{
    float InterpolationTime;                                                          // 0x0000 (size: 0x4)
    float DampingRatio;                                                               // 0x0004 (size: 0x4)
    float MaxSpeed;                                                                   // 0x0008 (size: 0x4)
    TEnumAsByte<EFilterInterpolationType> InterpolationType;                          // 0x000C (size: 0x1)

}; // Size: 0x10

struct FIrisNetDriverConfig
{
    FName NetDriverDefinition;                                                        // 0x0000 (size: 0x8)
    FName NetDriverName;                                                              // 0x0008 (size: 0x8)
    FString NetDriverWildcardName;                                                    // 0x0010 (size: 0x10)
    bool bCanUseIris;                                                                 // 0x0020 (size: 0x1)

}; // Size: 0x28

struct FKAggregateGeom
{
    TArray<FKSphereElem> SphereElems;                                                 // 0x0000 (size: 0x10)
    TArray<FKBoxElem> BoxElems;                                                       // 0x0010 (size: 0x10)
    TArray<FKSphylElem> SphylElems;                                                   // 0x0020 (size: 0x10)
    TArray<FKConvexElem> ConvexElems;                                                 // 0x0030 (size: 0x10)
    TArray<FKTaperedCapsuleElem> TaperedCapsuleElems;                                 // 0x0040 (size: 0x10)
    TArray<FKLevelSetElem> LevelSetElems;                                             // 0x0050 (size: 0x10)
    TArray<FKSkinnedLevelSetElem> SkinnedLevelSetElems;                               // 0x0060 (size: 0x10)

}; // Size: 0x80

struct FKBoxElem : public FKShapeElem
{
    FVector Center;                                                                   // 0x0030 (size: 0x18)
    FRotator Rotation;                                                                // 0x0048 (size: 0x18)
    float X;                                                                          // 0x0060 (size: 0x4)
    float Y;                                                                          // 0x0064 (size: 0x4)
    float Z;                                                                          // 0x0068 (size: 0x4)

}; // Size: 0x70

struct FKConvexElem : public FKShapeElem
{
    TArray<FVector> VertexData;                                                       // 0x0030 (size: 0x10)
    TArray<int32> IndexData;                                                          // 0x0040 (size: 0x10)
    FBox ElemBox;                                                                     // 0x0050 (size: 0x38)
    FTransform Transform;                                                             // 0x0090 (size: 0x60)

}; // Size: 0x100

struct FKLevelSetElem : public FKShapeElem
{
    FTransform Transform;                                                             // 0x0030 (size: 0x60)

}; // Size: 0xA0

struct FKShapeElem
{
    float RestOffset;                                                                 // 0x0008 (size: 0x4)
    FName Name;                                                                       // 0x000C (size: 0x8)
    uint8 bContributeToMass;                                                          // 0x0018 (size: 0x1)
    TEnumAsByte<ECollisionEnabled::Type> CollisionEnabled;                            // 0x0019 (size: 0x1)

}; // Size: 0x30

struct FKSkinnedLevelSetElem : public FKShapeElem
{
}; // Size: 0x38

struct FKSphereElem : public FKShapeElem
{
    FVector Center;                                                                   // 0x0030 (size: 0x18)
    float Radius;                                                                     // 0x0048 (size: 0x4)

}; // Size: 0x50

struct FKSphylElem : public FKShapeElem
{
    FVector Center;                                                                   // 0x0030 (size: 0x18)
    FRotator Rotation;                                                                // 0x0048 (size: 0x18)
    float Radius;                                                                     // 0x0060 (size: 0x4)
    float Length;                                                                     // 0x0064 (size: 0x4)

}; // Size: 0x68

struct FKTaperedCapsuleElem : public FKShapeElem
{
    FVector Center;                                                                   // 0x0030 (size: 0x18)
    FRotator Rotation;                                                                // 0x0048 (size: 0x18)
    float Radius0;                                                                    // 0x0060 (size: 0x4)
    float Radius1;                                                                    // 0x0064 (size: 0x4)
    float Length;                                                                     // 0x0068 (size: 0x4)

}; // Size: 0x70

struct FKeyBind
{
    FKey Key;                                                                         // 0x0000 (size: 0x18)
    FString Command;                                                                  // 0x0018 (size: 0x10)
    uint8 Control;                                                                    // 0x0028 (size: 0x1)
    uint8 Shift;                                                                      // 0x0028 (size: 0x1)
    uint8 Alt;                                                                        // 0x0028 (size: 0x1)
    uint8 Cmd;                                                                        // 0x0028 (size: 0x1)
    uint8 bIgnoreCtrl;                                                                // 0x0028 (size: 0x1)
    uint8 bIgnoreShift;                                                               // 0x0028 (size: 0x1)
    uint8 bIgnoreAlt;                                                                 // 0x0028 (size: 0x1)
    uint8 bIgnoreCmd;                                                                 // 0x0028 (size: 0x1)
    uint8 bDisabled;                                                                  // 0x0029 (size: 0x1)

}; // Size: 0x30

struct FKeyHandleLookupTable
{
}; // Size: 0x88

struct FKeyHandleMap
{
}; // Size: 0x60

struct FLODMappingData
{
    TArray<int32> Mapping;                                                            // 0x0000 (size: 0x10)
    TArray<int32> InverseMapping;                                                     // 0x0010 (size: 0x10)

}; // Size: 0x20

struct FLODSoloTrack
{
    TArray<uint8> SoloEnableSetting;                                                  // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FLatentActionInfo
{
    int32 Linkage;                                                                    // 0x0000 (size: 0x4)
    int32 UUID;                                                                       // 0x0004 (size: 0x4)
    FName ExecutionFunction;                                                          // 0x0008 (size: 0x8)
    class UObject* CallbackTarget;                                                    // 0x0010 (size: 0x8)

}; // Size: 0x18

struct FLatentActionManager
{
}; // Size: 0x60

struct FLaunchOnTestSettings
{
    FFilePath LaunchOnTestmap;                                                        // 0x0000 (size: 0x10)
    FString DeviceID;                                                                 // 0x0010 (size: 0x10)

}; // Size: 0x20

struct FLayerActorStats
{
    UClass* Type;                                                                     // 0x0000 (size: 0x8)
    int32 Total;                                                                      // 0x0008 (size: 0x4)

}; // Size: 0x10

struct FLensBloomSettings
{
    FGaussianSumBloomSettings GaussianSum;                                            // 0x0000 (size: 0x84)
    FConvolutionBloomSettings Convolution;                                            // 0x0088 (size: 0x30)
    TEnumAsByte<EBloomMethod> Method;                                                 // 0x00B8 (size: 0x1)

}; // Size: 0xC0

struct FLensImperfectionSettings
{
    class UTexture* DirtMask;                                                         // 0x0000 (size: 0x8)
    float DirtMaskIntensity;                                                          // 0x0008 (size: 0x4)
    FLinearColor DirtMaskTint;                                                        // 0x000C (size: 0x10)

}; // Size: 0x20

struct FLensSettings
{
    FLensBloomSettings Bloom;                                                         // 0x0000 (size: 0xC0)
    FLensImperfectionSettings Imperfections;                                          // 0x00C0 (size: 0x20)
    float ChromaticAberration;                                                        // 0x00E0 (size: 0x4)

}; // Size: 0xE8

struct FLevelCollection
{
    class AGameStateBase* GameState;                                                  // 0x0008 (size: 0x8)
    class UNetDriver* NetDriver;                                                      // 0x0010 (size: 0x8)
    class UDemoNetDriver* DemoNetDriver;                                              // 0x0018 (size: 0x8)
    class ULevel* PersistentLevel;                                                    // 0x0020 (size: 0x8)
    TSet<ULevel*> Levels;                                                             // 0x0028 (size: 0x50)

}; // Size: 0x78

struct FLevelNameAndTime
{
    FString LevelName;                                                                // 0x0000 (size: 0x10)
    uint32 LevelChangeTimeInMS;                                                       // 0x0010 (size: 0x4)

}; // Size: 0x18

struct FLevelSimplificationDetails
{
    bool bCreatePackagePerAsset;                                                      // 0x0000 (size: 0x1)
    float DetailsPercentage;                                                          // 0x0004 (size: 0x4)
    FMaterialProxySettings StaticMeshMaterialSettings;                                // 0x0008 (size: 0xA0)
    bool bOverrideLandscapeExportLOD;                                                 // 0x00A8 (size: 0x1)
    int32 LandscapeExportLOD;                                                         // 0x00AC (size: 0x4)
    FMaterialProxySettings LandscapeMaterialSettings;                                 // 0x00B0 (size: 0xA0)
    bool bBakeFoliageToLandscape;                                                     // 0x0150 (size: 0x1)
    bool bBakeGrassToLandscape;                                                       // 0x0151 (size: 0x1)

}; // Size: 0x158

struct FLevelStreamingStatus
{
    FName PackageName;                                                                // 0x0000 (size: 0x8)
    uint8 bShouldBeLoaded;                                                            // 0x0008 (size: 0x1)
    uint8 bShouldBeVisible;                                                           // 0x0008 (size: 0x1)
    uint32 LODIndex;                                                                  // 0x000C (size: 0x4)

}; // Size: 0x10

struct FLevelViewportInfo
{
    FVector CamPosition;                                                              // 0x0000 (size: 0x18)
    FRotator CamRotation;                                                             // 0x0018 (size: 0x18)
    float CamOrthoZoom;                                                               // 0x0030 (size: 0x4)
    bool CamUpdated;                                                                  // 0x0034 (size: 0x1)

}; // Size: 0x38

struct FLightingChannels
{
    uint8 bChannel0;                                                                  // 0x0000 (size: 0x1)
    uint8 bChannel1;                                                                  // 0x0000 (size: 0x1)
    uint8 bChannel2;                                                                  // 0x0000 (size: 0x1)

}; // Size: 0x1

struct FLightmassDebugOptions
{
    uint8 bDebugMode;                                                                 // 0x0000 (size: 0x1)
    uint8 bStatsEnabled;                                                              // 0x0000 (size: 0x1)
    uint8 bGatherBSPSurfacesAcrossComponents;                                         // 0x0000 (size: 0x1)
    float CoplanarTolerance;                                                          // 0x0004 (size: 0x4)
    uint8 bUseImmediateImport;                                                        // 0x0008 (size: 0x1)
    uint8 bImmediateProcessMappings;                                                  // 0x0008 (size: 0x1)
    uint8 bSortMappings;                                                              // 0x0008 (size: 0x1)
    uint8 bDumpBinaryFiles;                                                           // 0x0008 (size: 0x1)
    uint8 bDebugMaterials;                                                            // 0x0008 (size: 0x1)
    uint8 bPadMappings;                                                               // 0x0008 (size: 0x1)
    uint8 bDebugPaddings;                                                             // 0x0008 (size: 0x1)
    uint8 bOnlyCalcDebugTexelMappings;                                                // 0x0008 (size: 0x1)
    uint8 bUseRandomColors;                                                           // 0x0009 (size: 0x1)
    uint8 bColorBordersGreen;                                                         // 0x0009 (size: 0x1)
    uint8 bColorByExecutionTime;                                                      // 0x0009 (size: 0x1)
    float ExecutionTimeDivisor;                                                       // 0x000C (size: 0x4)

}; // Size: 0x10

struct FLightmassDirectionalLightSettings : public FLightmassLightSettings
{
    float LightSourceAngle;                                                           // 0x000C (size: 0x4)

}; // Size: 0x10

struct FLightmassLightSettings
{
    float IndirectLightingSaturation;                                                 // 0x0000 (size: 0x4)
    float ShadowExponent;                                                             // 0x0004 (size: 0x4)
    bool bUseAreaShadowsForStationaryLight;                                           // 0x0008 (size: 0x1)

}; // Size: 0xC

struct FLightmassMaterialInterfaceSettings
{
    float EmissiveBoost;                                                              // 0x0000 (size: 0x4)
    float DiffuseBoost;                                                               // 0x0004 (size: 0x4)
    float ExportResolutionScale;                                                      // 0x0008 (size: 0x4)
    uint8 bCastShadowAsMasked;                                                        // 0x000C (size: 0x1)
    uint8 bOverrideCastShadowAsMasked;                                                // 0x000C (size: 0x1)
    uint8 bOverrideEmissiveBoost;                                                     // 0x000C (size: 0x1)
    uint8 bOverrideDiffuseBoost;                                                      // 0x000C (size: 0x1)
    uint8 bOverrideExportResolutionScale;                                             // 0x000C (size: 0x1)

}; // Size: 0x10

struct FLightmassPointLightSettings : public FLightmassLightSettings
{
}; // Size: 0xC

struct FLightmassPrimitiveSettings
{
    uint8 bUseTwoSidedLighting;                                                       // 0x0000 (size: 0x1)
    uint8 bShadowIndirectOnly;                                                        // 0x0000 (size: 0x1)
    uint8 bUseEmissiveForStaticLighting;                                              // 0x0000 (size: 0x1)
    uint8 bUseVertexNormalForHemisphereGather;                                        // 0x0000 (size: 0x1)
    float EmissiveLightFalloffExponent;                                               // 0x0004 (size: 0x4)
    float EmissiveLightExplicitInfluenceRadius;                                       // 0x0008 (size: 0x4)
    float EmissiveBoost;                                                              // 0x000C (size: 0x4)
    float DiffuseBoost;                                                               // 0x0010 (size: 0x4)
    float FullyOccludedSamplesFraction;                                               // 0x0014 (size: 0x4)

}; // Size: 0x18

struct FLightmassWorldInfoSettings
{
    float StaticLightingLevelScale;                                                   // 0x0000 (size: 0x4)
    int32 NumIndirectLightingBounces;                                                 // 0x0004 (size: 0x4)
    int32 NumSkyLightingBounces;                                                      // 0x0008 (size: 0x4)
    float IndirectLightingQuality;                                                    // 0x000C (size: 0x4)
    float IndirectLightingSmoothness;                                                 // 0x0010 (size: 0x4)
    FColor EnvironmentColor;                                                          // 0x0014 (size: 0x4)
    float EnvironmentIntensity;                                                       // 0x0018 (size: 0x4)
    float EmissiveBoost;                                                              // 0x001C (size: 0x4)
    float DiffuseBoost;                                                               // 0x0020 (size: 0x4)
    TEnumAsByte<EVolumeLightingMethod> VolumeLightingMethod;                          // 0x0024 (size: 0x1)
    uint8 bUseAmbientOcclusion;                                                       // 0x0025 (size: 0x1)
    uint8 bGenerateAmbientOcclusionMaterialMask;                                      // 0x0025 (size: 0x1)
    uint8 bVisualizeMaterialDiffuse;                                                  // 0x0025 (size: 0x1)
    uint8 bVisualizeAmbientOcclusion;                                                 // 0x0025 (size: 0x1)
    uint8 bCompressLightmaps;                                                         // 0x0025 (size: 0x1)
    float VolumetricLightmapDetailCellSize;                                           // 0x0028 (size: 0x4)
    float VolumetricLightmapMaximumBrickMemoryMb;                                     // 0x002C (size: 0x4)
    float VolumetricLightmapSphericalHarmonicSmoothing;                               // 0x0030 (size: 0x4)
    float VolumeLightSamplePlacementScale;                                            // 0x0034 (size: 0x4)
    float DirectIlluminationOcclusionFraction;                                        // 0x0038 (size: 0x4)
    float IndirectIlluminationOcclusionFraction;                                      // 0x003C (size: 0x4)
    float OcclusionExponent;                                                          // 0x0040 (size: 0x4)
    float FullyOccludedSamplesFraction;                                               // 0x0044 (size: 0x4)
    float MaxOcclusionDistance;                                                       // 0x0048 (size: 0x4)

}; // Size: 0x4C

struct FLinearConstraint : public FConstraintBaseParams
{
    float Limit;                                                                      // 0x0014 (size: 0x4)
    TEnumAsByte<ELinearConstraintMotion> XMotion;                                     // 0x0018 (size: 0x1)
    TEnumAsByte<ELinearConstraintMotion> YMotion;                                     // 0x0019 (size: 0x1)
    TEnumAsByte<ELinearConstraintMotion> ZMotion;                                     // 0x001A (size: 0x1)

}; // Size: 0x1C

struct FLinearDriveConstraint
{
    FVector PositionTarget;                                                           // 0x0000 (size: 0x18)
    FVector VelocityTarget;                                                           // 0x0018 (size: 0x18)
    FConstraintDrive XDrive;                                                          // 0x0030 (size: 0x10)
    FConstraintDrive YDrive;                                                          // 0x0040 (size: 0x10)
    FConstraintDrive ZDrive;                                                          // 0x0050 (size: 0x10)

}; // Size: 0x60

struct FLinkedAnimLayerClassData
{
    TArray<FLinkedAnimLayerInstanceData> InstancesData;                               // 0x0008 (size: 0x10)

}; // Size: 0x20

struct FLinkedAnimLayerInstanceData
{
    class UAnimInstance* Instance;                                                    // 0x0000 (size: 0x8)
    TMap<class FName, class TWeakObjectPtr<UAnimInstance>> LinkedFunctions;           // 0x0008 (size: 0x50)

}; // Size: 0x60

struct FLocalSpacePose
{
    TArray<FTransform> Transforms;                                                    // 0x0000 (size: 0x10)
    TArray<FName> Names;                                                              // 0x0010 (size: 0x10)

}; // Size: 0x20

struct FLocationBoneSocketInfo
{
    FName BoneSocketName;                                                             // 0x0000 (size: 0x8)
    FVector Offset;                                                                   // 0x0008 (size: 0x18)

}; // Size: 0x20

struct FMTDResult
{
    FVector Direction;                                                                // 0x0000 (size: 0x18)
    float Distance;                                                                   // 0x0018 (size: 0x4)

}; // Size: 0x20

struct FMarkerSyncAnimPosition
{
    FName PreviousMarkerName;                                                         // 0x0000 (size: 0x8)
    FName NextMarkerName;                                                             // 0x0008 (size: 0x8)
    float PositionBetweenMarkers;                                                     // 0x0010 (size: 0x4)

}; // Size: 0x14

struct FMarkerSyncData
{
    TArray<FAnimSyncMarker> AuthoredSyncMarkers;                                      // 0x0000 (size: 0x10)

}; // Size: 0x20

struct FMaterialAttributesInput : public FExpressionInput
{
    int64 PropertyConnectedMask;                                                      // 0x0028 (size: 0x8)

}; // Size: 0x30

struct FMaterialCachedExpressionData
{
    FMaterialCachedParameterEntry RuntimeEntries;                                     // 0x0000 (size: 0x280)
    TArray<int32> ScalarPrimitiveDataIndexValues;                                     // 0x0280 (size: 0x10)
    TArray<int32> VectorPrimitiveDataIndexValues;                                     // 0x0290 (size: 0x10)
    TArray<float> ScalarValues;                                                       // 0x02A0 (size: 0x10)
    TArray<bool> StaticSwitchValues;                                                  // 0x02B0 (size: 0x10)
    TArray<bool> DynamicSwitchValues;                                                 // 0x02C0 (size: 0x10)
    TArray<FLinearColor> VectorValues;                                                // 0x02D0 (size: 0x10)
    TArray<FVector4d> DoubleVectorValues;                                             // 0x02E0 (size: 0x10)
    TArray<TSoftObjectPtr<UTexture>> TextureValues;                                   // 0x02F0 (size: 0x10)
    TArray<TSoftObjectPtr<UFont>> FontValues;                                         // 0x0300 (size: 0x10)
    TArray<int32> FontPageValues;                                                     // 0x0310 (size: 0x10)
    TArray<TSoftObjectPtr<URuntimeVirtualTexture>> RuntimeVirtualTextureValues;       // 0x0320 (size: 0x10)
    TArray<TSoftObjectPtr<USparseVolumeTexture>> SparseVolumeTextureValues;           // 0x0330 (size: 0x10)
    TArray<class UObject*> ReferencedTextures;                                        // 0x0340 (size: 0x10)
    TArray<FMaterialFunctionInfo> FunctionInfos;                                      // 0x0350 (size: 0x10)
    uint32 FunctionInfosStateCRC;                                                     // 0x0360 (size: 0x4)
    TArray<FMaterialParameterCollectionInfo> ParameterCollectionInfos;                // 0x0368 (size: 0x10)
    TArray<class ULandscapeGrassType*> GrassTypes;                                    // 0x0378 (size: 0x10)
    FMaterialLayersFunctionsRuntimeData MaterialLayers;                               // 0x0388 (size: 0x20)
    TArray<FName> DynamicParameterNames;                                              // 0x03A8 (size: 0x10)
    TArray<bool> QualityLevelsUsed;                                                   // 0x03B8 (size: 0x10)
    uint8 bHasMaterialLayers;                                                         // 0x03C8 (size: 0x1)
    uint8 bHasRuntimeVirtualTextureOutput;                                            // 0x03C8 (size: 0x1)
    uint8 bHasSceneColor;                                                             // 0x03C8 (size: 0x1)
    uint8 bHasPerInstanceCustomData;                                                  // 0x03C8 (size: 0x1)
    uint8 bHasPerInstanceRandom;                                                      // 0x03C8 (size: 0x1)
    uint8 bHasVertexInterpolator;                                                     // 0x03C8 (size: 0x1)
    uint32 PropertyConnectedBitmask;                                                  // 0x03CC (size: 0x4)
    uint64 PropertyConnectedMask;                                                     // 0x03D0 (size: 0x8)

}; // Size: 0x3D8

struct FMaterialCachedExpressionEditorOnlyData
{
    FMaterialCachedParameterEntry EditorOnlyEntries;                                  // 0x0000 (size: 0x50)
    FMaterialCachedParameterEditorEntry EditorEntries;                                // 0x0050 (size: 0x90)
    TArray<bool> StaticSwitchValues;                                                  // 0x00E0 (size: 0x10)
    TArray<FStaticComponentMaskValue> StaticComponentMaskValues;                      // 0x00F0 (size: 0x10)
    TArray<FVector2D> ScalarMinMaxValues;                                             // 0x0100 (size: 0x10)
    TArray<TSoftObjectPtr<UCurveLinearColor>> ScalarCurveValues;                      // 0x0110 (size: 0x10)
    TArray<TSoftObjectPtr<UCurveLinearColorAtlas>> ScalarCurveAtlasValues;            // 0x0120 (size: 0x10)
    TArray<FParameterChannelNames> VectorChannelNameValues;                           // 0x0130 (size: 0x10)
    TArray<bool> VectorUsedAsChannelMaskValues;                                       // 0x0140 (size: 0x10)
    TArray<FParameterChannelNames> TextureChannelNameValues;                          // 0x0150 (size: 0x10)
    FMaterialLayersFunctionsEditorOnlyData MaterialLayers;                            // 0x0160 (size: 0x70)
    TArray<FString> AssetPaths;                                                       // 0x01D0 (size: 0x10)
    TArray<FName> LandscapeLayerNames;                                                // 0x01E0 (size: 0x10)
    TSet<FString> ExpressionIncludeFilePaths;                                         // 0x01F0 (size: 0x50)

}; // Size: 0x240

struct FMaterialCachedParameterEditorEntry
{
    TArray<FMaterialCachedParameterEditorInfo> EditorInfo;                            // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FMaterialCachedParameterEditorInfo
{
    FString Description;                                                              // 0x0000 (size: 0x10)
    FName Group;                                                                      // 0x0010 (size: 0x8)
    int32 SortPriority;                                                               // 0x0018 (size: 0x4)
    int32 AssetIndex;                                                                 // 0x001C (size: 0x4)
    FGuid ExpressionGUID;                                                             // 0x0020 (size: 0x10)

}; // Size: 0x30

struct FMaterialCachedParameterEntry
{
    TSet<FMaterialParameterInfo> ParameterInfoSet;                                    // 0x0000 (size: 0x50)

}; // Size: 0x50

struct FMaterialEditorPromotionSettings
{
    FFilePath DefaultMaterialAsset;                                                   // 0x0000 (size: 0x10)
    FFilePath DefaultDiffuseTexture;                                                  // 0x0010 (size: 0x10)
    FFilePath DefaultNormalTexture;                                                   // 0x0020 (size: 0x10)

}; // Size: 0x30

struct FMaterialExpressionCollection
{
    TArray<class UMaterialExpression*> Expressions;                                   // 0x0000 (size: 0x10)
    TArray<class UMaterialExpressionComment*> EditorComments;                         // 0x0010 (size: 0x10)
    class UMaterialExpressionExecBegin* ExpressionExecBegin;                          // 0x0020 (size: 0x8)
    class UMaterialExpressionExecEnd* ExpressionExecEnd;                              // 0x0028 (size: 0x8)

}; // Size: 0x30

struct FMaterialFunctionInfo
{
    FGuid StateId;                                                                    // 0x0000 (size: 0x10)
    class UMaterialFunctionInterface* Function;                                       // 0x0010 (size: 0x8)

}; // Size: 0x18

struct FMaterialInput
{
    class UMaterialExpression* Expression;                                            // 0x0000 (size: 0x8)
    int32 OutputIndex;                                                                // 0x0008 (size: 0x4)
    FName InputName;                                                                  // 0x000C (size: 0x8)
    int32 Mask;                                                                       // 0x0014 (size: 0x4)
    int32 MaskR;                                                                      // 0x0018 (size: 0x4)
    int32 MaskG;                                                                      // 0x001C (size: 0x4)
    int32 MaskB;                                                                      // 0x0020 (size: 0x4)
    int32 MaskA;                                                                      // 0x0024 (size: 0x4)

}; // Size: 0x28

struct FMaterialInstanceBasePropertyOverrides
{
    uint8 bOverride_OpacityMaskClipValue;                                             // 0x0000 (size: 0x1)
    uint8 bOverride_BlendMode;                                                        // 0x0000 (size: 0x1)
    uint8 bOverride_ShadingModel;                                                     // 0x0000 (size: 0x1)
    uint8 bOverride_DitheredLODTransition;                                            // 0x0000 (size: 0x1)
    uint8 bOverride_CastDynamicShadowAsMasked;                                        // 0x0000 (size: 0x1)
    uint8 bOverride_TwoSided;                                                         // 0x0000 (size: 0x1)
    uint8 bOverride_bIsThinSurface;                                                   // 0x0000 (size: 0x1)
    uint8 bOverride_OutputTranslucentVelocity;                                        // 0x0000 (size: 0x1)
    uint8 bOverride_bHasPixelAnimation;                                               // 0x0001 (size: 0x1)
    uint8 bOverride_bEnableTessellation;                                              // 0x0001 (size: 0x1)
    uint8 bOverride_DisplacementScaling;                                              // 0x0001 (size: 0x1)
    uint8 bOverride_MaxWorldPositionOffsetDisplacement;                               // 0x0001 (size: 0x1)
    uint8 TwoSided;                                                                   // 0x0001 (size: 0x1)
    uint8 bIsThinSurface;                                                             // 0x0001 (size: 0x1)
    uint8 DitheredLODTransition;                                                      // 0x0001 (size: 0x1)
    uint8 bCastDynamicShadowAsMasked;                                                 // 0x0001 (size: 0x1)
    uint8 bOutputTranslucentVelocity;                                                 // 0x0002 (size: 0x1)
    uint8 bHasPixelAnimation;                                                         // 0x0002 (size: 0x1)
    uint8 bEnableTessellation;                                                        // 0x0002 (size: 0x1)
    TEnumAsByte<EBlendMode> BlendMode;                                                // 0x0003 (size: 0x1)
    TEnumAsByte<EMaterialShadingModel> ShadingModel;                                  // 0x0004 (size: 0x1)
    float OpacityMaskClipValue;                                                       // 0x0008 (size: 0x4)
    FDisplacementScaling DisplacementScaling;                                         // 0x000C (size: 0x8)
    float MaxWorldPositionOffsetDisplacement;                                         // 0x0014 (size: 0x4)

}; // Size: 0x18

struct FMaterialInstanceCachedData
{
    TArray<int32> ParentLayerIndexRemap;                                              // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FMaterialLayersFunctions : public FMaterialLayersFunctionsRuntimeData
{
    FMaterialLayersFunctionsEditorOnlyData EditorOnly;                                // 0x0020 (size: 0x70)
    TArray<bool> LayerStates;                                                         // 0x0090 (size: 0x10)
    TArray<FText> LayerNames;                                                         // 0x00A0 (size: 0x10)
    TArray<bool> RestrictToLayerRelatives;                                            // 0x00B0 (size: 0x10)
    TArray<bool> RestrictToBlendRelatives;                                            // 0x00C0 (size: 0x10)
    TArray<FGuid> LayerGuids;                                                         // 0x00D0 (size: 0x10)
    TArray<EMaterialLayerLinkState> LayerLinkStates;                                  // 0x00E0 (size: 0x10)
    TArray<FGuid> DeletedParentLayerGuids;                                            // 0x00F0 (size: 0x10)

}; // Size: 0x100

struct FMaterialLayersFunctionsEditorOnlyData
{
    TArray<bool> LayerStates;                                                         // 0x0000 (size: 0x10)
    TArray<FText> LayerNames;                                                         // 0x0010 (size: 0x10)
    TArray<bool> RestrictToLayerRelatives;                                            // 0x0020 (size: 0x10)
    TArray<bool> RestrictToBlendRelatives;                                            // 0x0030 (size: 0x10)
    TArray<FGuid> LayerGuids;                                                         // 0x0040 (size: 0x10)
    TArray<EMaterialLayerLinkState> LayerLinkStates;                                  // 0x0050 (size: 0x10)
    TArray<FGuid> DeletedParentLayerGuids;                                            // 0x0060 (size: 0x10)

}; // Size: 0x70

struct FMaterialLayersFunctionsRuntimeData
{
    TArray<class UMaterialFunctionInterface*> Layers;                                 // 0x0000 (size: 0x10)
    TArray<class UMaterialFunctionInterface*> Blends;                                 // 0x0010 (size: 0x10)

}; // Size: 0x20

struct FMaterialOverrideNanite
{
    bool bEnableOverride;                                                             // 0x0000 (size: 0x1)
    class UMaterialInterface* OverrideMaterial;                                       // 0x0008 (size: 0x8)
    TSoftObjectPtr<UMaterialInterface> OverrideMaterialRef;                           // 0x0010 (size: 0x28)

}; // Size: 0x38

struct FMaterialParameterCollectionInfo
{
    FGuid StateId;                                                                    // 0x0000 (size: 0x10)
    class UMaterialParameterCollection* ParameterCollection;                          // 0x0010 (size: 0x8)

}; // Size: 0x18

struct FMaterialParameterInfo
{
    FName Name;                                                                       // 0x0000 (size: 0x8)
    TEnumAsByte<EMaterialParameterAssociation> Association;                           // 0x0008 (size: 0x1)
    int32 Index;                                                                      // 0x000C (size: 0x4)

}; // Size: 0x10

struct FMaterialProxySettings
{
    TEnumAsByte<ETextureSizingType> TextureSizingType;                                // 0x0000 (size: 0x1)
    FIntPoint TextureSize;                                                            // 0x0004 (size: 0x8)
    float TargetTexelDensityPerMeter;                                                 // 0x000C (size: 0x4)
    float MeshMaxScreenSizePercent;                                                   // 0x0010 (size: 0x4)
    double MeshMinDrawDistance;                                                       // 0x0018 (size: 0x8)
    float GutterSpace;                                                                // 0x0020 (size: 0x4)
    float MetallicConstant;                                                           // 0x0024 (size: 0x4)
    float RoughnessConstant;                                                          // 0x0028 (size: 0x4)
    float AnisotropyConstant;                                                         // 0x002C (size: 0x4)
    float SpecularConstant;                                                           // 0x0030 (size: 0x4)
    float OpacityConstant;                                                            // 0x0034 (size: 0x4)
    float OpacityMaskConstant;                                                        // 0x0038 (size: 0x4)
    float AmbientOcclusionConstant;                                                   // 0x003C (size: 0x4)
    TEnumAsByte<EMaterialMergeType> MaterialMergeType;                                // 0x0040 (size: 0x1)
    TEnumAsByte<EBlendMode> BlendMode;                                                // 0x0041 (size: 0x1)
    uint8 bAllowTwoSidedMaterial;                                                     // 0x0042 (size: 0x1)
    uint8 bNormalMap;                                                                 // 0x0042 (size: 0x1)
    uint8 bTangentMap;                                                                // 0x0042 (size: 0x1)
    uint8 bMetallicMap;                                                               // 0x0042 (size: 0x1)
    uint8 bRoughnessMap;                                                              // 0x0042 (size: 0x1)
    uint8 bAnisotropyMap;                                                             // 0x0042 (size: 0x1)
    uint8 bSpecularMap;                                                               // 0x0042 (size: 0x1)
    uint8 bEmissiveMap;                                                               // 0x0042 (size: 0x1)
    uint8 bOpacityMap;                                                                // 0x0043 (size: 0x1)
    uint8 bOpacityMaskMap;                                                            // 0x0043 (size: 0x1)
    uint8 bAmbientOcclusionMap;                                                       // 0x0043 (size: 0x1)
    FIntPoint DiffuseTextureSize;                                                     // 0x0044 (size: 0x8)
    FIntPoint NormalTextureSize;                                                      // 0x004C (size: 0x8)
    FIntPoint TangentTextureSize;                                                     // 0x0054 (size: 0x8)
    FIntPoint MetallicTextureSize;                                                    // 0x005C (size: 0x8)
    FIntPoint RoughnessTextureSize;                                                   // 0x0064 (size: 0x8)
    FIntPoint AnisotropyTextureSize;                                                  // 0x006C (size: 0x8)
    FIntPoint SpecularTextureSize;                                                    // 0x0074 (size: 0x8)
    FIntPoint EmissiveTextureSize;                                                    // 0x007C (size: 0x8)
    FIntPoint OpacityTextureSize;                                                     // 0x0084 (size: 0x8)
    FIntPoint OpacityMaskTextureSize;                                                 // 0x008C (size: 0x8)
    FIntPoint AmbientOcclusionTextureSize;                                            // 0x0094 (size: 0x8)

}; // Size: 0xA0

struct FMaterialRemapIndex
{
    uint32 ImportVersionKey;                                                          // 0x0000 (size: 0x4)
    TArray<int32> MaterialRemap;                                                      // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FMaterialShadingModelField
{
    uint16 ShadingModelField;                                                         // 0x0000 (size: 0x2)

}; // Size: 0x2

struct FMaterialSpriteElement
{
    class UMaterialInterface* Material;                                               // 0x0000 (size: 0x8)
    class UCurveFloat* DistanceToOpacityCurve;                                        // 0x0008 (size: 0x8)
    uint8 bSizeIsInScreenSpace;                                                       // 0x0010 (size: 0x1)
    float BaseSizeX;                                                                  // 0x0014 (size: 0x4)
    float BaseSizeY;                                                                  // 0x0018 (size: 0x4)
    class UCurveFloat* DistanceToSizeCurve;                                           // 0x0020 (size: 0x8)

}; // Size: 0x28

struct FMaterialTextureInfo
{
    float SamplingScale;                                                              // 0x0000 (size: 0x4)
    int32 UVChannelIndex;                                                             // 0x0004 (size: 0x4)
    FName TextureName;                                                                // 0x0008 (size: 0x8)

}; // Size: 0x10

struct FMemberReference
{
    class UObject* MemberParent;                                                      // 0x0000 (size: 0x8)
    FString MemberScope;                                                              // 0x0008 (size: 0x10)
    FName MemberName;                                                                 // 0x0018 (size: 0x8)
    FGuid MemberGuid;                                                                 // 0x0020 (size: 0x10)
    bool bSelfContext;                                                                // 0x0030 (size: 0x1)
    bool bWasDeprecated;                                                              // 0x0031 (size: 0x1)

}; // Size: 0x38

struct FMeshApproximationSettings
{
    EMeshApproximationType OutputType;                                                // 0x0000 (size: 0x1)
    float ApproximationAccuracy;                                                      // 0x0004 (size: 0x4)
    int32 ClampVoxelDimension;                                                        // 0x0008 (size: 0x4)
    bool bAttemptAutoThickening;                                                      // 0x000C (size: 0x1)
    float TargetMinThicknessMultiplier;                                               // 0x0010 (size: 0x4)
    bool bIgnoreTinyParts;                                                            // 0x0014 (size: 0x1)
    float TinyPartSizeMultiplier;                                                     // 0x0018 (size: 0x4)
    EMeshApproximationBaseCappingType BaseCapping;                                    // 0x001C (size: 0x1)
    float WindingThreshold;                                                           // 0x0020 (size: 0x4)
    bool bFillGaps;                                                                   // 0x0024 (size: 0x1)
    float GapDistance;                                                                // 0x0028 (size: 0x4)
    EOccludedGeometryFilteringPolicy OcclusionMethod;                                 // 0x002C (size: 0x1)
    bool bOccludeFromBottom;                                                          // 0x002D (size: 0x1)
    EMeshApproximationSimplificationPolicy SimplifyMethod;                            // 0x002E (size: 0x1)
    int32 TargetTriCount;                                                             // 0x0030 (size: 0x4)
    float TrianglesPerM;                                                              // 0x0034 (size: 0x4)
    float GeometricDeviation;                                                         // 0x0038 (size: 0x4)
    EMeshApproximationGroundPlaneClippingPolicy GroundClipping;                       // 0x003C (size: 0x1)
    float GroundClippingZHeight;                                                      // 0x0040 (size: 0x4)
    bool bEstimateHardNormals;                                                        // 0x0044 (size: 0x1)
    float HardNormalAngle;                                                            // 0x0048 (size: 0x4)
    EMeshApproximationUVGenerationPolicy UVGenerationMethod;                          // 0x004C (size: 0x1)
    int32 InitialPatchCount;                                                          // 0x0050 (size: 0x4)
    float CurvatureAlignment;                                                         // 0x0054 (size: 0x4)
    float MergingThreshold;                                                           // 0x0058 (size: 0x4)
    float MaxAngleDeviation;                                                          // 0x005C (size: 0x4)
    bool bGenerateNaniteEnabledMesh;                                                  // 0x0060 (size: 0x1)
    ENaniteFallbackTarget NaniteFallbackTarget;                                       // 0x0061 (size: 0x1)
    float NaniteFallbackPercentTriangles;                                             // 0x0064 (size: 0x4)
    float NaniteFallbackRelativeError;                                                // 0x0068 (size: 0x4)
    bool bSupportRayTracing;                                                          // 0x006C (size: 0x1)
    bool bAllowDistanceField;                                                         // 0x006D (size: 0x1)
    int32 MultiSamplingAA;                                                            // 0x0070 (size: 0x4)
    int32 RenderCaptureResolution;                                                    // 0x0074 (size: 0x4)
    FMaterialProxySettings MaterialSettings;                                          // 0x0078 (size: 0xA0)
    float CaptureFieldOfView;                                                         // 0x0118 (size: 0x4)
    float NearPlaneDist;                                                              // 0x011C (size: 0x4)
    bool bUseRenderLODMeshes;                                                         // 0x0120 (size: 0x1)
    bool bEnableSimplifyPrePass;                                                      // 0x0121 (size: 0x1)
    bool bEnableParallelBaking;                                                       // 0x0122 (size: 0x1)
    bool bPrintDebugMessages;                                                         // 0x0123 (size: 0x1)
    bool bEmitFullDebugMesh;                                                          // 0x0124 (size: 0x1)

}; // Size: 0x128

struct FMeshBuildSettings
{
    uint8 bUseMikkTSpace;                                                             // 0x0000 (size: 0x1)
    uint8 bRecomputeNormals;                                                          // 0x0000 (size: 0x1)
    uint8 bRecomputeTangents;                                                         // 0x0000 (size: 0x1)
    uint8 bComputeWeightedNormals;                                                    // 0x0000 (size: 0x1)
    uint8 bRemoveDegenerates;                                                         // 0x0000 (size: 0x1)
    uint8 bBuildReversedIndexBuffer;                                                  // 0x0000 (size: 0x1)
    uint8 bUseHighPrecisionTangentBasis;                                              // 0x0000 (size: 0x1)
    uint8 bUseFullPrecisionUVs;                                                       // 0x0000 (size: 0x1)
    uint8 bUseBackwardsCompatibleF16TruncUVs;                                         // 0x0001 (size: 0x1)
    uint8 bGenerateLightmapUVs;                                                       // 0x0001 (size: 0x1)
    uint8 bGenerateDistanceFieldAsIfTwoSided;                                         // 0x0001 (size: 0x1)
    uint8 bSupportFaceRemap;                                                          // 0x0001 (size: 0x1)
    int32 MinLightmapResolution;                                                      // 0x0004 (size: 0x4)
    int32 SrcLightmapIndex;                                                           // 0x0008 (size: 0x4)
    int32 DstLightmapIndex;                                                           // 0x000C (size: 0x4)
    float BuildScale;                                                                 // 0x0010 (size: 0x4)
    FVector BuildScale3D;                                                             // 0x0018 (size: 0x18)
    float DistanceFieldResolutionScale;                                               // 0x0030 (size: 0x4)
    class UStaticMesh* DistanceFieldReplacementMesh;                                  // 0x0038 (size: 0x8)
    int32 MaxLumenMeshCards;                                                          // 0x0040 (size: 0x4)

}; // Size: 0x48

struct FMeshDeformerInstanceSet
{
    TArray<class UMeshDeformerInstance*> DeformerInstances;                           // 0x0000 (size: 0x10)

}; // Size: 0x20

struct FMeshDisplacementMap
{
    class UTexture2D* Texture;                                                        // 0x0000 (size: 0x8)
    float Magnitude;                                                                  // 0x0008 (size: 0x4)
    float Center;                                                                     // 0x000C (size: 0x4)

}; // Size: 0x10

struct FMeshDrawCommandStatsBudget
{
    FName CategoryName;                                                               // 0x0000 (size: 0x8)
    TArray<FName> LinkedStatNames;                                                    // 0x0008 (size: 0x10)
    int32 PrimitiveBudget;                                                            // 0x0018 (size: 0x4)
    int32 Collection;                                                                 // 0x001C (size: 0x4)
    TArray<FName> Passes;                                                             // 0x0020 (size: 0x10)

}; // Size: 0x30

struct FMeshDrawCommandStatsBudgetTotals
{
    int32 PrimitiveBudget;                                                            // 0x0000 (size: 0x4)
    int32 Collection;                                                                 // 0x0004 (size: 0x4)

}; // Size: 0x8

struct FMeshInstancingSettings
{
    TSubclassOf<class AActor> ActorClassToUse;                                        // 0x0000 (size: 0x8)
    int32 InstanceReplacementThreshold;                                               // 0x0008 (size: 0x4)
    bool bSkipMeshesWithVertexColors;                                                 // 0x000C (size: 0x1)
    bool bUseHLODVolumes;                                                             // 0x000D (size: 0x1)
    TSubclassOf<class UInstancedStaticMeshComponent> ISMComponentToUse;               // 0x0010 (size: 0x8)

}; // Size: 0x18

struct FMeshMergingSettings
{
    int32 TargetLightMapResolution;                                                   // 0x0000 (size: 0x4)
    EUVOutput OutputUVs;                                                              // 0x0004 (size: 0x8)
    FMaterialProxySettings MaterialSettings;                                          // 0x0010 (size: 0xA0)
    int32 GutterSize;                                                                 // 0x00B0 (size: 0x4)
    EMeshLODSelectionType LODSelectionType;                                           // 0x00B4 (size: 0x1)
    int32 SpecificLOD;                                                                // 0x00B8 (size: 0x4)
    uint8 bGenerateLightMapUV;                                                        // 0x00BC (size: 0x1)
    uint8 bComputedLightMapResolution;                                                // 0x00BC (size: 0x1)
    uint8 bPivotPointAtZero;                                                          // 0x00BC (size: 0x1)
    uint8 bMergePhysicsData;                                                          // 0x00BC (size: 0x1)
    uint8 bMergeMeshSockets;                                                          // 0x00BC (size: 0x1)
    uint8 bMergeMaterials;                                                            // 0x00BC (size: 0x1)
    uint8 bBakeVertexDataToMesh;                                                      // 0x00BC (size: 0x1)
    uint8 bUseVertexDataForBakingMaterial;                                            // 0x00BC (size: 0x1)
    uint8 bUseTextureBinning;                                                         // 0x00BD (size: 0x1)
    uint8 bReuseMeshLightmapUVs;                                                      // 0x00BD (size: 0x1)
    uint8 bMergeEquivalentMaterials;                                                  // 0x00BD (size: 0x1)
    uint8 bUseLandscapeCulling;                                                       // 0x00BD (size: 0x1)
    uint8 bIncludeImposters;                                                          // 0x00BD (size: 0x1)
    uint8 bSupportRayTracing;                                                         // 0x00BD (size: 0x1)
    uint8 bAllowDistanceField;                                                        // 0x00BD (size: 0x1)
    FMeshNaniteSettings NaniteSettings;                                               // 0x00C0 (size: 0x40)

}; // Size: 0x108

struct FMeshNaniteSettings
{
    uint8 bEnabled;                                                                   // 0x0000 (size: 0x1)
    uint8 bPreserveArea;                                                              // 0x0000 (size: 0x1)
    uint8 bExplicitTangents;                                                          // 0x0000 (size: 0x1)
    uint8 bLerpUVs;                                                                   // 0x0000 (size: 0x1)
    int32 PositionPrecision;                                                          // 0x0004 (size: 0x4)
    int32 NormalPrecision;                                                            // 0x0008 (size: 0x4)
    int32 TangentPrecision;                                                           // 0x000C (size: 0x4)
    uint32 TargetMinimumResidencyInKB;                                                // 0x0010 (size: 0x4)
    float KeepPercentTriangles;                                                       // 0x0014 (size: 0x4)
    float TrimRelativeError;                                                          // 0x0018 (size: 0x4)
    ENaniteFallbackTarget FallbackTarget;                                             // 0x001C (size: 0x1)
    float FallbackPercentTriangles;                                                   // 0x0020 (size: 0x4)
    float FallbackRelativeError;                                                      // 0x0024 (size: 0x4)
    float MaxEdgeLengthFactor;                                                        // 0x0028 (size: 0x4)
    int32 DisplacementUVChannel;                                                      // 0x002C (size: 0x4)
    TArray<FMeshDisplacementMap> DisplacementMaps;                                    // 0x0030 (size: 0x10)

}; // Size: 0x40

struct FMeshProxySettings
{
    int32 ScreenSize;                                                                 // 0x0000 (size: 0x4)
    float VoxelSize;                                                                  // 0x0004 (size: 0x4)
    FMaterialProxySettings MaterialSettings;                                          // 0x0008 (size: 0xA0)
    float MergeDistance;                                                              // 0x00A8 (size: 0x4)
    FColor UnresolvedGeometryColor;                                                   // 0x00AC (size: 0x4)
    float MaxRayCastDist;                                                             // 0x00B0 (size: 0x4)
    float HardAngleThreshold;                                                         // 0x00B4 (size: 0x4)
    int32 LightMapResolution;                                                         // 0x00B8 (size: 0x4)
    TEnumAsByte<EProxyNormalComputationMethod::Type> NormalCalculationMethod;         // 0x00BC (size: 0x1)
    TEnumAsByte<ELandscapeCullingPrecision::Type> LandscapeCullingPrecision;          // 0x00BD (size: 0x1)
    uint8 bCalculateCorrectLODModel;                                                  // 0x00BE (size: 0x1)
    uint8 bOverrideVoxelSize;                                                         // 0x00BE (size: 0x1)
    uint8 bOverrideTransferDistance;                                                  // 0x00BE (size: 0x1)
    uint8 bUseHardAngleThreshold;                                                     // 0x00BE (size: 0x1)
    uint8 bComputeLightMapResolution;                                                 // 0x00BE (size: 0x1)
    uint8 bRecalculateNormals;                                                        // 0x00BE (size: 0x1)
    uint8 bUseLandscapeCulling;                                                       // 0x00BE (size: 0x1)
    uint8 bSupportRayTracing;                                                         // 0x00BE (size: 0x1)
    uint8 bAllowDistanceField;                                                        // 0x00BF (size: 0x1)
    uint8 bReuseMeshLightmapUVs;                                                      // 0x00BF (size: 0x1)
    uint8 bGroupIdenticalMeshesForBaking;                                             // 0x00BF (size: 0x1)
    uint8 bCreateCollision;                                                           // 0x00BF (size: 0x1)
    uint8 bAllowVertexColors;                                                         // 0x00BF (size: 0x1)
    uint8 bGenerateLightmapUVs;                                                       // 0x00BF (size: 0x1)
    FMeshNaniteSettings NaniteSettings;                                               // 0x00C0 (size: 0x40)

}; // Size: 0x100

struct FMeshReductionSettings
{
    float PercentTriangles;                                                           // 0x0000 (size: 0x4)
    uint32 MaxNumOfTriangles;                                                         // 0x0004 (size: 0x4)
    float PercentVertices;                                                            // 0x0008 (size: 0x4)
    uint32 MaxNumOfVerts;                                                             // 0x000C (size: 0x4)
    float MaxDeviation;                                                               // 0x0010 (size: 0x4)
    float PixelError;                                                                 // 0x0014 (size: 0x4)
    float WeldingThreshold;                                                           // 0x0018 (size: 0x4)
    float HardAngleThreshold;                                                         // 0x001C (size: 0x4)
    int32 BaseLODModel;                                                               // 0x0020 (size: 0x4)
    TEnumAsByte<EMeshFeatureImportance::Type> SilhouetteImportance;                   // 0x0024 (size: 0x1)
    TEnumAsByte<EMeshFeatureImportance::Type> TextureImportance;                      // 0x0025 (size: 0x1)
    TEnumAsByte<EMeshFeatureImportance::Type> ShadingImportance;                      // 0x0026 (size: 0x1)
    uint8 bRecalculateNormals;                                                        // 0x0027 (size: 0x1)
    uint8 bGenerateUniqueLightmapUVs;                                                 // 0x0027 (size: 0x1)
    uint8 bKeepSymmetry;                                                              // 0x0027 (size: 0x1)
    uint8 bVisibilityAided;                                                           // 0x0027 (size: 0x1)
    uint8 bCullOccluded;                                                              // 0x0027 (size: 0x1)
    EStaticMeshReductionTerimationCriterion TerminationCriterion;                     // 0x0028 (size: 0x1)
    TEnumAsByte<EMeshFeatureImportance::Type> VisibilityAggressiveness;               // 0x0029 (size: 0x1)
    TEnumAsByte<EMeshFeatureImportance::Type> VertexColorImportance;                  // 0x002A (size: 0x1)

}; // Size: 0x2C

struct FMeshSectionInfo
{
    int32 MaterialIndex;                                                              // 0x0000 (size: 0x4)
    bool bEnableCollision;                                                            // 0x0004 (size: 0x1)
    bool bCastShadow;                                                                 // 0x0005 (size: 0x1)
    bool bVisibleInRayTracing;                                                        // 0x0006 (size: 0x1)
    bool bAffectDistanceFieldLighting;                                                // 0x0007 (size: 0x1)
    bool bForceOpaque;                                                                // 0x0008 (size: 0x1)

}; // Size: 0xC

struct FMeshSectionInfoMap
{
    TMap<uint32, FMeshSectionInfo> Map;                                               // 0x0000 (size: 0x50)

}; // Size: 0x50

struct FMeshUVChannelInfo
{
    bool bInitialized;                                                                // 0x0000 (size: 0x1)
    bool bOverrideDensities;                                                          // 0x0001 (size: 0x1)
    float LocalUVDensities;                                                           // 0x0004 (size: 0x10)

}; // Size: 0x14

struct FMinimalViewInfo
{
    FVector Location;                                                                 // 0x0000 (size: 0x18)
    FRotator Rotation;                                                                // 0x0018 (size: 0x18)
    float FOV;                                                                        // 0x0030 (size: 0x4)
    float DesiredFOV;                                                                 // 0x0034 (size: 0x4)
    float OrthoWidth;                                                                 // 0x0038 (size: 0x4)
    bool bAutoCalculateOrthoPlanes;                                                   // 0x003C (size: 0x1)
    float AutoPlaneShift;                                                             // 0x0040 (size: 0x4)
    bool bUpdateOrthoPlanes;                                                          // 0x0044 (size: 0x1)
    bool bUseCameraHeightAsViewTarget;                                                // 0x0045 (size: 0x1)
    float OrthoNearClipPlane;                                                         // 0x0048 (size: 0x4)
    float OrthoFarClipPlane;                                                          // 0x004C (size: 0x4)
    float PerspectiveNearClipPlane;                                                   // 0x0050 (size: 0x4)
    float AspectRatio;                                                                // 0x0054 (size: 0x4)
    uint8 bConstrainAspectRatio;                                                      // 0x0060 (size: 0x1)
    uint8 bUseFieldOfViewForLOD;                                                      // 0x0060 (size: 0x1)
    TEnumAsByte<ECameraProjectionMode::Type> ProjectionMode;                          // 0x0064 (size: 0x1)
    float PostProcessBlendWeight;                                                     // 0x0068 (size: 0x4)
    FPostProcessSettings PostProcessSettings;                                         // 0x0070 (size: 0x6F0)
    FVector2D OffCenterProjectionOffset;                                              // 0x0760 (size: 0x10)

}; // Size: 0x800

struct FMirrorFindReplaceExpression
{
    FName FindExpression;                                                             // 0x0000 (size: 0x8)
    FName ReplaceExpression;                                                          // 0x0008 (size: 0x8)
    TEnumAsByte<EMirrorFindReplaceMethod::Type> FindReplaceMethod;                    // 0x0010 (size: 0x1)

}; // Size: 0x14

struct FMirrorTableRow : public FTableRowBase
{
    FName Name;                                                                       // 0x0008 (size: 0x8)
    FName MirroredName;                                                               // 0x0010 (size: 0x8)
    TEnumAsByte<EMirrorRowType::Type> MirrorEntryType;                                // 0x0018 (size: 0x1)

}; // Size: 0x20

struct FModulatorContinuousParams
{
    FName ParameterName;                                                              // 0x0000 (size: 0x8)
    float Default;                                                                    // 0x0008 (size: 0x4)
    float MinInput;                                                                   // 0x000C (size: 0x4)
    float MaxInput;                                                                   // 0x0010 (size: 0x4)
    float MinOutput;                                                                  // 0x0014 (size: 0x4)
    float MaxOutput;                                                                  // 0x0018 (size: 0x4)
    TEnumAsByte<ModulationParamMode> ParamMode;                                       // 0x001C (size: 0x1)

}; // Size: 0x20

struct FMontageBlendSettings
{
    class UBlendProfile* BlendProfile;                                                // 0x0000 (size: 0x8)
    FAlphaBlendArgs Blend;                                                            // 0x0008 (size: 0x10)
    EMontageBlendMode BlendMode;                                                      // 0x0018 (size: 0x1)

}; // Size: 0x20

struct FMovementProperties
{
    uint8 bCanCrouch;                                                                 // 0x0000 (size: 0x1)
    uint8 bCanJump;                                                                   // 0x0000 (size: 0x1)
    uint8 bCanWalk;                                                                   // 0x0000 (size: 0x1)
    uint8 bCanSwim;                                                                   // 0x0000 (size: 0x1)
    uint8 bCanFly;                                                                    // 0x0000 (size: 0x1)

}; // Size: 0x1

struct FMulticastRecordOptions
{
    FString FuncPathName;                                                             // 0x0000 (size: 0x10)
    bool bServerSkip;                                                                 // 0x0010 (size: 0x1)
    bool bClientSkip;                                                                 // 0x0011 (size: 0x1)

}; // Size: 0x18

struct FNameCurve : public FIndexedCurve
{
    TArray<FNameCurveKey> keys;                                                       // 0x0068 (size: 0x10)

}; // Size: 0x78

struct FNameCurveKey
{
    float Time;                                                                       // 0x0000 (size: 0x4)
    FName Value;                                                                      // 0x0004 (size: 0x8)

}; // Size: 0xC

struct FNameMapping
{
    FName NodeName;                                                                   // 0x0000 (size: 0x8)
    FName BoneName;                                                                   // 0x0008 (size: 0x8)

}; // Size: 0x10

struct FNamedColor
{
    FColor Value;                                                                     // 0x0000 (size: 0x4)
    FName Name;                                                                       // 0x0004 (size: 0x8)

}; // Size: 0xC

struct FNamedCurveValue
{
    FName Name;                                                                       // 0x0000 (size: 0x8)
    float Value;                                                                      // 0x0008 (size: 0x4)

}; // Size: 0xC

struct FNamedEmitterMaterial
{
    FName Name;                                                                       // 0x0000 (size: 0x8)
    class UMaterialInterface* Material;                                               // 0x0008 (size: 0x8)

}; // Size: 0x10

struct FNamedFloat
{
    float Value;                                                                      // 0x0000 (size: 0x4)
    FName Name;                                                                       // 0x0004 (size: 0x8)

}; // Size: 0xC

struct FNamedNetDriver
{
    class UNetDriver* NetDriver;                                                      // 0x0000 (size: 0x8)

}; // Size: 0x10

struct FNamedTransform
{
    FTransform Value;                                                                 // 0x0000 (size: 0x60)
    FName Name;                                                                       // 0x0060 (size: 0x8)

}; // Size: 0x70

struct FNamedVector
{
    FVector Value;                                                                    // 0x0000 (size: 0x18)
    FName Name;                                                                       // 0x0018 (size: 0x8)

}; // Size: 0x20

struct FNaniteSettings
{
    bool bAllowMaskedMaterials;                                                       // 0x0000 (size: 0x1)

}; // Size: 0x1

struct FNavAgentProperties : public FMovementProperties
{
    float AgentRadius;                                                                // 0x0004 (size: 0x4)
    float AgentHeight;                                                                // 0x0008 (size: 0x4)
    float AgentStepHeight;                                                            // 0x000C (size: 0x4)
    float NavWalkingSearchHeightScale;                                                // 0x0010 (size: 0x4)
    FSoftClassPath PreferredNavData;                                                  // 0x0018 (size: 0x20)

}; // Size: 0x38

struct FNavAgentSelector
{
    uint8 bSupportsAgent0;                                                            // 0x0000 (size: 0x1)
    uint8 bSupportsAgent1;                                                            // 0x0000 (size: 0x1)
    uint8 bSupportsAgent2;                                                            // 0x0000 (size: 0x1)
    uint8 bSupportsAgent3;                                                            // 0x0000 (size: 0x1)
    uint8 bSupportsAgent4;                                                            // 0x0000 (size: 0x1)
    uint8 bSupportsAgent5;                                                            // 0x0000 (size: 0x1)
    uint8 bSupportsAgent6;                                                            // 0x0000 (size: 0x1)
    uint8 bSupportsAgent7;                                                            // 0x0000 (size: 0x1)
    uint8 bSupportsAgent8;                                                            // 0x0001 (size: 0x1)
    uint8 bSupportsAgent9;                                                            // 0x0001 (size: 0x1)
    uint8 bSupportsAgent10;                                                           // 0x0001 (size: 0x1)
    uint8 bSupportsAgent11;                                                           // 0x0001 (size: 0x1)
    uint8 bSupportsAgent12;                                                           // 0x0001 (size: 0x1)
    uint8 bSupportsAgent13;                                                           // 0x0001 (size: 0x1)
    uint8 bSupportsAgent14;                                                           // 0x0001 (size: 0x1)
    uint8 bSupportsAgent15;                                                           // 0x0001 (size: 0x1)

}; // Size: 0x4

struct FNavAvoidanceData
{
}; // Size: 0x58

struct FNavAvoidanceMask
{
    uint8 bGroup0;                                                                    // 0x0000 (size: 0x1)
    uint8 bGroup1;                                                                    // 0x0000 (size: 0x1)
    uint8 bGroup2;                                                                    // 0x0000 (size: 0x1)
    uint8 bGroup3;                                                                    // 0x0000 (size: 0x1)
    uint8 bGroup4;                                                                    // 0x0000 (size: 0x1)
    uint8 bGroup5;                                                                    // 0x0000 (size: 0x1)
    uint8 bGroup6;                                                                    // 0x0000 (size: 0x1)
    uint8 bGroup7;                                                                    // 0x0000 (size: 0x1)
    uint8 bGroup8;                                                                    // 0x0001 (size: 0x1)
    uint8 bGroup9;                                                                    // 0x0001 (size: 0x1)
    uint8 bGroup10;                                                                   // 0x0001 (size: 0x1)
    uint8 bGroup11;                                                                   // 0x0001 (size: 0x1)
    uint8 bGroup12;                                                                   // 0x0001 (size: 0x1)
    uint8 bGroup13;                                                                   // 0x0001 (size: 0x1)
    uint8 bGroup14;                                                                   // 0x0001 (size: 0x1)
    uint8 bGroup15;                                                                   // 0x0001 (size: 0x1)
    uint8 bGroup16;                                                                   // 0x0002 (size: 0x1)
    uint8 bGroup17;                                                                   // 0x0002 (size: 0x1)
    uint8 bGroup18;                                                                   // 0x0002 (size: 0x1)
    uint8 bGroup19;                                                                   // 0x0002 (size: 0x1)
    uint8 bGroup20;                                                                   // 0x0002 (size: 0x1)
    uint8 bGroup21;                                                                   // 0x0002 (size: 0x1)
    uint8 bGroup22;                                                                   // 0x0002 (size: 0x1)
    uint8 bGroup23;                                                                   // 0x0002 (size: 0x1)
    uint8 bGroup24;                                                                   // 0x0003 (size: 0x1)
    uint8 bGroup25;                                                                   // 0x0003 (size: 0x1)
    uint8 bGroup26;                                                                   // 0x0003 (size: 0x1)
    uint8 bGroup27;                                                                   // 0x0003 (size: 0x1)
    uint8 bGroup28;                                                                   // 0x0003 (size: 0x1)
    uint8 bGroup29;                                                                   // 0x0003 (size: 0x1)
    uint8 bGroup30;                                                                   // 0x0003 (size: 0x1)
    uint8 bGroup31;                                                                   // 0x0003 (size: 0x1)

}; // Size: 0x4

struct FNavDataConfig : public FNavAgentProperties
{
    FName Name;                                                                       // 0x0038 (size: 0x8)
    FColor Color;                                                                     // 0x0040 (size: 0x4)
    FVector DefaultQueryExtent;                                                       // 0x0048 (size: 0x18)
    TSoftClassPtr<AActor> NavDataClass;                                               // 0x0060 (size: 0x28)

}; // Size: 0x88

struct FNavLinkAuxiliaryId
{
    uint64 ID;                                                                        // 0x0000 (size: 0x8)

}; // Size: 0x8

struct FNavLinkId
{
    uint64 ID;                                                                        // 0x0000 (size: 0x8)

}; // Size: 0x8

struct FNavigationLink : public FNavigationLinkBase
{
    FVector Left;                                                                     // 0x0040 (size: 0x18)
    FVector Right;                                                                    // 0x0058 (size: 0x18)

}; // Size: 0x70

struct FNavigationLinkBase
{
    float LeftProjectHeight;                                                          // 0x0000 (size: 0x4)
    float MaxFallDownLength;                                                          // 0x0004 (size: 0x4)
    float SnapRadius;                                                                 // 0x0018 (size: 0x4)
    float SnapHeight;                                                                 // 0x001C (size: 0x4)
    FNavAgentSelector SupportedAgents;                                                // 0x0020 (size: 0x4)
    uint8 bSupportsAgent0;                                                            // 0x0024 (size: 0x1)
    uint8 bSupportsAgent1;                                                            // 0x0024 (size: 0x1)
    uint8 bSupportsAgent2;                                                            // 0x0024 (size: 0x1)
    uint8 bSupportsAgent3;                                                            // 0x0024 (size: 0x1)
    uint8 bSupportsAgent4;                                                            // 0x0024 (size: 0x1)
    uint8 bSupportsAgent5;                                                            // 0x0024 (size: 0x1)
    uint8 bSupportsAgent6;                                                            // 0x0024 (size: 0x1)
    uint8 bSupportsAgent7;                                                            // 0x0024 (size: 0x1)
    uint8 bSupportsAgent8;                                                            // 0x0025 (size: 0x1)
    uint8 bSupportsAgent9;                                                            // 0x0025 (size: 0x1)
    uint8 bSupportsAgent10;                                                           // 0x0025 (size: 0x1)
    uint8 bSupportsAgent11;                                                           // 0x0025 (size: 0x1)
    uint8 bSupportsAgent12;                                                           // 0x0025 (size: 0x1)
    uint8 bSupportsAgent13;                                                           // 0x0025 (size: 0x1)
    uint8 bSupportsAgent14;                                                           // 0x0025 (size: 0x1)
    uint8 bSupportsAgent15;                                                           // 0x0025 (size: 0x1)
    TEnumAsByte<ENavLinkDirection::Type> Direction;                                   // 0x0028 (size: 0x1)
    uint8 bUseSnapHeight;                                                             // 0x0029 (size: 0x1)
    uint8 bSnapToCheapestArea;                                                        // 0x0029 (size: 0x1)
    uint8 bCustomFlag0;                                                               // 0x0029 (size: 0x1)
    uint8 bCustomFlag1;                                                               // 0x0029 (size: 0x1)
    uint8 bCustomFlag2;                                                               // 0x0029 (size: 0x1)
    uint8 bCustomFlag3;                                                               // 0x0029 (size: 0x1)
    uint8 bCustomFlag4;                                                               // 0x0029 (size: 0x1)
    uint8 bCustomFlag5;                                                               // 0x0029 (size: 0x1)
    uint8 bCustomFlag6;                                                               // 0x002A (size: 0x1)
    uint8 bCustomFlag7;                                                               // 0x002A (size: 0x1)
    TSubclassOf<class UNavAreaBase> AreaClass;                                        // 0x0030 (size: 0x8)

}; // Size: 0x40

struct FNavigationSegmentLink : public FNavigationLinkBase
{
    FVector LeftStart;                                                                // 0x0040 (size: 0x18)
    FVector LeftEnd;                                                                  // 0x0058 (size: 0x18)
    FVector RightStart;                                                               // 0x0070 (size: 0x18)
    FVector RightEnd;                                                                 // 0x0088 (size: 0x18)

}; // Size: 0xA0

struct FNetDriverDefinition
{
    FName DefName;                                                                    // 0x0000 (size: 0x8)
    FName DriverClassName;                                                            // 0x0008 (size: 0x8)
    FName DriverClassNameFallback;                                                    // 0x0010 (size: 0x8)
    int32 MaxChannelsOverride;                                                        // 0x0018 (size: 0x4)

}; // Size: 0x1C

struct FNetDriverReplicationSystemConfig
{
    uint32 MaxReplicatedObjectClientCount;                                            // 0x0000 (size: 0x4)
    uint32 MaxReplicatedObjectServerCount;                                            // 0x0004 (size: 0x4)
    uint32 PreAllocatedReplicatedObjectClientCount;                                   // 0x0008 (size: 0x4)
    uint32 PreAllocatedReplicatedObjectServerCount;                                   // 0x000C (size: 0x4)
    uint32 MaxReplicatedWriterObjectClientCount;                                      // 0x0010 (size: 0x4)
    uint32 MaxDeltaCompressedObjectCount;                                             // 0x0014 (size: 0x4)
    uint32 MaxNetObjectGroupCount;                                                    // 0x0018 (size: 0x4)

}; // Size: 0x1C

struct FNetLevelVisibilityTransactionId
{
    uint32 Data;                                                                      // 0x0000 (size: 0x4)

}; // Size: 0x4

struct FNetViewer
{
    class UNetConnection* Connection;                                                 // 0x0000 (size: 0x8)
    class AActor* InViewer;                                                           // 0x0008 (size: 0x8)
    class AActor* ViewTarget;                                                         // 0x0010 (size: 0x8)
    FVector ViewLocation;                                                             // 0x0018 (size: 0x18)
    FVector ViewDir;                                                                  // 0x0030 (size: 0x18)

}; // Size: 0x48

struct FNetworkEmulationProfileDescription
{
    FString ProfileName;                                                              // 0x0000 (size: 0x10)
    FString ToolTip;                                                                  // 0x0010 (size: 0x10)

}; // Size: 0x20

struct FNetworkMetricConfig
{
    FName MetricName;                                                                 // 0x0000 (size: 0x8)
    TSoftClassPtr<UNetworkMetricsBaseListener> Class;                                 // 0x0008 (size: 0x28)
    ENetworkMetricEnableMode EnableMode;                                              // 0x0030 (size: 0x1)

}; // Size: 0x38

struct FNetworkPhysicsData
{
    int32 ServerFrame;                                                                // 0x0008 (size: 0x4)
    int32 LocalFrame;                                                                 // 0x000C (size: 0x4)
    int32 InputFrame;                                                                 // 0x0010 (size: 0x4)

}; // Size: 0x18

struct FNetworkPhysicsDatas : public FNetworkPhysicsData
{
}; // Size: 0x18

struct FNetworkPhysicsRewindDataInputProxy : public FNetworkPhysicsRewindDataProxy
{
}; // Size: 0x10

struct FNetworkPhysicsRewindDataProxy
{
    class UNetworkPhysicsComponent* Owner;                                            // 0x0008 (size: 0x8)

}; // Size: 0x10

struct FNetworkPhysicsRewindDataStateProxy : public FNetworkPhysicsRewindDataProxy
{
}; // Size: 0x10

struct FNetworkPhysicsSettings
{
    uint8 bOverrideSimProxyRepMode;                                                   // 0x0000 (size: 0x1)
    EPhysicsReplicationMode SimProxyRepMode;                                          // 0x0004 (size: 0x1)

}; // Size: 0x8

struct FNetworkPhysicsSettingsPredictiveInterpolation
{
    uint8 bOverridePosCorrectionTimeBase;                                             // 0x0000 (size: 0x1)
    float PosCorrectionTimeBase;                                                      // 0x0004 (size: 0x4)
    uint8 bOverridePosCorrectionTimeMin;                                              // 0x0008 (size: 0x1)
    float PosCorrectionTimeMin;                                                       // 0x000C (size: 0x4)
    uint8 bOverridePosCorrectionTimeMultiplier;                                       // 0x0010 (size: 0x1)
    float PosCorrectionTimeMultiplier;                                                // 0x0014 (size: 0x4)
    uint8 bOverrideRotCorrectionTimeBase;                                             // 0x0018 (size: 0x1)
    float RotCorrectionTimeBase;                                                      // 0x001C (size: 0x4)
    uint8 bOverrideRotCorrectionTimeMin;                                              // 0x0020 (size: 0x1)
    float RotCorrectionTimeMin;                                                       // 0x0024 (size: 0x4)
    uint8 bOverrideRotCorrectionTimeMultiplier;                                       // 0x0028 (size: 0x1)
    float RotCorrectionTimeMultiplier;                                                // 0x002C (size: 0x4)
    uint8 bOverridePosInterpolationTimeMultiplier;                                    // 0x0030 (size: 0x1)
    float PosInterpolationTimeMultiplier;                                             // 0x0034 (size: 0x4)
    uint8 bOverrideRotInterpolationTimeMultiplier;                                    // 0x0038 (size: 0x1)
    float RotInterpolationTimeMultiplier;                                             // 0x003C (size: 0x4)
    uint8 bOverrideSoftSnapPosStrength;                                               // 0x0040 (size: 0x1)
    float SoftSnapPosStrength;                                                        // 0x0044 (size: 0x4)
    uint8 bOverrideSoftSnapRotStrength;                                               // 0x0048 (size: 0x1)
    float SoftSnapRotStrength;                                                        // 0x004C (size: 0x4)
    uint8 bOverrideSoftSnapToSource;                                                  // 0x0050 (size: 0x1)
    bool bSoftSnapToSource;                                                           // 0x0054 (size: 0x1)
    uint8 bOverrideSkipVelocityRepOnPosEarlyOut;                                      // 0x0058 (size: 0x1)
    bool bSkipVelocityRepOnPosEarlyOut;                                               // 0x005C (size: 0x1)
    uint8 bOverridePostResimWaitForUpdate;                                            // 0x0060 (size: 0x1)
    bool bPostResimWaitForUpdate;                                                     // 0x0064 (size: 0x1)
    uint8 bOverrideDisableSoftSnap;                                                   // 0x0068 (size: 0x1)
    bool bDisableSoftSnap;                                                            // 0x006C (size: 0x1)

}; // Size: 0x70

struct FNetworkPhysicsSettingsResimulation
{
    uint8 bOverrideRedundantInputs;                                                   // 0x0000 (size: 0x1)
    uint8 RedundantInputs;                                                            // 0x0004 (size: 0x1)
    uint8 bOverrideRedundantStates;                                                   // 0x0008 (size: 0x1)
    uint8 RedundantStates;                                                            // 0x000C (size: 0x1)
    uint8 bOverrideRuntimeCorrectionEnabled;                                          // 0x0010 (size: 0x1)
    bool bRuntimeCorrectionEnabled;                                                   // 0x0014 (size: 0x1)
    uint8 bOverrideRuntimeVelocityCorrection;                                         // 0x0018 (size: 0x1)
    bool bRuntimeVelocityCorrection;                                                  // 0x001C (size: 0x1)
    uint8 bOverridePosStabilityMultiplier;                                            // 0x0020 (size: 0x1)
    float PosStabilityMultiplier;                                                     // 0x0024 (size: 0x4)
    uint8 bOverrideRotStabilityMultiplier;                                            // 0x0028 (size: 0x1)
    float RotStabilityMultiplier;                                                     // 0x002C (size: 0x4)
    uint8 bOverrideVelStabilityMultiplier;                                            // 0x0030 (size: 0x1)
    float VelStabilityMultiplier;                                                     // 0x0034 (size: 0x4)
    uint8 bOverrideAngVelStabilityMultiplier;                                         // 0x0038 (size: 0x1)
    float AngVelStabilityMultiplier;                                                  // 0x003C (size: 0x4)
    uint8 bOverrideResimulationErrorThreshold;                                        // 0x0040 (size: 0x1)
    uint32 ResimulationErrorThreshold;                                                // 0x0044 (size: 0x4)
    uint8 bOverrideCompareStateToTriggerRewind;                                       // 0x0048 (size: 0x1)
    bool bCompareStateToTriggerRewind;                                                // 0x004C (size: 0x1)
    uint8 bOverrideCompareInputToTriggerRewind;                                       // 0x0050 (size: 0x1)
    bool bCompareInputToTriggerRewind;                                                // 0x0054 (size: 0x1)

}; // Size: 0x58

struct FNeuralProfileStruct
{
    ENeuralProfileFormat InputFormat;                                                 // 0x0000 (size: 0x1)
    ENeuralProfileFormat OutputFormat;                                                // 0x0001 (size: 0x1)
    ENeuralProfileRuntimeType RuntimeType;                                            // 0x0002 (size: 0x1)
    class UObject* NNEModelData;                                                      // 0x0008 (size: 0x8)
    FIntVector4 InputDimension;                                                       // 0x0010 (size: 0x10)
    FIntVector4 OutputDimension;                                                      // 0x0020 (size: 0x10)
    int32 BatchSizeOverride;                                                          // 0x0030 (size: 0x4)
    ENeuralModelTileType TileSize;                                                    // 0x0034 (size: 0x1)
    FIntPoint TileOverlap;                                                            // 0x0038 (size: 0x8)
    ETileOverlapResolveType TileOverlapResolveType;                                   // 0x0040 (size: 0x1)

}; // Size: 0x48

struct FNewLevelInstanceParams
{
    ELevelInstanceCreationType Type;                                                  // 0x0000 (size: 0x1)
    ELevelInstancePivotType PivotType;                                                // 0x0001 (size: 0x1)
    class AActor* PivotActor;                                                         // 0x0008 (size: 0x8)
    bool bAlwaysShowDialog;                                                           // 0x0010 (size: 0x1)
    class UWorld* TemplateWorld;                                                      // 0x0018 (size: 0x8)
    FString LevelPackageName;                                                         // 0x0020 (size: 0x10)
    bool bPromptForSave;                                                              // 0x0030 (size: 0x1)
    TSubclassOf<class AActor> LevelInstanceClass;                                     // 0x0038 (size: 0x8)
    bool bEnableStreaming;                                                            // 0x0040 (size: 0x1)
    bool bExternalActors;                                                             // 0x0041 (size: 0x1)
    bool bForceExternalActors;                                                        // 0x0042 (size: 0x1)
    bool bHideCreationType;                                                           // 0x0043 (size: 0x1)

}; // Size: 0x48

struct FNodeItem
{
    FName ParentName;                                                                 // 0x0000 (size: 0x8)
    FTransform Transform;                                                             // 0x0010 (size: 0x60)

}; // Size: 0x70

struct FNodeToCodeAssociation
{
}; // Size: 0x14

struct FNonBlendableFloatAnimationAttribute : public FFloatAnimationAttribute
{
}; // Size: 0x4

struct FNonBlendableIntegerAnimationAttribute : public FIntegerAnimationAttribute
{
}; // Size: 0x4

struct FNonBlendableQuaternionAnimationAttribute : public FQuaternionAnimationAttribute
{
}; // Size: 0x20

struct FNonBlendableTransformAnimationAttribute : public FTransformAnimationAttribute
{
}; // Size: 0x60

struct FNonBlendableVectorAnimationAttribute : public FVectorAnimationAttribute
{
}; // Size: 0x18

struct FOrbitOptions
{
    uint8 bProcessDuringSpawn;                                                        // 0x0000 (size: 0x1)
    uint8 bProcessDuringUpdate;                                                       // 0x0000 (size: 0x1)
    uint8 bUseEmitterTime;                                                            // 0x0000 (size: 0x1)

}; // Size: 0x4

struct FOverlapResult
{
    FActorInstanceHandle OverlapObjectHandle;                                         // 0x0000 (size: 0x20)
    TWeakObjectPtr<class UPrimitiveComponent> Component;                              // 0x0020 (size: 0x8)
    uint8 bBlockingHit;                                                               // 0x0038 (size: 0x1)

}; // Size: 0x40

struct FPOV
{
    FVector Location;                                                                 // 0x0000 (size: 0x18)
    FRotator Rotation;                                                                // 0x0018 (size: 0x18)
    float FOV;                                                                        // 0x0030 (size: 0x4)

}; // Size: 0x38

struct FPSCPool
{
    TArray<FPSCPoolElem> FreeElements;                                                // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FPSCPoolElem
{
    class UParticleSystemComponent* PSC;                                              // 0x0000 (size: 0x8)

}; // Size: 0x10

struct FPacketSimulationSettings
{
    int32 PktLoss;                                                                    // 0x0000 (size: 0x4)
    int32 PktLossMaxSize;                                                             // 0x0004 (size: 0x4)
    int32 PktLossMinSize;                                                             // 0x0008 (size: 0x4)
    int32 PktOrder;                                                                   // 0x000C (size: 0x4)
    int32 PktDup;                                                                     // 0x0010 (size: 0x4)
    int32 PktLag;                                                                     // 0x0014 (size: 0x4)
    int32 PktLagVariance;                                                             // 0x0018 (size: 0x4)
    int32 PktLagMin;                                                                  // 0x001C (size: 0x4)
    int32 PktLagMax;                                                                  // 0x0020 (size: 0x4)
    int32 PktIncomingLagMin;                                                          // 0x0024 (size: 0x4)
    int32 PktIncomingLagMax;                                                          // 0x0028 (size: 0x4)
    int32 PktIncomingLoss;                                                            // 0x002C (size: 0x4)
    int32 PktJitter;                                                                  // 0x0030 (size: 0x4)

}; // Size: 0x34

struct FPaintedVertex
{
    FVector Position;                                                                 // 0x0000 (size: 0x18)
    FColor Color;                                                                     // 0x0018 (size: 0x4)
    FVector4 Normal;                                                                  // 0x0020 (size: 0x20)

}; // Size: 0x40

struct FParameterChannelNames
{
    FText R;                                                                          // 0x0000 (size: 0x10)
    FText G;                                                                          // 0x0010 (size: 0x10)
    FText B;                                                                          // 0x0020 (size: 0x10)
    FText A;                                                                          // 0x0030 (size: 0x10)

}; // Size: 0x40

struct FParameterGroupData
{
    FString GroupName;                                                                // 0x0000 (size: 0x10)
    int32 GroupSortPriority;                                                          // 0x0010 (size: 0x4)

}; // Size: 0x18

struct FParticleBurst
{
    int32 Count;                                                                      // 0x0000 (size: 0x4)
    int32 CountLow;                                                                   // 0x0004 (size: 0x4)
    float Time;                                                                       // 0x0008 (size: 0x4)

}; // Size: 0xC

struct FParticleCurvePair
{
    FString CurveName;                                                                // 0x0000 (size: 0x10)
    class UObject* CurveObject;                                                       // 0x0010 (size: 0x8)

}; // Size: 0x18

struct FParticleEditorPromotionSettings
{
