#ifndef UE4SS_SDK_Mantle_Asset_HPP
#define UE4SS_SDK_Mantle_Asset_HPP

struct FMantle_Asset
{
    class UAnimMontage* AnimMontage_42_63D6D9044A5DAB0EFBDC858CD9E37736;              // 0x0000 (size: 0x8)
    class UCurveVector* PositionCorrectionCurve_43_0A4924AE48051202994680A7CE2D2C3A;  // 0x0008 (size: 0x8)
    FVector StartingOffset_30_FA0FF9D34F3BA3C50CF7C3928E516172;                       // 0x0010 (size: 0x18)
    float LowHeight_21_5CC2462A4191A12ECA9BDE85FA26C424;                              // 0x0028 (size: 0x4)
    float LowPlayRate_37_391A50444B0AD0F7DD66A9BE9C6C65CA;                            // 0x002C (size: 0x4)
    float LowStartPosition_22_17AF0D8346D9E966FE520FB93F149B66;                       // 0x0030 (size: 0x4)
    float HighHeight_23_8A8982FC42C3B6CDF79429B8675C86D9;                             // 0x0034 (size: 0x4)
    float HighPlayRate_39_7ABB38D5459C2FE20D6A24AB7820B2FD;                           // 0x0038 (size: 0x4)
    float HighStartPosition_24_D005813041B0EAEEB90490A469911497;                      // 0x003C (size: 0x4)

}; // Size: 0x40

#endif
