#ifndef UE4SS_SDK_Resource_Fish_HPP
#define UE4SS_SDK_Resource_Fish_HPP

class AResource_Fish_C : public AResource
{
    class USceneComponent* workpos_drought_tagged;                                    // 0x0328 (size: 0x8)
    class USceneComponent* workpos_tagged;                                            // 0x0330 (size: 0x8)
    class UStaticMeshComponent* berries5;                                             // 0x0338 (size: 0x8)
    class UStaticMeshComponent* berries4;                                             // 0x0340 (size: 0x8)
    class UStaticMeshComponent* berries3;                                             // 0x0348 (size: 0x8)
    class UStaticMeshComponent* berries2;                                             // 0x0350 (size: 0x8)
    class UStaticMeshComponent* berries1;                                             // 0x0358 (size: 0x8)
    class UStaticMeshComponent* berries_01;                                           // 0x0360 (size: 0x8)
    class UStaticMeshComponent* berries;                                              // 0x0368 (size: 0x8)

}; // Size: 0x370

#endif
