#ifndef UE4SS_SDK_BM_MarketStall_HPP
#define UE4SS_SDK_BM_MarketStall_HPP

class ABM_MarketStall_C : public AStaticMeshActor
{
    class USceneComponent* pickup_B_editorOnly;                                       // 0x02A0 (size: 0x8)
    class USceneComponent* pickup_A_editorOnly;                                       // 0x02A8 (size: 0x8)
    class USceneComponent* workpos_B_editorOnly;                                      // 0x02B0 (size: 0x8)
    class USceneComponent* workpos_A_editorOnly;                                      // 0x02B8 (size: 0x8)
    class UStaticMeshComponent* dirt_4_3;                                             // 0x02C0 (size: 0x8)
    class USceneComponent* gathering;                                                 // 0x02C8 (size: 0x8)
    class UStaticMeshComponent* Dirt_0_1;                                             // 0x02D0 (size: 0x8)
    class UStaticMeshComponent* MainBld_33;                                           // 0x02D8 (size: 0x8)

}; // Size: 0x2E0

#endif
