#ifndef UE4SS_SDK_BM_SG_Townhouse_LV3_EmptyBPart_3_Narrow_HPP
#define UE4SS_SDK_BM_SG_Townhouse_LV3_EmptyBPart_3_Narrow_HPP

class ABM_SG_Townhouse_LV3_EmptyBPart_3_Narrow_C : public AStaticMeshActor
{
    class UStaticMeshComponent* clutter_10;                                           // 0x02A0 (size: 0x8)
    class UStaticMeshComponent* clutter_9;                                            // 0x02A8 (size: 0x8)
    class UStaticMeshComponent* clutter_45;                                           // 0x02B0 (size: 0x8)
    class UStaticMeshComponent* clutter_12;                                           // 0x02B8 (size: 0x8)
    class UStaticMeshComponent* Dirt_0_0;                                             // 0x02C0 (size: 0x8)
    class UStaticMeshComponent* MainBld_466;                                          // 0x02C8 (size: 0x8)
    class UStaticMeshComponent* clutter_16;                                           // 0x02D0 (size: 0x8)
    class USceneComponent* Scene;                                                     // 0x02D8 (size: 0x8)

}; // Size: 0x2E0

#endif
