#ifndef UE4SS_SDK_BM_SG_FishermansHut_HPP
#define UE4SS_SDK_BM_SG_FishermansHut_HPP

class ABM_SG_FishermansHut_C : public AStaticMeshActor
{
    class UStaticMeshComponent* Dirt_0_10;                                            // 0x02A0 (size: 0x8)
    class UStaticMeshComponent* clutter_bag_16;                                       // 0x02A8 (size: 0x8)
    class UStaticMeshComponent* clutter_bag_15;                                       // 0x02B0 (size: 0x8)
    class UStaticMeshComponent* clutter_bush11;                                       // 0x02B8 (size: 0x8)
    class UStaticMeshComponent* clutter_11;                                           // 0x02C0 (size: 0x8)
    class UStaticMeshComponent* clutter_FishingTrap1;                                 // 0x02C8 (size: 0x8)
    class UStaticMeshComponent* clutter_FishingTrap;                                  // 0x02D0 (size: 0x8)
    class UStaticMeshComponent* clutter_FishingNetStick;                              // 0x02D8 (size: 0x8)
    class UStaticMeshComponent* fullBld_431;                                          // 0x02E0 (size: 0x8)
    class UStaticMeshComponent* clutter_10;                                           // 0x02E8 (size: 0x8)
    class UStaticMeshComponent* clutter_32;                                           // 0x02F0 (size: 0x8)
    class UStaticMeshComponent* clutter_FishingBoat;                                  // 0x02F8 (size: 0x8)
    class UStaticMeshComponent* bench_11_4;                                           // 0x0300 (size: 0x8)
    class UStaticMeshComponent* bench_11_3;                                           // 0x0308 (size: 0x8)
    class UStaticMeshComponent* Dirt_3_3;                                             // 0x0310 (size: 0x8)
    class UStaticMeshComponent* bench_23_3;                                           // 0x0318 (size: 0x8)
    class UStaticMeshComponent* Dirt_0_9;                                             // 0x0320 (size: 0x8)
    class UStaticMeshComponent* Dirt_0_8;                                             // 0x0328 (size: 0x8)
    class UStaticMeshComponent* dirt_4_6;                                             // 0x0330 (size: 0x8)
    class UStaticMeshComponent* Dirt_3_1;                                             // 0x0338 (size: 0x8)
    class UStaticMeshComponent* Dirt_1_3;                                             // 0x0340 (size: 0x8)
    class UStaticMeshComponent* bench_11_2;                                           // 0x0348 (size: 0x8)
    class UStaticMeshComponent* clutter_bush10;                                       // 0x0350 (size: 0x8)
    class UStaticMeshComponent* clutter_bush9;                                        // 0x0358 (size: 0x8)
    class UStaticMeshComponent* clutter_bush8;                                        // 0x0360 (size: 0x8)
    class UStaticMeshComponent* clutter_bush7;                                        // 0x0368 (size: 0x8)
    class UStaticMeshComponent* clutter_bush6;                                        // 0x0370 (size: 0x8)
    class UStaticMeshComponent* clutter_bush5;                                        // 0x0378 (size: 0x8)
    class UStaticMeshComponent* clutter_bush4;                                        // 0x0380 (size: 0x8)
    class UStaticMeshComponent* clutter_bush3;                                        // 0x0388 (size: 0x8)
    class UStaticMeshComponent* clutter_bush2;                                        // 0x0390 (size: 0x8)
    class UStaticMeshComponent* Bld_401_16;                                           // 0x0398 (size: 0x8)
    class UStaticMeshComponent* Bld_401_15;                                           // 0x03A0 (size: 0x8)
    class UStaticMeshComponent* Bld_401_14;                                           // 0x03A8 (size: 0x8)
    class UStaticMeshComponent* Bld_401_13;                                           // 0x03B0 (size: 0x8)
    class UStaticMeshComponent* Bld_401_12;                                           // 0x03B8 (size: 0x8)
    class UStaticMeshComponent* Bld_401_11;                                           // 0x03C0 (size: 0x8)
    class UStaticMeshComponent* Bld_401_10;                                           // 0x03C8 (size: 0x8)
    class UStaticMeshComponent* Bld_401_9;                                            // 0x03D0 (size: 0x8)
    class UStaticMeshComponent* MainBld_414;                                          // 0x03D8 (size: 0x8)
    class UStaticMeshComponent* bld_0_6;                                              // 0x03E0 (size: 0x8)

}; // Size: 0x3E8

#endif
