#ifndef UE4SS_SDK_c_campfire_HPP
#define UE4SS_SDK_c_campfire_HPP

class Ac_campfire_C : public AConstructionBP_C
{
    class UStaticMeshComponent* rop1;                                                 // 0x0550 (size: 0x8)
    class UStaticMeshComponent* rop;                                                  // 0x0558 (size: 0x8)
    class UStaticMeshComponent* Sctr_rock_granite_T_phxuF_LOD5_21_StaticMeshComponent0; // 0x0560 (size: 0x8)
    class UStaticMeshComponent* Sctr_rock_granite_T_phxuF_LOD5_2_StaticMeshComponent0; // 0x0568 (size: 0x8)
    class UStaticMeshComponent* Sctr_rock_granite_T_phxuF_LOD5_14_StaticMeshComponent0; // 0x0570 (size: 0x8)
    class UStaticMeshComponent* Sctr_rock_granite_T_phxuF_LOD5_15_StaticMeshComponent0; // 0x0578 (size: 0x8)
    class UStaticMeshComponent* Sctr_rock_granite_T_phxuF_LOD5_16_StaticMeshComponent0; // 0x0580 (size: 0x8)
    class UStaticMeshComponent* Sctr_rock_granite_T_phxuF_LOD5_17_StaticMeshComponent0; // 0x0588 (size: 0x8)
    class UStaticMeshComponent* Sctr_rock_granite_T_phxuF_LOD5_18_StaticMeshComponent0; // 0x0590 (size: 0x8)
    class UStaticMeshComponent* Sctr_rock_granite_T_phxuF_LOD5_19_StaticMeshComponent0; // 0x0598 (size: 0x8)
    class UStaticMeshComponent* Sctr_rock_granite_T_phxuF_LOD5_20_StaticMeshComponent0; // 0x05A0 (size: 0x8)
    class UStaticMeshComponent* Sctr_rock_granite_T_phxuF_LOD5_1_StaticMeshComponent0; // 0x05A8 (size: 0x8)
    class UStaticMeshComponent* Aset_rock_granite_M_raBbf_LOD5_StaticMeshComponent0;  // 0x05B0 (size: 0x8)
    class UStaticMeshComponent* fire_StaticMeshComponent0;                            // 0x05B8 (size: 0x8)
    class UStaticMeshComponent* fire3_StaticMeshComponent0;                           // 0x05C0 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed90_StaticMeshComponent0;           // 0x05C8 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed119_StaticMeshComponent0;          // 0x05D0 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed120_StaticMeshComponent0;          // 0x05D8 (size: 0x8)
    class UStaticMeshComponent* Firewood_Pack_LOD5_vbwhfi1iw_11_StaticMeshComponent0; // 0x05E0 (size: 0x8)
    class UStaticMeshComponent* Firewood_Pack_LOD5_vbwhfi1iw_12_StaticMeshComponent0; // 0x05E8 (size: 0x8)
    class UStaticMeshComponent* Firewood_Pack_LOD5_vbwhfi1iw_13_StaticMeshComponent0; // 0x05F0 (size: 0x8)
    class USceneComponent* campfire_DefaultSceneRoot;                                 // 0x05F8 (size: 0x8)

}; // Size: 0x600

#endif
