#ifndef UE4SS_SDK_C_Extension_Goat_HPP
#define UE4SS_SDK_C_Extension_Goat_HPP

class AC_Extension_Goat_C : public AConstructionBP_C
{
    class UStaticMeshComponent* all_aboard_longboardA134_StaticMeshComponent0;        // 0x0550 (size: 0x8)
    class UStaticMeshComponent* all_aboard_longboardA133_StaticMeshComponent0;        // 0x0558 (size: 0x8)
    class UStaticMeshComponent* SM_Rope4_StaticMeshComponent0;                        // 0x0560 (size: 0x8)
    class UStaticMeshComponent* all_aboard_longboardA132_StaticMeshComponent0;        // 0x0568 (size: 0x8)
    class UStaticMeshComponent* fence_A36_StaticMeshComponent0;                       // 0x0570 (size: 0x8)
    class UStaticMeshComponent* all_aboard_longboardA131_StaticMeshComponent0;        // 0x0578 (size: 0x8)
    class UStaticMeshComponent* all_aboard_longboardA130_StaticMeshComponent0;        // 0x0580 (size: 0x8)
    class UStaticMeshComponent* SM_MERGED_tubWater_12_StaticMeshComponent0;           // 0x0588 (size: 0x8)
    class UStaticMeshComponent* dirtHeapA101_StaticMeshComponent0;                    // 0x0590 (size: 0x8)
    class UStaticMeshComponent* bag31_StaticMeshComponent0;                           // 0x0598 (size: 0x8)
    class UStaticMeshComponent* Wooden_Container_LOD5_ueihfisfa10_StaticMeshComponent0; // 0x05A0 (size: 0x8)
    class UStaticMeshComponent* Wooden_Container_LOD5_ueihfisfa9_StaticMeshComponent0; // 0x05A8 (size: 0x8)
    class UStaticMeshComponent* dirtHeapA100_StaticMeshComponent0;                    // 0x05B0 (size: 0x8)
    class UStaticMeshComponent* dirtHeapA99_StaticMeshComponent0;                     // 0x05B8 (size: 0x8)
    class UStaticMeshComponent* SM_Rope13_StaticMeshComponent0;                       // 0x05C0 (size: 0x8)
    class UStaticMeshComponent* SM_Rope12_StaticMeshComponent0;                       // 0x05C8 (size: 0x8)
    class UStaticMeshComponent* dirtHeapA98_StaticMeshComponent0;                     // 0x05D0 (size: 0x8)
    class UStaticMeshComponent* ubupeirfa_LOD5_bucket3_StaticMeshComponent0;          // 0x05D8 (size: 0x8)
    class UStaticMeshComponent* dirtHeapA97_StaticMeshComponent0;                     // 0x05E0 (size: 0x8)
    class UStaticMeshComponent* dirtHeapA96_StaticMeshComponent0;                     // 0x05E8 (size: 0x8)
    class UStaticMeshComponent* dirtHeapA95_StaticMeshComponent0;                     // 0x05F0 (size: 0x8)
    class UStaticMeshComponent* all_aboard_longboardC4_StaticMeshComponent0;          // 0x05F8 (size: 0x8)
    class UStaticMeshComponent* all_aboard_longboardC3_StaticMeshComponent0;          // 0x0600 (size: 0x8)
    class UStaticMeshComponent* fence_A35_StaticMeshComponent0;                       // 0x0608 (size: 0x8)
    class UStaticMeshComponent* fence_A34_StaticMeshComponent0;                       // 0x0610 (size: 0x8)
    class UStaticMeshComponent* fence_A33_StaticMeshComponent0;                       // 0x0618 (size: 0x8)
    class UStaticMeshComponent* fence_A32_StaticMeshComponent0;                       // 0x0620 (size: 0x8)
    class UStaticMeshComponent* fence_A31_StaticMeshComponent0;                       // 0x0628 (size: 0x8)
    class UStaticMeshComponent* fence_A30_StaticMeshComponent0;                       // 0x0630 (size: 0x8)
    class UStaticMeshComponent* dirtHeapA94_StaticMeshComponent0;                     // 0x0638 (size: 0x8)
    class UStaticMeshComponent* fence_A29_StaticMeshComponent0;                       // 0x0640 (size: 0x8)
    class UStaticMeshComponent* fence_A28_StaticMeshComponent0;                       // 0x0648 (size: 0x8)
    class UStaticMeshComponent* fence_A27_StaticMeshComponent0;                       // 0x0650 (size: 0x8)
    class UStaticMeshComponent* fence_A26_StaticMeshComponent0;                       // 0x0658 (size: 0x8)
    class UStaticMeshComponent* fence_A25_StaticMeshComponent0;                       // 0x0660 (size: 0x8)
    class UStaticMeshComponent* fence_A24_StaticMeshComponent0;                       // 0x0668 (size: 0x8)
    class UStaticMeshComponent* fence_A23_StaticMeshComponent0;                       // 0x0670 (size: 0x8)
    class UStaticMeshComponent* fence_A22_StaticMeshComponent0;                       // 0x0678 (size: 0x8)
    class UStaticMeshComponent* fence_A21_StaticMeshComponent0;                       // 0x0680 (size: 0x8)
    class UStaticMeshComponent* fence_A20_StaticMeshComponent0;                       // 0x0688 (size: 0x8)
    class UStaticMeshComponent* fence_A19_StaticMeshComponent0;                       // 0x0690 (size: 0x8)
    class UStaticMeshComponent* all_aboard_longboardA129_StaticMeshComponent0;        // 0x0698 (size: 0x8)
    class UStaticMeshComponent* all_aboard_longboardA128_StaticMeshComponent0;        // 0x06A0 (size: 0x8)
    class UStaticMeshComponent* all_aboard_longboardA127_StaticMeshComponent0;        // 0x06A8 (size: 0x8)
    class UStaticMeshComponent* all_aboard_longboardA126_StaticMeshComponent0;        // 0x06B0 (size: 0x8)
    class UStaticMeshComponent* all_aboard_longboardA125_StaticMeshComponent0;        // 0x06B8 (size: 0x8)
    class UStaticMeshComponent* all_aboard_longboardA124_StaticMeshComponent0;        // 0x06C0 (size: 0x8)
    class UStaticMeshComponent* all_aboard_longboardA123_StaticMeshComponent0;        // 0x06C8 (size: 0x8)
    class UStaticMeshComponent* all_aboard_longboardA122_StaticMeshComponent0;        // 0x06D0 (size: 0x8)
    class UStaticMeshComponent* all_aboard_longboardA121_StaticMeshComponent0;        // 0x06D8 (size: 0x8)
    class UStaticMeshComponent* all_aboard_longboardA120_StaticMeshComponent0;        // 0x06E0 (size: 0x8)
    class UStaticMeshComponent* all_aboard_longboardA119_StaticMeshComponent0;        // 0x06E8 (size: 0x8)
    class UStaticMeshComponent* all_aboard_longboardA118_StaticMeshComponent0;        // 0x06F0 (size: 0x8)
    class UStaticMeshComponent* all_aboard_longboardA117_StaticMeshComponent0;        // 0x06F8 (size: 0x8)
    class UStaticMeshComponent* all_aboard_longboardA116_StaticMeshComponent0;        // 0x0700 (size: 0x8)
    class UStaticMeshComponent* all_aboard_longboardA115_StaticMeshComponent0;        // 0x0708 (size: 0x8)
    class UStaticMeshComponent* all_aboard_longboardA114_StaticMeshComponent0;        // 0x0710 (size: 0x8)
    class UStaticMeshComponent* all_aboard_longboardA108_StaticMeshComponent0;        // 0x0718 (size: 0x8)
    class UStaticMeshComponent* all_aboard_longboardA107_StaticMeshComponent0;        // 0x0720 (size: 0x8)
    class UStaticMeshComponent* stick_heap9_StaticMeshComponent0;                     // 0x0728 (size: 0x8)
    class UStaticMeshComponent* stick_heap8_StaticMeshComponent0;                     // 0x0730 (size: 0x8)
    class UStaticMeshComponent* stick_heap7_StaticMeshComponent0;                     // 0x0738 (size: 0x8)
    class UStaticMeshComponent* dirtHeapA93_StaticMeshComponent0;                     // 0x0740 (size: 0x8)
    class UStaticMeshComponent* dirtHeapA92_StaticMeshComponent0;                     // 0x0748 (size: 0x8)
    class UStaticMeshComponent* bag30_StaticMeshComponent0;                           // 0x0750 (size: 0x8)
    class UStaticMeshComponent* bag29_StaticMeshComponent0;                           // 0x0758 (size: 0x8)
    class UStaticMeshComponent* Wooden_Container_LOD5_ueihfisfa8_StaticMeshComponent0; // 0x0760 (size: 0x8)
    class UStaticMeshComponent* Wooden_Container_LOD5_ueihfisfa7_StaticMeshComponent0; // 0x0768 (size: 0x8)
    class UStaticMeshComponent* all_aboard_longboardA106_StaticMeshComponent0;        // 0x0770 (size: 0x8)
    class UStaticMeshComponent* all_aboard_longboardA105_StaticMeshComponent0;        // 0x0778 (size: 0x8)
    class UStaticMeshComponent* all_aboard_longboardA104_StaticMeshComponent0;        // 0x0780 (size: 0x8)
    class UStaticMeshComponent* thatchModuleSmall4_StaticMeshComponent0;              // 0x0788 (size: 0x8)
    class UStaticMeshComponent* all_aboard_longboardA103_StaticMeshComponent0;        // 0x0790 (size: 0x8)
    class USceneComponent* extensionGoat2_DefaultSceneRoot;                           // 0x0798 (size: 0x8)

}; // Size: 0x7A0

#endif
