#ifndef UE4SS_SDK_C_outpost_HPP
#define UE4SS_SDK_C_outpost_HPP

class AC_outpost_C : public AConstructionBP_C
{
    class USceneComponent* fireplace3_Default Root Component;                         // 0x0550 (size: 0x8)
    class UStaticMeshComponent* tentsAllCentered_Object3_StaticMeshComponent0;        // 0x0558 (size: 0x8)
    class UStaticMeshComponent* tentsAllCentered_Object99_StaticMeshComponent0;       // 0x0560 (size: 0x8)
    class UStaticMeshComponent* tentsAllCentered_Object100_StaticMeshComponent0;      // 0x0568 (size: 0x8)
    class UStaticMeshComponent* tentsAllCentered_Object101_StaticMeshComponent0;      // 0x0570 (size: 0x8)
    class UStaticMeshComponent* tentsAllCentered_Object102_StaticMeshComponent0;      // 0x0578 (size: 0x8)
    class UStaticMeshComponent* tentsAllCentered_Object103_StaticMeshComponent0;      // 0x0580 (size: 0x8)
    class UStaticMeshComponent* tentsAllCentered_Object104_StaticMeshComponent0;      // 0x0588 (size: 0x8)
    class UStaticMeshComponent* tentsAllCentered_Object105_StaticMeshComponent0;      // 0x0590 (size: 0x8)
    class UStaticMeshComponent* tentsAllCentered_Object106_StaticMeshComponent0;      // 0x0598 (size: 0x8)
    class UStaticMeshComponent* tentsAllCentered_Object107_StaticMeshComponent0;      // 0x05A0 (size: 0x8)
    class UStaticMeshComponent* tentsAllCentered_Object108_StaticMeshComponent0;      // 0x05A8 (size: 0x8)
    class UStaticMeshComponent* tentsAllCentered_Object109_StaticMeshComponent0;      // 0x05B0 (size: 0x8)
    class UStaticMeshComponent* tentsAllCentered_Object110_StaticMeshComponent0;      // 0x05B8 (size: 0x8)
    class UStaticMeshComponent* tentsAllCentered_Object111_StaticMeshComponent0;      // 0x05C0 (size: 0x8)
    class UStaticMeshComponent* tentsAllCentered_Object112_StaticMeshComponent0;      // 0x05C8 (size: 0x8)
    class UStaticMeshComponent* tentsAllCentered_Object113_StaticMeshComponent0;      // 0x05D0 (size: 0x8)
    class UStaticMeshComponent* tentsAllCentered_Object114_StaticMeshComponent0;      // 0x05D8 (size: 0x8)
    class UStaticMeshComponent* tentsAllCentered_Object115_StaticMeshComponent0;      // 0x05E0 (size: 0x8)
    class UStaticMeshComponent* tentsAllCentered_Object116_StaticMeshComponent0;      // 0x05E8 (size: 0x8)
    class UStaticMeshComponent* tentsAllCentered_Object117_StaticMeshComponent0;      // 0x05F0 (size: 0x8)
    class UStaticMeshComponent* tentsAllCentered_Object118_StaticMeshComponent0;      // 0x05F8 (size: 0x8)
    class UStaticMeshComponent* tentsAllCentered_Object119_StaticMeshComponent0;      // 0x0600 (size: 0x8)
    class UStaticMeshComponent* tentsAllCentered_Object120_StaticMeshComponent0;      // 0x0608 (size: 0x8)
    class UStaticMeshComponent* mount_luv13_StaticMeshComponent0;                     // 0x0610 (size: 0x8)
    class UStaticMeshComponent* tentsAllCentered_Object137_StaticMeshComponent0;      // 0x0618 (size: 0x8)
    class UStaticMeshComponent* tentsAllCentered_Object121_StaticMeshComponent0;      // 0x0620 (size: 0x8)
    class UStaticMeshComponent* tentsAllCentered_Object122_StaticMeshComponent0;      // 0x0628 (size: 0x8)
    class UStaticMeshComponent* rope34_StaticMeshComponent0;                          // 0x0630 (size: 0x8)
    class UStaticMeshComponent* rope35_StaticMeshComponent0;                          // 0x0638 (size: 0x8)
    class UStaticMeshComponent* rope36_StaticMeshComponent0;                          // 0x0640 (size: 0x8)
    class UStaticMeshComponent* rope37_StaticMeshComponent0;                          // 0x0648 (size: 0x8)
    class UStaticMeshComponent* rope38_StaticMeshComponent0;                          // 0x0650 (size: 0x8)
    class UStaticMeshComponent* rope39_StaticMeshComponent0;                          // 0x0658 (size: 0x8)
    class UStaticMeshComponent* mount_luv15_StaticMeshComponent0;                     // 0x0660 (size: 0x8)
    class UStaticMeshComponent* tentsAllCentered_Object123_StaticMeshComponent0;      // 0x0668 (size: 0x8)
    class UStaticMeshComponent* tentsAllCentered_Object124_StaticMeshComponent0;      // 0x0670 (size: 0x8)
    class UStaticMeshComponent* tentsAllCentered_Object125_StaticMeshComponent0;      // 0x0678 (size: 0x8)
    class UStaticMeshComponent* tentsAllCentered_Object126_StaticMeshComponent0;      // 0x0680 (size: 0x8)
    class UStaticMeshComponent* tentsAllCentered_Object127_StaticMeshComponent0;      // 0x0688 (size: 0x8)
    class UStaticMeshComponent* tentsAllCentered_Object128_StaticMeshComponent0;      // 0x0690 (size: 0x8)
    class UStaticMeshComponent* tentsAllCentered_Object129_StaticMeshComponent0;      // 0x0698 (size: 0x8)
    class UStaticMeshComponent* tentsAllCentered_Object130_StaticMeshComponent0;      // 0x06A0 (size: 0x8)
    class UStaticMeshComponent* tentsAllCentered_Object131_StaticMeshComponent0;      // 0x06A8 (size: 0x8)
    class UStaticMeshComponent* tentsAllCentered_Object132_StaticMeshComponent0;      // 0x06B0 (size: 0x8)
    class UStaticMeshComponent* tentsAllCentered_Object133_StaticMeshComponent0;      // 0x06B8 (size: 0x8)
    class UStaticMeshComponent* tentsAllCentered_Object134_StaticMeshComponent0;      // 0x06C0 (size: 0x8)
    class UStaticMeshComponent* tentsAllCentered_Object135_StaticMeshComponent0;      // 0x06C8 (size: 0x8)
    class UStaticMeshComponent* tentsAllCentered_Object136_StaticMeshComponent0;      // 0x06D0 (size: 0x8)
    class UStaticMeshComponent* mount_luv14_StaticMeshComponent0;                     // 0x06D8 (size: 0x8)
    class USceneComponent* tool_StandB5_SharedRoot;                                   // 0x06E0 (size: 0x8)
    class USceneComponent* tool_Stands3_SharedRoot;                                   // 0x06E8 (size: 0x8)
    class USceneComponent* tool_StandB6_SharedRoot;                                   // 0x06F0 (size: 0x8)
    class USceneComponent* wooden_base_3_SharedRoot1;                                 // 0x06F8 (size: 0x8)
    class USceneComponent* tent3_DefaultSceneRoot;                                    // 0x0700 (size: 0x8)
    class USceneComponent* Scene;                                                     // 0x0708 (size: 0x8)
    class UStaticMeshComponent* tentsAllCentered_Object138_StaticMeshComponent0;      // 0x0710 (size: 0x8)
    class UStaticMeshComponent* tentsAllCentered_Object139_StaticMeshComponent0;      // 0x0718 (size: 0x8)
    class UStaticMeshComponent* tentsAllCentered_Object140_StaticMeshComponent0;      // 0x0720 (size: 0x8)
    class UStaticMeshComponent* tentsAllCentered_Object141_StaticMeshComponent0;      // 0x0728 (size: 0x8)
    class UStaticMeshComponent* tentsAllCentered_Object142_StaticMeshComponent0;      // 0x0730 (size: 0x8)
    class UStaticMeshComponent* tentsAllCentered_Object143_StaticMeshComponent0;      // 0x0738 (size: 0x8)
    class UStaticMeshComponent* tentsAllCentered_Object144_StaticMeshComponent0;      // 0x0740 (size: 0x8)
    class UStaticMeshComponent* tentsAllCentered_Object145_StaticMeshComponent0;      // 0x0748 (size: 0x8)
    class UStaticMeshComponent* tentsAllCentered_Object146_StaticMeshComponent0;      // 0x0750 (size: 0x8)
    class UStaticMeshComponent* rope40_StaticMeshComponent0;                          // 0x0758 (size: 0x8)
    class UStaticMeshComponent* fireplace3_StaticMeshComponent015;                    // 0x0760 (size: 0x8)
    class UStaticMeshComponent* fireplace3_StaticMeshComponent028;                    // 0x0768 (size: 0x8)
    class UStaticMeshComponent* fireplace3_StaticMeshComponent029;                    // 0x0770 (size: 0x8)
    class UStaticMeshComponent* fireplace3_StaticMeshComponent019;                    // 0x0778 (size: 0x8)
    class UStaticMeshComponent* fireplace3_StaticMeshComponent010;                    // 0x0780 (size: 0x8)
    class UStaticMeshComponent* fireplace3_StaticMeshComponent018;                    // 0x0788 (size: 0x8)
    class UStaticMeshComponent* fireplace3_StaticMeshComponent011;                    // 0x0790 (size: 0x8)
    class UStaticMeshComponent* fireplace3_StaticMeshComponent012;                    // 0x0798 (size: 0x8)
    class UStaticMeshComponent* fireplace3_StaticMeshComponent013;                    // 0x07A0 (size: 0x8)
    class UStaticMeshComponent* fireplace3_StaticMeshComponent014;                    // 0x07A8 (size: 0x8)
    class UStaticMeshComponent* fireplace3_StaticMeshComponent017;                    // 0x07B0 (size: 0x8)
    class UStaticMeshComponent* fireplace3_StaticMeshComponent016;                    // 0x07B8 (size: 0x8)
    class UStaticMeshComponent* fireplace3_StaticMeshComponent09;                     // 0x07C0 (size: 0x8)
    class UStaticMeshComponent* fireplace3_StaticMesh;                                // 0x07C8 (size: 0x8)
    class UStaticMeshComponent* fireplace3_StaticMeshComponent030;                    // 0x07D0 (size: 0x8)
    class UStaticMeshComponent* fireplace3_StaticMeshComponent020;                    // 0x07D8 (size: 0x8)
    class UStaticMeshComponent* fireplace3_StaticMeshComponent021;                    // 0x07E0 (size: 0x8)
    class UStaticMeshComponent* fireplace3_StaticMeshComponent022;                    // 0x07E8 (size: 0x8)
    class UStaticMeshComponent* fireplace3_StaticMeshComponent023;                    // 0x07F0 (size: 0x8)
    class UStaticMeshComponent* fireplace3_StaticMeshComponent024;                    // 0x07F8 (size: 0x8)
    class UStaticMeshComponent* fireplace3_StaticMeshComponent025;                    // 0x0800 (size: 0x8)
    class UStaticMeshComponent* fireplace3_StaticMeshComponent026;                    // 0x0808 (size: 0x8)
    class UStaticMeshComponent* fireplace3_StaticMeshComponent027;                    // 0x0810 (size: 0x8)
    class USceneComponent* fireplace3_DefaultSceneRoot2;                              // 0x0818 (size: 0x8)
    class USceneComponent* fireplace3_SharedRoot;                                     // 0x0820 (size: 0x8)
    class UPoseableMeshComponent* fireplace3_stoneStructure;                          // 0x0828 (size: 0x8)
    class UStaticMeshComponent* tool_StandB5_StaticMeshComponent0304;                 // 0x0830 (size: 0x8)
    class UStaticMeshComponent* tool_StandB5_StaticMeshComponent0297;                 // 0x0838 (size: 0x8)
    class UStaticMeshComponent* tool_StandB5_StaticMeshComponent0299;                 // 0x0840 (size: 0x8)
    class UStaticMeshComponent* tool_StandB5_StaticMeshComponent0292;                 // 0x0848 (size: 0x8)
    class UStaticMeshComponent* tool_StandB5_StaticMeshComponent0293;                 // 0x0850 (size: 0x8)
    class UStaticMeshComponent* tool_StandB5_StaticMeshComponent0294;                 // 0x0858 (size: 0x8)
    class UStaticMeshComponent* tool_StandB5_StaticMeshComponent0295;                 // 0x0860 (size: 0x8)
    class UStaticMeshComponent* tool_StandB5_StaticMeshComponent0296;                 // 0x0868 (size: 0x8)
    class UStaticMeshComponent* tool_StandB5_StaticMeshComponent0306;                 // 0x0870 (size: 0x8)
    class UStaticMeshComponent* tool_StandB5_StaticMeshComponent0305;                 // 0x0878 (size: 0x8)
    class UStaticMeshComponent* tool_StandB5_StaticMeshComponent0298;                 // 0x0880 (size: 0x8)
    class UStaticMeshComponent* tool_StandB5_StaticMeshComponent0291;                 // 0x0888 (size: 0x8)
    class UStaticMeshComponent* tool_StandB5_StaticMeshComponent0300;                 // 0x0890 (size: 0x8)
    class UStaticMeshComponent* tool_StandB5_StaticMeshComponent0301;                 // 0x0898 (size: 0x8)
    class UStaticMeshComponent* tool_StandB5_StaticMeshComponent0302;                 // 0x08A0 (size: 0x8)
    class UStaticMeshComponent* tool_StandB5_StaticMeshComponent0303;                 // 0x08A8 (size: 0x8)
    class USceneComponent* tool_StandB5_standB;                                       // 0x08B0 (size: 0x8)
    class USceneComponent* tool_StandB5_Scene;                                        // 0x08B8 (size: 0x8)
    class UStaticMeshComponent* tool_Stands3_StaticMeshComponent0288;                 // 0x08C0 (size: 0x8)
    class UStaticMeshComponent* tool_Stands3_StaticMeshComponent0279;                 // 0x08C8 (size: 0x8)
    class UStaticMeshComponent* tool_Stands3_StaticMeshComponent0281;                 // 0x08D0 (size: 0x8)
    class UStaticMeshComponent* tool_Stands3_StaticMeshComponent0272;                 // 0x08D8 (size: 0x8)
    class UStaticMeshComponent* tool_Stands3_StaticMeshComponent0273;                 // 0x08E0 (size: 0x8)
    class UStaticMeshComponent* tool_Stands3_StaticMeshComponent0278;                 // 0x08E8 (size: 0x8)
    class UStaticMeshComponent* tool_Stands3_StaticMeshComponent0274;                 // 0x08F0 (size: 0x8)
    class UStaticMeshComponent* tool_Stands3_StaticMeshComponent0275;                 // 0x08F8 (size: 0x8)
    class UStaticMeshComponent* tool_Stands3_StaticMeshComponent0276;                 // 0x0900 (size: 0x8)
    class UStaticMeshComponent* tool_Stands3_StaticMeshComponent0277;                 // 0x0908 (size: 0x8)
    class UStaticMeshComponent* tool_Stands3_StaticMeshComponent0290;                 // 0x0910 (size: 0x8)
    class UStaticMeshComponent* tool_Stands3_StaticMeshComponent0289;                 // 0x0918 (size: 0x8)
    class UStaticMeshComponent* tool_Stands3_StaticMeshComponent0280;                 // 0x0920 (size: 0x8)
    class UStaticMeshComponent* tool_Stands3_StaticMeshComponent0271;                 // 0x0928 (size: 0x8)
    class UStaticMeshComponent* tool_Stands3_StaticMeshComponent0282;                 // 0x0930 (size: 0x8)
    class UStaticMeshComponent* tool_Stands3_StaticMeshComponent0283;                 // 0x0938 (size: 0x8)
    class UStaticMeshComponent* tool_Stands3_StaticMeshComponent0284;                 // 0x0940 (size: 0x8)
    class UStaticMeshComponent* tool_Stands3_StaticMeshComponent0285;                 // 0x0948 (size: 0x8)
    class UStaticMeshComponent* tool_Stands3_StaticMeshComponent0286;                 // 0x0950 (size: 0x8)
    class UStaticMeshComponent* tool_Stands3_StaticMeshComponent0287;                 // 0x0958 (size: 0x8)
    class USceneComponent* tool_Stands3_standA;                                       // 0x0960 (size: 0x8)
    class USceneComponent* tool_Stands3_Scene;                                        // 0x0968 (size: 0x8)
    class UStaticMeshComponent* tool_StandB6_StaticMeshComponent0304;                 // 0x0970 (size: 0x8)
    class UStaticMeshComponent* tool_StandB6_StaticMeshComponent0297;                 // 0x0978 (size: 0x8)
    class UStaticMeshComponent* tool_StandB6_StaticMeshComponent0299;                 // 0x0980 (size: 0x8)
    class UStaticMeshComponent* tool_StandB6_StaticMeshComponent0292;                 // 0x0988 (size: 0x8)
    class UStaticMeshComponent* tool_StandB6_StaticMeshComponent0293;                 // 0x0990 (size: 0x8)
    class UStaticMeshComponent* tool_StandB6_StaticMeshComponent0294;                 // 0x0998 (size: 0x8)
    class UStaticMeshComponent* tool_StandB6_StaticMeshComponent0295;                 // 0x09A0 (size: 0x8)
    class UStaticMeshComponent* tool_StandB6_StaticMeshComponent0296;                 // 0x09A8 (size: 0x8)
    class UStaticMeshComponent* tool_StandB6_StaticMeshComponent0306;                 // 0x09B0 (size: 0x8)
    class UStaticMeshComponent* tool_StandB6_StaticMeshComponent0305;                 // 0x09B8 (size: 0x8)
    class UStaticMeshComponent* tool_StandB6_StaticMeshComponent0298;                 // 0x09C0 (size: 0x8)
    class UStaticMeshComponent* tool_StandB6_StaticMeshComponent0291;                 // 0x09C8 (size: 0x8)
    class UStaticMeshComponent* tool_StandB6_StaticMeshComponent0300;                 // 0x09D0 (size: 0x8)
    class UStaticMeshComponent* tool_StandB6_StaticMeshComponent0301;                 // 0x09D8 (size: 0x8)
    class UStaticMeshComponent* tool_StandB6_StaticMeshComponent0302;                 // 0x09E0 (size: 0x8)
    class UStaticMeshComponent* tool_StandB6_StaticMeshComponent0303;                 // 0x09E8 (size: 0x8)
    class USceneComponent* tool_StandB6_standB;                                       // 0x09F0 (size: 0x8)
    class USceneComponent* tool_StandB6_Scene;                                        // 0x09F8 (size: 0x8)
    class UStaticMeshComponent* wooden_base_3_StaticMeshComponent082;                 // 0x0A00 (size: 0x8)
    class UStaticMeshComponent* wooden_base_3_StaticMeshComponent071;                 // 0x0A08 (size: 0x8)
    class UStaticMeshComponent* wooden_base_3_StaticMeshComponent058;                 // 0x0A10 (size: 0x8)
    class UStaticMeshComponent* wooden_base_3_StaticMeshComponent02;                  // 0x0A18 (size: 0x8)
    class UStaticMeshComponent* wooden_base_3_StaticMeshComponent03;                  // 0x0A20 (size: 0x8)
    class UStaticMeshComponent* wooden_base_3_StaticMeshComponent04;                  // 0x0A28 (size: 0x8)
    class UStaticMeshComponent* wooden_base_3_StaticMeshComponent05;                  // 0x0A30 (size: 0x8)
    class UStaticMeshComponent* wooden_base_3_StaticMeshComponent06;                  // 0x0A38 (size: 0x8)
    class UStaticMeshComponent* wooden_base_3_StaticMeshComponent07;                  // 0x0A40 (size: 0x8)
    class UStaticMeshComponent* wooden_base_3_StaticMeshComponent053;                 // 0x0A48 (size: 0x8)
    class UStaticMeshComponent* wooden_base_3_StaticMeshComponent0;                   // 0x0A50 (size: 0x8)
    class UStaticMeshComponent* wooden_base_3_StaticMeshComponent01;                  // 0x0A58 (size: 0x8)
    class UStaticMeshComponent* wooden_base_3_StaticMeshComponent064;                 // 0x0A60 (size: 0x8)
    class UStaticMeshComponent* wooden_base_3_StaticMeshComponent055;                 // 0x0A68 (size: 0x8)
    class UStaticMeshComponent* wooden_base_3_StaticMeshComponent056;                 // 0x0A70 (size: 0x8)
    class UStaticMeshComponent* wooden_base_3_StaticMeshComponent057;                 // 0x0A78 (size: 0x8)
    class UStaticMeshComponent* wooden_base_3_StaticMeshComponent062;                 // 0x0A80 (size: 0x8)
    class UStaticMeshComponent* wooden_base_3_StaticMeshComponent052;                 // 0x0A88 (size: 0x8)
    class UStaticMeshComponent* wooden_base_3_StaticMeshComponent059;                 // 0x0A90 (size: 0x8)
    class UStaticMeshComponent* wooden_base_3_StaticMeshComponent060;                 // 0x0A98 (size: 0x8)
    class UStaticMeshComponent* wooden_base_3_StaticMeshComponent061;                 // 0x0AA0 (size: 0x8)
    class UStaticMeshComponent* wooden_base_3_StaticMeshComponent051;                 // 0x0AA8 (size: 0x8)
    class UStaticMeshComponent* wooden_base_3_StaticMeshComponent050;                 // 0x0AB0 (size: 0x8)
    class UStaticMeshComponent* wooden_base_3_StaticMeshComponent054;                 // 0x0AB8 (size: 0x8)
    class UStaticMeshComponent* wooden_base_3_StaticMeshComponent065;                 // 0x0AC0 (size: 0x8)
    class UStaticMeshComponent* wooden_base_3_StaticMeshComponent066;                 // 0x0AC8 (size: 0x8)
    class UStaticMeshComponent* wooden_base_3_StaticMeshComponent067;                 // 0x0AD0 (size: 0x8)
    class UStaticMeshComponent* wooden_base_3_StaticMeshComponent063;                 // 0x0AD8 (size: 0x8)
    class UStaticMeshComponent* wooden_base_3_StaticMeshComponent068;                 // 0x0AE0 (size: 0x8)
    class UStaticMeshComponent* wooden_base_3_StaticMeshComponent069;                 // 0x0AE8 (size: 0x8)
    class UStaticMeshComponent* wooden_base_3_StaticMeshComponent070;                 // 0x0AF0 (size: 0x8)
    class USceneComponent* wooden_base_3_Scene1;                                      // 0x0AF8 (size: 0x8)
    class USceneComponent* wooden_base_3_Scene;                                       // 0x0B00 (size: 0x8)
    class USceneComponent* wooden_base_3_Scene2;                                      // 0x0B08 (size: 0x8)
    class USceneComponent* constructionCamp_pivot3_DefaultSceneRoot;                  // 0x0B10 (size: 0x8)

}; // Size: 0xB18

#endif
