#ifndef UE4SS_SDK_C_SG_Cottage_Lv1_A_v4_UBeamFoundations_HPP
#define UE4SS_SDK_C_SG_Cottage_Lv1_A_v4_UBeamFoundations_HPP

class AC_SG_Cottage_Lv1_A_v4_UBeamFoundations_C : public AConstructionBP_C
{
    class UStaticMeshComponent* Foundation_DoorStepStone2_StaticMeshComponent0;       // 0x0550 (size: 0x8)
    class UStaticMeshComponent* FoundationPrecise21_StaticMeshComponent0;             // 0x0558 (size: 0x8)
    class UStaticMeshComponent* FoundationPrecise20_StaticMeshComponent0;             // 0x0560 (size: 0x8)
    class UStaticMeshComponent* FoundationPrecise19_StaticMeshComponent0;             // 0x0568 (size: 0x8)
    class UStaticMeshComponent* FoundationPrecise18_StaticMeshComponent0;             // 0x0570 (size: 0x8)
    class UStaticMeshComponent* FoundationPrecise17_StaticMeshComponent0;             // 0x0578 (size: 0x8)
    class UStaticMeshComponent* FoundationPrecise16_StaticMeshComponent0;             // 0x0580 (size: 0x8)
    class UStaticMeshComponent* SG_windowBoardA81_StaticMeshComponent0;               // 0x0588 (size: 0x8)
    class UStaticMeshComponent* SG_windowBoardA80_StaticMeshComponent0;               // 0x0590 (size: 0x8)
    class UStaticMeshComponent* SG_windowBoardA79_StaticMeshComponent0;               // 0x0598 (size: 0x8)
    class UStaticMeshComponent* SG_windowBoardA78_StaticMeshComponent0;               // 0x05A0 (size: 0x8)
    class UStaticMeshComponent* FoundationPrecise15_StaticMeshComponent0;             // 0x05A8 (size: 0x8)
    class UStaticMeshComponent* FoundationPrecise14_StaticMeshComponent0;             // 0x05B0 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg14_StaticMeshComponent0;     // 0x05B8 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg13_StaticMeshComponent0;     // 0x05C0 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg12_StaticMeshComponent0;     // 0x05C8 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg11_StaticMeshComponent0;     // 0x05D0 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg10_StaticMeshComponent0;     // 0x05D8 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg9_StaticMeshComponent0;      // 0x05E0 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg8_StaticMeshComponent0;      // 0x05E8 (size: 0x8)
    class UStaticMeshComponent* interior4_StaticMeshComponent0;                       // 0x05F0 (size: 0x8)
    class UStaticMeshComponent* interior3_StaticMeshComponent0;                       // 0x05F8 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_17_StaticMeshComponent0;               // 0x0600 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_16_StaticMeshComponent0;               // 0x0608 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_15_StaticMeshComponent0;               // 0x0610 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_14_StaticMeshComponent0;               // 0x0618 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long_ultra160_StaticMeshComponent0;  // 0x0620 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m874_StaticMeshComponent0;                // 0x0628 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m873_StaticMeshComponent0;                // 0x0630 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long_ultra159_StaticMeshComponent0;  // 0x0638 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_13_StaticMeshComponent0;               // 0x0640 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m872_StaticMeshComponent0;                // 0x0648 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_12_StaticMeshComponent0;               // 0x0650 (size: 0x8)
    class UStaticMeshComponent* SG_windowBoardA73_StaticMeshComponent0;               // 0x0658 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m871_StaticMeshComponent0;                // 0x0660 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m870_StaticMeshComponent0;                // 0x0668 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m869_StaticMeshComponent0;                // 0x0670 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m868_StaticMeshComponent0;                // 0x0678 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m867_StaticMeshComponent0;                // 0x0680 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m866_StaticMeshComponent0;                // 0x0688 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m865_StaticMeshComponent0;                // 0x0690 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m864_StaticMeshComponent0;                // 0x0698 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m863_StaticMeshComponent0;                // 0x06A0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m862_StaticMeshComponent0;                // 0x06A8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m861_StaticMeshComponent0;                // 0x06B0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m860_StaticMeshComponent0;                // 0x06B8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m859_StaticMeshComponent0;                // 0x06C0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m858_StaticMeshComponent0;                // 0x06C8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m857_StaticMeshComponent0;                // 0x06D0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m856_StaticMeshComponent0;                // 0x06D8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m855_StaticMeshComponent0;                // 0x06E0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m854_StaticMeshComponent0;                // 0x06E8 (size: 0x8)
    class UStaticMeshComponent* SG_windowBoardA72_StaticMeshComponent0;               // 0x06F0 (size: 0x8)
    class UStaticMeshComponent* SG_windowBoardA71_StaticMeshComponent0;               // 0x06F8 (size: 0x8)
    class UStaticMeshComponent* SG_windowBoardA70_StaticMeshComponent0;               // 0x0700 (size: 0x8)
    class UStaticMeshComponent* SG_windowBoardA69_StaticMeshComponent0;               // 0x0708 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long_ultra158_StaticMeshComponent0;  // 0x0710 (size: 0x8)
    class UStaticMeshComponent* SG_windowBoardA68_StaticMeshComponent0;               // 0x0718 (size: 0x8)
    class UStaticMeshComponent* SG_windowBoardA67_StaticMeshComponent0;               // 0x0720 (size: 0x8)
    class UStaticMeshComponent* SG_windowBoardA66_StaticMeshComponent0;               // 0x0728 (size: 0x8)
    class UStaticMeshComponent* SG_windowBoardA65_StaticMeshComponent0;               // 0x0730 (size: 0x8)
    class UStaticMeshComponent* SG_windowBoardA64_StaticMeshComponent0;               // 0x0738 (size: 0x8)
    class UStaticMeshComponent* SG_windowBoardA63_StaticMeshComponent0;               // 0x0740 (size: 0x8)
    class UStaticMeshComponent* SG_windowBoardA62_StaticMeshComponent0;               // 0x0748 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m853_StaticMeshComponent0;                // 0x0750 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m852_StaticMeshComponent0;                // 0x0758 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m851_StaticMeshComponent0;                // 0x0760 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m850_StaticMeshComponent0;                // 0x0768 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m849_StaticMeshComponent0;                // 0x0770 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m848_StaticMeshComponent0;                // 0x0778 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m847_StaticMeshComponent0;                // 0x0780 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m846_StaticMeshComponent0;                // 0x0788 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m845_StaticMeshComponent0;                // 0x0790 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m844_StaticMeshComponent0;                // 0x0798 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m843_StaticMeshComponent0;                // 0x07A0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m842_StaticMeshComponent0;                // 0x07A8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m841_StaticMeshComponent0;                // 0x07B0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m840_StaticMeshComponent0;                // 0x07B8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m839_StaticMeshComponent0;                // 0x07C0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m838_StaticMeshComponent0;                // 0x07C8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m837_StaticMeshComponent0;                // 0x07D0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m836_StaticMeshComponent0;                // 0x07D8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m835_StaticMeshComponent0;                // 0x07E0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m834_StaticMeshComponent0;                // 0x07E8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m833_StaticMeshComponent0;                // 0x07F0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m832_StaticMeshComponent0;                // 0x07F8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m831_StaticMeshComponent0;                // 0x0800 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m830_StaticMeshComponent0;                // 0x0808 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m811_StaticMeshComponent0;                // 0x0810 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m810_StaticMeshComponent0;                // 0x0818 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m808_StaticMeshComponent0;                // 0x0820 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m807_StaticMeshComponent0;                // 0x0828 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long_ultra157_StaticMeshComponent0;  // 0x0830 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long_ultra156_StaticMeshComponent0;  // 0x0838 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m806_StaticMeshComponent0;                // 0x0840 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m805_StaticMeshComponent0;                // 0x0848 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m774_StaticMeshComponent0;                // 0x0850 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m773_StaticMeshComponent0;                // 0x0858 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m772_StaticMeshComponent0;                // 0x0860 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m771_StaticMeshComponent0;                // 0x0868 (size: 0x8)
    class UStaticMeshComponent* SG_windowBoardA61_StaticMeshComponent0;               // 0x0870 (size: 0x8)
    class UStaticMeshComponent* Thatch_FullUV_CottageA_lv1_v4_StaticMeshComponent0;   // 0x0878 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_TwoWindowsStandard6_StaticMeshComponent0;  // 0x0880 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_TwoWindowsStandard5_StaticMeshComponent0;  // 0x0888 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_TwoWindowsStandard4_StaticMeshComponent0;  // 0x0890 (size: 0x8)
    class USceneComponent* SG_Cottage1_A4_DefaultSceneRoot;                           // 0x0898 (size: 0x8)

}; // Size: 0x8A0

#endif
