#ifndef UE4SS_SDK_C_SG_Tower_Lv3_HPP
#define UE4SS_SDK_C_SG_Tower_Lv3_HPP

class AC_SG_Tower_Lv3_C : public AConstructionBP_C
{
    class UStaticMeshComponent* sg_peg230_StaticMeshComponent0;                       // 0x0550 (size: 0x8)
    class UStaticMeshComponent* sg_peg229_StaticMeshComponent0;                       // 0x0558 (size: 0x8)
    class UStaticMeshComponent* sg_peg228_StaticMeshComponent0;                       // 0x0560 (size: 0x8)
    class UStaticMeshComponent* sg_peg227_StaticMeshComponent0;                       // 0x0568 (size: 0x8)
    class UStaticMeshComponent* sg_peg208_StaticMeshComponent0;                       // 0x0570 (size: 0x8)
    class UStaticMeshComponent* sg_peg207_StaticMeshComponent0;                       // 0x0578 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise788_StaticMeshComponent0;              // 0x0580 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise787_StaticMeshComponent0;              // 0x0588 (size: 0x8)
    class UStaticMeshComponent* SG_PlatformBoarding30_StaticMeshComponent0;           // 0x0590 (size: 0x8)
    class UStaticMeshComponent* SG_PlatformBoarding29_StaticMeshComponent0;           // 0x0598 (size: 0x8)
    class UStaticMeshComponent* SG_PlatformBoarding28_StaticMeshComponent0;           // 0x05A0 (size: 0x8)
    class UStaticMeshComponent* Manor_LV3_Stripe3_StaticMeshComponent0;               // 0x05A8 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise786_StaticMeshComponent0;              // 0x05B0 (size: 0x8)
    class UStaticMeshComponent* SG_PlatformBoarding27_StaticMeshComponent0;           // 0x05B8 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise785_StaticMeshComponent0;              // 0x05C0 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise784_StaticMeshComponent0;              // 0x05C8 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise783_StaticMeshComponent0;              // 0x05D0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam_DiagonalG94_StaticMeshComponent0;         // 0x05D8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam_DiagonalG93_StaticMeshComponent0;         // 0x05E0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam_DiagonalG92_StaticMeshComponent0;         // 0x05E8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam_DiagonalG91_StaticMeshComponent0;         // 0x05F0 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise782_StaticMeshComponent0;              // 0x05F8 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise781_StaticMeshComponent0;              // 0x0600 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam_DiagonalG90_StaticMeshComponent0;         // 0x0608 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise780_StaticMeshComponent0;              // 0x0610 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam_DiagonalG89_StaticMeshComponent0;         // 0x0618 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise779_StaticMeshComponent0;              // 0x0620 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam_DiagonalG88_StaticMeshComponent0;         // 0x0628 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise778_StaticMeshComponent0;              // 0x0630 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam_DiagonalG87_StaticMeshComponent0;         // 0x0638 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise777_StaticMeshComponent0;              // 0x0640 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam_DiagonalG86_StaticMeshComponent0;         // 0x0648 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise776_StaticMeshComponent0;              // 0x0650 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise775_StaticMeshComponent0;              // 0x0658 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise774_StaticMeshComponent0;              // 0x0660 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise773_StaticMeshComponent0;              // 0x0668 (size: 0x8)
    class UStaticMeshComponent* SG_PlatformBoarding26_StaticMeshComponent0;           // 0x0670 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam_DiagonalG85_StaticMeshComponent0;         // 0x0678 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise772_StaticMeshComponent0;              // 0x0680 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam_DiagonalG84_StaticMeshComponent0;         // 0x0688 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise771_StaticMeshComponent0;              // 0x0690 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam_DiagonalG83_StaticMeshComponent0;         // 0x0698 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise770_StaticMeshComponent0;              // 0x06A0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam_DiagonalG82_StaticMeshComponent0;         // 0x06A8 (size: 0x8)
    class UStaticMeshComponent* SG_PlatformBoarding25_StaticMeshComponent0;           // 0x06B0 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise769_StaticMeshComponent0;              // 0x06B8 (size: 0x8)
    class UStaticMeshComponent* sg_chimneyTop6_StaticMeshComponent0;                  // 0x06C0 (size: 0x8)
    class UStaticMeshComponent* ChimneyLP14_StaticMeshComponent0;                     // 0x06C8 (size: 0x8)
    class UStaticMeshComponent* SG_PlatformBoarding24_StaticMeshComponent0;           // 0x06D0 (size: 0x8)
    class UStaticMeshComponent* SG_BigWindowA75_StaticMeshComponent0;                 // 0x06D8 (size: 0x8)
    class UStaticMeshComponent* SG_StoneWindowA30_StaticMeshComponent0;               // 0x06E0 (size: 0x8)
    class UStaticMeshComponent* SG_BigWindowA74_StaticMeshComponent0;                 // 0x06E8 (size: 0x8)
    class UStaticMeshComponent* SG_StoneWindowA29_StaticMeshComponent0;               // 0x06F0 (size: 0x8)
    class UStaticMeshComponent* sg_roundSlit_low15_StaticMeshComponent0;              // 0x06F8 (size: 0x8)
    class UStaticMeshComponent* sg_roundSlit_low14_StaticMeshComponent0;              // 0x0700 (size: 0x8)
    class UStaticMeshComponent* sg_roundSlit_low13_StaticMeshComponent0;              // 0x0708 (size: 0x8)
    class UStaticMeshComponent* sg_roundSlit_low12_StaticMeshComponent0;              // 0x0710 (size: 0x8)
    class UStaticMeshComponent* sg_roundSlit_low11_StaticMeshComponent0;              // 0x0718 (size: 0x8)
    class UStaticMeshComponent* Aset_castle_structure_M_sgyvB_LOD35_StaticMeshComponent0; // 0x0720 (size: 0x8)
    class UStaticMeshComponent* Aset_castle_structure_M_sgyvB_LOD34_StaticMeshComponent0; // 0x0728 (size: 0x8)
    class UStaticMeshComponent* SG_PlatformBoarding23_StaticMeshComponent0;           // 0x0730 (size: 0x8)
    class UStaticMeshComponent* sg_windowBars12_StaticMeshComponent0;                 // 0x0738 (size: 0x8)
    class UStaticMeshComponent* sg_windowBars11_StaticMeshComponent0;                 // 0x0740 (size: 0x8)
    class UStaticMeshComponent* sg_windowBars10_StaticMeshComponent0;                 // 0x0748 (size: 0x8)
    class UStaticMeshComponent* SG_BigWindowA73_StaticMeshComponent0;                 // 0x0750 (size: 0x8)
    class UStaticMeshComponent* SG_BigWindowA72_StaticMeshComponent0;                 // 0x0758 (size: 0x8)
    class UStaticMeshComponent* SG_BigWindowA71_StaticMeshComponent0;                 // 0x0760 (size: 0x8)
    class UStaticMeshComponent* SG_BigWindowA70_StaticMeshComponent0;                 // 0x0768 (size: 0x8)
    class UStaticMeshComponent* SG_StoneWindowA28_StaticMeshComponent0;               // 0x0770 (size: 0x8)
    class UStaticMeshComponent* SG_BigWindowA69_StaticMeshComponent0;                 // 0x0778 (size: 0x8)
    class UStaticMeshComponent* SG_BigWindowA68_StaticMeshComponent0;                 // 0x0780 (size: 0x8)
    class UStaticMeshComponent* SG_StoneWindowA27_StaticMeshComponent0;               // 0x0788 (size: 0x8)
    class UStaticMeshComponent* quoinB_luv142_StaticMeshComponent0;                   // 0x0790 (size: 0x8)
    class UStaticMeshComponent* quoinB_luv141_StaticMeshComponent0;                   // 0x0798 (size: 0x8)
    class UStaticMeshComponent* quoinB_luv140_StaticMeshComponent0;                   // 0x07A0 (size: 0x8)
    class UStaticMeshComponent* quoinB_luv139_StaticMeshComponent0;                   // 0x07A8 (size: 0x8)
    class UStaticMeshComponent* quoinB_luv138_StaticMeshComponent0;                   // 0x07B0 (size: 0x8)
    class UStaticMeshComponent* quoinB_luv137_StaticMeshComponent0;                   // 0x07B8 (size: 0x8)
    class UStaticMeshComponent* SG_BigWindowA67_StaticMeshComponent0;                 // 0x07C0 (size: 0x8)
    class UStaticMeshComponent* SG_BigWindowA66_StaticMeshComponent0;                 // 0x07C8 (size: 0x8)
    class UStaticMeshComponent* SG_StoneWindowA26_StaticMeshComponent0;               // 0x07D0 (size: 0x8)
    class UStaticMeshComponent* SG_BigWindowA65_StaticMeshComponent0;                 // 0x07D8 (size: 0x8)
    class UStaticMeshComponent* SG_BigWindowA64_StaticMeshComponent0;                 // 0x07E0 (size: 0x8)
    class UStaticMeshComponent* SG_BigWindowA63_StaticMeshComponent0;                 // 0x07E8 (size: 0x8)
    class UStaticMeshComponent* SG_BigWindowA62_StaticMeshComponent0;                 // 0x07F0 (size: 0x8)
    class UStaticMeshComponent* SG_StoneWindowA25_StaticMeshComponent0;               // 0x07F8 (size: 0x8)
    class UStaticMeshComponent* Scree_12_StaticMeshComponent0;                        // 0x0800 (size: 0x8)
    class UStaticMeshComponent* Scree_11_StaticMeshComponent0;                        // 0x0808 (size: 0x8)
    class UStaticMeshComponent* Scree_10_StaticMeshComponent0;                        // 0x0810 (size: 0x8)
    class UStaticMeshComponent* black39_StaticMeshComponent0;                         // 0x0818 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise768_StaticMeshComponent0;              // 0x0820 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long_diagonalD200_StaticMeshComponent0; // 0x0828 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long_diagonalD199_StaticMeshComponent0; // 0x0830 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long_diagonalD198_StaticMeshComponent0; // 0x0838 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long_diagonalD197_StaticMeshComponent0; // 0x0840 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long_diagonalD196_StaticMeshComponent0; // 0x0848 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long_diagonalD195_StaticMeshComponent0; // 0x0850 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long_diagonalD194_StaticMeshComponent0; // 0x0858 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long_diagonalD193_StaticMeshComponent0; // 0x0860 (size: 0x8)
    class UStaticMeshComponent* SG_PlatformBoarding22_StaticMeshComponent0;           // 0x0868 (size: 0x8)
    class UStaticMeshComponent* sg_boarding_turret8_StaticMeshComponent0;             // 0x0870 (size: 0x8)
    class UStaticMeshComponent* sg_boarding_turret7_StaticMeshComponent0;             // 0x0878 (size: 0x8)
    class UStaticMeshComponent* sg_boarding_turret6_StaticMeshComponent0;             // 0x0880 (size: 0x8)
    class UStaticMeshComponent* sg_boarding_turret5_StaticMeshComponent0;             // 0x0888 (size: 0x8)
    class UStaticMeshComponent* sg_tower_lv3_rooftiles2_StaticMeshComponent0;         // 0x0890 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise767_StaticMeshComponent0;              // 0x0898 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise766_StaticMeshComponent0;              // 0x08A0 (size: 0x8)
    class UStaticMeshComponent* Plane181_StaticMeshComponent0;                        // 0x08A8 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise765_StaticMeshComponent0;              // 0x08B0 (size: 0x8)
    class UStaticMeshComponent* Plane180_StaticMeshComponent0;                        // 0x08B8 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise764_StaticMeshComponent0;              // 0x08C0 (size: 0x8)
    class UStaticMeshComponent* Plane179_StaticMeshComponent0;                        // 0x08C8 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise763_StaticMeshComponent0;              // 0x08D0 (size: 0x8)
    class UStaticMeshComponent* Plane178_StaticMeshComponent0;                        // 0x08D8 (size: 0x8)
    class UStaticMeshComponent* Plane177_StaticMeshComponent0;                        // 0x08E0 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise762_StaticMeshComponent0;              // 0x08E8 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise761_StaticMeshComponent0;              // 0x08F0 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise760_StaticMeshComponent0;              // 0x08F8 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise759_StaticMeshComponent0;              // 0x0900 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise758_StaticMeshComponent0;              // 0x0908 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise757_StaticMeshComponent0;              // 0x0910 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise756_StaticMeshComponent0;              // 0x0918 (size: 0x8)
    class UStaticMeshComponent* Plane176_StaticMeshComponent0;                        // 0x0920 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise755_StaticMeshComponent0;              // 0x0928 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise754_StaticMeshComponent0;              // 0x0930 (size: 0x8)
    class UStaticMeshComponent* Plane175_StaticMeshComponent0;                        // 0x0938 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise753_StaticMeshComponent0;              // 0x0940 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise752_StaticMeshComponent0;              // 0x0948 (size: 0x8)
    class UStaticMeshComponent* Plane174_StaticMeshComponent0;                        // 0x0950 (size: 0x8)
    class UStaticMeshComponent* Plane173_StaticMeshComponent0;                        // 0x0958 (size: 0x8)
    class UStaticMeshComponent* Plane172_StaticMeshComponent0;                        // 0x0960 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise751_StaticMeshComponent0;              // 0x0968 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise750_StaticMeshComponent0;              // 0x0970 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise749_StaticMeshComponent0;              // 0x0978 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise748_StaticMeshComponent0;              // 0x0980 (size: 0x8)
    class UStaticMeshComponent* SG_PlatformBoarding21_StaticMeshComponent0;           // 0x0988 (size: 0x8)
    class UStaticMeshComponent* SG_PlatformBoarding20_StaticMeshComponent0;           // 0x0990 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise747_StaticMeshComponent0;              // 0x0998 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise746_StaticMeshComponent0;              // 0x09A0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam_DiagonalG81_StaticMeshComponent0;         // 0x09A8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam_DiagonalG80_StaticMeshComponent0;         // 0x09B0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam_DiagonalG79_StaticMeshComponent0;         // 0x09B8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam_DiagonalG78_StaticMeshComponent0;         // 0x09C0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam_DiagonalG77_StaticMeshComponent0;         // 0x09C8 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise745_StaticMeshComponent0;              // 0x09D0 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise744_StaticMeshComponent0;              // 0x09D8 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise743_StaticMeshComponent0;              // 0x09E0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam_DiagonalG76_StaticMeshComponent0;         // 0x09E8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam_DiagonalG75_StaticMeshComponent0;         // 0x09F0 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise742_StaticMeshComponent0;              // 0x09F8 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise741_StaticMeshComponent0;              // 0x0A00 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise740_StaticMeshComponent0;              // 0x0A08 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise739_StaticMeshComponent0;              // 0x0A10 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise738_StaticMeshComponent0;              // 0x0A18 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise737_StaticMeshComponent0;              // 0x0A20 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise736_StaticMeshComponent0;              // 0x0A28 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise735_StaticMeshComponent0;              // 0x0A30 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise734_StaticMeshComponent0;              // 0x0A38 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise733_StaticMeshComponent0;              // 0x0A40 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise732_StaticMeshComponent0;              // 0x0A48 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise731_StaticMeshComponent0;              // 0x0A50 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise730_StaticMeshComponent0;              // 0x0A58 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise729_StaticMeshComponent0;              // 0x0A60 (size: 0x8)
    class UStaticMeshComponent* SM_HouseRoof9_StaticMeshComponent0;                   // 0x0A68 (size: 0x8)
    class UStaticMeshComponent* SG_StoneToilet4_StaticMeshComponent0;                 // 0x0A70 (size: 0x8)
    class UStaticMeshComponent* SG_BigWindowA61_StaticMeshComponent0;                 // 0x0A78 (size: 0x8)
    class UStaticMeshComponent* SG_StoneWindowA24_StaticMeshComponent0;               // 0x0A80 (size: 0x8)
    class UStaticMeshComponent* SG_BigWindowA60_StaticMeshComponent0;                 // 0x0A88 (size: 0x8)
    class UStaticMeshComponent* SG_BigWindowA59_StaticMeshComponent0;                 // 0x0A90 (size: 0x8)
    class UStaticMeshComponent* SG_BigWindowA58_StaticMeshComponent0;                 // 0x0A98 (size: 0x8)
    class UStaticMeshComponent* SG_BigWindowA57_StaticMeshComponent0;                 // 0x0AA0 (size: 0x8)
    class UStaticMeshComponent* SG_BigWindowA56_StaticMeshComponent0;                 // 0x0AA8 (size: 0x8)
    class UStaticMeshComponent* SG_BigWindowA55_StaticMeshComponent0;                 // 0x0AB0 (size: 0x8)
    class UStaticMeshComponent* SG_BigWindowA54_StaticMeshComponent0;                 // 0x0AB8 (size: 0x8)
    class UStaticMeshComponent* SG_BigWindowA53_StaticMeshComponent0;                 // 0x0AC0 (size: 0x8)
    class UStaticMeshComponent* SG_BigWindowA52_StaticMeshComponent0;                 // 0x0AC8 (size: 0x8)
    class UStaticMeshComponent* SG_BigWindowA51_StaticMeshComponent0;                 // 0x0AD0 (size: 0x8)
    class UStaticMeshComponent* black38_StaticMeshComponent0;                         // 0x0AD8 (size: 0x8)
    class UStaticMeshComponent* quoinB_luv136_StaticMeshComponent0;                   // 0x0AE0 (size: 0x8)
    class UStaticMeshComponent* quoinB_luv135_StaticMeshComponent0;                   // 0x0AE8 (size: 0x8)
    class UStaticMeshComponent* quoinB_luv134_StaticMeshComponent0;                   // 0x0AF0 (size: 0x8)
    class UStaticMeshComponent* quoinB_luv133_StaticMeshComponent0;                   // 0x0AF8 (size: 0x8)
    class UStaticMeshComponent* quoinB_luv132_StaticMeshComponent0;                   // 0x0B00 (size: 0x8)
    class UStaticMeshComponent* quoinB_luv131_StaticMeshComponent0;                   // 0x0B08 (size: 0x8)
    class UStaticMeshComponent* SG_PlatformBoarding13_StaticMeshComponent0;           // 0x0B10 (size: 0x8)
    class UStaticMeshComponent* SG_PlatformBoarding9_StaticMeshComponent0;            // 0x0B18 (size: 0x8)
    class UStaticMeshComponent* SG_PlatformBoarding8_StaticMeshComponent0;            // 0x0B20 (size: 0x8)
    class UStaticMeshComponent* SG_StoneDoorA5_StaticMeshComponent0;                  // 0x0B28 (size: 0x8)
    class UStaticMeshComponent* SG_StoneWindowA23_StaticMeshComponent0;               // 0x0B30 (size: 0x8)
    class UStaticMeshComponent* SG_StoneWindowA22_StaticMeshComponent0;               // 0x0B38 (size: 0x8)
    class UStaticMeshComponent* SG_StoneWindowA21_StaticMeshComponent0;               // 0x0B40 (size: 0x8)
    class UStaticMeshComponent* sg_tower_lv3_base2_StaticMeshComponent0;              // 0x0B48 (size: 0x8)
    class USceneComponent* C_SG_Tower_lv4_DefaultSceneRoot;                           // 0x0B50 (size: 0x8)

}; // Size: 0xB58

#endif
