#ifndef UE4SS_SDK_C_SG_CharcoalKiln_HPP
#define UE4SS_SDK_C_SG_CharcoalKiln_HPP

class AC_SG_CharcoalKiln_C : public AConstructionBP_C
{
    class UStaticMeshComponent* UBeam_Strut_Straight44_StaticMeshComponent0;          // 0x0550 (size: 0x8)
    class UStaticMeshComponent* UBeam_Strut_Straight43_StaticMeshComponent0;          // 0x0558 (size: 0x8)
    class UStaticMeshComponent* UBeam_Strut_Straight42_StaticMeshComponent0;          // 0x0560 (size: 0x8)
    class UStaticMeshComponent* UBeam_Strut_Straight41_StaticMeshComponent0;          // 0x0568 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA18_StaticMeshComponent0;            // 0x0570 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA17_StaticMeshComponent0;            // 0x0578 (size: 0x8)
    class UStaticMeshComponent* Cube4_StaticMeshComponent0;                           // 0x0580 (size: 0x8)
    class UStaticMeshComponent* UBeam_LadderLong2_StaticMeshComponent0;               // 0x0588 (size: 0x8)
    class UStaticMeshComponent* Cube3_StaticMeshComponent0;                           // 0x0590 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA16_StaticMeshComponent0;            // 0x0598 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA15_StaticMeshComponent0;            // 0x05A0 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA14_StaticMeshComponent0;            // 0x05A8 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA13_StaticMeshComponent0;            // 0x05B0 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA12_StaticMeshComponent0;            // 0x05B8 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA11_StaticMeshComponent0;            // 0x05C0 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA10_StaticMeshComponent0;            // 0x05C8 (size: 0x8)
    class UStaticMeshComponent* UBeam_Strut_Straight40_StaticMeshComponent0;          // 0x05D0 (size: 0x8)
    class UStaticMeshComponent* UBeam_Strut_Straight39_StaticMeshComponent0;          // 0x05D8 (size: 0x8)
    class UStaticMeshComponent* UBeam_Strut_Straight38_StaticMeshComponent0;          // 0x05E0 (size: 0x8)
    class UStaticMeshComponent* UBeam_Strut_Straight37_StaticMeshComponent0;          // 0x05E8 (size: 0x8)
    class UStaticMeshComponent* UBeam_Strut_Straight36_StaticMeshComponent0;          // 0x05F0 (size: 0x8)
    class UStaticMeshComponent* UBeam_Strut_Straight35_StaticMeshComponent0;          // 0x05F8 (size: 0x8)
    class UStaticMeshComponent* UBeam_Strut_Straight34_StaticMeshComponent0;          // 0x0600 (size: 0x8)
    class UStaticMeshComponent* UBeam_Strut_Straight33_StaticMeshComponent0;          // 0x0608 (size: 0x8)
    class UStaticMeshComponent* UBeam_Strut_Straight32_StaticMeshComponent0;          // 0x0610 (size: 0x8)
    class UStaticMeshComponent* UBeam_Strut_Straight31_StaticMeshComponent0;          // 0x0618 (size: 0x8)
    class UStaticMeshComponent* UBeam_Strut_Straight30_StaticMeshComponent0;          // 0x0620 (size: 0x8)
    class UStaticMeshComponent* UBeam_Strut_Straight29_StaticMeshComponent0;          // 0x0628 (size: 0x8)
    class UStaticMeshComponent* UBeam_Strut_Straight28_StaticMeshComponent0;          // 0x0630 (size: 0x8)
    class UStaticMeshComponent* UBeam_Strut_Straight27_StaticMeshComponent0;          // 0x0638 (size: 0x8)
    class UStaticMeshComponent* UBeam_Strut_Straight26_StaticMeshComponent0;          // 0x0640 (size: 0x8)
    class UStaticMeshComponent* UBeam_Strut_Straight25_StaticMeshComponent0;          // 0x0648 (size: 0x8)
    class UStaticMeshComponent* UBeam_Strut_Straight24_StaticMeshComponent0;          // 0x0650 (size: 0x8)
    class UStaticMeshComponent* UBeam_Strut_Straight23_StaticMeshComponent0;          // 0x0658 (size: 0x8)
    class UStaticMeshComponent* hromada_hlina_01_30k_f2_StaticMeshComponent0;         // 0x0660 (size: 0x8)
    class USceneComponent* Actor3_DefaultSceneRoot;                                   // 0x0668 (size: 0x8)

}; // Size: 0x670

#endif
