#ifndef UE4SS_SDK_C_SG_Shed_Small_Planked_UBeam_HPP
#define UE4SS_SDK_C_SG_Shed_Small_Planked_UBeam_HPP

class AC_SG_Shed_Small_Planked_UBeam_C : public AConstructionBP_C
{
    class UStaticMeshComponent* Thatch_SG_Shed_Small_Ubeam2_StaticMeshComponent0;     // 0x0550 (size: 0x8)
    class UStaticMeshComponent* Foundation_SG_Shed_Small_Ubeam2_StaticMeshComponent0; // 0x0558 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA_Crooked40_StaticMeshComponent0;    // 0x0560 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA_Crooked39_StaticMeshComponent0;    // 0x0568 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA_Crooked38_StaticMeshComponent0;    // 0x0570 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA_Crooked37_StaticMeshComponent0;    // 0x0578 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA_Crooked36_StaticMeshComponent0;    // 0x0580 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA4_StaticMeshComponent0;             // 0x0588 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA_Crooked35_StaticMeshComponent0;    // 0x0590 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA_Crooked34_StaticMeshComponent0;    // 0x0598 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA_Crooked33_StaticMeshComponent0;    // 0x05A0 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA_Crooked32_StaticMeshComponent0;    // 0x05A8 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA_Crooked31_StaticMeshComponent0;    // 0x05B0 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA_Crooked30_StaticMeshComponent0;    // 0x05B8 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA_Crooked29_StaticMeshComponent0;    // 0x05C0 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA_Crooked28_StaticMeshComponent0;    // 0x05C8 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA_Crooked27_StaticMeshComponent0;    // 0x05D0 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA_Crooked26_StaticMeshComponent0;    // 0x05D8 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA_Crooked25_StaticMeshComponent0;    // 0x05E0 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA_Crooked24_StaticMeshComponent0;    // 0x05E8 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA_Crooked23_StaticMeshComponent0;    // 0x05F0 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA_Crooked22_StaticMeshComponent0;    // 0x05F8 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA_Crooked21_StaticMeshComponent0;    // 0x0600 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA3_StaticMeshComponent0;             // 0x0608 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m16_StaticMeshComponent0;                   // 0x0610 (size: 0x8)
    class UStaticMeshComponent* UBeam_Strut_Wonky32_StaticMeshComponent0;             // 0x0618 (size: 0x8)
    class UStaticMeshComponent* UBeam_Strut_Wonky31_StaticMeshComponent0;             // 0x0620 (size: 0x8)
    class UStaticMeshComponent* UBeam_Strut_Wonky30_StaticMeshComponent0;             // 0x0628 (size: 0x8)
    class UStaticMeshComponent* UBeam_Strut_Wonky29_StaticMeshComponent0;             // 0x0630 (size: 0x8)
    class UStaticMeshComponent* UBeam_Strut_Wonky28_StaticMeshComponent0;             // 0x0638 (size: 0x8)
    class UStaticMeshComponent* UBeam_Strut_Wonky27_StaticMeshComponent0;             // 0x0640 (size: 0x8)
    class UStaticMeshComponent* UBeam_Strut_Wonky26_StaticMeshComponent0;             // 0x0648 (size: 0x8)
    class UStaticMeshComponent* UBeam_Strut_Wonky25_StaticMeshComponent0;             // 0x0650 (size: 0x8)
    class UStaticMeshComponent* UBeam_Strut_Wonky24_StaticMeshComponent0;             // 0x0658 (size: 0x8)
    class UStaticMeshComponent* UBeam_Strut_Wonky23_StaticMeshComponent0;             // 0x0660 (size: 0x8)
    class UStaticMeshComponent* UBeam_Strut_Wonky22_StaticMeshComponent0;             // 0x0668 (size: 0x8)
    class UStaticMeshComponent* UBeam_Strut_Wonky21_StaticMeshComponent0;             // 0x0670 (size: 0x8)
    class UStaticMeshComponent* UBeam_Strut_Wonky20_StaticMeshComponent0;             // 0x0678 (size: 0x8)
    class UStaticMeshComponent* UBeam_Strut_Wonky19_StaticMeshComponent0;             // 0x0680 (size: 0x8)
    class UStaticMeshComponent* UBeam_Strut_Wonky18_StaticMeshComponent0;             // 0x0688 (size: 0x8)
    class UStaticMeshComponent* UBeam_Strut_Wonky17_StaticMeshComponent0;             // 0x0690 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m15_StaticMeshComponent0;                   // 0x0698 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m14_StaticMeshComponent0;                   // 0x06A0 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m19_StaticMeshComponent0;                      // 0x06A8 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m18_StaticMeshComponent0;                      // 0x06B0 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m17_StaticMeshComponent0;                      // 0x06B8 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m16_StaticMeshComponent0;                      // 0x06C0 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m15_StaticMeshComponent0;                      // 0x06C8 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m14_StaticMeshComponent0;                      // 0x06D0 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m13_StaticMeshComponent0;                      // 0x06D8 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m13_StaticMeshComponent0;                   // 0x06E0 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m12_StaticMeshComponent0;                   // 0x06E8 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m11_StaticMeshComponent0;                   // 0x06F0 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m10_StaticMeshComponent0;                   // 0x06F8 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m9_StaticMeshComponent0;                    // 0x0700 (size: 0x8)
    class USceneComponent* Actor_Shed_Small Planked2_DefaultSceneRoot;                // 0x0708 (size: 0x8)

}; // Size: 0x710

#endif
