#ifndef UE4SS_SDK_C_SG_Church_lv1_ubeam_HPP
#define UE4SS_SDK_C_SG_Church_lv1_ubeam_HPP

class AC_SG_Church_lv1_ubeam_C : public AConstructionBP_C
{
    class UStaticMeshComponent* SM_Beam6m_Noise92_StaticMeshComponent0;               // 0x0550 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise91_StaticMeshComponent0;               // 0x0558 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA118_StaticMeshComponent0;              // 0x0560 (size: 0x8)
    class UStaticMeshComponent* sg_ubeam_gable_planks2_StaticMeshComponent0;          // 0x0568 (size: 0x8)
    class UStaticMeshComponent* sg_church_turret38_StaticMeshComponent0;              // 0x0570 (size: 0x8)
    class UStaticMeshComponent* sg_church_turret37_StaticMeshComponent0;              // 0x0578 (size: 0x8)
    class UStaticMeshComponent* Foundation_DoorStepStone4_StaticMeshComponent0;       // 0x0580 (size: 0x8)
    class UStaticMeshComponent* Foundation_DoorStepStone3_StaticMeshComponent0;       // 0x0588 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise90_StaticMeshComponent0;               // 0x0590 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise89_StaticMeshComponent0;               // 0x0598 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise88_StaticMeshComponent0;               // 0x05A0 (size: 0x8)
    class UStaticMeshComponent* foundations_sg_church_lv1_ubeam2_StaticMeshComponent0; // 0x05A8 (size: 0x8)
    class UStaticMeshComponent* sg_church_turret36_StaticMeshComponent0;              // 0x05B0 (size: 0x8)
    class UStaticMeshComponent* sg_church_turret35_StaticMeshComponent0;              // 0x05B8 (size: 0x8)
    class UStaticMeshComponent* sg_church_turret34_StaticMeshComponent0;              // 0x05C0 (size: 0x8)
    class UStaticMeshComponent* sg_church_turret33_StaticMeshComponent0;              // 0x05C8 (size: 0x8)
    class UStaticMeshComponent* sg_church_turret32_StaticMeshComponent0;              // 0x05D0 (size: 0x8)
    class UStaticMeshComponent* sg_church_turret31_StaticMeshComponent0;              // 0x05D8 (size: 0x8)
    class UStaticMeshComponent* sg_church_turret30_StaticMeshComponent0;              // 0x05E0 (size: 0x8)
    class UStaticMeshComponent* woodenShinglesMega_anotherSculpt12_StaticMeshComponent0; // 0x05E8 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise87_StaticMeshComponent0;               // 0x05F0 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise86_StaticMeshComponent0;               // 0x05F8 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise85_StaticMeshComponent0;               // 0x0600 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise84_StaticMeshComponent0;               // 0x0608 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise83_StaticMeshComponent0;               // 0x0610 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise82_StaticMeshComponent0;               // 0x0618 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise81_StaticMeshComponent0;               // 0x0620 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise80_StaticMeshComponent0;               // 0x0628 (size: 0x8)
    class UStaticMeshComponent* black36_StaticMeshComponent0;                         // 0x0630 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise79_StaticMeshComponent0;               // 0x0638 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise78_StaticMeshComponent0;               // 0x0640 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise77_StaticMeshComponent0;               // 0x0648 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise76_StaticMeshComponent0;               // 0x0650 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise75_StaticMeshComponent0;               // 0x0658 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise74_StaticMeshComponent0;               // 0x0660 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA212_StaticMeshComponent0;              // 0x0668 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA211_StaticMeshComponent0;              // 0x0670 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA210_StaticMeshComponent0;              // 0x0678 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA209_StaticMeshComponent0;              // 0x0680 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA208_StaticMeshComponent0;              // 0x0688 (size: 0x8)
    class UStaticMeshComponent* paintedPlanksA_paintedPlankD30_StaticMeshComponent0;  // 0x0690 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA207_StaticMeshComponent0;              // 0x0698 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA206_StaticMeshComponent0;              // 0x06A0 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA205_StaticMeshComponent0;              // 0x06A8 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA204_StaticMeshComponent0;              // 0x06B0 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA203_StaticMeshComponent0;              // 0x06B8 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA202_StaticMeshComponent0;              // 0x06C0 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA201_StaticMeshComponent0;              // 0x06C8 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA200_StaticMeshComponent0;              // 0x06D0 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA199_StaticMeshComponent0;              // 0x06D8 (size: 0x8)
    class UStaticMeshComponent* paintedPlanksA_paintedPlankD29_StaticMeshComponent0;  // 0x06E0 (size: 0x8)
    class UStaticMeshComponent* paintedPlanksA_paintedPlankD28_StaticMeshComponent0;  // 0x06E8 (size: 0x8)
    class UStaticMeshComponent* paintedPlanksA_paintedPlankD27_StaticMeshComponent0;  // 0x06F0 (size: 0x8)
    class UStaticMeshComponent* paintedPlanksA_paintedPlankD26_StaticMeshComponent0;  // 0x06F8 (size: 0x8)
    class UStaticMeshComponent* paintedPlanksA_paintedPlankD25_StaticMeshComponent0;  // 0x0700 (size: 0x8)
    class UStaticMeshComponent* paintedPlanksA_paintedPlankD24_StaticMeshComponent0;  // 0x0708 (size: 0x8)
    class UStaticMeshComponent* paintedPlanksA_paintedPlankD23_StaticMeshComponent0;  // 0x0710 (size: 0x8)
    class UStaticMeshComponent* paintedPlanksA_paintedPlankD22_StaticMeshComponent0;  // 0x0718 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA198_StaticMeshComponent0;              // 0x0720 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA197_StaticMeshComponent0;              // 0x0728 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA196_StaticMeshComponent0;              // 0x0730 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA195_StaticMeshComponent0;              // 0x0738 (size: 0x8)
    class UStaticMeshComponent* paintedPlanksA_paintedPlankD21_StaticMeshComponent0;  // 0x0740 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA194_StaticMeshComponent0;              // 0x0748 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA193_StaticMeshComponent0;              // 0x0750 (size: 0x8)
    class UStaticMeshComponent* paintedPlanksA_paintedPlankD20_StaticMeshComponent0;  // 0x0758 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA192_StaticMeshComponent0;              // 0x0760 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA191_StaticMeshComponent0;              // 0x0768 (size: 0x8)
    class UStaticMeshComponent* paintedPlanksA_paintedPlankD19_StaticMeshComponent0;  // 0x0770 (size: 0x8)
    class UStaticMeshComponent* black35_StaticMeshComponent0;                         // 0x0778 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA190_StaticMeshComponent0;              // 0x0780 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA189_StaticMeshComponent0;              // 0x0788 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA188_StaticMeshComponent0;              // 0x0790 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA187_StaticMeshComponent0;              // 0x0798 (size: 0x8)
    class UStaticMeshComponent* paintedPlanksA_paintedPlankD18_StaticMeshComponent0;  // 0x07A0 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA186_StaticMeshComponent0;              // 0x07A8 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA185_StaticMeshComponent0;              // 0x07B0 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA184_StaticMeshComponent0;              // 0x07B8 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA183_StaticMeshComponent0;              // 0x07C0 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA182_StaticMeshComponent0;              // 0x07C8 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA181_StaticMeshComponent0;              // 0x07D0 (size: 0x8)
    class UStaticMeshComponent* paintedPlanksA_paintedPlankD17_StaticMeshComponent0;  // 0x07D8 (size: 0x8)
    class UStaticMeshComponent* paintedPlanksA_paintedPlankD15_StaticMeshComponent0;  // 0x07E0 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA180_StaticMeshComponent0;              // 0x07E8 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA176_StaticMeshComponent0;              // 0x07F0 (size: 0x8)
    class UStaticMeshComponent* doorHeadA_short7_StaticMeshComponent0;                // 0x07F8 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise73_StaticMeshComponent0;               // 0x0800 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise72_StaticMeshComponent0;               // 0x0808 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise71_StaticMeshComponent0;               // 0x0810 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise70_StaticMeshComponent0;               // 0x0818 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise69_StaticMeshComponent0;               // 0x0820 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise68_StaticMeshComponent0;               // 0x0828 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA179_StaticMeshComponent0;              // 0x0830 (size: 0x8)
    class UStaticMeshComponent* woodenShinglesMega_anotherSculpt11_StaticMeshComponent0; // 0x0838 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA125_StaticMeshComponent0;              // 0x0840 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise67_StaticMeshComponent0;               // 0x0848 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise66_StaticMeshComponent0;               // 0x0850 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise65_StaticMeshComponent0;               // 0x0858 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise64_StaticMeshComponent0;               // 0x0860 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise63_StaticMeshComponent0;               // 0x0868 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise62_StaticMeshComponent0;               // 0x0870 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise61_StaticMeshComponent0;               // 0x0878 (size: 0x8)
    class UStaticMeshComponent* black2_StaticMeshComponent0;                          // 0x0880 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise60_StaticMeshComponent0;               // 0x0888 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise59_StaticMeshComponent0;               // 0x0890 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise58_StaticMeshComponent0;               // 0x0898 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise57_StaticMeshComponent0;               // 0x08A0 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise56_StaticMeshComponent0;               // 0x08A8 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise55_StaticMeshComponent0;               // 0x08B0 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise54_StaticMeshComponent0;               // 0x08B8 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise53_StaticMeshComponent0;               // 0x08C0 (size: 0x8)
    class UStaticMeshComponent* woodenShinglesMega_anotherSculpt10_StaticMeshComponent0; // 0x08C8 (size: 0x8)
    class UStaticMeshComponent* woodenShinglesMega_anotherSculpt7_StaticMeshComponent0; // 0x08D0 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA117_StaticMeshComponent0;              // 0x08D8 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA114_StaticMeshComponent0;              // 0x08E0 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA113_StaticMeshComponent0;              // 0x08E8 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA112_StaticMeshComponent0;              // 0x08F0 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise52_StaticMeshComponent0;               // 0x08F8 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise51_StaticMeshComponent0;               // 0x0900 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise50_StaticMeshComponent0;               // 0x0908 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise49_StaticMeshComponent0;               // 0x0910 (size: 0x8)
    class UStaticMeshComponent* doorHeadA_short6_StaticMeshComponent0;                // 0x0918 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise48_StaticMeshComponent0;               // 0x0920 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise47_StaticMeshComponent0;               // 0x0928 (size: 0x8)
    class UStaticMeshComponent* gableDecor_lod3_StaticMeshComponent0;                 // 0x0930 (size: 0x8)
    class UStaticMeshComponent* gableDecor_lod2_StaticMeshComponent0;                 // 0x0938 (size: 0x8)
    class UStaticMeshComponent* sg_church_turret29_StaticMeshComponent0;              // 0x0940 (size: 0x8)
    class UStaticMeshComponent* sg_church_turret28_StaticMeshComponent0;              // 0x0948 (size: 0x8)
    class UStaticMeshComponent* sg_church_turret27_StaticMeshComponent0;              // 0x0950 (size: 0x8)
    class UStaticMeshComponent* sg_church_turret26_StaticMeshComponent0;              // 0x0958 (size: 0x8)
    class UStaticMeshComponent* sg_church_turret25_StaticMeshComponent0;              // 0x0960 (size: 0x8)
    class UStaticMeshComponent* sg_church_turret24_StaticMeshComponent0;              // 0x0968 (size: 0x8)
    class UStaticMeshComponent* sg_church_turret23_StaticMeshComponent0;              // 0x0970 (size: 0x8)
    class UStaticMeshComponent* sg_church_turret22_StaticMeshComponent0;              // 0x0978 (size: 0x8)
    class UStaticMeshComponent* sg_church_turret21_StaticMeshComponent0;              // 0x0980 (size: 0x8)
    class UStaticMeshComponent* shinglesMega_turret2_StaticMeshComponent0;            // 0x0988 (size: 0x8)
    class UStaticMeshComponent* sg_church_turret20_StaticMeshComponent0;              // 0x0990 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg16_StaticMeshComponent0;     // 0x0998 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_21_StaticMeshComponent0;               // 0x09A0 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_20_StaticMeshComponent0;               // 0x09A8 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg15_StaticMeshComponent0;     // 0x09B0 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_19_StaticMeshComponent0;               // 0x09B8 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg14_StaticMeshComponent0;     // 0x09C0 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_18_StaticMeshComponent0;               // 0x09C8 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg13_StaticMeshComponent0;     // 0x09D0 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg12_StaticMeshComponent0;     // 0x09D8 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_17_StaticMeshComponent0;               // 0x09E0 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_16_StaticMeshComponent0;               // 0x09E8 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg11_StaticMeshComponent0;     // 0x09F0 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg10_StaticMeshComponent0;     // 0x09F8 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg9_StaticMeshComponent0;      // 0x0A00 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_15_StaticMeshComponent0;               // 0x0A08 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_14_StaticMeshComponent0;               // 0x0A10 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_13_StaticMeshComponent0;               // 0x0A18 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_12_StaticMeshComponent0;               // 0x0A20 (size: 0x8)
    class USceneComponent* SG_Church_Lv2_DefaultSceneRoot;                            // 0x0A28 (size: 0x8)

}; // Size: 0xA30

#endif
