#ifndef UE4SS_SDK_C_SG_Bedchambers_HPP
#define UE4SS_SDK_C_SG_Bedchambers_HPP

class AC_SG_Bedchambers_C : public AConstructionBP_C
{
    class UStaticMeshComponent* roofSingleSmallDisp4_StaticMeshComponent0;            // 0x0550 (size: 0x8)
    class UStaticMeshComponent* roofSingleSmallDisp3_StaticMeshComponent0;            // 0x0558 (size: 0x8)
    class UStaticMeshComponent* all_aboard_pivot_boardC17_StaticMeshComponent0;       // 0x0560 (size: 0x8)
    class UStaticMeshComponent* all_aboard_pivot_boardC16_StaticMeshComponent0;       // 0x0568 (size: 0x8)
    class UStaticMeshComponent* sg_fillerBoardB61_StaticMeshComponent0;               // 0x0570 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardB_thin34_StaticMeshComponent0;          // 0x0578 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA34_StaticMeshComponent0;               // 0x0580 (size: 0x8)
    class UStaticMeshComponent* sg_fillerBoardB60_StaticMeshComponent0;               // 0x0588 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardB_thin33_StaticMeshComponent0;          // 0x0590 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardB_thin32_StaticMeshComponent0;          // 0x0598 (size: 0x8)
    class UStaticMeshComponent* sg_fillerBoardB59_StaticMeshComponent0;               // 0x05A0 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardB_thin31_StaticMeshComponent0;          // 0x05A8 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA33_StaticMeshComponent0;               // 0x05B0 (size: 0x8)
    class UStaticMeshComponent* sg_fillerBoardB58_StaticMeshComponent0;               // 0x05B8 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardB_thin30_StaticMeshComponent0;          // 0x05C0 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_97_StaticMeshComponent0; // 0x05C8 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_96_StaticMeshComponent0; // 0x05D0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short40_StaticMeshComponent0;        // 0x05D8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short39_StaticMeshComponent0;        // 0x05E0 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_95_StaticMeshComponent0; // 0x05E8 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_94_StaticMeshComponent0; // 0x05F0 (size: 0x8)
    class UStaticMeshComponent* sg_fillerBoardB57_StaticMeshComponent0;               // 0x05F8 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA32_StaticMeshComponent0;               // 0x0600 (size: 0x8)
    class UStaticMeshComponent* sg_fillerBoardB56_StaticMeshComponent0;               // 0x0608 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA31_StaticMeshComponent0;               // 0x0610 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short38_StaticMeshComponent0;        // 0x0618 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short37_StaticMeshComponent0;        // 0x0620 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short36_StaticMeshComponent0;        // 0x0628 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short35_StaticMeshComponent0;        // 0x0630 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short34_StaticMeshComponent0;        // 0x0638 (size: 0x8)
    class USceneComponent* chambers_platform2_DefaultSceneRoot;                       // 0x0640 (size: 0x8)
    class UStaticMeshComponent* sg_fillerBoardB55_StaticMeshComponent0;               // 0x0648 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA30_StaticMeshComponent0;               // 0x0650 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardB_thin29_StaticMeshComponent0;          // 0x0658 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly70_StaticMeshComponent0;    // 0x0660 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly69_StaticMeshComponent0;    // 0x0668 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly68_StaticMeshComponent0;    // 0x0670 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly67_StaticMeshComponent0;    // 0x0678 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly66_StaticMeshComponent0;    // 0x0680 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly65_StaticMeshComponent0;    // 0x0688 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly64_StaticMeshComponent0;    // 0x0690 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly63_StaticMeshComponent0;    // 0x0698 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly62_StaticMeshComponent0;    // 0x06A0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly61_StaticMeshComponent0;    // 0x06A8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly60_StaticMeshComponent0;    // 0x06B0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly59_StaticMeshComponent0;    // 0x06B8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly58_StaticMeshComponent0;    // 0x06C0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly57_StaticMeshComponent0;    // 0x06C8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly56_StaticMeshComponent0;    // 0x06D0 (size: 0x8)
    class UStaticMeshComponent* sg_woodenGableA5_StaticMeshComponent0;                // 0x06D8 (size: 0x8)
    class UStaticMeshComponent* sg_boardedGable_window4_StaticMeshComponent0;         // 0x06E0 (size: 0x8)
    class UStaticMeshComponent* sg_woodenGableA4_StaticMeshComponent0;                // 0x06E8 (size: 0x8)
    class UStaticMeshComponent* sg_boardedGable_window3_StaticMeshComponent0;         // 0x06F0 (size: 0x8)
    class UStaticMeshComponent* sg_shutterA_short6_StaticMeshComponent0;              // 0x06F8 (size: 0x8)
    class UStaticMeshComponent* SG_windowBoardC_square2_StaticMeshComponent0;         // 0x0700 (size: 0x8)
    class UStaticMeshComponent* sg_shutterA_short5_StaticMeshComponent0;              // 0x0708 (size: 0x8)
    class UStaticMeshComponent* sg_shutterA_short4_StaticMeshComponent0;              // 0x0710 (size: 0x8)
    class UStaticMeshComponent* sg_shutterA_roundedTop8_StaticMeshComponent0;         // 0x0718 (size: 0x8)
    class UStaticMeshComponent* sg_shutterA_roundedTop7_StaticMeshComponent0;         // 0x0720 (size: 0x8)
    class UStaticMeshComponent* sg_shutterA_roundedTop6_StaticMeshComponent0;         // 0x0728 (size: 0x8)
    class UStaticMeshComponent* sg_shutterA_roundedTop5_StaticMeshComponent0;         // 0x0730 (size: 0x8)
    class UStaticMeshComponent* sg_fillerBoard_RoundedWindowsOnlyTwo4_StaticMeshComponent0; // 0x0738 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardB_thin28_StaticMeshComponent0;          // 0x0740 (size: 0x8)
    class UStaticMeshComponent* sg_fillerBoardB54_StaticMeshComponent0;               // 0x0748 (size: 0x8)
    class UStaticMeshComponent* sg_fillerBoardB53_StaticMeshComponent0;               // 0x0750 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA29_StaticMeshComponent0;               // 0x0758 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardB_thin27_StaticMeshComponent0;          // 0x0760 (size: 0x8)
    class UStaticMeshComponent* sg_fillerBoardB52_StaticMeshComponent0;               // 0x0768 (size: 0x8)
    class UStaticMeshComponent* sg_fillerBoardB51_StaticMeshComponent0;               // 0x0770 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA28_StaticMeshComponent0;               // 0x0778 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardB_thin26_StaticMeshComponent0;          // 0x0780 (size: 0x8)
    class UStaticMeshComponent* sg_fillerBoardB50_StaticMeshComponent0;               // 0x0788 (size: 0x8)
    class UStaticMeshComponent* SG_windowBoardD_square__long2_StaticMeshComponent0;   // 0x0790 (size: 0x8)
    class UStaticMeshComponent* sg_fillerBoardB49_StaticMeshComponent0;               // 0x0798 (size: 0x8)
    class UStaticMeshComponent* sg_fillerBoardB48_StaticMeshComponent0;               // 0x07A0 (size: 0x8)
    class UStaticMeshComponent* sg_fillerBoardB47_StaticMeshComponent0;               // 0x07A8 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA27_StaticMeshComponent0;               // 0x07B0 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardB_thin25_StaticMeshComponent0;          // 0x07B8 (size: 0x8)
    class UStaticMeshComponent* sg_fillerBoardB46_StaticMeshComponent0;               // 0x07C0 (size: 0x8)
    class UStaticMeshComponent* sg_fillerBoardB45_StaticMeshComponent0;               // 0x07C8 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA26_StaticMeshComponent0;               // 0x07D0 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardB_thin24_StaticMeshComponent0;          // 0x07D8 (size: 0x8)
    class UStaticMeshComponent* sg_fillerBoardB44_StaticMeshComponent0;               // 0x07E0 (size: 0x8)
    class UStaticMeshComponent* sg_fillerBoardB43_StaticMeshComponent0;               // 0x07E8 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA25_StaticMeshComponent0;               // 0x07F0 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardB_thin23_StaticMeshComponent0;          // 0x07F8 (size: 0x8)
    class UStaticMeshComponent* sg_fillerBoard_RoundedWindowsOnlyTwo3_StaticMeshComponent0; // 0x0800 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardB_thin22_StaticMeshComponent0;          // 0x0808 (size: 0x8)
    class UStaticMeshComponent* sg_fillerBoardB42_StaticMeshComponent0;               // 0x0810 (size: 0x8)
    class UStaticMeshComponent* sg_fillerBoardB41_StaticMeshComponent0;               // 0x0818 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA24_StaticMeshComponent0;               // 0x0820 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardB_thin21_StaticMeshComponent0;          // 0x0828 (size: 0x8)
    class UStaticMeshComponent* sg_fillerBoardB40_StaticMeshComponent0;               // 0x0830 (size: 0x8)
    class UStaticMeshComponent* sg_fillerBoardB39_StaticMeshComponent0;               // 0x0838 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA23_StaticMeshComponent0;               // 0x0840 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardB_thin20_StaticMeshComponent0;          // 0x0848 (size: 0x8)
    class UStaticMeshComponent* sg_fillerBoardB38_StaticMeshComponent0;               // 0x0850 (size: 0x8)
    class UStaticMeshComponent* sg_fillerBoardB37_StaticMeshComponent0;               // 0x0858 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA22_StaticMeshComponent0;               // 0x0860 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardB_thin19_StaticMeshComponent0;          // 0x0868 (size: 0x8)
    class UStaticMeshComponent* sg_fillerBoardB36_StaticMeshComponent0;               // 0x0870 (size: 0x8)
    class UStaticMeshComponent* SG_windowBoardE_double_square2_StaticMeshComponent0;  // 0x0878 (size: 0x8)
    class UStaticMeshComponent* sg_fillerBoardB35_StaticMeshComponent0;               // 0x0880 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA21_StaticMeshComponent0;               // 0x0888 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardB_thin18_StaticMeshComponent0;          // 0x0890 (size: 0x8)
    class UStaticMeshComponent* roofSingleDisplaced_cutdownTinier2_StaticMeshComponent0; // 0x0898 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth107_StaticMeshComponent0;          // 0x08A0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth106_StaticMeshComponent0;          // 0x08A8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth105_StaticMeshComponent0;          // 0x08B0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth104_StaticMeshComponent0;          // 0x08B8 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_doorHead_A_SpikyTop2_StaticMeshComponent0; // 0x08C0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth103_StaticMeshComponent0;          // 0x08C8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth102_StaticMeshComponent0;          // 0x08D0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth101_StaticMeshComponent0;          // 0x08D8 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Tapered_CutE28_StaticMeshComponent0;        // 0x08E0 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Tapered_CutE27_StaticMeshComponent0;        // 0x08E8 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Tapered_CutE26_StaticMeshComponent0;        // 0x08F0 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Tapered_CutE25_StaticMeshComponent0;        // 0x08F8 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Tapered_CutE24_StaticMeshComponent0;        // 0x0900 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Tapered_CutE23_StaticMeshComponent0;        // 0x0908 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Tapered_CutE22_StaticMeshComponent0;        // 0x0910 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_93_StaticMeshComponent0; // 0x0918 (size: 0x8)
    class UStaticMeshComponent* foundationTiling_A_detailed41_StaticMeshComponent0;   // 0x0920 (size: 0x8)
    class UStaticMeshComponent* foundationTiling_A_detailed40_StaticMeshComponent0;   // 0x0928 (size: 0x8)
    class UStaticMeshComponent* foundationTiling_A_detailed39_StaticMeshComponent0;   // 0x0930 (size: 0x8)
    class UStaticMeshComponent* foundationTiling_A_detailed38_StaticMeshComponent0;   // 0x0938 (size: 0x8)
    class UStaticMeshComponent* LevitatingOuthouse2_StaticMeshComponent0;             // 0x0940 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth100_StaticMeshComponent0;          // 0x0948 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth99_StaticMeshComponent0;           // 0x0950 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Tapered_CutE21_StaticMeshComponent0;        // 0x0958 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth98_StaticMeshComponent0;           // 0x0960 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth97_StaticMeshComponent0;           // 0x0968 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Tapered_CutE20_StaticMeshComponent0;        // 0x0970 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth96_StaticMeshComponent0;           // 0x0978 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth95_StaticMeshComponent0;           // 0x0980 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Tapered_CutE19_StaticMeshComponent0;        // 0x0988 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth94_StaticMeshComponent0;           // 0x0990 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth93_StaticMeshComponent0;           // 0x0998 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Tapered_CutE18_StaticMeshComponent0;        // 0x09A0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth92_StaticMeshComponent0;           // 0x09A8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth91_StaticMeshComponent0;           // 0x09B0 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Tapered_CutE17_StaticMeshComponent0;        // 0x09B8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth90_StaticMeshComponent0;           // 0x09C0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth89_StaticMeshComponent0;           // 0x09C8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth88_StaticMeshComponent0;           // 0x09D0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth87_StaticMeshComponent0;           // 0x09D8 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Tapered_CutE16_StaticMeshComponent0;        // 0x09E0 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Tapered_CutE15_StaticMeshComponent0;        // 0x09E8 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_92_StaticMeshComponent0; // 0x09F0 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_91_StaticMeshComponent0; // 0x09F8 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_90_StaticMeshComponent0; // 0x0A00 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_89_StaticMeshComponent0; // 0x0A08 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_88_StaticMeshComponent0; // 0x0A10 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_87_StaticMeshComponent0; // 0x0A18 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_86_StaticMeshComponent0; // 0x0A20 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_85_StaticMeshComponent0; // 0x0A28 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_84_StaticMeshComponent0; // 0x0A30 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_83_StaticMeshComponent0; // 0x0A38 (size: 0x8)
    class UStaticMeshComponent* all_aboard_pivot_boardC15_StaticMeshComponent0;       // 0x0A40 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_82_StaticMeshComponent0; // 0x0A48 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_81_StaticMeshComponent0; // 0x0A50 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_80_StaticMeshComponent0; // 0x0A58 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_79_StaticMeshComponent0; // 0x0A60 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_78_StaticMeshComponent0; // 0x0A68 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_77_StaticMeshComponent0; // 0x0A70 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_76_StaticMeshComponent0; // 0x0A78 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_75_StaticMeshComponent0; // 0x0A80 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth86_StaticMeshComponent0;           // 0x0A88 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth85_StaticMeshComponent0;           // 0x0A90 (size: 0x8)
    class UStaticMeshComponent* all_aboard_pivot_boardC14_StaticMeshComponent0;       // 0x0A98 (size: 0x8)
    class UStaticMeshComponent* all_aboard_pivot_boardC13_StaticMeshComponent0;       // 0x0AA0 (size: 0x8)
    class UStaticMeshComponent* all_aboard_pivot_boardC12_StaticMeshComponent0;       // 0x0AA8 (size: 0x8)
    class UStaticMeshComponent* all_aboard_pivot_boardC11_StaticMeshComponent0;       // 0x0AB0 (size: 0x8)
    class UStaticMeshComponent* all_aboard_pivot_boardC10_StaticMeshComponent0;       // 0x0AB8 (size: 0x8)
    class UStaticMeshComponent* foundationTiling_A_detailed37_StaticMeshComponent0;   // 0x0AC0 (size: 0x8)
    class UStaticMeshComponent* foundationTiling_A_detailed36_StaticMeshComponent0;   // 0x0AC8 (size: 0x8)
    class UStaticMeshComponent* foundationTiling_A_detailed35_StaticMeshComponent0;   // 0x0AD0 (size: 0x8)
    class UStaticMeshComponent* foundationTiling_A_detailed34_StaticMeshComponent0;   // 0x0AD8 (size: 0x8)
    class UStaticMeshComponent* foundationTiling_A_detailed33_StaticMeshComponent0;   // 0x0AE0 (size: 0x8)
    class UStaticMeshComponent* foundationTiling_A_detailed32_StaticMeshComponent0;   // 0x0AE8 (size: 0x8)
    class UStaticMeshComponent* foundationTiling_A_detailed27_StaticMeshComponent0;   // 0x0AF0 (size: 0x8)
    class USceneComponent* chambers2_DefaultSceneRoot;                                // 0x0AF8 (size: 0x8)

}; // Size: 0xB00

#endif
