#ifndef UE4SS_SDK_C_SG_Malthouse_Core_HPP
#define UE4SS_SDK_C_SG_Malthouse_Core_HPP

class AC_SG_Malthouse_Core_C : public AConstructionBP_C
{
    class UStaticMeshComponent* SG_fillerBoardA402_StaticMeshComponent0;              // 0x0550 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA401_StaticMeshComponent0;              // 0x0558 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA400_StaticMeshComponent0;              // 0x0560 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA399_StaticMeshComponent0;              // 0x0568 (size: 0x8)
    class UStaticMeshComponent* sg_woodenGableA17_StaticMeshComponent0;               // 0x0570 (size: 0x8)
    class UStaticMeshComponent* sg_woodenGableA16_StaticMeshComponent0;               // 0x0578 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA398_StaticMeshComponent0;              // 0x0580 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise458_StaticMeshComponent0;              // 0x0588 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise457_StaticMeshComponent0;              // 0x0590 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise456_StaticMeshComponent0;              // 0x0598 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise455_StaticMeshComponent0;              // 0x05A0 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise454_StaticMeshComponent0;              // 0x05A8 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise453_StaticMeshComponent0;              // 0x05B0 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise452_StaticMeshComponent0;              // 0x05B8 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise451_StaticMeshComponent0;              // 0x05C0 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise450_StaticMeshComponent0;              // 0x05C8 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise449_StaticMeshComponent0;              // 0x05D0 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise448_StaticMeshComponent0;              // 0x05D8 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA397_StaticMeshComponent0;              // 0x05E0 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA396_StaticMeshComponent0;              // 0x05E8 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA395_StaticMeshComponent0;              // 0x05F0 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA394_StaticMeshComponent0;              // 0x05F8 (size: 0x8)
    class UStaticMeshComponent* SG_windowBoardC_square12_StaticMeshComponent0;        // 0x0600 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA393_StaticMeshComponent0;              // 0x0608 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA392_StaticMeshComponent0;              // 0x0610 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA391_StaticMeshComponent0;              // 0x0618 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA390_StaticMeshComponent0;              // 0x0620 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short411_StaticMeshComponent0;       // 0x0628 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA389_StaticMeshComponent0;              // 0x0630 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA388_StaticMeshComponent0;              // 0x0638 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA387_StaticMeshComponent0;              // 0x0640 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA386_StaticMeshComponent0;              // 0x0648 (size: 0x8)
    class UStaticMeshComponent* SG_windowBoardE_double4_StaticMeshComponent0;         // 0x0650 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA385_StaticMeshComponent0;              // 0x0658 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA384_StaticMeshComponent0;              // 0x0660 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA383_StaticMeshComponent0;              // 0x0668 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA382_StaticMeshComponent0;              // 0x0670 (size: 0x8)
    class UStaticMeshComponent* SG_windowBoardE_double3_StaticMeshComponent0;         // 0x0678 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA381_StaticMeshComponent0;              // 0x0680 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA380_StaticMeshComponent0;              // 0x0688 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA379_StaticMeshComponent0;              // 0x0690 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA378_StaticMeshComponent0;              // 0x0698 (size: 0x8)
    class UStaticMeshComponent* SG_windowBoardC_square10_StaticMeshComponent0;        // 0x06A0 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA377_StaticMeshComponent0;              // 0x06A8 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA376_StaticMeshComponent0;              // 0x06B0 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA375_StaticMeshComponent0;              // 0x06B8 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA374_StaticMeshComponent0;              // 0x06C0 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA373_StaticMeshComponent0;              // 0x06C8 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA372_StaticMeshComponent0;              // 0x06D0 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise447_StaticMeshComponent0;              // 0x06D8 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise446_StaticMeshComponent0;              // 0x06E0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short410_StaticMeshComponent0;       // 0x06E8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short409_StaticMeshComponent0;       // 0x06F0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short408_StaticMeshComponent0;       // 0x06F8 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise445_StaticMeshComponent0;              // 0x0700 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise376_StaticMeshComponent0;              // 0x0708 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short407_StaticMeshComponent0;       // 0x0710 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short406_StaticMeshComponent0;       // 0x0718 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short405_StaticMeshComponent0;       // 0x0720 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short404_StaticMeshComponent0;       // 0x0728 (size: 0x8)
    class UStaticMeshComponent* Aset_castle_wall_M_sdAta_LOD40_StaticMeshComponent0;  // 0x0730 (size: 0x8)
    class UStaticMeshComponent* pebbleWallDisplaced84_StaticMeshComponent0;           // 0x0738 (size: 0x8)
    class UStaticMeshComponent* Aset_castle_wall_M_sdAta_LOD37_StaticMeshComponent0;  // 0x0740 (size: 0x8)
    class UStaticMeshComponent* pebbleWallDisplaced83_StaticMeshComponent0;           // 0x0748 (size: 0x8)
    class UStaticMeshComponent* pebbleWallDisplaced82_StaticMeshComponent0;           // 0x0750 (size: 0x8)
    class UStaticMeshComponent* pebbleWallDisplaced81_StaticMeshComponent0;           // 0x0758 (size: 0x8)
    class UStaticMeshComponent* pebbleWallDisplaced80_StaticMeshComponent0;           // 0x0760 (size: 0x8)
    class UStaticMeshComponent* pebbleWallDisplaced79_StaticMeshComponent0;           // 0x0768 (size: 0x8)
    class UStaticMeshComponent* pebbleWallDisplaced78_StaticMeshComponent0;           // 0x0770 (size: 0x8)
    class UStaticMeshComponent* pebbleWallDisplaced77_StaticMeshComponent0;           // 0x0778 (size: 0x8)
    class UStaticMeshComponent* pebbleWallDisplaced76_StaticMeshComponent0;           // 0x0780 (size: 0x8)
    class UStaticMeshComponent* pebbleWallDisplaced69_StaticMeshComponent0;           // 0x0788 (size: 0x8)
    class UStaticMeshComponent* pebbleWallDisplaced68_StaticMeshComponent0;           // 0x0790 (size: 0x8)
    class UStaticMeshComponent* palisade_strut36_StaticMeshComponent0;                // 0x0798 (size: 0x8)
    class UStaticMeshComponent* palisade_strut35_StaticMeshComponent0;                // 0x07A0 (size: 0x8)
    class UStaticMeshComponent* palisade_strut34_StaticMeshComponent0;                // 0x07A8 (size: 0x8)
    class UStaticMeshComponent* palisade_strut33_StaticMeshComponent0;                // 0x07B0 (size: 0x8)
    class UStaticMeshComponent* palisade_strut32_StaticMeshComponent0;                // 0x07B8 (size: 0x8)
    class UStaticMeshComponent* palisade_strut31_StaticMeshComponent0;                // 0x07C0 (size: 0x8)
    class UStaticMeshComponent* palisade_strut30_StaticMeshComponent0;                // 0x07C8 (size: 0x8)
    class UStaticMeshComponent* palisade_strut29_StaticMeshComponent0;                // 0x07D0 (size: 0x8)
    class UStaticMeshComponent* palisade_strut28_StaticMeshComponent0;                // 0x07D8 (size: 0x8)
    class UStaticMeshComponent* palisade_strut27_StaticMeshComponent0;                // 0x07E0 (size: 0x8)
    class UStaticMeshComponent* palisade_strut26_StaticMeshComponent0;                // 0x07E8 (size: 0x8)
    class UStaticMeshComponent* palisade_strut25_StaticMeshComponent0;                // 0x07F0 (size: 0x8)
    class UStaticMeshComponent* owidzThatch_Filled7_StaticMeshComponent0;             // 0x07F8 (size: 0x8)
    class UStaticMeshComponent* owidzThatch_Filled6_StaticMeshComponent0;             // 0x0800 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long_diagonalD123_StaticMeshComponent0; // 0x0808 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long_diagonalD122_StaticMeshComponent0; // 0x0810 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long_diagonalD121_StaticMeshComponent0; // 0x0818 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long_diagonalD120_StaticMeshComponent0; // 0x0820 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long_diagonalD119_StaticMeshComponent0; // 0x0828 (size: 0x8)
    class UStaticMeshComponent* doorHeadA_angled6_StaticMeshComponent0;               // 0x0830 (size: 0x8)
    class USceneComponent* SG_Malthouse_Core2_DefaultSceneRoot;                       // 0x0838 (size: 0x8)

}; // Size: 0x840

#endif
