#ifndef UE4SS_SDK_C_SG_HayShed_HPP
#define UE4SS_SDK_C_SG_HayShed_HPP

class AC_SG_HayShed_C : public AConstructionBP_C
{
    class UStaticMeshComponent* UBeam_FillerBoardBeveledSharp79_StaticMeshComponent0; // 0x0550 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m246_StaticMeshComponent0;                     // 0x0558 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m245_StaticMeshComponent0;                     // 0x0560 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_28_StaticMeshComponent0;               // 0x0568 (size: 0x8)
    class UStaticMeshComponent* roof_thatch_hayShed2_StaticMeshComponent0;            // 0x0570 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_27_StaticMeshComponent0;               // 0x0578 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_26_StaticMeshComponent0;               // 0x0580 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_25_StaticMeshComponent0;               // 0x0588 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_24_StaticMeshComponent0;               // 0x0590 (size: 0x8)
    class UStaticMeshComponent* UGable_Standard4_StaticMeshComponent0;                // 0x0598 (size: 0x8)
    class UStaticMeshComponent* UGable_Standard3_StaticMeshComponent0;                // 0x05A0 (size: 0x8)
    class UStaticMeshComponent* roofSingleDisplaced_cutdownTiny4_StaticMeshComponent0; // 0x05A8 (size: 0x8)
    class UStaticMeshComponent* roofSingleDisplaced_cutdownTiny3_StaticMeshComponent0; // 0x05B0 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m244_StaticMeshComponent0;                     // 0x05B8 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_23_StaticMeshComponent0;               // 0x05C0 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_22_StaticMeshComponent0;               // 0x05C8 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m243_StaticMeshComponent0;                     // 0x05D0 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m242_StaticMeshComponent0;                     // 0x05D8 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m241_StaticMeshComponent0;                     // 0x05E0 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m240_StaticMeshComponent0;                     // 0x05E8 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m239_StaticMeshComponent0;                     // 0x05F0 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m238_StaticMeshComponent0;                     // 0x05F8 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m237_StaticMeshComponent0;                     // 0x0600 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m236_StaticMeshComponent0;                     // 0x0608 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m235_StaticMeshComponent0;                     // 0x0610 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m234_StaticMeshComponent0;                     // 0x0618 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m233_StaticMeshComponent0;                     // 0x0620 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m232_StaticMeshComponent0;                     // 0x0628 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m231_StaticMeshComponent0;                     // 0x0630 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m230_StaticMeshComponent0;                     // 0x0638 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m229_StaticMeshComponent0;                     // 0x0640 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m228_StaticMeshComponent0;                     // 0x0648 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m227_StaticMeshComponent0;                     // 0x0650 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m226_StaticMeshComponent0;                     // 0x0658 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m225_StaticMeshComponent0;                     // 0x0660 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m224_StaticMeshComponent0;                     // 0x0668 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m223_StaticMeshComponent0;                     // 0x0670 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m222_StaticMeshComponent0;                     // 0x0678 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m221_StaticMeshComponent0;                     // 0x0680 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardBeveledSharp78_StaticMeshComponent0; // 0x0688 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardBeveledSharp77_StaticMeshComponent0; // 0x0690 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardBeveledSharp76_StaticMeshComponent0; // 0x0698 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardBeveledSharp75_StaticMeshComponent0; // 0x06A0 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardBeveledSharp74_StaticMeshComponent0; // 0x06A8 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardBeveledSharp73_StaticMeshComponent0; // 0x06B0 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardBeveledSharp72_StaticMeshComponent0; // 0x06B8 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardBeveledSharp71_StaticMeshComponent0; // 0x06C0 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardBeveledSharp70_StaticMeshComponent0; // 0x06C8 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardBeveledSharp69_StaticMeshComponent0; // 0x06D0 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardBeveledSharp68_StaticMeshComponent0; // 0x06D8 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardBeveledSharp67_StaticMeshComponent0; // 0x06E0 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardBeveledSharp66_StaticMeshComponent0; // 0x06E8 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardBeveledSharp65_StaticMeshComponent0; // 0x06F0 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardBeveledSharp64_StaticMeshComponent0; // 0x06F8 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardBeveledSharp63_StaticMeshComponent0; // 0x0700 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardBeveledSharp62_StaticMeshComponent0; // 0x0708 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardBeveledSharp61_StaticMeshComponent0; // 0x0710 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardBeveledSharp60_StaticMeshComponent0; // 0x0718 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardBeveledSharp59_StaticMeshComponent0; // 0x0720 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardBeveledSharp58_StaticMeshComponent0; // 0x0728 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardBeveledSharp57_StaticMeshComponent0; // 0x0730 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardBeveledSharp56_StaticMeshComponent0; // 0x0738 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardBeveledSharp55_StaticMeshComponent0; // 0x0740 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardBeveledSharp54_StaticMeshComponent0; // 0x0748 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardBeveledSharp53_StaticMeshComponent0; // 0x0750 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardBeveledSharp52_StaticMeshComponent0; // 0x0758 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardBeveledSharp51_StaticMeshComponent0; // 0x0760 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardBeveledSharp43_StaticMeshComponent0; // 0x0768 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardBeveledSharp42_StaticMeshComponent0; // 0x0770 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardBeveledSharp41_StaticMeshComponent0; // 0x0778 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardBeveledSharp40_StaticMeshComponent0; // 0x0780 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardBeveledSharp39_StaticMeshComponent0; // 0x0788 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardBeveledSharp38_StaticMeshComponent0; // 0x0790 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardBeveledSharp37_StaticMeshComponent0; // 0x0798 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardBeveledSharp20_StaticMeshComponent0; // 0x07A0 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardBeveledSharp18_StaticMeshComponent0; // 0x07A8 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardBeveledSharp17_StaticMeshComponent0; // 0x07B0 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m220_StaticMeshComponent0;                     // 0x07B8 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m219_StaticMeshComponent0;                     // 0x07C0 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m218_StaticMeshComponent0;                     // 0x07C8 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m217_StaticMeshComponent0;                     // 0x07D0 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m216_StaticMeshComponent0;                     // 0x07D8 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m215_StaticMeshComponent0;                     // 0x07E0 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m214_StaticMeshComponent0;                     // 0x07E8 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m188_StaticMeshComponent0;                     // 0x07F0 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m187_StaticMeshComponent0;                     // 0x07F8 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m186_StaticMeshComponent0;                     // 0x0800 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m181_StaticMeshComponent0;                     // 0x0808 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m176_StaticMeshComponent0;                     // 0x0810 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m174_StaticMeshComponent0;                     // 0x0818 (size: 0x8)
    class USceneComponent* SG_hayShed2_DefaultSceneRoot;                              // 0x0820 (size: 0x8)

}; // Size: 0x828

#endif
