#ifndef UE4SS_SDK_C_SG_VentilTower_HPP
#define UE4SS_SDK_C_SG_VentilTower_HPP

class AC_SG_VentilTower_C : public AConstructionBP_C
{
    class UStaticMeshComponent* BlackCube_StaticMeshComponent0;                       // 0x0550 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m_StaticMeshComponent0;                        // 0x0558 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m2_StaticMeshComponent0;                       // 0x0560 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m3_StaticMeshComponent0;                       // 0x0568 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m4_StaticMeshComponent0;                       // 0x0570 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_09_StaticMeshComponent0;               // 0x0578 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA_StaticMeshComponent0;              // 0x0580 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA2_StaticMeshComponent0;             // 0x0588 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA3_StaticMeshComponent0;             // 0x0590 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA4_StaticMeshComponent0;             // 0x0598 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA5_StaticMeshComponent0;             // 0x05A0 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m_StaticMeshComponent0;                        // 0x05A8 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m2_StaticMeshComponent0;                       // 0x05B0 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m3_StaticMeshComponent0;                       // 0x05B8 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m4_StaticMeshComponent0;                       // 0x05C0 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA21_StaticMeshComponent0;            // 0x05C8 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA22_StaticMeshComponent0;            // 0x05D0 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA26_StaticMeshComponent0;            // 0x05D8 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA27_StaticMeshComponent0;            // 0x05E0 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA28_StaticMeshComponent0;            // 0x05E8 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA6_StaticMeshComponent0;             // 0x05F0 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA7_StaticMeshComponent0;             // 0x05F8 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA8_StaticMeshComponent0;             // 0x0600 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA9_StaticMeshComponent0;             // 0x0608 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA10_StaticMeshComponent0;            // 0x0610 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA24_StaticMeshComponent0;            // 0x0618 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA11_StaticMeshComponent0;            // 0x0620 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA12_StaticMeshComponent0;            // 0x0628 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA13_StaticMeshComponent0;            // 0x0630 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA14_StaticMeshComponent0;            // 0x0638 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA15_StaticMeshComponent0;            // 0x0640 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA32_StaticMeshComponent0;            // 0x0648 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA16_StaticMeshComponent0;            // 0x0650 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA17_StaticMeshComponent0;            // 0x0658 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA18_StaticMeshComponent0;            // 0x0660 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA19_StaticMeshComponent0;            // 0x0668 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA20_StaticMeshComponent0;            // 0x0670 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA37_StaticMeshComponent0;            // 0x0678 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m5_StaticMeshComponent0;                       // 0x0680 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA29_StaticMeshComponent0;            // 0x0688 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA23_StaticMeshComponent0;            // 0x0690 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA25_StaticMeshComponent0;            // 0x0698 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA30_StaticMeshComponent0;            // 0x06A0 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA31_StaticMeshComponent0;            // 0x06A8 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA33_StaticMeshComponent0;            // 0x06B0 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA34_StaticMeshComponent0;            // 0x06B8 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA35_StaticMeshComponent0;            // 0x06C0 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m6_StaticMeshComponent0;                       // 0x06C8 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m7_StaticMeshComponent0;                       // 0x06D0 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA36_StaticMeshComponent0;            // 0x06D8 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA38_StaticMeshComponent0;            // 0x06E0 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA39_StaticMeshComponent0;            // 0x06E8 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA40_StaticMeshComponent0;            // 0x06F0 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m8_StaticMeshComponent0;                       // 0x06F8 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA41_StaticMeshComponent0;            // 0x0700 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA42_StaticMeshComponent0;            // 0x0708 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA43_StaticMeshComponent0;            // 0x0710 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA44_StaticMeshComponent0;            // 0x0718 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA45_StaticMeshComponent0;            // 0x0720 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA46_StaticMeshComponent0;            // 0x0728 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA47_StaticMeshComponent0;            // 0x0730 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA48_StaticMeshComponent0;            // 0x0738 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m9_StaticMeshComponent0;                       // 0x0740 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m10_StaticMeshComponent0;                      // 0x0748 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m5_StaticMeshComponent0;                       // 0x0750 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_07_StaticMeshComponent0;               // 0x0758 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m11_StaticMeshComponent0;                      // 0x0760 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m12_StaticMeshComponent0;                      // 0x0768 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m13_StaticMeshComponent0;                      // 0x0770 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m14_StaticMeshComponent0;                      // 0x0778 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m15_StaticMeshComponent0;                      // 0x0780 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_11_StaticMeshComponent0;               // 0x0788 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m16_StaticMeshComponent0;                      // 0x0790 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m17_StaticMeshComponent0;                      // 0x0798 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m18_StaticMeshComponent0;                      // 0x07A0 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m19_StaticMeshComponent0;                      // 0x07A8 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m20_StaticMeshComponent0;                      // 0x07B0 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m21_StaticMeshComponent0;                      // 0x07B8 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m22_StaticMeshComponent0;                      // 0x07C0 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m23_StaticMeshComponent0;                      // 0x07C8 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m24_StaticMeshComponent0;                      // 0x07D0 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m25_StaticMeshComponent0;                      // 0x07D8 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m26_StaticMeshComponent0;                      // 0x07E0 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_8_StaticMeshComponent0;                // 0x07E8 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_9_StaticMeshComponent0;                // 0x07F0 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_10_StaticMeshComponent0;               // 0x07F8 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_12_StaticMeshComponent0;               // 0x0800 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_13_StaticMeshComponent0;               // 0x0808 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_14_StaticMeshComponent0;               // 0x0810 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_15_StaticMeshComponent0;               // 0x0818 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_16_StaticMeshComponent0;               // 0x0820 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_17_StaticMeshComponent0;               // 0x0828 (size: 0x8)
    class UStaticMeshComponent* Roof_VentilTower_StaticMeshComponent0;                // 0x0830 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg_StaticMeshComponent0;       // 0x0838 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg2_StaticMeshComponent0;      // 0x0840 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg3_StaticMeshComponent0;      // 0x0848 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg4_StaticMeshComponent0;      // 0x0850 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg5_StaticMeshComponent0;      // 0x0858 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg6_StaticMeshComponent0;      // 0x0860 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg7_StaticMeshComponent0;      // 0x0868 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg8_StaticMeshComponent0;      // 0x0870 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg9_StaticMeshComponent0;      // 0x0878 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg10_StaticMeshComponent0;     // 0x0880 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg11_StaticMeshComponent0;     // 0x0888 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg12_StaticMeshComponent0;     // 0x0890 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg13_StaticMeshComponent0;     // 0x0898 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg14_StaticMeshComponent0;     // 0x08A0 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg15_StaticMeshComponent0;     // 0x08A8 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg16_StaticMeshComponent0;     // 0x08B0 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg17_StaticMeshComponent0;     // 0x08B8 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg18_StaticMeshComponent0;     // 0x08C0 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg19_StaticMeshComponent0;     // 0x08C8 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg20_StaticMeshComponent0;     // 0x08D0 (size: 0x8)
    class USceneComponent* C_SG_VentilTower_DefaultSceneRoot;                         // 0x08D8 (size: 0x8)

}; // Size: 0x8E0

#endif
