#ifndef UE4SS_SDK_C_SG_Tavern_LV2_BigShed_HPP
#define UE4SS_SDK_C_SG_Tavern_LV2_BigShed_HPP

class AC_SG_Tavern_LV2_BigShed_C : public AConstructionBP_C
{
    class UStaticMeshComponent* UBeam_3m59_StaticMeshComponent0;                      // 0x0550 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m60_StaticMeshComponent0;                      // 0x0558 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m61_StaticMeshComponent0;                      // 0x0560 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m62_StaticMeshComponent0;                      // 0x0568 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m63_StaticMeshComponent0;                      // 0x0570 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m64_StaticMeshComponent0;                      // 0x0578 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m65_StaticMeshComponent0;                      // 0x0580 (size: 0x8)
    class UStaticMeshComponent* UBeam_TaperedCutB10_StaticMeshComponent0;             // 0x0588 (size: 0x8)
    class UStaticMeshComponent* UBeam_TaperedCutB11_StaticMeshComponent0;             // 0x0590 (size: 0x8)
    class UStaticMeshComponent* UBeam_TaperedCutB12_StaticMeshComponent0;             // 0x0598 (size: 0x8)
    class UStaticMeshComponent* UBeam_TaperedCutB13_StaticMeshComponent0;             // 0x05A0 (size: 0x8)
    class UStaticMeshComponent* UBeam_TaperedCutB14_StaticMeshComponent0;             // 0x05A8 (size: 0x8)
    class UStaticMeshComponent* UBeam_TaperedCutB15_StaticMeshComponent0;             // 0x05B0 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m66_StaticMeshComponent0;                      // 0x05B8 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m67_StaticMeshComponent0;                      // 0x05C0 (size: 0x8)
    class UStaticMeshComponent* UBeam_TaperedCutB16_StaticMeshComponent0;             // 0x05C8 (size: 0x8)
    class UStaticMeshComponent* UBeam_TaperedCutB17_StaticMeshComponent0;             // 0x05D0 (size: 0x8)
    class UStaticMeshComponent* UBeam_TaperedCutB18_StaticMeshComponent0;             // 0x05D8 (size: 0x8)
    class UStaticMeshComponent* UBeam_GableSimpleA4_StaticMeshComponent0;             // 0x05E0 (size: 0x8)
    class UStaticMeshComponent* UBeam_GableSimpleA5_StaticMeshComponent0;             // 0x05E8 (size: 0x8)
    class UStaticMeshComponent* sg_WallRough_A26_StaticMeshComponent0;                // 0x05F0 (size: 0x8)
    class UStaticMeshComponent* sg_WallRough_B12_StaticMeshComponent0;                // 0x05F8 (size: 0x8)
    class UStaticMeshComponent* sg_WallRough_C23_StaticMeshComponent0;                // 0x0600 (size: 0x8)
    class UStaticMeshComponent* sg_WallRough_A27_StaticMeshComponent0;                // 0x0608 (size: 0x8)
    class UStaticMeshComponent* sg_WallRough_C24_StaticMeshComponent0;                // 0x0610 (size: 0x8)
    class UStaticMeshComponent* sg_WallRough_A28_StaticMeshComponent0;                // 0x0618 (size: 0x8)
    class UStaticMeshComponent* sg_WallRough_A29_StaticMeshComponent0;                // 0x0620 (size: 0x8)
    class UStaticMeshComponent* sg_WallRough_B13_StaticMeshComponent0;                // 0x0628 (size: 0x8)
    class UStaticMeshComponent* sg_WallRough_C25_StaticMeshComponent0;                // 0x0630 (size: 0x8)
    class UStaticMeshComponent* sg_WallRough_C26_StaticMeshComponent0;                // 0x0638 (size: 0x8)
    class UStaticMeshComponent* sg_WallRough_A30_StaticMeshComponent0;                // 0x0640 (size: 0x8)
    class UStaticMeshComponent* sg_WallRough_A31_StaticMeshComponent0;                // 0x0648 (size: 0x8)
    class UStaticMeshComponent* sg_WallRough_B14_StaticMeshComponent0;                // 0x0650 (size: 0x8)
    class UStaticMeshComponent* sg_WallRough_C27_StaticMeshComponent0;                // 0x0658 (size: 0x8)
    class UStaticMeshComponent* sg_WallRough_C28_StaticMeshComponent0;                // 0x0660 (size: 0x8)
    class UStaticMeshComponent* sg_WallRough_A32_StaticMeshComponent0;                // 0x0668 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_104_StaticMeshComponent0; // 0x0670 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_105_StaticMeshComponent0; // 0x0678 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_106_StaticMeshComponent0; // 0x0680 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_107_StaticMeshComponent0; // 0x0688 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_108_StaticMeshComponent0; // 0x0690 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m148_StaticMeshComponent0;                // 0x0698 (size: 0x8)
    class UStaticMeshComponent* sg_WallRough_A33_StaticMeshComponent0;                // 0x06A0 (size: 0x8)
    class UStaticMeshComponent* sg_WallRough_A34_StaticMeshComponent0;                // 0x06A8 (size: 0x8)
    class UStaticMeshComponent* sg_WallRough_A35_StaticMeshComponent0;                // 0x06B0 (size: 0x8)
    class UStaticMeshComponent* sg_WallRough_B15_StaticMeshComponent0;                // 0x06B8 (size: 0x8)
    class UStaticMeshComponent* sg_WallRough_C29_StaticMeshComponent0;                // 0x06C0 (size: 0x8)
    class UStaticMeshComponent* sg_WallRough_A36_StaticMeshComponent0;                // 0x06C8 (size: 0x8)
    class UStaticMeshComponent* sg_WallRough_C30_StaticMeshComponent0;                // 0x06D0 (size: 0x8)
    class UStaticMeshComponent* sg_WallRough_A37_StaticMeshComponent0;                // 0x06D8 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_109_StaticMeshComponent0; // 0x06E0 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_110_StaticMeshComponent0; // 0x06E8 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_111_StaticMeshComponent0; // 0x06F0 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_112_StaticMeshComponent0; // 0x06F8 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_113_StaticMeshComponent0; // 0x0700 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_114_StaticMeshComponent0; // 0x0708 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_115_StaticMeshComponent0; // 0x0710 (size: 0x8)
    class UStaticMeshComponent* sg_WallRough_A38_StaticMeshComponent0;                // 0x0718 (size: 0x8)
    class UStaticMeshComponent* sg_WallRough_B16_StaticMeshComponent0;                // 0x0720 (size: 0x8)
    class UStaticMeshComponent* sg_WallRough_C31_StaticMeshComponent0;                // 0x0728 (size: 0x8)
    class UStaticMeshComponent* sg_WallRough_C32_StaticMeshComponent0;                // 0x0730 (size: 0x8)
    class UStaticMeshComponent* sg_WallRough_A39_StaticMeshComponent0;                // 0x0738 (size: 0x8)
    class UStaticMeshComponent* sg_WallRough_A40_StaticMeshComponent0;                // 0x0740 (size: 0x8)
    class UStaticMeshComponent* sg_WallRough_A41_StaticMeshComponent0;                // 0x0748 (size: 0x8)
    class UStaticMeshComponent* sg_WallRough_B17_StaticMeshComponent0;                // 0x0750 (size: 0x8)
    class UStaticMeshComponent* sg_WallRough_C33_StaticMeshComponent0;                // 0x0758 (size: 0x8)
    class UStaticMeshComponent* sg_WallRough_C34_StaticMeshComponent0;                // 0x0760 (size: 0x8)
    class UStaticMeshComponent* sg_WallRough_A42_StaticMeshComponent0;                // 0x0768 (size: 0x8)
    class UStaticMeshComponent* sg_WallRough_A43_StaticMeshComponent0;                // 0x0770 (size: 0x8)
    class UStaticMeshComponent* sg_WallRough_B18_StaticMeshComponent0;                // 0x0778 (size: 0x8)
    class UStaticMeshComponent* sg_WallRough_C35_StaticMeshComponent0;                // 0x0780 (size: 0x8)
    class UStaticMeshComponent* sg_WallRough_C36_StaticMeshComponent0;                // 0x0788 (size: 0x8)
    class UStaticMeshComponent* sg_WallRough_A44_StaticMeshComponent0;                // 0x0790 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m209_StaticMeshComponent0;                // 0x0798 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m167_StaticMeshComponent0;                // 0x07A0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m168_StaticMeshComponent0;                // 0x07A8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m170_StaticMeshComponent0;                // 0x07B0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m171_StaticMeshComponent0;                // 0x07B8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m172_StaticMeshComponent0;                // 0x07C0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m210_StaticMeshComponent0;                // 0x07C8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m248_StaticMeshComponent0;                // 0x07D0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m249_StaticMeshComponent0;                // 0x07D8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m211_StaticMeshComponent0;                // 0x07E0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m212_StaticMeshComponent0;                // 0x07E8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m250_StaticMeshComponent0;                // 0x07F0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m251_StaticMeshComponent0;                // 0x07F8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m252_StaticMeshComponent0;                // 0x0800 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m253_StaticMeshComponent0;                // 0x0808 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m254_StaticMeshComponent0;                // 0x0810 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m255_StaticMeshComponent0;                // 0x0818 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_TwoWindowsStandard_Wide_RightPadding3_StaticMeshComponent0; // 0x0820 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_TwoWindowsStandard_Wide_RightPadding4_StaticMeshComponent0; // 0x0828 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_TwoWindowsStandard_Wider3_StaticMeshComponent0; // 0x0830 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_TwoWindowsStandard_Wider4_StaticMeshComponent0; // 0x0838 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA22_StaticMeshComponent0;            // 0x0840 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardBeveled17_StaticMeshComponent0;      // 0x0848 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardBeveledSharp20_StaticMeshComponent0; // 0x0850 (size: 0x8)
    class UStaticMeshComponent* UBeam_windowBoard_TwoRoundedWindows3_StaticMeshComponent0; // 0x0858 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardBeveled18_StaticMeshComponent0;      // 0x0860 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardBeveledSharp21_StaticMeshComponent0; // 0x0868 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA23_StaticMeshComponent0;            // 0x0870 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardBeveled19_StaticMeshComponent0;      // 0x0878 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardBeveledSharp22_StaticMeshComponent0; // 0x0880 (size: 0x8)
    class UStaticMeshComponent* UBeam_windowBoard_TwoRoundedWindows4_StaticMeshComponent0; // 0x0888 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardBeveled20_StaticMeshComponent0;      // 0x0890 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardBeveledSharp23_StaticMeshComponent0; // 0x0898 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA24_StaticMeshComponent0;            // 0x08A0 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardBeveled21_StaticMeshComponent0;      // 0x08A8 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardBeveledSharp24_StaticMeshComponent0; // 0x08B0 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardBeveled22_StaticMeshComponent0;      // 0x08B8 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardBeveledSharp25_StaticMeshComponent0; // 0x08C0 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardBeveledSharp26_StaticMeshComponent0; // 0x08C8 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_116_StaticMeshComponent0; // 0x08D0 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_117_StaticMeshComponent0; // 0x08D8 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_118_StaticMeshComponent0; // 0x08E0 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_119_StaticMeshComponent0; // 0x08E8 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_120_StaticMeshComponent0; // 0x08F0 (size: 0x8)
    class UStaticMeshComponent* UBeam_windowBoardD_square__longer5_StaticMeshComponent0; // 0x08F8 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA25_StaticMeshComponent0;            // 0x0900 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardBeveled23_StaticMeshComponent0;      // 0x0908 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardBeveledSharp27_StaticMeshComponent0; // 0x0910 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardBeveled24_StaticMeshComponent0;      // 0x0918 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardBeveledSharp28_StaticMeshComponent0; // 0x0920 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardBeveledSharp29_StaticMeshComponent0; // 0x0928 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardBeveledSharp30_StaticMeshComponent0; // 0x0930 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg179_StaticMeshComponent0;    // 0x0938 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg180_StaticMeshComponent0;    // 0x0940 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg181_StaticMeshComponent0;    // 0x0948 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg182_StaticMeshComponent0;    // 0x0950 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg183_StaticMeshComponent0;    // 0x0958 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg184_StaticMeshComponent0;    // 0x0960 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg185_StaticMeshComponent0;    // 0x0968 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg186_StaticMeshComponent0;    // 0x0970 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg187_StaticMeshComponent0;    // 0x0978 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg188_StaticMeshComponent0;    // 0x0980 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg189_StaticMeshComponent0;    // 0x0988 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg190_StaticMeshComponent0;    // 0x0990 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m256_StaticMeshComponent0;                // 0x0998 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m68_StaticMeshComponent0;                      // 0x09A0 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m69_StaticMeshComponent0;                      // 0x09A8 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m70_StaticMeshComponent0;                      // 0x09B0 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m71_StaticMeshComponent0;                      // 0x09B8 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m72_StaticMeshComponent0;                      // 0x09C0 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg191_StaticMeshComponent0;    // 0x09C8 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg192_StaticMeshComponent0;    // 0x09D0 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg193_StaticMeshComponent0;    // 0x09D8 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg194_StaticMeshComponent0;    // 0x09E0 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg195_StaticMeshComponent0;    // 0x09E8 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg196_StaticMeshComponent0;    // 0x09F0 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg197_StaticMeshComponent0;    // 0x09F8 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg198_StaticMeshComponent0;    // 0x0A00 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg199_StaticMeshComponent0;    // 0x0A08 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg200_StaticMeshComponent0;    // 0x0A10 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg201_StaticMeshComponent0;    // 0x0A18 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg202_StaticMeshComponent0;    // 0x0A20 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg203_StaticMeshComponent0;    // 0x0A28 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg204_StaticMeshComponent0;    // 0x0A30 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg205_StaticMeshComponent0;    // 0x0A38 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg206_StaticMeshComponent0;    // 0x0A40 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg207_StaticMeshComponent0;    // 0x0A48 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg208_StaticMeshComponent0;    // 0x0A50 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg209_StaticMeshComponent0;    // 0x0A58 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg210_StaticMeshComponent0;    // 0x0A60 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg211_StaticMeshComponent0;    // 0x0A68 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg212_StaticMeshComponent0;    // 0x0A70 (size: 0x8)
    class UStaticMeshComponent* WattleOwidzTriangle7_StaticMeshComponent0;            // 0x0A78 (size: 0x8)
    class UStaticMeshComponent* UBeam_WindowFrame27_StaticMeshComponent0;             // 0x0A80 (size: 0x8)
    class UStaticMeshComponent* UBeam_WindowFrame28_StaticMeshComponent0;             // 0x0A88 (size: 0x8)
    class UStaticMeshComponent* UBeam_WindowFrame29_StaticMeshComponent0;             // 0x0A90 (size: 0x8)
    class UStaticMeshComponent* UBeam_WindowFrame30_StaticMeshComponent0;             // 0x0A98 (size: 0x8)
    class UStaticMeshComponent* Thatch_SG_tavern_lv2_bigShed2_StaticMeshComponent0;   // 0x0AA0 (size: 0x8)
    class UStaticMeshComponent* Foundation_tavern_lvl2_bigShed2_StaticMeshComponent0; // 0x0AA8 (size: 0x8)
    class USceneComponent* C_SG_Tavern_BigShed_DefaultSceneRoot;                      // 0x0AB0 (size: 0x8)

}; // Size: 0xAB8

#endif
