#ifndef UE4SS_SDK_C_SG_OuthouseHug_00_HPP
#define UE4SS_SDK_C_SG_OuthouseHug_00_HPP

class AC_SG_OuthouseHug_00_C : public AConstructionBP_C
{
    class UStaticMeshComponent* UBeam_FillerBoardA42_StaticMeshComponent3;            // 0x0550 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA42_StaticMeshComponent2;            // 0x0558 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA42_StaticMeshComponent1;            // 0x0560 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA57_StaticMeshComponent0;            // 0x0568 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA56_StaticMeshComponent0;            // 0x0570 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA55_StaticMeshComponent0;            // 0x0578 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA54_StaticMeshComponent0;            // 0x0580 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA53_StaticMeshComponent0;            // 0x0588 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA52_StaticMeshComponent0;            // 0x0590 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA51_StaticMeshComponent0;            // 0x0598 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA50_StaticMeshComponent0;            // 0x05A0 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA49_StaticMeshComponent0;            // 0x05A8 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA48_StaticMeshComponent0;            // 0x05B0 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m16_StaticMeshComponent0;                      // 0x05B8 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m15_StaticMeshComponent0;                      // 0x05C0 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m14_StaticMeshComponent0;                      // 0x05C8 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m13_StaticMeshComponent0;                      // 0x05D0 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA47_StaticMeshComponent0;            // 0x05D8 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA46_StaticMeshComponent0;            // 0x05E0 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA45_StaticMeshComponent0;            // 0x05E8 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m12_StaticMeshComponent0;                      // 0x05F0 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m11_StaticMeshComponent0;                      // 0x05F8 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m10_StaticMeshComponent0;                      // 0x0600 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m9_StaticMeshComponent0;                       // 0x0608 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA44_StaticMeshComponent0;            // 0x0610 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA43_StaticMeshComponent0;            // 0x0618 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA42_StaticMeshComponent0;            // 0x0620 (size: 0x8)
    class USceneComponent* outhouse_hug2_DefaultSceneRoot;                            // 0x0628 (size: 0x8)

}; // Size: 0x630

#endif
