#ifndef UE4SS_SDK_C_SG_Malthouse_Attachment_HPP
#define UE4SS_SDK_C_SG_Malthouse_Attachment_HPP

class AC_SG_Malthouse_Attachment_C : public AConstructionBP_C
{
    class UStaticMeshComponent* sg_woodenGableA17_StaticMeshComponent0;               // 0x0550 (size: 0x8)
    class UStaticMeshComponent* sg_woodenGableA16_StaticMeshComponent0;               // 0x0558 (size: 0x8)
    class UStaticMeshComponent* Aset_castle_wall_M_sdAta_LOD57_StaticMeshComponent0;  // 0x0560 (size: 0x8)
    class UStaticMeshComponent* Aset_castle_wall_M_sdAta_LOD56_StaticMeshComponent0;  // 0x0568 (size: 0x8)
    class UStaticMeshComponent* Aset_castle_wall_M_sdAta_LOD55_StaticMeshComponent0;  // 0x0570 (size: 0x8)
    class UStaticMeshComponent* Aset_castle_wall_M_sdAta_LOD54_StaticMeshComponent0;  // 0x0578 (size: 0x8)
    class UStaticMeshComponent* Aset_castle_wall_M_sdAta_LOD53_StaticMeshComponent0;  // 0x0580 (size: 0x8)
    class UStaticMeshComponent* Aset_castle_wall_M_sdAta_LOD52_StaticMeshComponent0;  // 0x0588 (size: 0x8)
    class UStaticMeshComponent* Aset_castle_wall_M_sdAta_LOD51_StaticMeshComponent0;  // 0x0590 (size: 0x8)
    class UStaticMeshComponent* Aset_castle_wall_M_sdAta_LOD50_StaticMeshComponent0;  // 0x0598 (size: 0x8)
    class UStaticMeshComponent* Aset_castle_wall_M_sdAta_LOD49_StaticMeshComponent0;  // 0x05A0 (size: 0x8)
    class UStaticMeshComponent* Aset_castle_wall_M_sdAta_LOD48_StaticMeshComponent0;  // 0x05A8 (size: 0x8)
    class UStaticMeshComponent* Aset_castle_wall_M_sdAta_LOD47_StaticMeshComponent0;  // 0x05B0 (size: 0x8)
    class UStaticMeshComponent* Aset_castle_wall_M_sdAta_LOD46_StaticMeshComponent0;  // 0x05B8 (size: 0x8)
    class UStaticMeshComponent* Aset_castle_wall_M_sdAta_LOD45_StaticMeshComponent0;  // 0x05C0 (size: 0x8)
    class UStaticMeshComponent* Aset_castle_wall_M_sdAta_LOD44_StaticMeshComponent0;  // 0x05C8 (size: 0x8)
    class UStaticMeshComponent* Aset_castle_wall_M_sdAta_LOD43_StaticMeshComponent0;  // 0x05D0 (size: 0x8)
    class UStaticMeshComponent* Aset_castle_wall_M_sdAta_LOD42_StaticMeshComponent0;  // 0x05D8 (size: 0x8)
    class UStaticMeshComponent* Aset_castle_wall_M_sdAta_LOD41_StaticMeshComponent0;  // 0x05E0 (size: 0x8)
    class UStaticMeshComponent* Aset_castle_wall_M_sdAta_LOD40_StaticMeshComponent0;  // 0x05E8 (size: 0x8)
    class UStaticMeshComponent* Aset_castle_wall_M_sdAta_LOD37_StaticMeshComponent0;  // 0x05F0 (size: 0x8)
    class UStaticMeshComponent* black37_StaticMeshComponent0;                         // 0x05F8 (size: 0x8)
    class UStaticMeshComponent* pebbleWallOven2_StaticMeshComponent0;                 // 0x0600 (size: 0x8)
    class UStaticMeshComponent* roofSingleSmallDisp5_StaticMeshComponent0;            // 0x0608 (size: 0x8)
    class UStaticMeshComponent* roofSingleSmallDisp4_StaticMeshComponent0;            // 0x0610 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m671_StaticMeshComponent0;                // 0x0618 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m670_StaticMeshComponent0;                // 0x0620 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long_diagonalD130_StaticMeshComponent0; // 0x0628 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long_diagonalD129_StaticMeshComponent0; // 0x0630 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long_diagonalD128_StaticMeshComponent0; // 0x0638 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long_diagonalD127_StaticMeshComponent0; // 0x0640 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m669_StaticMeshComponent0;                // 0x0648 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m668_StaticMeshComponent0;                // 0x0650 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m667_StaticMeshComponent0;                // 0x0658 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m666_StaticMeshComponent0;                // 0x0660 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m665_StaticMeshComponent0;                // 0x0668 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m664_StaticMeshComponent0;                // 0x0670 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m663_StaticMeshComponent0;                // 0x0678 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m662_StaticMeshComponent0;                // 0x0680 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m661_StaticMeshComponent0;                // 0x0688 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m660_StaticMeshComponent0;                // 0x0690 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m659_StaticMeshComponent0;                // 0x0698 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m658_StaticMeshComponent0;                // 0x06A0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m657_StaticMeshComponent0;                // 0x06A8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m656_StaticMeshComponent0;                // 0x06B0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m655_StaticMeshComponent0;                // 0x06B8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m654_StaticMeshComponent0;                // 0x06C0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long_diagonalD126_StaticMeshComponent0; // 0x06C8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long_diagonalD125_StaticMeshComponent0; // 0x06D0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long_diagonalD124_StaticMeshComponent0; // 0x06D8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long_diagonalD123_StaticMeshComponent0; // 0x06E0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m653_StaticMeshComponent0;                // 0x06E8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m652_StaticMeshComponent0;                // 0x06F0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m651_StaticMeshComponent0;                // 0x06F8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m650_StaticMeshComponent0;                // 0x0700 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long_diagonalD122_StaticMeshComponent0; // 0x0708 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long_diagonalD121_StaticMeshComponent0; // 0x0710 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long_diagonalD120_StaticMeshComponent0; // 0x0718 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long_diagonalD119_StaticMeshComponent0; // 0x0720 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m649_StaticMeshComponent0;                // 0x0728 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m648_StaticMeshComponent0;                // 0x0730 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m647_StaticMeshComponent0;                // 0x0738 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m646_StaticMeshComponent0;                // 0x0740 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m645_StaticMeshComponent0;                // 0x0748 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m644_StaticMeshComponent0;                // 0x0750 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m643_StaticMeshComponent0;                // 0x0758 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m642_StaticMeshComponent0;                // 0x0760 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m641_StaticMeshComponent0;                // 0x0768 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m640_StaticMeshComponent0;                // 0x0770 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m639_StaticMeshComponent0;                // 0x0778 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed182_StaticMeshComponent0;          // 0x0780 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed181_StaticMeshComponent0;          // 0x0788 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed180_StaticMeshComponent0;          // 0x0790 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed179_StaticMeshComponent0;          // 0x0798 (size: 0x8)
    class UStaticMeshComponent* owidzWattleTrimmed162_StaticMeshComponent0;           // 0x07A0 (size: 0x8)
    class UStaticMeshComponent* owidzWattleTrimmed161_StaticMeshComponent0;           // 0x07A8 (size: 0x8)
    class UStaticMeshComponent* owidzWattleTrimmed160_StaticMeshComponent0;           // 0x07B0 (size: 0x8)
    class UStaticMeshComponent* owidzWattleTrimmed159_StaticMeshComponent0;           // 0x07B8 (size: 0x8)
    class UStaticMeshComponent* owidzWattleTrimmed158_StaticMeshComponent0;           // 0x07C0 (size: 0x8)
    class UStaticMeshComponent* owidzWattleTrimmed157_StaticMeshComponent0;           // 0x07C8 (size: 0x8)
    class UStaticMeshComponent* quoinB_luv96_StaticMeshComponent0;                    // 0x07D0 (size: 0x8)
    class UStaticMeshComponent* quoinB_luv95_StaticMeshComponent0;                    // 0x07D8 (size: 0x8)
    class UStaticMeshComponent* quoinB_luv94_StaticMeshComponent0;                    // 0x07E0 (size: 0x8)
    class UStaticMeshComponent* quoinB_luv93_StaticMeshComponent0;                    // 0x07E8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m638_StaticMeshComponent0;                // 0x07F0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m637_StaticMeshComponent0;                // 0x07F8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m636_StaticMeshComponent0;                // 0x0800 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m635_StaticMeshComponent0;                // 0x0808 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m634_StaticMeshComponent0;                // 0x0810 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m633_StaticMeshComponent0;                // 0x0818 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m632_StaticMeshComponent0;                // 0x0820 (size: 0x8)
    class UStaticMeshComponent* pebbleWallDisplaced81_StaticMeshComponent0;           // 0x0828 (size: 0x8)
    class UStaticMeshComponent* pebbleWallDisplaced80_StaticMeshComponent0;           // 0x0830 (size: 0x8)
    class UStaticMeshComponent* pebbleWallDisplaced79_StaticMeshComponent0;           // 0x0838 (size: 0x8)
    class UStaticMeshComponent* pebbleWallDisplaced78_StaticMeshComponent0;           // 0x0840 (size: 0x8)
    class UStaticMeshComponent* pebbleWallDisplaced77_StaticMeshComponent0;           // 0x0848 (size: 0x8)
    class UStaticMeshComponent* pebbleWallDisplaced76_StaticMeshComponent0;           // 0x0850 (size: 0x8)
    class USceneComponent* C_SG_Malthouse_Attachment2_DefaultSceneRoot;               // 0x0858 (size: 0x8)

}; // Size: 0x860

#endif
