#ifndef UE4SS_SDK_C_SG_LivestockMerchant_HPP
#define UE4SS_SDK_C_SG_LivestockMerchant_HPP

class AC_SG_LivestockMerchant_C : public AConstructionBP_C
{
    class UStaticMeshComponent* sg_woodenGableA13_StaticMeshComponent0;               // 0x0550 (size: 0x8)
    class UStaticMeshComponent* sg_woodenGableA12_StaticMeshComponent0;               // 0x0558 (size: 0x8)
    class UStaticMeshComponent* owidzThatch_Filled4_StaticMeshComponent0;             // 0x0560 (size: 0x8)
    class UStaticMeshComponent* owidzThatch_Filled3_StaticMeshComponent0;             // 0x0568 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed183_StaticMeshComponent0;          // 0x0570 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed182_StaticMeshComponent0;          // 0x0578 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed181_StaticMeshComponent0;          // 0x0580 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed180_StaticMeshComponent0;          // 0x0588 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed179_StaticMeshComponent0;          // 0x0590 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed178_StaticMeshComponent0;          // 0x0598 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed177_StaticMeshComponent0;          // 0x05A0 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed176_StaticMeshComponent0;          // 0x05A8 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed175_StaticMeshComponent0;          // 0x05B0 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed174_StaticMeshComponent0;          // 0x05B8 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed173_StaticMeshComponent0;          // 0x05C0 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed172_StaticMeshComponent0;          // 0x05C8 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed171_StaticMeshComponent0;          // 0x05D0 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed170_StaticMeshComponent0;          // 0x05D8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m588_StaticMeshComponent0;                // 0x05E0 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA310_StaticMeshComponent0;              // 0x05E8 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA309_StaticMeshComponent0;              // 0x05F0 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA308_StaticMeshComponent0;              // 0x05F8 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA307_StaticMeshComponent0;              // 0x0600 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA306_StaticMeshComponent0;              // 0x0608 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA305_StaticMeshComponent0;              // 0x0610 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA304_StaticMeshComponent0;              // 0x0618 (size: 0x8)
    class UStaticMeshComponent* SG_windowBoardC_square16_StaticMeshComponent0;        // 0x0620 (size: 0x8)
    class UStaticMeshComponent* SG_windowBoardC_square15_StaticMeshComponent0;        // 0x0628 (size: 0x8)
    class UStaticMeshComponent* SG_windowBoardC_square14_StaticMeshComponent0;        // 0x0630 (size: 0x8)
    class UStaticMeshComponent* SG_windowBoardC_square13_StaticMeshComponent0;        // 0x0638 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA303_StaticMeshComponent0;              // 0x0640 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA302_StaticMeshComponent0;              // 0x0648 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA301_StaticMeshComponent0;              // 0x0650 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA300_StaticMeshComponent0;              // 0x0658 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA299_StaticMeshComponent0;              // 0x0660 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA298_StaticMeshComponent0;              // 0x0668 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA297_StaticMeshComponent0;              // 0x0670 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA296_StaticMeshComponent0;              // 0x0678 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA295_StaticMeshComponent0;              // 0x0680 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA294_StaticMeshComponent0;              // 0x0688 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA293_StaticMeshComponent0;              // 0x0690 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA292_StaticMeshComponent0;              // 0x0698 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA291_StaticMeshComponent0;              // 0x06A0 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA290_StaticMeshComponent0;              // 0x06A8 (size: 0x8)
    class UStaticMeshComponent* SG_windowBoardC_square12_StaticMeshComponent0;        // 0x06B0 (size: 0x8)
    class UStaticMeshComponent* SG_windowBoardC_square11_StaticMeshComponent0;        // 0x06B8 (size: 0x8)
    class UStaticMeshComponent* SG_windowBoardC_square10_StaticMeshComponent0;        // 0x06C0 (size: 0x8)
    class UStaticMeshComponent* SG_windowBoardC_square9_StaticMeshComponent0;         // 0x06C8 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA289_StaticMeshComponent0;              // 0x06D0 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA288_StaticMeshComponent0;              // 0x06D8 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA287_StaticMeshComponent0;              // 0x06E0 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA286_StaticMeshComponent0;              // 0x06E8 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA285_StaticMeshComponent0;              // 0x06F0 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA284_StaticMeshComponent0;              // 0x06F8 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA283_StaticMeshComponent0;              // 0x0700 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m587_StaticMeshComponent0;                // 0x0708 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m586_StaticMeshComponent0;                // 0x0710 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m585_StaticMeshComponent0;                // 0x0718 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m584_StaticMeshComponent0;                // 0x0720 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m583_StaticMeshComponent0;                // 0x0728 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m582_StaticMeshComponent0;                // 0x0730 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short365_StaticMeshComponent0;       // 0x0738 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short364_StaticMeshComponent0;       // 0x0740 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short363_StaticMeshComponent0;       // 0x0748 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short362_StaticMeshComponent0;       // 0x0750 (size: 0x8)
    class UStaticMeshComponent* foundationTiling_A_detailed220_StaticMeshComponent0;  // 0x0758 (size: 0x8)
    class UStaticMeshComponent* foundationTiling_A_detailed219_StaticMeshComponent0;  // 0x0760 (size: 0x8)
    class UStaticMeshComponent* foundationTiling_A_detailed218_StaticMeshComponent0;  // 0x0768 (size: 0x8)
    class UStaticMeshComponent* foundationTiling_A_detailed217_StaticMeshComponent0;  // 0x0770 (size: 0x8)
    class UStaticMeshComponent* foundationTiling_A_detailed216_StaticMeshComponent0;  // 0x0778 (size: 0x8)
    class UStaticMeshComponent* foundationTiling_A_detailed215_StaticMeshComponent0;  // 0x0780 (size: 0x8)
    class UStaticMeshComponent* foundationTiling_A_detailed214_StaticMeshComponent0;  // 0x0788 (size: 0x8)
    class UStaticMeshComponent* foundationTiling_A_detailed213_StaticMeshComponent0;  // 0x0790 (size: 0x8)
    class UStaticMeshComponent* foundationTiling_A_detailed212_StaticMeshComponent0;  // 0x0798 (size: 0x8)
    class UStaticMeshComponent* foundationTiling_A_detailed211_StaticMeshComponent0;  // 0x07A0 (size: 0x8)
    class USceneComponent* SG_livestockMerchant2_DefaultSceneRoot;                    // 0x07A8 (size: 0x8)

}; // Size: 0x7B0

#endif
