#ifndef UE4SS_SDK_C_SG_Cottage_Lv2_B_UBeam_00_HPP
#define UE4SS_SDK_C_SG_Cottage_Lv2_B_UBeam_00_HPP

class AC_SG_Cottage_Lv2_B_UBeam_00_C : public AConstructionBP_C
{
    class UStaticMeshComponent* UBeam_FillerBoardB54_StaticMeshComponent0;            // 0x0550 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardB53_StaticMeshComponent0;            // 0x0558 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise564_StaticMeshComponent0;              // 0x0560 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise563_StaticMeshComponent0;              // 0x0568 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardB52_StaticMeshComponent0;            // 0x0570 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardB51_StaticMeshComponent0;            // 0x0578 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardB50_StaticMeshComponent0;            // 0x0580 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardB49_StaticMeshComponent0;            // 0x0588 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardB48_StaticMeshComponent0;            // 0x0590 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardB47_StaticMeshComponent0;            // 0x0598 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardB46_StaticMeshComponent0;            // 0x05A0 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardB45_StaticMeshComponent0;            // 0x05A8 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardB44_StaticMeshComponent0;            // 0x05B0 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardB43_StaticMeshComponent0;            // 0x05B8 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardB42_StaticMeshComponent0;            // 0x05C0 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardB41_StaticMeshComponent0;            // 0x05C8 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardB40_StaticMeshComponent0;            // 0x05D0 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardB39_StaticMeshComponent0;            // 0x05D8 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardB38_StaticMeshComponent0;            // 0x05E0 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardB37_StaticMeshComponent0;            // 0x05E8 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardB36_StaticMeshComponent0;            // 0x05F0 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardB35_StaticMeshComponent0;            // 0x05F8 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardB34_StaticMeshComponent0;            // 0x0600 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardB33_StaticMeshComponent0;            // 0x0608 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardB32_StaticMeshComponent0;            // 0x0610 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardB31_StaticMeshComponent0;            // 0x0618 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_SingleWindowsTopOnly4_StaticMeshComponent0; // 0x0620 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_SingleWindowsTopOnly3_StaticMeshComponent0; // 0x0628 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardB30_StaticMeshComponent0;            // 0x0630 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardB29_StaticMeshComponent0;            // 0x0638 (size: 0x8)
    class UStaticMeshComponent* roof_cottage_lv2_B_ubeam2_StaticMeshComponent0;       // 0x0640 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long_diagonalD168_StaticMeshComponent0; // 0x0648 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long_diagonalD167_StaticMeshComponent0; // 0x0650 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long_diagonalD166_StaticMeshComponent0; // 0x0658 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long_diagonalD165_StaticMeshComponent0; // 0x0660 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long_diagonalD164_StaticMeshComponent0; // 0x0668 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long_diagonalD163_StaticMeshComponent0; // 0x0670 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long_diagonalD162_StaticMeshComponent0; // 0x0678 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long_diagonalD161_StaticMeshComponent0; // 0x0680 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long_diagonalD160_StaticMeshComponent0; // 0x0688 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long_diagonalD159_StaticMeshComponent0; // 0x0690 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long_diagonalD158_StaticMeshComponent0; // 0x0698 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long_diagonalD157_StaticMeshComponent0; // 0x06A0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long_diagonalD156_StaticMeshComponent0; // 0x06A8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long_diagonalD155_StaticMeshComponent0; // 0x06B0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long_diagonalD154_StaticMeshComponent0; // 0x06B8 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise562_StaticMeshComponent0;              // 0x06C0 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise561_StaticMeshComponent0;              // 0x06C8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long_diagonalD153_StaticMeshComponent0; // 0x06D0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long_diagonalD152_StaticMeshComponent0; // 0x06D8 (size: 0x8)
    class UStaticMeshComponent* Cube10_StaticMeshComponent0;                          // 0x06E0 (size: 0x8)
    class UStaticMeshComponent* Aset_castle_wall_M_sdAta_lower2_StaticMeshComponent0; // 0x06E8 (size: 0x8)
    class UStaticMeshComponent* gableDecor_lod0_tinyWindows6_StaticMeshComponent0;    // 0x06F0 (size: 0x8)
    class UStaticMeshComponent* sg_shutterA_short30_StaticMeshComponent0;             // 0x06F8 (size: 0x8)
    class UStaticMeshComponent* sg_shutterA_short27_StaticMeshComponent0;             // 0x0700 (size: 0x8)
    class UStaticMeshComponent* gableDecor_lod0_tinyWindows2_StaticMeshComponent0;    // 0x0708 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise560_StaticMeshComponent0;              // 0x0710 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise559_StaticMeshComponent0;              // 0x0718 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise558_StaticMeshComponent0;              // 0x0720 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise557_StaticMeshComponent0;              // 0x0728 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise556_StaticMeshComponent0;              // 0x0730 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise555_StaticMeshComponent0;              // 0x0738 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise554_StaticMeshComponent0;              // 0x0740 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise553_StaticMeshComponent0;              // 0x0748 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise552_StaticMeshComponent0;              // 0x0750 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise551_StaticMeshComponent0;              // 0x0758 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise550_StaticMeshComponent0;              // 0x0760 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise549_StaticMeshComponent0;              // 0x0768 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise548_StaticMeshComponent0;              // 0x0770 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise547_StaticMeshComponent0;              // 0x0778 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise546_StaticMeshComponent0;              // 0x0780 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise545_StaticMeshComponent0;              // 0x0788 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise544_StaticMeshComponent0;              // 0x0790 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise543_StaticMeshComponent0;              // 0x0798 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise542_StaticMeshComponent0;              // 0x07A0 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise541_StaticMeshComponent0;              // 0x07A8 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise540_StaticMeshComponent0;              // 0x07B0 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise539_StaticMeshComponent0;              // 0x07B8 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise538_StaticMeshComponent0;              // 0x07C0 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise537_StaticMeshComponent0;              // 0x07C8 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise536_StaticMeshComponent0;              // 0x07D0 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise535_StaticMeshComponent0;              // 0x07D8 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise534_StaticMeshComponent0;              // 0x07E0 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise533_StaticMeshComponent0;              // 0x07E8 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise532_StaticMeshComponent0;              // 0x07F0 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise531_StaticMeshComponent0;              // 0x07F8 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise530_StaticMeshComponent0;              // 0x0800 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise529_StaticMeshComponent0;              // 0x0808 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise528_StaticMeshComponent0;              // 0x0810 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise527_StaticMeshComponent0;              // 0x0818 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise526_StaticMeshComponent0;              // 0x0820 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise525_StaticMeshComponent0;              // 0x0828 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise524_StaticMeshComponent0;              // 0x0830 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise523_StaticMeshComponent0;              // 0x0838 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise522_StaticMeshComponent0;              // 0x0840 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise521_StaticMeshComponent0;              // 0x0848 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise520_StaticMeshComponent0;              // 0x0850 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise519_StaticMeshComponent0;              // 0x0858 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise518_StaticMeshComponent0;              // 0x0860 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise517_StaticMeshComponent0;              // 0x0868 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise516_StaticMeshComponent0;              // 0x0870 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise515_StaticMeshComponent0;              // 0x0878 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise514_StaticMeshComponent0;              // 0x0880 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise513_StaticMeshComponent0;              // 0x0888 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise512_StaticMeshComponent0;              // 0x0890 (size: 0x8)
    class UStaticMeshComponent* doorHeadA_angled7_StaticMeshComponent0;               // 0x0898 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise511_StaticMeshComponent0;              // 0x08A0 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise510_StaticMeshComponent0;              // 0x08A8 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise509_StaticMeshComponent0;              // 0x08B0 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise508_StaticMeshComponent0;              // 0x08B8 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise469_StaticMeshComponent0;              // 0x08C0 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise467_StaticMeshComponent0;              // 0x08C8 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise466_StaticMeshComponent0;              // 0x08D0 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise377_StaticMeshComponent0;              // 0x08D8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long1614_StaticMeshComponent0;       // 0x08E0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long1613_StaticMeshComponent0;       // 0x08E8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long1612_StaticMeshComponent0;       // 0x08F0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long1606_StaticMeshComponent0;       // 0x08F8 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg48_StaticMeshComponent0;     // 0x0900 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg47_StaticMeshComponent0;     // 0x0908 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg46_StaticMeshComponent0;     // 0x0910 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg45_StaticMeshComponent0;     // 0x0918 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg44_StaticMeshComponent0;     // 0x0920 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg43_StaticMeshComponent0;     // 0x0928 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg42_StaticMeshComponent0;     // 0x0930 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg41_StaticMeshComponent0;     // 0x0938 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg40_StaticMeshComponent0;     // 0x0940 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg39_StaticMeshComponent0;     // 0x0948 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg38_StaticMeshComponent0;     // 0x0950 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg37_StaticMeshComponent0;     // 0x0958 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg36_StaticMeshComponent0;     // 0x0960 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg35_StaticMeshComponent0;     // 0x0968 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg34_StaticMeshComponent0;     // 0x0970 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg33_StaticMeshComponent0;     // 0x0978 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg32_StaticMeshComponent0;     // 0x0980 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg31_StaticMeshComponent0;     // 0x0988 (size: 0x8)
    class UStaticMeshComponent* foundations_Cottage_lv2_ubeam2_StaticMeshComponent0;  // 0x0990 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Slit_DenseUV58_StaticMeshComponent0;       // 0x0998 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardB28_StaticMeshComponent0;            // 0x09A0 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Slit_DenseUV57_StaticMeshComponent0;       // 0x09A8 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Slit_DenseUV56_StaticMeshComponent0;       // 0x09B0 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Slit_DenseUV55_StaticMeshComponent0;       // 0x09B8 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Slit_DenseUV54_StaticMeshComponent0;       // 0x09C0 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Slit_DenseUV53_StaticMeshComponent0;       // 0x09C8 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg30_StaticMeshComponent0;     // 0x09D0 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg29_StaticMeshComponent0;     // 0x09D8 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg28_StaticMeshComponent0;     // 0x09E0 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg27_StaticMeshComponent0;     // 0x09E8 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg26_StaticMeshComponent0;     // 0x09F0 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg25_StaticMeshComponent0;     // 0x09F8 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Slit_DenseUV52_StaticMeshComponent0;       // 0x0A00 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Slit_DenseUV51_StaticMeshComponent0;       // 0x0A08 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Slit_DenseUV50_StaticMeshComponent0;       // 0x0A10 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Slit_DenseUV49_StaticMeshComponent0;       // 0x0A18 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Slit_DenseUV48_StaticMeshComponent0;       // 0x0A20 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Slit_DenseUV47_StaticMeshComponent0;       // 0x0A28 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Slit_DenseUV46_StaticMeshComponent0;       // 0x0A30 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Slit_DenseUV45_StaticMeshComponent0;       // 0x0A38 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Slit_DenseUV44_StaticMeshComponent0;       // 0x0A40 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Slit_DenseUV43_StaticMeshComponent0;       // 0x0A48 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Slit_DenseUV42_StaticMeshComponent0;       // 0x0A50 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Slit_DenseUV41_StaticMeshComponent0;       // 0x0A58 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Slit_DenseUV40_StaticMeshComponent0;       // 0x0A60 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Slit_DenseUV39_StaticMeshComponent0;       // 0x0A68 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Slit_DenseUV38_StaticMeshComponent0;       // 0x0A70 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Slit_DenseUV37_StaticMeshComponent0;       // 0x0A78 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Slit_DenseUV36_StaticMeshComponent0;       // 0x0A80 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Slit_DenseUV35_StaticMeshComponent0;       // 0x0A88 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Slit_DenseUV34_StaticMeshComponent0;       // 0x0A90 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Slit_DenseUV33_StaticMeshComponent0;       // 0x0A98 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Slit_DenseUV32_StaticMeshComponent0;       // 0x0AA0 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Slit_DenseUV31_StaticMeshComponent0;       // 0x0AA8 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Slit_DenseUV30_StaticMeshComponent0;       // 0x0AB0 (size: 0x8)
    class USceneComponent* C_SG_Cottage_LV2_B2_DefaultSceneRoot;                      // 0x0AB8 (size: 0x8)

}; // Size: 0xAC0

#endif
