#ifndef UE4SS_SDK_C_SG_DryingShed_HPP
#define UE4SS_SDK_C_SG_DryingShed_HPP

class AC_SG_DryingShed_C : public AConstructionBP_C
{
    class UChildActorComponent* UBeam_1_5_m129_394;                                   // 0x0550 (size: 0x8)
    class UChildActorComponent* UBeam_1_5_m130_395;                                   // 0x0558 (size: 0x8)
    class UChildActorComponent* UBeam_1_5_m131_396;                                   // 0x0560 (size: 0x8)
    class UChildActorComponent* UBeam_1_5_m132_397;                                   // 0x0568 (size: 0x8)
    class UChildActorComponent* UBeam_1_5_m133_398;                                   // 0x0570 (size: 0x8)
    class UChildActorComponent* UBeam_1_5_m134_399;                                   // 0x0578 (size: 0x8)
    class UChildActorComponent* UBeam_1_5_m135_400;                                   // 0x0580 (size: 0x8)
    class UChildActorComponent* UBeam_Diagonal_401;                                   // 0x0588 (size: 0x8)
    class UChildActorComponent* UBeam_Diagonal_402;                                   // 0x0590 (size: 0x8)
    class UChildActorComponent* UBeam_Diagonal_403;                                   // 0x0598 (size: 0x8)
    class UChildActorComponent* UBeam_Diagonal_404;                                   // 0x05A0 (size: 0x8)
    class UChildActorComponent* UBeam_Diagonal_405;                                   // 0x05A8 (size: 0x8)
    class UChildActorComponent* UBeam_Diagonal_406;                                   // 0x05B0 (size: 0x8)
    class UChildActorComponent* UBeam_Diagonal_407;                                   // 0x05B8 (size: 0x8)
    class UChildActorComponent* UBeam_Tapered_CutE9;                                  // 0x05C0 (size: 0x8)
    class UChildActorComponent* UBeam_Diagonal_408;                                   // 0x05C8 (size: 0x8)
    class UChildActorComponent* UBeam_Diagonal_409;                                   // 0x05D0 (size: 0x8)
    class UChildActorComponent* UBeam_Tapered_CutE10;                                 // 0x05D8 (size: 0x8)
    class UChildActorComponent* UBeam_Diagonal_410;                                   // 0x05E0 (size: 0x8)
    class UChildActorComponent* UBeam_Diagonal_411;                                   // 0x05E8 (size: 0x8)
    class UChildActorComponent* UBeam_1_5_m136_412;                                   // 0x05F0 (size: 0x8)
    class UChildActorComponent* UBeam_1_5_m137_413;                                   // 0x05F8 (size: 0x8)
    class UChildActorComponent* UBeam_1_5_m138_414;                                   // 0x0600 (size: 0x8)
    class UChildActorComponent* UBeam_1_5_m139_415;                                   // 0x0608 (size: 0x8)
    class UChildActorComponent* UBeam_1_5_m140_416;                                   // 0x0610 (size: 0x8)
    class UChildActorComponent* UBeam_1_5_m141_417;                                   // 0x0618 (size: 0x8)
    class UChildActorComponent* UBeam_1_5_m142_418;                                   // 0x0620 (size: 0x8)
    class UChildActorComponent* UBeam_1_5_m143_419;                                   // 0x0628 (size: 0x8)
    class UChildActorComponent* UBeam_1_5_m144_420;                                   // 0x0630 (size: 0x8)
    class UChildActorComponent* UBeam_Strut_Straight54_421;                           // 0x0638 (size: 0x8)
    class UChildActorComponent* UBeam_Strut_Straight55_422;                           // 0x0640 (size: 0x8)
    class UChildActorComponent* UBeam_Strut_Straight56_423;                           // 0x0648 (size: 0x8)
    class UChildActorComponent* UBeam_Strut_Straight57_424;                           // 0x0650 (size: 0x8)
    class UChildActorComponent* UBeam_Strut_Straight58_425;                           // 0x0658 (size: 0x8)
    class UChildActorComponent* UBeam_Strut_Straight59_426;                           // 0x0660 (size: 0x8)
    class UChildActorComponent* UBeam_Strut_Straight60_427;                           // 0x0668 (size: 0x8)
    class UChildActorComponent* UBeam_Strut_Straight61_428;                           // 0x0670 (size: 0x8)
    class UChildActorComponent* UBeam_Strut_Straight62_429;                           // 0x0678 (size: 0x8)
    class UChildActorComponent* UBeam_Strut_Straight63_430;                           // 0x0680 (size: 0x8)
    class UChildActorComponent* UBeam_Strut_Straight64_431;                           // 0x0688 (size: 0x8)
    class UChildActorComponent* UBeam_Strut_Straight65;                               // 0x0690 (size: 0x8)
    class UChildActorComponent* UBeam_Strut_Straight66;                               // 0x0698 (size: 0x8)
    class UChildActorComponent* UBeam_Strut_Straight67;                               // 0x06A0 (size: 0x8)
    class UChildActorComponent* UBeam_Strut_Straight68;                               // 0x06A8 (size: 0x8)
    class UChildActorComponent* UBeam_Strut_Straight69;                               // 0x06B0 (size: 0x8)
    class UChildActorComponent* UBeam_Strut_Straight70;                               // 0x06B8 (size: 0x8)
    class UChildActorComponent* UBeam_Strut_Straight71;                               // 0x06C0 (size: 0x8)
    class UChildActorComponent* UBeam_1_5_m145_432;                                   // 0x06C8 (size: 0x8)
    class UChildActorComponent* UBeam_1_5_m146_433;                                   // 0x06D0 (size: 0x8)
    class UChildActorComponent* UBeam_1_5_m147_434;                                   // 0x06D8 (size: 0x8)
    class UChildActorComponent* UBeam_1_5_m148_435;                                   // 0x06E0 (size: 0x8)
    class UChildActorComponent* UBeam_Tapered_CutE11;                                 // 0x06E8 (size: 0x8)
    class UChildActorComponent* UBeam_1_5_m149_436;                                   // 0x06F0 (size: 0x8)
    class UChildActorComponent* UBeam_1_5_m150_437;                                   // 0x06F8 (size: 0x8)
    class UChildActorComponent* UBeam_Tapered_CutE12;                                 // 0x0700 (size: 0x8)
    class UChildActorComponent* UBeam_1_5_m151;                                       // 0x0708 (size: 0x8)
    class UChildActorComponent* UBeam_1_5_m152;                                       // 0x0710 (size: 0x8)
    class UChildActorComponent* UBeam_Tapered_CutE13;                                 // 0x0718 (size: 0x8)
    class UChildActorComponent* UBeam_1_5_m153;                                       // 0x0720 (size: 0x8)
    class UChildActorComponent* UBeam_1_5_m154;                                       // 0x0728 (size: 0x8)
    class UChildActorComponent* UBeam_Tapered_CutE14;                                 // 0x0730 (size: 0x8)
    class UChildActorComponent* UBeam_1_5_m155;                                       // 0x0738 (size: 0x8)
    class UChildActorComponent* UBeam_1_5_m156;                                       // 0x0740 (size: 0x8)
    class UChildActorComponent* UBeam_Tapered_CutE15;                                 // 0x0748 (size: 0x8)
    class UChildActorComponent* UBeam_1_5_m157;                                       // 0x0750 (size: 0x8)
    class UChildActorComponent* UBeam_1_5_m158;                                       // 0x0758 (size: 0x8)
    class UChildActorComponent* UBeam_Tapered_CutE16;                                 // 0x0760 (size: 0x8)
    class UChildActorComponent* UBeam_1_5_m159;                                       // 0x0768 (size: 0x8)
    class UChildActorComponent* UBeam_1_5_m160;                                       // 0x0770 (size: 0x8)
    class UChildActorComponent* UBeam_CylinderLowpoly_Peg92_438;                      // 0x0778 (size: 0x8)
    class UChildActorComponent* UBeam_CylinderLowpoly_Peg93_439;                      // 0x0780 (size: 0x8)
    class UChildActorComponent* UBeam_CylinderLowpoly_Peg94_440;                      // 0x0788 (size: 0x8)
    class UChildActorComponent* UBeam_CylinderLowpoly_Peg95_441;                      // 0x0790 (size: 0x8)
    class UChildActorComponent* UBeam_CylinderLowpoly_Peg96_442;                      // 0x0798 (size: 0x8)
    class UChildActorComponent* UBeam_CylinderLowpoly_Peg97_443;                      // 0x07A0 (size: 0x8)
    class UChildActorComponent* UBeam_CylinderLowpoly_Peg98_444;                      // 0x07A8 (size: 0x8)
    class UChildActorComponent* UBeam_CylinderLowpoly_Peg99_445;                      // 0x07B0 (size: 0x8)
    class UChildActorComponent* UBeam_CylinderLowpoly_Peg100_446;                     // 0x07B8 (size: 0x8)
    class UChildActorComponent* UBeam_CylinderLowpoly_Peg101_447;                     // 0x07C0 (size: 0x8)
    class UChildActorComponent* UBeam_CylinderLowpoly_Peg102_448;                     // 0x07C8 (size: 0x8)
    class UChildActorComponent* UBeam_CylinderLowpoly_Peg103_449;                     // 0x07D0 (size: 0x8)
    class UChildActorComponent* UBeam_CylinderLowpoly_Peg104_450;                     // 0x07D8 (size: 0x8)
    class UChildActorComponent* UBeam_CylinderLowpoly_Peg105_451;                     // 0x07E0 (size: 0x8)
    class UChildActorComponent* UBeam_CylinderLowpoly_Peg106_452;                     // 0x07E8 (size: 0x8)
    class UChildActorComponent* UBeam_CylinderLowpoly_Peg107_453;                     // 0x07F0 (size: 0x8)
    class UChildActorComponent* UBeam_CylinderLowpoly_Peg108_454;                     // 0x07F8 (size: 0x8)
    class UChildActorComponent* UBeam_CylinderLowpoly_Peg109_455;                     // 0x0800 (size: 0x8)
    class UChildActorComponent* UBeam_CylinderLowpoly_Peg110_456;                     // 0x0808 (size: 0x8)
    class UChildActorComponent* UBeam_CylinderLowpoly_Peg111_457;                     // 0x0810 (size: 0x8)
    class UChildActorComponent* UBeam_CylinderLowpoly_Peg112_458;                     // 0x0818 (size: 0x8)
    class UChildActorComponent* UBeam_CylinderLowpoly_Peg113_459;                     // 0x0820 (size: 0x8)
    class UChildActorComponent* UBeam_CylinderLowpoly_Peg114_460;                     // 0x0828 (size: 0x8)
    class UChildActorComponent* UBeam_CylinderLowpoly_Peg115_461;                     // 0x0830 (size: 0x8)
    class UChildActorComponent* roofSingleDisplaced_shed5;                            // 0x0838 (size: 0x8)
    class UChildActorComponent* roofSingleDisplaced_shed6;                            // 0x0840 (size: 0x8)
    class UChildActorComponent* UBeam_1_5_m128_393;                                   // 0x0848 (size: 0x8)
    class UChildActorComponent* dryingShed2;                                          // 0x0850 (size: 0x8)

}; // Size: 0x858

#endif
