#ifndef UE4SS_SDK_C_SG_AnimalFeeder_HPP
#define UE4SS_SDK_C_SG_AnimalFeeder_HPP

class AC_SG_AnimalFeeder_C : public AConstructionBP_C
{
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg28_StaticMeshComponent0;     // 0x0550 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg27_StaticMeshComponent0;     // 0x0558 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg26_StaticMeshComponent0;     // 0x0560 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg25_StaticMeshComponent0;     // 0x0568 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m_Tapered36_StaticMeshComponent0;              // 0x0570 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m_Tapered35_StaticMeshComponent0;              // 0x0578 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m_Tapered34_StaticMeshComponent0;              // 0x0580 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m_Tapered33_StaticMeshComponent0;              // 0x0588 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg24_StaticMeshComponent0;     // 0x0590 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg23_StaticMeshComponent0;     // 0x0598 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg22_StaticMeshComponent0;     // 0x05A0 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg21_StaticMeshComponent0;     // 0x05A8 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg20_StaticMeshComponent0;     // 0x05B0 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg19_StaticMeshComponent0;     // 0x05B8 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg18_StaticMeshComponent0;     // 0x05C0 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg17_StaticMeshComponent0;     // 0x05C8 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg16_StaticMeshComponent0;     // 0x05D0 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg15_StaticMeshComponent0;     // 0x05D8 (size: 0x8)
    class UStaticMeshComponent* dirtHeapA_Static4_StaticMeshComponent0;               // 0x05E0 (size: 0x8)
    class UStaticMeshComponent* dirtHeapA_Static3_StaticMeshComponent0;               // 0x05E8 (size: 0x8)
    class UStaticMeshComponent* owidzThatch_Filled4_StaticMeshComponent0;             // 0x05F0 (size: 0x8)
    class UStaticMeshComponent* owidzThatch_Filled3_StaticMeshComponent0;             // 0x05F8 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m_Tapered32_StaticMeshComponent0;              // 0x0600 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m_Tapered31_StaticMeshComponent0;              // 0x0608 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m_Tapered30_StaticMeshComponent0;              // 0x0610 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m_Tapered29_StaticMeshComponent0;              // 0x0618 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m_Tapered28_StaticMeshComponent0;              // 0x0620 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m_Tapered27_StaticMeshComponent0;              // 0x0628 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m_Tapered26_StaticMeshComponent0;              // 0x0630 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m_Tapered25_StaticMeshComponent0;              // 0x0638 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardB29_StaticMeshComponent0;            // 0x0640 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardB28_StaticMeshComponent0;            // 0x0648 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardB27_StaticMeshComponent0;            // 0x0650 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardB26_StaticMeshComponent0;            // 0x0658 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardB25_StaticMeshComponent0;            // 0x0660 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardB24_StaticMeshComponent0;            // 0x0668 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardB23_StaticMeshComponent0;            // 0x0670 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardB22_StaticMeshComponent0;            // 0x0678 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardB21_StaticMeshComponent0;            // 0x0680 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardB20_StaticMeshComponent0;            // 0x0688 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardB19_StaticMeshComponent0;            // 0x0690 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardB18_StaticMeshComponent0;            // 0x0698 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m_Tapered24_StaticMeshComponent0;              // 0x06A0 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m_Tapered23_StaticMeshComponent0;              // 0x06A8 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m_Tapered22_StaticMeshComponent0;              // 0x06B0 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m_Tapered21_StaticMeshComponent0;              // 0x06B8 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m_Tapered20_StaticMeshComponent0;              // 0x06C0 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardB4_StaticMeshComponent0;             // 0x06C8 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardB3_StaticMeshComponent0;             // 0x06D0 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_19_StaticMeshComponent0;               // 0x06D8 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_18_StaticMeshComponent0;               // 0x06E0 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m_Tapered19_StaticMeshComponent0;              // 0x06E8 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_17_StaticMeshComponent0;               // 0x06F0 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_10_StaticMeshComponent0;               // 0x06F8 (size: 0x8)
    class USceneComponent* feeder2_DefaultSceneRoot;                                  // 0x0700 (size: 0x8)

}; // Size: 0x708

#endif
