#ifndef UE4SS_SDK_C_SG_Townhouse_Lv3_A_02_HPP
#define UE4SS_SDK_C_SG_Townhouse_Lv3_A_02_HPP

class AC_SG_Townhouse_Lv3_A_02_C : public AConstructionBP_C
{
    class UStaticMeshComponent* SM_WoodBeam6m_orSth200_StaticMeshComponent0;          // 0x0550 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth199_StaticMeshComponent0;          // 0x0558 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly144_StaticMeshComponent0;   // 0x0560 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly143_StaticMeshComponent0;   // 0x0568 (size: 0x8)
    class UStaticMeshComponent* PlaneDenseBeveledWide86_StaticMeshComponent0;         // 0x0570 (size: 0x8)
    class UStaticMeshComponent* PlaneDenseBeveledWide85_StaticMeshComponent0;         // 0x0578 (size: 0x8)
    class UStaticMeshComponent* PlaneDenseBeveledWide84_StaticMeshComponent0;         // 0x0580 (size: 0x8)
    class UStaticMeshComponent* PlaneDenseBeveledWide83_StaticMeshComponent0;         // 0x0588 (size: 0x8)
    class UStaticMeshComponent* PlaneDenseBeveledWide82_StaticMeshComponent0;         // 0x0590 (size: 0x8)
    class UStaticMeshComponent* PlaneDenseBeveledWide81_StaticMeshComponent0;         // 0x0598 (size: 0x8)
    class UStaticMeshComponent* PlaneDenseBeveledWide80_StaticMeshComponent0;         // 0x05A0 (size: 0x8)
    class UStaticMeshComponent* PlaneDenseBeveledB54_StaticMeshComponent0;            // 0x05A8 (size: 0x8)
    class UStaticMeshComponent* PlaneDenseBeveledWide79_StaticMeshComponent0;         // 0x05B0 (size: 0x8)
    class UStaticMeshComponent* PlaneDenseBeveledWide78_StaticMeshComponent0;         // 0x05B8 (size: 0x8)
    class UStaticMeshComponent* PlaneDenseBeveledWide77_StaticMeshComponent0;         // 0x05C0 (size: 0x8)
    class UStaticMeshComponent* PlaneDenseBeveledWide76_StaticMeshComponent0;         // 0x05C8 (size: 0x8)
    class UStaticMeshComponent* PlaneDenseBeveledWide75_StaticMeshComponent0;         // 0x05D0 (size: 0x8)
    class UStaticMeshComponent* PlaneDenseBeveledWide74_StaticMeshComponent0;         // 0x05D8 (size: 0x8)
    class UStaticMeshComponent* PlaneDenseBeveledWide73_StaticMeshComponent0;         // 0x05E0 (size: 0x8)
    class UStaticMeshComponent* PlaneDenseBeveledWide72_StaticMeshComponent0;         // 0x05E8 (size: 0x8)
    class UStaticMeshComponent* PlaneDenseBeveledWide71_StaticMeshComponent0;         // 0x05F0 (size: 0x8)
    class UStaticMeshComponent* PlaneDenseBeveledWide70_StaticMeshComponent0;         // 0x05F8 (size: 0x8)
    class UStaticMeshComponent* PlaneDenseBeveledWide69_StaticMeshComponent0;         // 0x0600 (size: 0x8)
    class UStaticMeshComponent* PlaneDenseBeveledWide68_StaticMeshComponent0;         // 0x0608 (size: 0x8)
    class UStaticMeshComponent* PlaneDenseBeveledWide67_StaticMeshComponent0;         // 0x0610 (size: 0x8)
    class UStaticMeshComponent* PlaneDenseBeveledWide66_StaticMeshComponent0;         // 0x0618 (size: 0x8)
    class UStaticMeshComponent* PlaneDenseBeveledWide65_StaticMeshComponent0;         // 0x0620 (size: 0x8)
    class UStaticMeshComponent* PlaneDenseBeveledWide64_StaticMeshComponent0;         // 0x0628 (size: 0x8)
    class UStaticMeshComponent* PlaneDenseBeveledWide63_StaticMeshComponent0;         // 0x0630 (size: 0x8)
    class UStaticMeshComponent* PlaneDenseBeveledWide62_StaticMeshComponent0;         // 0x0638 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short74_StaticMeshComponent0;        // 0x0640 (size: 0x8)
    class UStaticMeshComponent* PlaneDenseBeveledWide61_StaticMeshComponent0;         // 0x0648 (size: 0x8)
    class UStaticMeshComponent* PlaneDenseBeveledWide60_StaticMeshComponent0;         // 0x0650 (size: 0x8)
    class UStaticMeshComponent* PlaneDenseBeveledWide59_StaticMeshComponent0;         // 0x0658 (size: 0x8)
    class UStaticMeshComponent* PlaneDenseBeveledWide58_StaticMeshComponent0;         // 0x0660 (size: 0x8)
    class UStaticMeshComponent* PlaneDenseBeveledWide23_StaticMeshComponent0;         // 0x0668 (size: 0x8)
    class UStaticMeshComponent* PlaneDenseBeveledWide22_StaticMeshComponent0;         // 0x0670 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth198_StaticMeshComponent0;          // 0x0678 (size: 0x8)
    class UStaticMeshComponent* PlaneDenseBeveledWide21_StaticMeshComponent0;         // 0x0680 (size: 0x8)
    class UStaticMeshComponent* PlaneDenseBeveledWide57_StaticMeshComponent0;         // 0x0688 (size: 0x8)
    class UStaticMeshComponent* PlaneDenseBeveledWide56_StaticMeshComponent0;         // 0x0690 (size: 0x8)
    class UStaticMeshComponent* PlaneDenseBeveledWide55_StaticMeshComponent0;         // 0x0698 (size: 0x8)
    class UStaticMeshComponent* PlaneDenseBeveledWide54_StaticMeshComponent0;         // 0x06A0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short73_StaticMeshComponent0;        // 0x06A8 (size: 0x8)
    class UStaticMeshComponent* PlaneDenseBeveledB53_StaticMeshComponent0;            // 0x06B0 (size: 0x8)
    class UStaticMeshComponent* PlaneDenseBeveledB52_StaticMeshComponent0;            // 0x06B8 (size: 0x8)
    class UStaticMeshComponent* PlaneDenseBeveledB51_StaticMeshComponent0;            // 0x06C0 (size: 0x8)
    class UStaticMeshComponent* PlaneDenseBeveledWide53_StaticMeshComponent0;         // 0x06C8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short72_StaticMeshComponent0;        // 0x06D0 (size: 0x8)
    class UStaticMeshComponent* PlaneDenseBeveledB50_StaticMeshComponent0;            // 0x06D8 (size: 0x8)
    class UStaticMeshComponent* PlaneDenseBeveledB49_StaticMeshComponent0;            // 0x06E0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly142_StaticMeshComponent0;   // 0x06E8 (size: 0x8)
    class UStaticMeshComponent* PlaneDenseBeveledB48_StaticMeshComponent0;            // 0x06F0 (size: 0x8)
    class UStaticMeshComponent* PlaneDenseBeveledB47_StaticMeshComponent0;            // 0x06F8 (size: 0x8)
    class UStaticMeshComponent* PlaneDenseBeveledB46_StaticMeshComponent0;            // 0x0700 (size: 0x8)
    class UStaticMeshComponent* PlaneDenseBeveledB45_StaticMeshComponent0;            // 0x0708 (size: 0x8)
    class UStaticMeshComponent* PlaneDenseBeveledB44_StaticMeshComponent0;            // 0x0710 (size: 0x8)
    class UStaticMeshComponent* PlaneDenseBeveledWide52_StaticMeshComponent0;         // 0x0718 (size: 0x8)
    class UStaticMeshComponent* PlaneDenseBeveledWide51_StaticMeshComponent0;         // 0x0720 (size: 0x8)
    class UStaticMeshComponent* PlaneDenseBeveledWide20_StaticMeshComponent0;         // 0x0728 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth197_StaticMeshComponent0;          // 0x0730 (size: 0x8)
    class UStaticMeshComponent* PlaneDenseBeveledB43_StaticMeshComponent0;            // 0x0738 (size: 0x8)
    class UStaticMeshComponent* sg_shutterA10_StaticMeshComponent0;                   // 0x0740 (size: 0x8)
    class UStaticMeshComponent* sg_shutterA9_StaticMeshComponent0;                    // 0x0748 (size: 0x8)
    class UStaticMeshComponent* sg_shutterA_short24_StaticMeshComponent0;             // 0x0750 (size: 0x8)
    class UStaticMeshComponent* SG_SmallGlassWindowB_Frame6_StaticMeshComponent0;     // 0x0758 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth196_StaticMeshComponent0;          // 0x0760 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth195_StaticMeshComponent0;          // 0x0768 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth194_StaticMeshComponent0;          // 0x0770 (size: 0x8)
    class UStaticMeshComponent* owidzWattleTrimmed2_StaticMeshComponent0;             // 0x0778 (size: 0x8)
    class UStaticMeshComponent* sg_chimneyTop2_StaticMeshComponent0;                  // 0x0780 (size: 0x8)
    class UStaticMeshComponent* ChimneyLP2_StaticMeshComponent0;                      // 0x0788 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly141_StaticMeshComponent0;   // 0x0790 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly140_StaticMeshComponent0;   // 0x0798 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly139_StaticMeshComponent0;   // 0x07A0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly138_StaticMeshComponent0;   // 0x07A8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly137_StaticMeshComponent0;   // 0x07B0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly136_StaticMeshComponent0;   // 0x07B8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly135_StaticMeshComponent0;   // 0x07C0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly134_StaticMeshComponent0;   // 0x07C8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly133_StaticMeshComponent0;   // 0x07D0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly132_StaticMeshComponent0;   // 0x07D8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly131_StaticMeshComponent0;   // 0x07E0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly130_StaticMeshComponent0;   // 0x07E8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly129_StaticMeshComponent0;   // 0x07F0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly128_StaticMeshComponent0;   // 0x07F8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly127_StaticMeshComponent0;   // 0x0800 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly126_StaticMeshComponent0;   // 0x0808 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly125_StaticMeshComponent0;   // 0x0810 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly124_StaticMeshComponent0;   // 0x0818 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly123_StaticMeshComponent0;   // 0x0820 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly122_StaticMeshComponent0;   // 0x0828 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly121_StaticMeshComponent0;   // 0x0830 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly120_StaticMeshComponent0;   // 0x0838 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly119_StaticMeshComponent0;   // 0x0840 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly118_StaticMeshComponent0;   // 0x0848 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly117_StaticMeshComponent0;   // 0x0850 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly116_StaticMeshComponent0;   // 0x0858 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly115_StaticMeshComponent0;   // 0x0860 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly114_StaticMeshComponent0;   // 0x0868 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly113_StaticMeshComponent0;   // 0x0870 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly112_StaticMeshComponent0;   // 0x0878 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly111_StaticMeshComponent0;   // 0x0880 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly110_StaticMeshComponent0;   // 0x0888 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly109_StaticMeshComponent0;   // 0x0890 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly108_StaticMeshComponent0;   // 0x0898 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly107_StaticMeshComponent0;   // 0x08A0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly106_StaticMeshComponent0;   // 0x08A8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly105_StaticMeshComponent0;   // 0x08B0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly104_StaticMeshComponent0;   // 0x08B8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly103_StaticMeshComponent0;   // 0x08C0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly102_StaticMeshComponent0;   // 0x08C8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly101_StaticMeshComponent0;   // 0x08D0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly100_StaticMeshComponent0;   // 0x08D8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly99_StaticMeshComponent0;    // 0x08E0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly98_StaticMeshComponent0;    // 0x08E8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly97_StaticMeshComponent0;    // 0x08F0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly96_StaticMeshComponent0;    // 0x08F8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly95_StaticMeshComponent0;    // 0x0900 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly94_StaticMeshComponent0;    // 0x0908 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly93_StaticMeshComponent0;    // 0x0910 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly92_StaticMeshComponent0;    // 0x0918 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly91_StaticMeshComponent0;    // 0x0920 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly90_StaticMeshComponent0;    // 0x0928 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly89_StaticMeshComponent0;    // 0x0930 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly88_StaticMeshComponent0;    // 0x0938 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly87_StaticMeshComponent0;    // 0x0940 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly86_StaticMeshComponent0;    // 0x0948 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly85_StaticMeshComponent0;    // 0x0950 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly84_StaticMeshComponent0;    // 0x0958 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly83_StaticMeshComponent0;    // 0x0960 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly82_StaticMeshComponent0;    // 0x0968 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly81_StaticMeshComponent0;    // 0x0970 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly80_StaticMeshComponent0;    // 0x0978 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly79_StaticMeshComponent0;    // 0x0980 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly78_StaticMeshComponent0;    // 0x0988 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly77_StaticMeshComponent0;    // 0x0990 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly76_StaticMeshComponent0;    // 0x0998 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly75_StaticMeshComponent0;    // 0x09A0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly74_StaticMeshComponent0;    // 0x09A8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly71_StaticMeshComponent0;    // 0x09B0 (size: 0x8)
    class UStaticMeshComponent* sg_shutterA_short23_StaticMeshComponent0;             // 0x09B8 (size: 0x8)
    class UStaticMeshComponent* sg_shutterA_short22_StaticMeshComponent0;             // 0x09C0 (size: 0x8)
    class UStaticMeshComponent* sg_shutterA_short21_StaticMeshComponent0;             // 0x09C8 (size: 0x8)
    class UStaticMeshComponent* sg_shutterA_short20_StaticMeshComponent0;             // 0x09D0 (size: 0x8)
    class UStaticMeshComponent* sg_shutterA_short19_StaticMeshComponent0;             // 0x09D8 (size: 0x8)
    class UStaticMeshComponent* sg_shutterA_short18_StaticMeshComponent0;             // 0x09E0 (size: 0x8)
    class UStaticMeshComponent* sg_shutterA_short17_StaticMeshComponent0;             // 0x09E8 (size: 0x8)
    class UStaticMeshComponent* sg_shutterA_short16_StaticMeshComponent0;             // 0x09F0 (size: 0x8)
    class UStaticMeshComponent* sg_shutterA_short15_StaticMeshComponent0;             // 0x09F8 (size: 0x8)
    class UStaticMeshComponent* sg_shutterA_short14_StaticMeshComponent0;             // 0x0A00 (size: 0x8)
    class UStaticMeshComponent* sg_shutterA8_StaticMeshComponent0;                    // 0x0A08 (size: 0x8)
    class UStaticMeshComponent* sg_shutterA_short13_StaticMeshComponent0;             // 0x0A10 (size: 0x8)
    class UStaticMeshComponent* sg_shutterA7_StaticMeshComponent0;                    // 0x0A18 (size: 0x8)
    class UStaticMeshComponent* sg_shutterA6_StaticMeshComponent0;                    // 0x0A20 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth193_StaticMeshComponent0;          // 0x0A28 (size: 0x8)
    class UStaticMeshComponent* PlaneDenseCorner8_StaticMeshComponent0;               // 0x0A30 (size: 0x8)
    class UStaticMeshComponent* PlaneDenseCorner7_StaticMeshComponent0;               // 0x0A38 (size: 0x8)
    class UStaticMeshComponent* PlaneDenseBeveledWide19_StaticMeshComponent0;         // 0x0A40 (size: 0x8)
    class UStaticMeshComponent* PlaneDenseWindowSlotsA_v2_Bevel2_StaticMeshComponent0; // 0x0A48 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Tapered_CutB24_StaticMeshComponent0;        // 0x0A50 (size: 0x8)
    class UStaticMeshComponent* PlaneDenseCorner6_StaticMeshComponent0;               // 0x0A58 (size: 0x8)
    class UStaticMeshComponent* PlaneDenseCorner5_StaticMeshComponent0;               // 0x0A60 (size: 0x8)
    class UStaticMeshComponent* PlaneDenseBeveledWide12_StaticMeshComponent0;         // 0x0A68 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short71_StaticMeshComponent0;        // 0x0A70 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth192_StaticMeshComponent0;          // 0x0A78 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth191_StaticMeshComponent0;          // 0x0A80 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth190_StaticMeshComponent0;          // 0x0A88 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_73_StaticMeshComponent0; // 0x0A90 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_72_StaticMeshComponent0; // 0x0A98 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth189_StaticMeshComponent0;          // 0x0AA0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth188_StaticMeshComponent0;          // 0x0AA8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth187_StaticMeshComponent0;          // 0x0AB0 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Tapered_CutB23_StaticMeshComponent0;        // 0x0AB8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth185_StaticMeshComponent0;          // 0x0AC0 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Tapered_CutB22_StaticMeshComponent0;        // 0x0AC8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth184_StaticMeshComponent0;          // 0x0AD0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth183_StaticMeshComponent0;          // 0x0AD8 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Tapered_CutB21_StaticMeshComponent0;        // 0x0AE0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth182_StaticMeshComponent0;          // 0x0AE8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth181_StaticMeshComponent0;          // 0x0AF0 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Tapered_CutB20_StaticMeshComponent0;        // 0x0AF8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth180_StaticMeshComponent0;          // 0x0B00 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth179_StaticMeshComponent0;          // 0x0B08 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Tapered_CutB19_StaticMeshComponent0;        // 0x0B10 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth178_StaticMeshComponent0;          // 0x0B18 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth177_StaticMeshComponent0;          // 0x0B20 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth176_StaticMeshComponent0;          // 0x0B28 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth175_StaticMeshComponent0;          // 0x0B30 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_71_StaticMeshComponent0; // 0x0B38 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_70_StaticMeshComponent0; // 0x0B40 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth174_StaticMeshComponent0;          // 0x0B48 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth173_StaticMeshComponent0;          // 0x0B50 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth172_StaticMeshComponent0;          // 0x0B58 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth171_StaticMeshComponent0;          // 0x0B60 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth170_StaticMeshComponent0;          // 0x0B68 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth169_StaticMeshComponent0;          // 0x0B70 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth168_StaticMeshComponent0;          // 0x0B78 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth167_StaticMeshComponent0;          // 0x0B80 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth166_StaticMeshComponent0;          // 0x0B88 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth165_StaticMeshComponent0;          // 0x0B90 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth164_StaticMeshComponent0;          // 0x0B98 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short70_StaticMeshComponent0;        // 0x0BA0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short69_StaticMeshComponent0;        // 0x0BA8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth163_StaticMeshComponent0;          // 0x0BB0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth162_StaticMeshComponent0;          // 0x0BB8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth161_StaticMeshComponent0;          // 0x0BC0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth160_StaticMeshComponent0;          // 0x0BC8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth159_StaticMeshComponent0;          // 0x0BD0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth158_StaticMeshComponent0;          // 0x0BD8 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_69_StaticMeshComponent0; // 0x0BE0 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_68_StaticMeshComponent0; // 0x0BE8 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_67_StaticMeshComponent0; // 0x0BF0 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_66_StaticMeshComponent0; // 0x0BF8 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_65_StaticMeshComponent0; // 0x0C00 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_64_StaticMeshComponent0; // 0x0C08 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth157_StaticMeshComponent0;          // 0x0C10 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth156_StaticMeshComponent0;          // 0x0C18 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth155_StaticMeshComponent0;          // 0x0C20 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth154_StaticMeshComponent0;          // 0x0C28 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_doorHead_A_SpikyTop4_StaticMeshComponent0; // 0x0C30 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short68_StaticMeshComponent0;        // 0x0C38 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short67_StaticMeshComponent0;        // 0x0C40 (size: 0x8)
    class UStaticMeshComponent* SG_SmallGlassWindowB_Frame5_StaticMeshComponent0;     // 0x0C48 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth153_StaticMeshComponent0;          // 0x0C50 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth152_StaticMeshComponent0;          // 0x0C58 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth151_StaticMeshComponent0;          // 0x0C60 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_63_StaticMeshComponent0; // 0x0C68 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_62_StaticMeshComponent0; // 0x0C70 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth150_StaticMeshComponent0;          // 0x0C78 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_61_StaticMeshComponent0; // 0x0C80 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_60_StaticMeshComponent0; // 0x0C88 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_59_StaticMeshComponent0; // 0x0C90 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_58_StaticMeshComponent0; // 0x0C98 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth149_StaticMeshComponent0;          // 0x0CA0 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_57_StaticMeshComponent0; // 0x0CA8 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_56_StaticMeshComponent0; // 0x0CB0 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_55_StaticMeshComponent0; // 0x0CB8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth148_StaticMeshComponent0;          // 0x0CC0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth147_StaticMeshComponent0;          // 0x0CC8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth146_StaticMeshComponent0;          // 0x0CD0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth145_StaticMeshComponent0;          // 0x0CD8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth144_StaticMeshComponent0;          // 0x0CE0 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_54_StaticMeshComponent0; // 0x0CE8 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_53_StaticMeshComponent0; // 0x0CF0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth143_StaticMeshComponent0;          // 0x0CF8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth142_StaticMeshComponent0;          // 0x0D00 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth141_StaticMeshComponent0;          // 0x0D08 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short66_StaticMeshComponent0;        // 0x0D10 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth140_StaticMeshComponent0;          // 0x0D18 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth139_StaticMeshComponent0;          // 0x0D20 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short65_StaticMeshComponent0;        // 0x0D28 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth138_StaticMeshComponent0;          // 0x0D30 (size: 0x8)
    class UStaticMeshComponent* SG_SmallGlassWindowA6_StaticMeshComponent0;           // 0x0D38 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth137_StaticMeshComponent0;          // 0x0D40 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth136_StaticMeshComponent0;          // 0x0D48 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth135_StaticMeshComponent0;          // 0x0D50 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth134_StaticMeshComponent0;          // 0x0D58 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth133_StaticMeshComponent0;          // 0x0D60 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth132_StaticMeshComponent0;          // 0x0D68 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth131_StaticMeshComponent0;          // 0x0D70 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth130_StaticMeshComponent0;          // 0x0D78 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_52_StaticMeshComponent0; // 0x0D80 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_51_StaticMeshComponent0; // 0x0D88 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth129_StaticMeshComponent0;          // 0x0D90 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_50_StaticMeshComponent0; // 0x0D98 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_49_StaticMeshComponent0; // 0x0DA0 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_48_StaticMeshComponent0; // 0x0DA8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth128_StaticMeshComponent0;          // 0x0DB0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth127_StaticMeshComponent0;          // 0x0DB8 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Tapered_CutB18_StaticMeshComponent0;        // 0x0DC0 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Tapered_CutB15_StaticMeshComponent0;        // 0x0DC8 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Tapered_CutB13_StaticMeshComponent0;        // 0x0DD0 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Tapered_CutB11_StaticMeshComponent0;        // 0x0DD8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth126_StaticMeshComponent0;          // 0x0DE0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth125_StaticMeshComponent0;          // 0x0DE8 (size: 0x8)
    class UStaticMeshComponent* SG_SmallGlassWindowB_Frame4_StaticMeshComponent0;     // 0x0DF0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth124_StaticMeshComponent0;          // 0x0DF8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth123_StaticMeshComponent0;          // 0x0E00 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth122_StaticMeshComponent0;          // 0x0E08 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth121_StaticMeshComponent0;          // 0x0E10 (size: 0x8)
    class UStaticMeshComponent* SG_SmallGlassWindowA5_StaticMeshComponent0;           // 0x0E18 (size: 0x8)
    class UStaticMeshComponent* SG_SmallGlassWindowA4_StaticMeshComponent0;           // 0x0E20 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth120_StaticMeshComponent0;          // 0x0E28 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth119_StaticMeshComponent0;          // 0x0E30 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth118_StaticMeshComponent0;          // 0x0E38 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth117_StaticMeshComponent0;          // 0x0E40 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth116_StaticMeshComponent0;          // 0x0E48 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth115_StaticMeshComponent0;          // 0x0E50 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Tapered_CutB9_StaticMeshComponent0;         // 0x0E58 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short64_StaticMeshComponent0;        // 0x0E60 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth114_StaticMeshComponent0;          // 0x0E68 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth113_StaticMeshComponent0;          // 0x0E70 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short63_StaticMeshComponent0;        // 0x0E78 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_47_StaticMeshComponent0; // 0x0E80 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_46_StaticMeshComponent0; // 0x0E88 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_45_StaticMeshComponent0; // 0x0E90 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_44_StaticMeshComponent0; // 0x0E98 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_43_StaticMeshComponent0; // 0x0EA0 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_42_StaticMeshComponent0; // 0x0EA8 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Tapered_CutB3_StaticMeshComponent0;         // 0x0EB0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth112_StaticMeshComponent0;          // 0x0EB8 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_41_StaticMeshComponent0; // 0x0EC0 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_40_StaticMeshComponent0; // 0x0EC8 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_39_StaticMeshComponent0; // 0x0ED0 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_38_StaticMeshComponent0; // 0x0ED8 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_doorHead_A_SpikyTop3_StaticMeshComponent0; // 0x0EE0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short62_StaticMeshComponent0;        // 0x0EE8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short61_StaticMeshComponent0;        // 0x0EF0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth111_StaticMeshComponent0;          // 0x0EF8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short60_StaticMeshComponent0;        // 0x0F00 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth110_StaticMeshComponent0;          // 0x0F08 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth109_StaticMeshComponent0;          // 0x0F10 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth108_StaticMeshComponent0;          // 0x0F18 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth107_StaticMeshComponent0;          // 0x0F20 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth106_StaticMeshComponent0;          // 0x0F28 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth105_StaticMeshComponent0;          // 0x0F30 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth104_StaticMeshComponent0;          // 0x0F38 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth103_StaticMeshComponent0;          // 0x0F40 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth102_StaticMeshComponent0;          // 0x0F48 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth101_StaticMeshComponent0;          // 0x0F50 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short59_StaticMeshComponent0;        // 0x0F58 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short58_StaticMeshComponent0;        // 0x0F60 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short55_StaticMeshComponent0;        // 0x0F68 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short41_StaticMeshComponent0;        // 0x0F70 (size: 0x8)
    class UStaticMeshComponent* sg_woodenGableA2_StaticMeshComponent0;                // 0x0F78 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardB_thin6_StaticMeshComponent0;           // 0x0F80 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardB_thin5_StaticMeshComponent0;           // 0x0F88 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_37_StaticMeshComponent0; // 0x0F90 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_36_StaticMeshComponent0; // 0x0F98 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_35_StaticMeshComponent0; // 0x0FA0 (size: 0x8)
    class UStaticMeshComponent* ClayRoofTownhouse_LV3_A2_StaticMeshComponent0;        // 0x0FA8 (size: 0x8)
    class UStaticMeshComponent* fakeInterior6_StaticMeshComponent0;                   // 0x0FB0 (size: 0x8)
    class UStaticMeshComponent* Foundation_DoorStepStoneFlat4_StaticMeshComponent0;   // 0x0FB8 (size: 0x8)
    class UStaticMeshComponent* fakeInterior5_StaticMeshComponent0;                   // 0x0FC0 (size: 0x8)
    class UStaticMeshComponent* fakeInterior4_StaticMeshComponent0;                   // 0x0FC8 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Narrow_Var11_StaticMeshComponent0;         // 0x0FD0 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Narrow_Var10_StaticMeshComponent0;         // 0x0FD8 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Narrow_Var9_StaticMeshComponent0;          // 0x0FE0 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Narrow_Var8_StaticMeshComponent0;          // 0x0FE8 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Narrow_Var7_StaticMeshComponent0;          // 0x0FF0 (size: 0x8)
    class UStaticMeshComponent* FoundationSeamless_Corner_500x512_StaticMeshComponent0; // 0x0FF8 (size: 0x8)
    class UStaticMeshComponent* Foundation_DoorStepStoneFlat3_StaticMeshComponent0;   // 0x1000 (size: 0x8)
    class UStaticMeshComponent* FoundationSeamless_Corner_500x511_StaticMeshComponent0; // 0x1008 (size: 0x8)
    class UStaticMeshComponent* FoundationSeamless_Corner_500x510_StaticMeshComponent0; // 0x1010 (size: 0x8)
    class UStaticMeshComponent* FoundationSeamless_Corner_500x509_StaticMeshComponent0; // 0x1018 (size: 0x8)
    class UStaticMeshComponent* FoundationSeamless_Corner_500x508_StaticMeshComponent0; // 0x1020 (size: 0x8)
    class UStaticMeshComponent* FoundationSeamless_Corner_500x507_StaticMeshComponent0; // 0x1028 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardB_thin4_StaticMeshComponent0;           // 0x1030 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth186_StaticMeshComponent0;          // 0x1038 (size: 0x8)
    class USceneComponent* Actor2_DefaultSceneRoot;                                   // 0x1040 (size: 0x8)

}; // Size: 0x1048

#endif
