#ifndef UE4SS_SDK_C_SG_RooftileFurnaceShed_HPP
#define UE4SS_SDK_C_SG_RooftileFurnaceShed_HPP

class AC_SG_RooftileFurnaceShed_C : public AConstructionBP_C
{
    class UStaticMeshComponent* roofSingleDisplaced_shed4_StaticMeshComponent0;       // 0x0550 (size: 0x8)
    class UStaticMeshComponent* roofSingleDisplaced_shed3_StaticMeshComponent0;       // 0x0558 (size: 0x8)
    class UStaticMeshComponent* roofSingleDisplaced8_StaticMeshComponent0;            // 0x0560 (size: 0x8)
    class UStaticMeshComponent* roofSingleDisplaced7_StaticMeshComponent0;            // 0x0568 (size: 0x8)
    class UStaticMeshComponent* UBeam_GableSimpleA4_StaticMeshComponent0;             // 0x0570 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg140_StaticMeshComponent0;    // 0x0578 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg139_StaticMeshComponent0;    // 0x0580 (size: 0x8)
    class UStaticMeshComponent* UBeam_CrookedPlank29_StaticMeshComponent0;            // 0x0588 (size: 0x8)
    class UStaticMeshComponent* UBeam_CrookedPlank28_StaticMeshComponent0;            // 0x0590 (size: 0x8)
    class UStaticMeshComponent* UBeam_CrookedPlank27_StaticMeshComponent0;            // 0x0598 (size: 0x8)
    class UStaticMeshComponent* UBeam_Strut_Straight64_StaticMeshComponent0;          // 0x05A0 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg138_StaticMeshComponent0;    // 0x05A8 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg137_StaticMeshComponent0;    // 0x05B0 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg136_StaticMeshComponent0;    // 0x05B8 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg135_StaticMeshComponent0;    // 0x05C0 (size: 0x8)
    class UStaticMeshComponent* UBeam_Strut_Straight63_StaticMeshComponent0;          // 0x05C8 (size: 0x8)
    class UStaticMeshComponent* UBeam_Strut_Straight62_StaticMeshComponent0;          // 0x05D0 (size: 0x8)
    class UStaticMeshComponent* UBeam_Strut_Straight61_StaticMeshComponent0;          // 0x05D8 (size: 0x8)
    class UStaticMeshComponent* UBeam_CrookedPlank26_StaticMeshComponent0;            // 0x05E0 (size: 0x8)
    class UStaticMeshComponent* UBeam_CrookedPlank25_StaticMeshComponent0;            // 0x05E8 (size: 0x8)
    class UStaticMeshComponent* UBeam_CrookedPlank24_StaticMeshComponent0;            // 0x05F0 (size: 0x8)
    class UStaticMeshComponent* UBeam_Strut_Straight60_StaticMeshComponent0;          // 0x05F8 (size: 0x8)
    class UStaticMeshComponent* UBeam_Strut_Straight59_StaticMeshComponent0;          // 0x0600 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg134_StaticMeshComponent0;    // 0x0608 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg133_StaticMeshComponent0;    // 0x0610 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg132_StaticMeshComponent0;    // 0x0618 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg131_StaticMeshComponent0;    // 0x0620 (size: 0x8)
    class UStaticMeshComponent* UBeam_Strut_Straight58_StaticMeshComponent0;          // 0x0628 (size: 0x8)
    class UStaticMeshComponent* UBeam_Strut_Straight57_StaticMeshComponent0;          // 0x0630 (size: 0x8)
    class UStaticMeshComponent* UBeam_Strut_Straight56_StaticMeshComponent0;          // 0x0638 (size: 0x8)
    class UStaticMeshComponent* UBeam_CrookedPlank23_StaticMeshComponent0;            // 0x0640 (size: 0x8)
    class UStaticMeshComponent* UBeam_CrookedPlank22_StaticMeshComponent0;            // 0x0648 (size: 0x8)
    class UStaticMeshComponent* UBeam_CrookedPlank21_StaticMeshComponent0;            // 0x0650 (size: 0x8)
    class UStaticMeshComponent* UBeam_Strut_Straight55_StaticMeshComponent0;          // 0x0658 (size: 0x8)
    class UStaticMeshComponent* UBeam_Strut_Straight54_StaticMeshComponent0;          // 0x0660 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg130_StaticMeshComponent0;    // 0x0668 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg129_StaticMeshComponent0;    // 0x0670 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg128_StaticMeshComponent0;    // 0x0678 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg127_StaticMeshComponent0;    // 0x0680 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg126_StaticMeshComponent0;    // 0x0688 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg125_StaticMeshComponent0;    // 0x0690 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg124_StaticMeshComponent0;    // 0x0698 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg123_StaticMeshComponent0;    // 0x06A0 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg122_StaticMeshComponent0;    // 0x06A8 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg121_StaticMeshComponent0;    // 0x06B0 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg120_StaticMeshComponent0;    // 0x06B8 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg119_StaticMeshComponent0;    // 0x06C0 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg118_StaticMeshComponent0;    // 0x06C8 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg117_StaticMeshComponent0;    // 0x06D0 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg116_StaticMeshComponent0;    // 0x06D8 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg115_StaticMeshComponent0;    // 0x06E0 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg114_StaticMeshComponent0;    // 0x06E8 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg113_StaticMeshComponent0;    // 0x06F0 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg112_StaticMeshComponent0;    // 0x06F8 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg111_StaticMeshComponent0;    // 0x0700 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg110_StaticMeshComponent0;    // 0x0708 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg109_StaticMeshComponent0;    // 0x0710 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg108_StaticMeshComponent0;    // 0x0718 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg107_StaticMeshComponent0;    // 0x0720 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg106_StaticMeshComponent0;    // 0x0728 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg105_StaticMeshComponent0;    // 0x0730 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg104_StaticMeshComponent0;    // 0x0738 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg103_StaticMeshComponent0;    // 0x0740 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg102_StaticMeshComponent0;    // 0x0748 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg101_StaticMeshComponent0;    // 0x0750 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg100_StaticMeshComponent0;    // 0x0758 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg99_StaticMeshComponent0;     // 0x0760 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg98_StaticMeshComponent0;     // 0x0768 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg97_StaticMeshComponent0;     // 0x0770 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg96_StaticMeshComponent0;     // 0x0778 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg95_StaticMeshComponent0;     // 0x0780 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg94_StaticMeshComponent0;     // 0x0788 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg93_StaticMeshComponent0;     // 0x0790 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg92_StaticMeshComponent0;     // 0x0798 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_54_StaticMeshComponent0;               // 0x07A0 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_53_StaticMeshComponent0;               // 0x07A8 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_52_StaticMeshComponent0;               // 0x07B0 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_51_StaticMeshComponent0;               // 0x07B8 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m150_StaticMeshComponent0;                  // 0x07C0 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m149_StaticMeshComponent0;                  // 0x07C8 (size: 0x8)
    class UStaticMeshComponent* UBeam_TaperedCutB20_StaticMeshComponent0;             // 0x07D0 (size: 0x8)
    class UStaticMeshComponent* UBeam_TaperedCutB19_StaticMeshComponent0;             // 0x07D8 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m148_StaticMeshComponent0;                  // 0x07E0 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m147_StaticMeshComponent0;                  // 0x07E8 (size: 0x8)
    class UStaticMeshComponent* UBeam_TaperedCutB18_StaticMeshComponent0;             // 0x07F0 (size: 0x8)
    class UStaticMeshComponent* UBeam_TaperedCutB17_StaticMeshComponent0;             // 0x07F8 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m146_StaticMeshComponent0;                  // 0x0800 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m145_StaticMeshComponent0;                  // 0x0808 (size: 0x8)
    class UStaticMeshComponent* UBeam_TaperedCutB16_StaticMeshComponent0;             // 0x0810 (size: 0x8)
    class UStaticMeshComponent* UBeam_TaperedCutB15_StaticMeshComponent0;             // 0x0818 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_50_StaticMeshComponent0;               // 0x0820 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_49_StaticMeshComponent0;               // 0x0828 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_48_StaticMeshComponent0;               // 0x0830 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_47_StaticMeshComponent0;               // 0x0838 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_46_StaticMeshComponent0;               // 0x0840 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_45_StaticMeshComponent0;               // 0x0848 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_44_StaticMeshComponent0;               // 0x0850 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_43_StaticMeshComponent0;               // 0x0858 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_42_StaticMeshComponent0;               // 0x0860 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_41_StaticMeshComponent0;               // 0x0868 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_40_StaticMeshComponent0;               // 0x0870 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_39_StaticMeshComponent0;               // 0x0878 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m144_StaticMeshComponent0;                  // 0x0880 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m143_StaticMeshComponent0;                  // 0x0888 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m142_StaticMeshComponent0;                  // 0x0890 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m141_StaticMeshComponent0;                  // 0x0898 (size: 0x8)
    class UStaticMeshComponent* UBeam_TaperedCutB14_StaticMeshComponent0;             // 0x08A0 (size: 0x8)
    class UStaticMeshComponent* UBeam_TaperedCutB13_StaticMeshComponent0;             // 0x08A8 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m140_StaticMeshComponent0;                  // 0x08B0 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m139_StaticMeshComponent0;                  // 0x08B8 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m138_StaticMeshComponent0;                  // 0x08C0 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m137_StaticMeshComponent0;                  // 0x08C8 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m136_StaticMeshComponent0;                  // 0x08D0 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m135_StaticMeshComponent0;                  // 0x08D8 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m134_StaticMeshComponent0;                  // 0x08E0 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m133_StaticMeshComponent0;                  // 0x08E8 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m132_StaticMeshComponent0;                  // 0x08F0 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m131_StaticMeshComponent0;                  // 0x08F8 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m130_StaticMeshComponent0;                  // 0x0900 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m129_StaticMeshComponent0;                  // 0x0908 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m128_StaticMeshComponent0;                  // 0x0910 (size: 0x8)
    class UStaticMeshComponent* UBeam_GableSimpleA2_StaticMeshComponent0;             // 0x0918 (size: 0x8)
    class UStaticMeshComponent* UBeam_CrookedPlank20_StaticMeshComponent0;            // 0x0920 (size: 0x8)
    class UStaticMeshComponent* UBeam_CrookedPlank19_StaticMeshComponent0;            // 0x0928 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_38_StaticMeshComponent0;               // 0x0930 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_37_StaticMeshComponent0;               // 0x0938 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_36_StaticMeshComponent0;               // 0x0940 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_35_StaticMeshComponent0;               // 0x0948 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_32_StaticMeshComponent0;               // 0x0950 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_31_StaticMeshComponent0;               // 0x0958 (size: 0x8)
    class UStaticMeshComponent* UBeam_TaperedCutB12_StaticMeshComponent0;             // 0x0960 (size: 0x8)
    class UStaticMeshComponent* UBeam_TaperedCutB11_StaticMeshComponent0;             // 0x0968 (size: 0x8)
    class USceneComponent* mainShed2_DefaultSceneRoot;                                // 0x0970 (size: 0x8)

}; // Size: 0x978

#endif
