#ifndef UE4SS_SDK_developmentPanelTree_HPP
#define UE4SS_SDK_developmentPanelTree_HPP

class UdevelopmentPanelTree_C : public UNaviSubGrid
{
    FPointerToUberGraphFrame UberGraphFrame;                                          // 0x0350 (size: 0x8)
    class UWidgetAnimation* duckHeader;                                               // 0x0358 (size: 0x8)
    class UWidgetAnimation* openAnim;                                                 // 0x0360 (size: 0x8)
    class UVerticalBox* allPolicies_VB;                                               // 0x0368 (size: 0x8)
    class UTextBlock* availablePoints_txt;                                            // 0x0370 (size: 0x8)
    class UBorder* avPoints_border;                                                   // 0x0378 (size: 0x8)
    class UImage* background_figures_1;                                               // 0x0380 (size: 0x8)
    class UImage* bg_brightGradient;                                                  // 0x0388 (size: 0x8)
    class UBorder* ClickBindTarget;                                                   // 0x0390 (size: 0x8)
    class UVerticalBox* close_vb;                                                     // 0x0398 (size: 0x8)
    class UComboBoxString* ComboBoxString_399;                                        // 0x03A0 (size: 0x8)
    class USizeBox* devBranches_SizeBox;                                              // 0x03A8 (size: 0x8)
    class UdevCard_C* devCard_C_9;                                                    // 0x03B0 (size: 0x8)
    class UdevCard_C* devCard_C_24;                                                   // 0x03B8 (size: 0x8)
    class UdevCard_C* devCard_C_25;                                                   // 0x03C0 (size: 0x8)
    class UdevCard_C* devCard_C_28;                                                   // 0x03C8 (size: 0x8)
    class UdevCard_C* devCard_C_29;                                                   // 0x03D0 (size: 0x8)
    class UdevCard_C* devCard_C_32;                                                   // 0x03D8 (size: 0x8)
    class UdevCard_C* devCard_C_37;                                                   // 0x03E0 (size: 0x8)
    class UdevCard_C* devCard_C_38;                                                   // 0x03E8 (size: 0x8)
    class UdevCard_C* devCard_C_39;                                                   // 0x03F0 (size: 0x8)
    class UdevCard_C* devCard_C_42;                                                   // 0x03F8 (size: 0x8)
    class UdevLink_C* devLink;                                                        // 0x0400 (size: 0x8)
    class UdevLink_C* devLink_1;                                                      // 0x0408 (size: 0x8)
    class UdevLink_C* devLink_2;                                                      // 0x0410 (size: 0x8)
    class UdevLink_C* devLink_3;                                                      // 0x0418 (size: 0x8)
    class UdevLink_C* devLink_4;                                                      // 0x0420 (size: 0x8)
    class UdevLink_C* devLink_5;                                                      // 0x0428 (size: 0x8)
    class UdevLink_C* devLink_6;                                                      // 0x0430 (size: 0x8)
    class UdevLink_C* devLink_7;                                                      // 0x0438 (size: 0x8)
    class UdevLink_C* devLink_8;                                                      // 0x0440 (size: 0x8)
    class UdevLink_C* devLink_9;                                                      // 0x0448 (size: 0x8)
    class UdevLink_C* devLink_10;                                                     // 0x0450 (size: 0x8)
    class UdevLink_C* devLink_11;                                                     // 0x0458 (size: 0x8)
    class UScaleBox* devTree_ScaleBox;                                                // 0x0460 (size: 0x8)
    class UImage* gradient_img;                                                       // 0x0468 (size: 0x8)
    class UGridPanel* GridPanel_0;                                                    // 0x0470 (size: 0x8)
    class UVerticalBox* header_VB;                                                    // 0x0478 (size: 0x8)
    class UHorizontalRadioSelect_C* HorizontalRadioSelect_MainCategories;             // 0x0480 (size: 0x8)
    class UImage* Image_2;                                                            // 0x0488 (size: 0x8)
    class UImage* Image_13;                                                           // 0x0490 (size: 0x8)
    class UImage* Image_18;                                                           // 0x0498 (size: 0x8)
    class UImage* Image_74;                                                           // 0x04A0 (size: 0x8)
    class UImage* Image_82;                                                           // 0x04A8 (size: 0x8)
    class UImage* Image_133;                                                          // 0x04B0 (size: 0x8)
    class UlocalizedTextBox_C* localizedTextBox;                                      // 0x04B8 (size: 0x8)
    class UlocalizedTextBox_C* localizedTextBox_1;                                    // 0x04C0 (size: 0x8)
    class UVerticalBox* main_VB;                                                      // 0x04C8 (size: 0x8)
    class USizeBox* MainSizeBox;                                                      // 0x04D0 (size: 0x8)
    class UmenuButton_C* menuButton;                                                  // 0x04D8 (size: 0x8)
    class UTextBlock* name_txt;                                                       // 0x04E0 (size: 0x8)
    class UMD_NaviAutoButton_C* naviBtn_regionEditName;                               // 0x04E8 (size: 0x8)
    class UMD_NaviAutoButton_C* naviBtn_regionNext;                                   // 0x04F0 (size: 0x8)
    class UMD_NaviAutoButton_C* naviBtn_regionPrev;                                   // 0x04F8 (size: 0x8)
    class UlocalizedTextBox_C* noRecentTransactions_txt;                              // 0x0500 (size: 0x8)
    class UImage* paper_bg;                                                           // 0x0508 (size: 0x8)
    class UHorizontalBox* policies_HB;                                                // 0x0510 (size: 0x8)
    class UpolicyWidget_C* policyWidget;                                              // 0x0518 (size: 0x8)
    class UpolicyWidget_C* policyWidget_1;                                            // 0x0520 (size: 0x8)
    class UpolicyWidget_C* policyWidget_2;                                            // 0x0528 (size: 0x8)
    class UpolicyWidget_C* policyWidget_3;                                            // 0x0530 (size: 0x8)
    class UpolicyWidget_C* policyWidget_4;                                            // 0x0538 (size: 0x8)
    class UpolicyWidget_C* policyWidget_5;                                            // 0x0540 (size: 0x8)
    class UpolicyWidget_C* policyWidget_6;                                            // 0x0548 (size: 0x8)
    class UpolicyWidget_C* policyWidget_7;                                            // 0x0550 (size: 0x8)
    class UpolicyWidget_C* policyWidget_8;                                            // 0x0558 (size: 0x8)
    class UpolicyWidget_C* policyWidget_9;                                            // 0x0560 (size: 0x8)
    class UpolicyWidget_C* policyWidget_10;                                           // 0x0568 (size: 0x8)
    class UpolicyWidget_C* policyWidget_11;                                           // 0x0570 (size: 0x8)
    class UpolicyWidget_C* policyWidget_12;                                           // 0x0578 (size: 0x8)
    class UpolicyWidget_C* policyWidget_13;                                           // 0x0580 (size: 0x8)
    class UpolicyWidget_C* policyWidget_14;                                           // 0x0588 (size: 0x8)
    class UpolicyWidget_C* policyWidget_15;                                           // 0x0590 (size: 0x8)
    class UpolicyWidget_C* policyWidget_16;                                           // 0x0598 (size: 0x8)
    class UTextBlock* regionName;                                                     // 0x05A0 (size: 0x8)
    class UImage* regionName_spacer;                                                  // 0x05A8 (size: 0x8)
    class UTextBlock* regionName_txt;                                                 // 0x05B0 (size: 0x8)
    class UButton* regionNextButton;                                                  // 0x05B8 (size: 0x8)
    class UButton* regionPrevButton;                                                  // 0x05C0 (size: 0x8)
    class UButton* rename_button_1;                                                   // 0x05C8 (size: 0x8)
    class UBorder* ribbon;                                                            // 0x05D0 (size: 0x8)
    class URichTextBlock* RichTextBlock_138;                                          // 0x05D8 (size: 0x8)
    class UScrollBox* ScrollBox_1;                                                    // 0x05E0 (size: 0x8)
    class UImage* settlementLv_Icon;                                                  // 0x05E8 (size: 0x8)
    class UdevelopmentBranchWidget_C* techButtWidget_C;                               // 0x05F0 (size: 0x8)
    class UdevelopmentBranchWidget_C* techButtWidget_C_1;                             // 0x05F8 (size: 0x8)
    class UdevelopmentBranchWidget_C* techButtWidget_C_2;                             // 0x0600 (size: 0x8)
    class UdevelopmentBranchWidget_C* techButtWidget_C_3;                             // 0x0608 (size: 0x8)
    class UdevelopmentBranchWidget_C* techButtWidget_C_4;                             // 0x0610 (size: 0x8)
    class UdevelopmentBranchWidget_C* techButtWidget_C_5;                             // 0x0618 (size: 0x8)
    class UdevelopmentBranchWidget_C* techButtWidget_C_6;                             // 0x0620 (size: 0x8)
    class UdevelopmentBranchWidget_C* techButtWidget_C_7;                             // 0x0628 (size: 0x8)
    class UdevelopmentBranchWidget_C* techButtWidget_C_8;                             // 0x0630 (size: 0x8)
    class UdevelopmentBranchWidget_C* techButtWidget_C_9;                             // 0x0638 (size: 0x8)
    class UdevelopmentBranchWidget_C* techButtWidget_C_10;                            // 0x0640 (size: 0x8)
    class UdevelopmentBranchWidget_C* techButtWidget_C_11;                            // 0x0648 (size: 0x8)
    class UdevelopmentBranchWidget_C* techButtWidget_C_12;                            // 0x0650 (size: 0x8)
    class UdevelopmentBranchWidget_C* techButtWidget_C_13;                            // 0x0658 (size: 0x8)
    class UdevelopmentBranchWidget_C* techButtWidget_C_14;                            // 0x0660 (size: 0x8)
    class UdevelopmentBranchWidget_C* techButtWidget_C_15;                            // 0x0668 (size: 0x8)
    class UdevelopmentBranchWidget_C* techButtWidget_C_16;                            // 0x0670 (size: 0x8)
    class UdevelopmentBranchWidget_C* techButtWidget_C_17;                            // 0x0678 (size: 0x8)
    class UdevelopmentBranchWidget_C* techButtWidget_C_60;                            // 0x0680 (size: 0x8)
    class UdevelopmentBranchWidget_C* techButtWidget_C_61;                            // 0x0688 (size: 0x8)
    class UdevelopmentBranchWidget_C* techButtWidget_C_62;                            // 0x0690 (size: 0x8)
    class UdevelopmentBranchWidget_C* techButtWidget_C_63;                            // 0x0698 (size: 0x8)
    class UdevelopmentBranchWidget_C* techButtWidget_C_64;                            // 0x06A0 (size: 0x8)
    class UdevelopmentBranchWidget_C* techButtWidget_C_65;                            // 0x06A8 (size: 0x8)
    class UdevelopmentBranchWidget_C* techButtWidget_C_66;                            // 0x06B0 (size: 0x8)
    class UdevelopmentBranchWidget_C* techButtWidget_C_67;                            // 0x06B8 (size: 0x8)
    class UdevelopmentBranchWidget_C* techButtWidget_C_68;                            // 0x06C0 (size: 0x8)
    class UdevelopmentBranchWidget_C* techButtWidget_C_69;                            // 0x06C8 (size: 0x8)
    class UdevelopmentBranchWidget_C* techButtWidget_C_70;                            // 0x06D0 (size: 0x8)
    class UdevelopmentBranchWidget_C* techButtWidget_C_71;                            // 0x06D8 (size: 0x8)
    class UdevelopmentBranchWidget_C* techButtWidget_C_72;                            // 0x06E0 (size: 0x8)
    class UdevelopmentBranchWidget_C* techButtWidget_C_73;                            // 0x06E8 (size: 0x8)
    class UdevelopmentBranchWidget_C* techButtWidget_C_74;                            // 0x06F0 (size: 0x8)
    class UdevelopmentBranchWidget_C* techButtWidget_C_77;                            // 0x06F8 (size: 0x8)
    class UdevelopmentBranchWidget_C* techButtWidget_C_79;                            // 0x0700 (size: 0x8)
    class UdevelopmentBranchWidget_C* techButtWidget_C_81;                            // 0x0708 (size: 0x8)
    class UdevelopmentBranchWidget_C* techButtWidget_C_82;                            // 0x0710 (size: 0x8)
    class UdevelopmentBranchWidget_C* techButtWidget_C_87;                            // 0x0718 (size: 0x8)
    class UdevelopmentBranchWidget_C* techButtWidget_C_88;                            // 0x0720 (size: 0x8)
    class UdevelopmentBranchWidget_C* techButtWidget_C_94;                            // 0x0728 (size: 0x8)
    class UdevelopmentBranchWidget_C* techButtWidget_C_95;                            // 0x0730 (size: 0x8)
    class UdevelopmentBranchWidget_C* techButtWidget_C_97;                            // 0x0738 (size: 0x8)
    class UdevelopmentBranchWidget_C* techButtWidget_C_98;                            // 0x0740 (size: 0x8)
    class UCanvasPanel* techCanvas;                                                   // 0x0748 (size: 0x8)
    class UTextBlock* TextBlock_15;                                                   // 0x0750 (size: 0x8)
    class UTextBlock* TextBlock_209;                                                  // 0x0758 (size: 0x8)
    class UHorizontalRadioSelect_C* tradeLogCategorySelect;                           // 0x0760 (size: 0x8)
    class UWrapBox* tradeLogGood_wrapBox;                                             // 0x0768 (size: 0x8)
    class UImage* tradeScreenBG_Img;                                                  // 0x0770 (size: 0x8)
    class UImage* tradeSpacerTop;                                                     // 0x0778 (size: 0x8)
    class UImage* tradeSpacerTop_1;                                                   // 0x0780 (size: 0x8)
    class UCanvasPanel* tradeViewCanvas;                                              // 0x0788 (size: 0x8)
    class UtransactionLog_C* transactionLog;                                          // 0x0790 (size: 0x8)
    class ARegion* Region;                                                            // 0x0798 (size: 0x8)
    FVector TierHighlight;                                                            // 0x07A0 (size: 0x18)
    double TierThres01;                                                               // 0x07B8 (size: 0x8)
    double deltaT;                                                                    // 0x07C0 (size: 0x8)
    double TierThres02;                                                               // 0x07C8 (size: 0x8)
    double TierThres03;                                                               // 0x07D0 (size: 0x8)
    int32 numPointSpent;                                                              // 0x07D8 (size: 0x4)
    double treeZoomLv;                                                                // 0x07E0 (size: 0x8)
    bool Dragging;                                                                    // 0x07E8 (size: 0x1)
    FVector2D prevMousePos2D;                                                         // 0x07F0 (size: 0x10)
    FVector2D treeOffset;                                                             // 0x0800 (size: 0x10)
    FString currentCategory;                                                          // 0x0810 (size: 0x10)
    TArray<class UpolicyWidget_C*> allPolicyWidgets;                                  // 0x0820 (size: 0x10)
    int32 tradeViewStartDay;                                                          // 0x0830 (size: 0x4)
    int32 tradeViewEndDay;                                                            // 0x0834 (size: 0x4)
    int32 tradeViewCurrentDay;                                                        // 0x0838 (size: 0x4)

    FEventReply OnMouseButtonUp_0(FGeometry MyGeometry, const FPointerEvent& MouseEvent);
    FEventReply OnMouseButtonDown_0(FGeometry MyGeometry, const FPointerEvent& MouseEvent);
    FNaviSubGridLayout ComputeSubGridLayout();
    void updateTradeViewSummaryText();
    void repopulateTradeSummaryGoods();
    void setTradeViewStartAndEndDays();
    class UWidget* OnGenerateWidget(FString Item);
    void updateTradeView();
    void Find Link Nodes();
    void updatePolicies();
    void lerpInOutCategory(FString CategoryName, class UWidget* Widget);
    FEventReply OnMouseWheel(FGeometry MyGeometry, const FPointerEvent& MouseEvent);
    void animateTierRings();
    void updateDevAttributes();
    void PreConstruct(bool IsDesignTime);
    void Construct();
    void updateContents();
    void Tick(FGeometry MyGeometry, float InDeltaTime);
    void Close();
    void BndEvt__developmentPanelTree_rename_button_1_K2Node_ComponentBoundEvent_3_OnButtonReleasedEvent__DelegateSignature();
    void BndEvt__developmentPanelTree_HorizontalRadioSelect_K2Node_ComponentBoundEvent_4_RadioSelectedSignature__DelegateSignature(FString Value);
    void updatePoliciesEvent();
    void BndEvt__developmentPanelTree_menuButton_K2Node_ComponentBoundEvent_1_onReleased__DelegateSignature();
    void BndEvt__developmentPanelTree_HorizontalRadioSelect_K2Node_ComponentBoundEvent_0_RadioSelectedSignature__DelegateSignature(FString Value);
    void BndEvt__developmentPanelTree_ComboBoxString_399_K2Node_ComponentBoundEvent_2_OnSelectionChangedEvent__DelegateSignature(FString SelectedItem, TEnumAsByte<ESelectInfo::Type> SelectionType);
    void ExecuteUbergraph_developmentPanelTree(int32 EntryPoint);
}; // Size: 0x83C

#endif
