#ifndef UE4SS_SDK_None_HPP
#define UE4SS_SDK_None_HPP

class ANone : public ASoundBuddy
{
}; // Size: 0xE78

class ANone : public ADirector
{
    class USceneComponent* DefaultSceneRoot;                                          // 0x02D8 (size: 0x8)

}; // Size: 0x2E0

class ANone : public ALevelScriptActor
{
    FPointerToUberGraphFrame UberGraphFrame;                                          // 0x0298 (size: 0x8)
    class AMyRTSMultiEngineCPP_BP_C* masterPtr;                                       // 0x02A0 (size: 0x8)
    double windT;                                                                     // 0x02A8 (size: 0x8)
    class AMyRTSMultiEngineCPP_BP_C* RTSGameManager_ExecuteUbergraph_Mission01_ROBBER_RefProperty; // 0x02B0 (size: 0x8)
    class AFogBP_C* FogBP_2_ExecuteUbergraph_Mission01_ROBBER_RefProperty;            // 0x02B8 (size: 0x8)
    class AWindDirectionalSource* WindDirectionalSource_2_windDir_MERGED_RefProperty; // 0x02C0 (size: 0x8)
    class AWindDirectionalSource* WindDirectionalSource_2_windStr_MERGED_RefProperty; // 0x02C8 (size: 0x8)
    class AWindDirectionalSource* WindDirectionalSource_2_windSpeedBlend_MERGED_RefProperty; // 0x02D0 (size: 0x8)
    class AMyRTSMultiEngineCPP_BP_C* RTSGameManager_spawnSomeAnimals_MERGED_RefProperty; // 0x02D8 (size: 0x8)

    void None(int32 Type, int32 amt);
    void None(EUnitRole unitType, int32 LastIndex);
    void None();
    void None();
    void None();
    void None();
    void None();
    void None(float DeltaSeconds);
    void None();
    void None();
    void None();
    void None();
    void None();
    void None();
    void None();
    void None();
    void None();
    void None();
    void None();
    void None(int32 day);
    void None(double fogMultiplier);
    void None();
    void None();
    void None();
    void None();
    void None();
    void None();
    void None();
    void None();
    void None();
    void None();
    void None();
    void None();
    void None(int32 Good Type);
    void None();
    void None(int32 amt);
    void None(int32 regionIndex, int32 Good Type);
    void None();
    void None();
    void None(int32 EntryPoint);
}; // Size: 0x2E0

class ANone : public ALevelScriptActor
{
    FPointerToUberGraphFrame UberGraphFrame;                                          // 0x0298 (size: 0x8)
    class AMyRTSMultiEngineCPP_BP_C* masterPtr;                                       // 0x02A0 (size: 0x8)
    double windT;                                                                     // 0x02A8 (size: 0x8)
    class AMyRTSMultiEngineCPP_BP_C* RTSGameManager_ExecuteUbergraph_Mission01_ROBBER_2024-12_RefProperty; // 0x02B0 (size: 0x8)
    class AFogBP_C* FogBP_2_ExecuteUbergraph_Mission01_ROBBER_2024-12_RefProperty;    // 0x02B8 (size: 0x8)
    class AWindDirectionalSource* WindDirectionalSource_2_windDir_MERGED_RefProperty; // 0x02C0 (size: 0x8)
    class AWindDirectionalSource* WindDirectionalSource_2_windStr_MERGED_RefProperty; // 0x02C8 (size: 0x8)
    class AWindDirectionalSource* WindDirectionalSource_2_windSpeedBlend_MERGED_RefProperty; // 0x02D0 (size: 0x8)
    class AMyRTSMultiEngineCPP_BP_C* RTSGameManager_spawnSomeAnimals_MERGED_RefProperty; // 0x02D8 (size: 0x8)

    void None(int32 Type, int32 amt);
    void None(EUnitRole unitType, int32 LastIndex);
    void None();
    void None();
    void None();
    void None();
    void None();
    void None(float DeltaSeconds);
    void None();
    void None();
    void None();
    void None();
    void None();
    void None();
    void None();
    void None();
    void None();
    void None();
    void None();
    void None(int32 day);
    void None(double fogMultiplier);
    void None();
    void None();
    void None();
    void None();
    void None();
    void None();
    void None();
    void None();
    void None();
    void None();
    void None();
    void None();
    void None(int32 Good Type);
    void None();
    void None(int32 amt);
    void None(int32 regionIndex, int32 Good Type);
    void None();
    void None();
    void None(int32 EntryPoint);
}; // Size: 0x2E0

class ANone : public AMLWaterBodyRiver
{
}; // Size: 0x328

class ANone : public ALevelScriptActor
{
    FPointerToUberGraphFrame UberGraphFrame;                                          // 0x0298 (size: 0x8)
    class AMyRTSMultiEngineCPP_BP_C* masterPtr;                                       // 0x02A0 (size: 0x8)
    double windT;                                                                     // 0x02A8 (size: 0x8)
    class AWindDirectionalSource* WindDirectionalSource_2_windDir_MERGED_RefProperty; // 0x02B0 (size: 0x8)
    class AWindDirectionalSource* WindDirectionalSource_2_windStr_MERGED_RefProperty; // 0x02B8 (size: 0x8)
    class AWindDirectionalSource* WindDirectionalSource_2_windSpeedBlend_MERGED_RefProperty; // 0x02C0 (size: 0x8)
    class AMyRTSMultiEngineCPP_BP_C* RTSGameManager_spawnSomeAnimals_MERGED_RefProperty; // 0x02C8 (size: 0x8)

    void None(int32 Type, int32 amt);
    void None(EUnitRole unitType);
    void None();
    void None();
    void None();
    void None();
    void None();
    void None(float DeltaSeconds);
    void None(int32 EntryPoint);
}; // Size: 0x2D0

class ANone : public ALevelScriptActor
{
    FPointerToUberGraphFrame UberGraphFrame;                                          // 0x0298 (size: 0x8)
    class AMyRTSMultiEngineCPP_BP_C* masterPtr;                                       // 0x02A0 (size: 0x8)
    double windT;                                                                     // 0x02A8 (size: 0x8)
    class AWindDirectionalSource* WindDirectionalSource_2_windDir_MERGED_RefProperty; // 0x02B0 (size: 0x8)
    class AWindDirectionalSource* WindDirectionalSource_2_windStr_MERGED_RefProperty; // 0x02B8 (size: 0x8)
    class AWindDirectionalSource* WindDirectionalSource_2_windSpeedBlend_MERGED_RefProperty; // 0x02C0 (size: 0x8)
    class AMyRTSMultiEngineCPP_BP_C* RTSGameManager_spawnSomeAnimals_MERGED_RefProperty; // 0x02C8 (size: 0x8)

    void None(int32 Type, int32 amt);
    void None(EUnitRole unitType, int32 LastIndex);
    void None();
    void None();
    void None();
    void None();
    void None();
    void None(float DeltaSeconds);
    void None(int32 EntryPoint);
}; // Size: 0x2D0

class UNone : public UObject
{
}; // Size: 0x28

class UNone : public UObject
{
}; // Size: 0x28

#endif
