#ifndef UE4SS_SDK_residentialWidgetFull_HPP
#define UE4SS_SDK_residentialWidgetFull_HPP

class UresidentialWidgetFull_C : public UUserWidget
{
    FPointerToUberGraphFrame UberGraphFrame;                                          // 0x02E0 (size: 0x8)
    class UHorizontalBox* arm_bow_hb;                                                 // 0x02E8 (size: 0x8)
    class UHorizontalBox* arm_bow_hb_1;                                               // 0x02F0 (size: 0x8)
    class UHorizontalBox* arm_bow_hb_2;                                               // 0x02F8 (size: 0x8)
    class UHorizontalBox* arm_helmet_hb;                                              // 0x0300 (size: 0x8)
    class UHorizontalBox* arm_helmet_hb_1;                                            // 0x0308 (size: 0x8)
    class UHorizontalBox* arm_mail_hb_3;                                              // 0x0310 (size: 0x8)
    class UHorizontalBox* arm_polearms_hb;                                            // 0x0318 (size: 0x8)
    class UHorizontalBox* arm_polearms_hb_1;                                          // 0x0320 (size: 0x8)
    class UHorizontalBox* arm_shields_hb;                                             // 0x0328 (size: 0x8)
    class UHorizontalBox* arm_shieldsSmall_hb;                                        // 0x0330 (size: 0x8)
    class UHorizontalBox* arm_sidearms_hb;                                            // 0x0338 (size: 0x8)
    class UHorizontalBox* arm_sidearms_hb_3;                                          // 0x0340 (size: 0x8)
    class UHorizontalBox* arm_spears_hb;                                              // 0x0348 (size: 0x8)
    class UHorizontalBox* arm_spears_hb_1;                                            // 0x0350 (size: 0x8)
    class UHorizontalBox* arm_xbow_hb_3;                                              // 0x0358 (size: 0x8)
    class UImage* buildingHelp;                                                       // 0x0360 (size: 0x8)
    class UImage* buildingHelp_1;                                                     // 0x0368 (size: 0x8)
    class UImage* buildingHelp_2;                                                     // 0x0370 (size: 0x8)
    class UImage* buildingHelp_3;                                                     // 0x0378 (size: 0x8)
    class UImage* buildingHelp_4;                                                     // 0x0380 (size: 0x8)
    class UHorizontalBox* faith_hb;                                                   // 0x0388 (size: 0x8)
    class UHorizontalBox* fuelHB_1;                                                   // 0x0390 (size: 0x8)
    class UHorizontalBox* fun_hb;                                                     // 0x0398 (size: 0x8)
    class UButton* help_buildingType;                                                 // 0x03A0 (size: 0x8)
    class UButton* help_buildingType_1;                                               // 0x03A8 (size: 0x8)
    class UButton* help_buildingType_2;                                               // 0x03B0 (size: 0x8)
    class UButton* help_buildingType_3;                                               // 0x03B8 (size: 0x8)
    class UButton* help_residentialRequirement_buttons;                               // 0x03C0 (size: 0x8)
    class UImage* Image;                                                              // 0x03C8 (size: 0x8)
    class UImage* Image_0;                                                            // 0x03D0 (size: 0x8)
    class UImage* Image_1;                                                            // 0x03D8 (size: 0x8)
    class UImage* Image_2;                                                            // 0x03E0 (size: 0x8)
    class UImage* Image_3;                                                            // 0x03E8 (size: 0x8)
    class UImage* Image_4;                                                            // 0x03F0 (size: 0x8)
    class UImage* Image_5;                                                            // 0x03F8 (size: 0x8)
    class UImage* Image_6;                                                            // 0x0400 (size: 0x8)
    class UImage* Image_7;                                                            // 0x0408 (size: 0x8)
    class UImage* Image_8;                                                            // 0x0410 (size: 0x8)
    class UImage* Image_9;                                                            // 0x0418 (size: 0x8)
    class UImage* Image_10;                                                           // 0x0420 (size: 0x8)
    class UImage* Image_11;                                                           // 0x0428 (size: 0x8)
    class UImage* Image_12;                                                           // 0x0430 (size: 0x8)
    class UImage* Image_13;                                                           // 0x0438 (size: 0x8)
    class UImage* Image_14;                                                           // 0x0440 (size: 0x8)
    class UImage* Image_15;                                                           // 0x0448 (size: 0x8)
    class UImage* Image_16;                                                           // 0x0450 (size: 0x8)
    class UImage* Image_17;                                                           // 0x0458 (size: 0x8)
    class UImage* Image_18;                                                           // 0x0460 (size: 0x8)
    class UImage* Image_19;                                                           // 0x0468 (size: 0x8)
    class UImage* Image_20;                                                           // 0x0470 (size: 0x8)
    class UImage* Image_21;                                                           // 0x0478 (size: 0x8)
    class UImage* Image_22;                                                           // 0x0480 (size: 0x8)
    class UImage* Image_23;                                                           // 0x0488 (size: 0x8)
    class UImage* Image_24;                                                           // 0x0490 (size: 0x8)
    class UImage* Image_25;                                                           // 0x0498 (size: 0x8)
    class UImage* Image_26;                                                           // 0x04A0 (size: 0x8)
    class UImage* Image_27;                                                           // 0x04A8 (size: 0x8)
    class UImage* Image_28;                                                           // 0x04B0 (size: 0x8)
    class UImage* Image_29;                                                           // 0x04B8 (size: 0x8)
    class UImage* Image_30;                                                           // 0x04C0 (size: 0x8)
    class UImage* Image_31;                                                           // 0x04C8 (size: 0x8)
    class UImage* Image_32;                                                           // 0x04D0 (size: 0x8)
    class UImage* Image_35;                                                           // 0x04D8 (size: 0x8)
    class UImage* Image_36;                                                           // 0x04E0 (size: 0x8)
    class UImage* Image_37;                                                           // 0x04E8 (size: 0x8)
    class UImage* Image_38;                                                           // 0x04F0 (size: 0x8)
    class UImage* Image_39;                                                           // 0x04F8 (size: 0x8)
    class UImage* Image_40;                                                           // 0x0500 (size: 0x8)
    class UImage* Image_41;                                                           // 0x0508 (size: 0x8)
    class UImage* Image_42;                                                           // 0x0510 (size: 0x8)
    class UImage* Image_43;                                                           // 0x0518 (size: 0x8)
    class UImage* Image_44;                                                           // 0x0520 (size: 0x8)
    class UImage* Image_45;                                                           // 0x0528 (size: 0x8)
    class UImage* Image_46;                                                           // 0x0530 (size: 0x8)
    class UImage* Image_47;                                                           // 0x0538 (size: 0x8)
    class UImage* Image_48;                                                           // 0x0540 (size: 0x8)
    class UImage* Image_49;                                                           // 0x0548 (size: 0x8)
    class UImage* Image_50;                                                           // 0x0550 (size: 0x8)
    class UImage* Image_70;                                                           // 0x0558 (size: 0x8)
    class UImage* Image_77;                                                           // 0x0560 (size: 0x8)
    class UImage* Image_125;                                                          // 0x0568 (size: 0x8)
    class UImage* Image_146;                                                          // 0x0570 (size: 0x8)
    class UImage* Image_197;                                                          // 0x0578 (size: 0x8)
    class UImage* Image_292;                                                          // 0x0580 (size: 0x8)
    class UlocalizedTextBox_C* localizedTextBox_C;                                    // 0x0588 (size: 0x8)
    class UlocalizedTextBox_C* localizedTextBox_C_1;                                  // 0x0590 (size: 0x8)
    class UlocalizedTextBox_C* localizedTextBox_C_2;                                  // 0x0598 (size: 0x8)
    class UlocalizedTextBox_C* localizedTextBox_C_3;                                  // 0x05A0 (size: 0x8)
    class UlocalizedTextBox_C* localizedTextBox_C_4;                                  // 0x05A8 (size: 0x8)
    class UlocalizedTextBox_C* localizedTextBox_C_5;                                  // 0x05B0 (size: 0x8)
    class UlocalizedTextBox_C* localizedTextBox_C_6;                                  // 0x05B8 (size: 0x8)
    class UlocalizedTextBox_C* localizedTextBox_C_7;                                  // 0x05C0 (size: 0x8)
    class UlocalizedTextBox_C* localizedTextBox_C_8;                                  // 0x05C8 (size: 0x8)
    class UlocalizedTextBox_C* localizedTextBox_C_9;                                  // 0x05D0 (size: 0x8)
    class UlocalizedTextBox_C* localizedTextBox_C_10;                                 // 0x05D8 (size: 0x8)
    class UHorizontalBox* mourning_hb;                                                // 0x05E0 (size: 0x8)
    class UTextBlock* mourning_txt;                                                   // 0x05E8 (size: 0x8)
    class UImage* prosperity_arow;                                                    // 0x05F0 (size: 0x8)
    class UHorizontalBox* prosperity_hb;                                              // 0x05F8 (size: 0x8)
    class UHorizontalBox* prosperity_hb_1;                                            // 0x0600 (size: 0x8)
    class UHorizontalBox* prosperity_hb_2;                                            // 0x0608 (size: 0x8)
    class UHorizontalBox* req_body_hb;                                                // 0x0610 (size: 0x8)
    class UHorizontalBox* req_helmet_hb;                                              // 0x0618 (size: 0x8)
    class UrequirementRating_C* requirementRating_body;                               // 0x0620 (size: 0x8)
    class UrequirementRating_C* requirementRating_commo;                              // 0x0628 (size: 0x8)
    class UrequirementRating_C* requirementRating_faith;                              // 0x0630 (size: 0x8)
    class UrequirementRating_C* requirementRating_food;                               // 0x0638 (size: 0x8)
    class UrequirementRating_C* requirementRating_fuel;                               // 0x0640 (size: 0x8)
    class UrequirementRating_C* requirementRating_fun;                                // 0x0648 (size: 0x8)
    class UrequirementRating_C* requirementRating_helmet;                             // 0x0650 (size: 0x8)
    class UrequirementRating_C* requirementRating_prosperity;                         // 0x0658 (size: 0x8)
    class UrequirementRating_C* requirementRating_water;                              // 0x0660 (size: 0x8)
    class UVerticalBox* requirements_vb;                                              // 0x0668 (size: 0x8)
    class UlocalizedTextBox_C* text_occasionalNeeds;                                  // 0x0670 (size: 0x8)
    class UTextBlock* text_occasionalNeeds_1;                                         // 0x0678 (size: 0x8)
    class UTextBlock* text_occasionalNeeds_2;                                         // 0x0680 (size: 0x8)
    class UTextBlock* text_occasionalNeeds_3;                                         // 0x0688 (size: 0x8)
    class UTextBlock* text_occasionalNeeds_4;                                         // 0x0690 (size: 0x8)
    class UTextBlock* text_occasionalNeeds_5;                                         // 0x0698 (size: 0x8)
    class UlocalizedTextBox_C* text_occasionalNeeds_6;                                // 0x06A0 (size: 0x8)
    class UTextBlock* text_occasionalNeeds_7;                                         // 0x06A8 (size: 0x8)
    class UTextBlock* text_occasionalNeeds_8;                                         // 0x06B0 (size: 0x8)
    class UTextBlock* text_occasionalNeeds_9;                                         // 0x06B8 (size: 0x8)
    class UTextBlock* text_occasionalNeeds_10;                                        // 0x06C0 (size: 0x8)
    class UTextBlock* text_occasionalNeeds_11;                                        // 0x06C8 (size: 0x8)
    class UTextBlock* TextBlock;                                                      // 0x06D0 (size: 0x8)
    class UTextBlock* TextBlock_1;                                                    // 0x06D8 (size: 0x8)
    class UTextBlock* TextBlock_2;                                                    // 0x06E0 (size: 0x8)
    class UTextBlock* TextBlock_3;                                                    // 0x06E8 (size: 0x8)
    class UTextBlock* TextBlock_4;                                                    // 0x06F0 (size: 0x8)
    class UTextBlock* TextBlock_5;                                                    // 0x06F8 (size: 0x8)
    class UTextBlock* TextBlock_6;                                                    // 0x0700 (size: 0x8)
    class UTextBlock* TextBlock_8;                                                    // 0x0708 (size: 0x8)
    class UTextBlock* TextBlock_10;                                                   // 0x0710 (size: 0x8)
    class UTextBlock* TextBlock_12;                                                   // 0x0718 (size: 0x8)
    class UTextBlock* TextBlock_bows;                                                 // 0x0720 (size: 0x8)
    class UTextBlock* TextBlock_candles;                                              // 0x0728 (size: 0x8)
    class UTextBlock* TextBlock_cloaks;                                               // 0x0730 (size: 0x8)
    class UTextBlock* TextBlock_clothes;                                              // 0x0738 (size: 0x8)
    class UTextBlock* TextBlock_gambesons;                                            // 0x0740 (size: 0x8)
    class UTextBlock* TextBlock_helmets;                                              // 0x0748 (size: 0x8)
    class UTextBlock* TextBlock_mails;                                                // 0x0750 (size: 0x8)
    class UTextBlock* TextBlock_pavise;                                               // 0x0758 (size: 0x8)
    class UTextBlock* TextBlock_polearms;                                             // 0x0760 (size: 0x8)
    class UTextBlock* TextBlock_shields;                                              // 0x0768 (size: 0x8)
    class UTextBlock* TextBlock_shoes;                                                // 0x0770 (size: 0x8)
    class UTextBlock* TextBlock_sidearms;                                             // 0x0778 (size: 0x8)
    class UTextBlock* TextBlock_spears;                                               // 0x0780 (size: 0x8)
    class UTextBlock* TextBlock_tools;                                                // 0x0788 (size: 0x8)
    class UTextBlock* TextBlock_xbows_1;                                              // 0x0790 (size: 0x8)
    class UHorizontalBox* waterHB;                                                    // 0x0798 (size: 0x8)
    class ASMBuildingMaster* building;                                                // 0x07A0 (size: 0x8)
    TArray<uint8> requirements;                                                       // 0x07A8 (size: 0x10)
    TArray<class UrequirementRating_C*> Requirement Rating Widgets;                   // 0x07B8 (size: 0x10)
    TArray<uint8> RequirementsNextLevel;                                              // 0x07C8 (size: 0x10)
    TArray<uint8> RequirementsTriggering;                                             // 0x07D8 (size: 0x10)
    TArray<FGood> StoredMilitaryEquipment;                                            // 0x07E8 (size: 0x10)
    TArray<FGood> RequiredMilitaryEquipment;                                          // 0x07F8 (size: 0x10)
    int32 num_familyMembers_total;                                                    // 0x0808 (size: 0x4)
    int32 num_familyMembers_assigned;                                                 // 0x080C (size: 0x4)
    TArray<class ASMUnit*> familyMembersCache;                                        // 0x0810 (size: 0x10)

    void getNumOccupantsConsumpationLevelSatisfied(FName statusType, int32& numSatisfied);
    void updateEssentialCommodityNum(class UTextBlock*& TextBlock, int32& needsAmt, FName statusType);
    void updateMilitaryEquipmentType(class UTextBlock* TextBlock, int32 goodID);
    void setRequirementAmtTxt(class UTextBlock* Target, int32 requried, FText hasTxt);
    void sumRequirementCount(TArray<uint8>& recuirements, int32& count1);
    void updateRequirements();
    void PreConstruct(bool IsDesignTime);
    void BndEvt__residentialWidgetFull_help_buildingType_4_K2Node_ComponentBoundEvent_0_OnButtonReleasedEvent__DelegateSignature();
    void Construct();
    void BndEvt__residentialWidgetFull_help_buildingType_1_K2Node_ComponentBoundEvent_1_OnButtonReleasedEvent__DelegateSignature();
    void BndEvt__residentialWidgetFull_help_buildingType_2_K2Node_ComponentBoundEvent_4_OnButtonReleasedEvent__DelegateSignature();
    void BndEvt__residentialWidgetFull_help_buildingType_3_K2Node_ComponentBoundEvent_5_OnButtonReleasedEvent__DelegateSignature();
    void ExecuteUbergraph_residentialWidgetFull(int32 EntryPoint);
}; // Size: 0x820

#endif
