#ifndef UE4SS_SDK_extensionSlotWidget_HPP
#define UE4SS_SDK_extensionSlotWidget_HPP

class UextensionSlotWidget_C : public UNaviSubGrid
{
    FPointerToUberGraphFrame UberGraphFrame;                                          // 0x0348 (size: 0x8)
    class UWidgetAnimation* openOptions;                                              // 0x0350 (size: 0x8)
    class UWidgetAnimation* closeOptions;                                             // 0x0358 (size: 0x8)
    class UVerticalBox* allOptions_vb;                                                // 0x0360 (size: 0x8)
    class UButton* Apiary;                                                            // 0x0368 (size: 0x8)
    class UButton* armorer;                                                           // 0x0370 (size: 0x8)
    class UButton* baker;                                                             // 0x0378 (size: 0x8)
    class UButton* Blacksmith;                                                        // 0x0380 (size: 0x8)
    class UButton* brewery;                                                           // 0x0388 (size: 0x8)
    class UButton* butcher;                                                           // 0x0390 (size: 0x8)
    class UButton* cobbler;                                                           // 0x0398 (size: 0x8)
    class UWrapBox* conversions;                                                      // 0x03A0 (size: 0x8)
    class UButton* coop;                                                              // 0x03A8 (size: 0x8)
    class UButton* demolish;                                                          // 0x03B0 (size: 0x8)
    class UImage* exclam;                                                             // 0x03B8 (size: 0x8)
    class UMD_NaviAutoButton_C* expansionButton;                                      // 0x03C0 (size: 0x8)
    class UMD_NaviAutoButton_C* ext0;                                                 // 0x03C8 (size: 0x8)
    class UMD_NaviAutoButton_C* ext0_0;                                               // 0x03D0 (size: 0x8)
    class UMD_NaviAutoButton_C* ext0_1;                                               // 0x03D8 (size: 0x8)
    class UMD_NaviAutoButton_C* ext0_2;                                               // 0x03E0 (size: 0x8)
    class UMD_NaviAutoButton_C* ext0_3;                                               // 0x03E8 (size: 0x8)
    class UMD_NaviAutoButton_C* ext1_0;                                               // 0x03F0 (size: 0x8)
    class UMD_NaviAutoButton_C* ext1_1;                                               // 0x03F8 (size: 0x8)
    class UMD_NaviAutoButton_C* ext1_2;                                               // 0x0400 (size: 0x8)
    class UMD_NaviAutoButton_C* ext2_0;                                               // 0x0408 (size: 0x8)
    class UMD_NaviAutoButton_C* ext2_1;                                               // 0x0410 (size: 0x8)
    class UMD_NaviAutoButton_C* ext2_2;                                               // 0x0418 (size: 0x8)
    class UMD_NaviAutoButton_C* ext3_0;                                               // 0x0420 (size: 0x8)
    class UMD_NaviAutoButton_C* ext3_1;                                               // 0x0428 (size: 0x8)
    class UMD_NaviAutoButton_C* ext3_2;                                               // 0x0430 (size: 0x8)
    class UWrapBox* extensionsOptions;                                                // 0x0438 (size: 0x8)
    class UButton* fletcher;                                                          // 0x0440 (size: 0x8)
    class UButton* garden;                                                            // 0x0448 (size: 0x8)
    class UButton* goat;                                                              // 0x0450 (size: 0x8)
    class UImage* Image;                                                              // 0x0458 (size: 0x8)
    class UImage* Image_1;                                                            // 0x0460 (size: 0x8)
    class UImage* Image_2;                                                            // 0x0468 (size: 0x8)
    class UImage* Image_3;                                                            // 0x0470 (size: 0x8)
    class UImage* Image_4;                                                            // 0x0478 (size: 0x8)
    class UImage* Image_5;                                                            // 0x0480 (size: 0x8)
    class UImage* Image_6;                                                            // 0x0488 (size: 0x8)
    class UImage* Image_7;                                                            // 0x0490 (size: 0x8)
    class UImage* Image_8;                                                            // 0x0498 (size: 0x8)
    class UImage* Image_9;                                                            // 0x04A0 (size: 0x8)
    class UImage* Image_12;                                                           // 0x04A8 (size: 0x8)
    class UImage* Image_13;                                                           // 0x04B0 (size: 0x8)
    class UImage* Image_14;                                                           // 0x04B8 (size: 0x8)
    class UImage* Image_15;                                                           // 0x04C0 (size: 0x8)
    class UImage* Image_17;                                                           // 0x04C8 (size: 0x8)
    class UImage* Image_18;                                                           // 0x04D0 (size: 0x8)
    class UImage* Image_19;                                                           // 0x04D8 (size: 0x8)
    class UImage* Image_20;                                                           // 0x04E0 (size: 0x8)
    class UImage* Image_21;                                                           // 0x04E8 (size: 0x8)
    class UImage* Image_22;                                                           // 0x04F0 (size: 0x8)
    class UImage* Image_23;                                                           // 0x04F8 (size: 0x8)
    class UImage* Image_24;                                                           // 0x0500 (size: 0x8)
    class UImage* Image_25;                                                           // 0x0508 (size: 0x8)
    class UImage* Image_26;                                                           // 0x0510 (size: 0x8)
    class UImage* Image_27;                                                           // 0x0518 (size: 0x8)
    class UImage* Image_55;                                                           // 0x0520 (size: 0x8)
    class UImage* Image_77;                                                           // 0x0528 (size: 0x8)
    class UImage* Image_93;                                                           // 0x0530 (size: 0x8)
    class UButton* joiner;                                                            // 0x0538 (size: 0x8)
    class UButton* main_button;                                                       // 0x0540 (size: 0x8)
    class UMD_NaviAutoButton_C* naviDemolish;                                         // 0x0548 (size: 0x8)
    class USizeBox* options_sb;                                                       // 0x0550 (size: 0x8)
    class UButton* Orchard;                                                           // 0x0558 (size: 0x8)
    class UButton* tailor;                                                            // 0x0560 (size: 0x8)
    FExtension Extension;                                                             // 0x0570 (size: 0xC0)
    class ASMBuildingMaster* building;                                                // 0x0630 (size: 0x8)
    int32 ID;                                                                         // 0x0638 (size: 0x4)
    bool showConversionOptions;                                                       // 0x063C (size: 0x1)
    bool showOptions;                                                                 // 0x063D (size: 0x1)

    FNaviSubGridLayout ComputeSubGridLayout();
    void requestArtisanChange(int32 New Request Upgrade ID);
    void setupTooltps();
    void playExtensionSignatureSnd(int32 Index);
    void ChangeExtension(int32 Type);
    void UpdateContents();
    void BndEvt__extensionSlotWidget_blacksmith_K2Node_ComponentBoundEvent_5_OnButtonReleasedEvent__DelegateSignature();
    void BndEvt__extensionSlotWidget_baker_K2Node_ComponentBoundEvent_3_OnButtonReleasedEvent__DelegateSignature();
    void BndEvt__extensionSlotWidget_demo_K2Node_ComponentBoundEvent_3_OnButtonReleasedEvent__DelegateSignature();
    void BndEvt__extensionSlotWidget_goat_K2Node_ComponentBoundEvent_2_OnButtonReleasedEvent__DelegateSignature();
    void BndEvt__extensionSlotWidget_main_button_K2Node_ComponentBoundEvent_8_OnButtonHoverEvent__DelegateSignature();
    void BndEvt__extensionSlotWidget_baker_K2Node_ComponentBoundEvent_9_OnButtonHoverEvent__DelegateSignature();
    void BndEvt__extensionSlotWidget_blacksmith_K2Node_ComponentBoundEvent_10_OnButtonHoverEvent__DelegateSignature();
    void BndEvt__extensionSlotWidget_Button_K2Node_ComponentBoundEvent_1_OnButtonReleasedEvent__DelegateSignature();
    void Tick(FGeometry MyGeometry, float InDeltaTime);
    void BndEvt__extensionSlotWidget_brewery_K2Node_ComponentBoundEvent_11_OnButtonReleasedEvent__DelegateSignature();
    void BndEvt__extensionSlotWidget_tailor_K2Node_ComponentBoundEvent_12_OnButtonHoverEvent__DelegateSignature();
    void BndEvt__extensionSlotWidget_tailor_K2Node_ComponentBoundEvent_13_OnButtonReleasedEvent__DelegateSignature();
    void BndEvt__extensionSlotWidget_cobbler_K2Node_ComponentBoundEvent_14_OnButtonReleasedEvent__DelegateSignature();
    void BndEvt__extensionSlotWidget_cobbler_K2Node_ComponentBoundEvent_15_OnButtonHoverEvent__DelegateSignature();
    void BndEvt__extensionSlotWidget_garden_K2Node_ComponentBoundEvent_16_OnButtonReleasedEvent__DelegateSignature();
    void BndEvt__extensionSlotWidget_joiner_K2Node_ComponentBoundEvent_17_OnButtonReleasedEvent__DelegateSignature();
    void BndEvt__extensionSlotWidget_armorer_K2Node_ComponentBoundEvent_18_OnButtonReleasedEvent__DelegateSignature();
    void BndEvt__extensionSlotWidget_armorer_1_K2Node_ComponentBoundEvent_19_OnButtonReleasedEvent__DelegateSignature();
    void BndEvt__extensionSlotWidget_orchard_K2Node_ComponentBoundEvent_20_OnButtonReleasedEvent__DelegateSignature();
    void BndEvt__extensionSlotWidget_Button_14_K2Node_ComponentBoundEvent_0_OnButtonReleasedEvent__DelegateSignature();
    void Construct();
    void BndEvt__extensionSlotWidget_butcher_K2Node_ComponentBoundEvent_21_OnButtonReleasedEvent__DelegateSignature();
    void BndEvt__extensionSlotWidget_brewery_K2Node_ComponentBoundEvent_22_OnButtonHoverEvent__DelegateSignature();
    void BndEvt__extensionSlotWidget_joiner_K2Node_ComponentBoundEvent_23_OnButtonHoverEvent__DelegateSignature();
    void BndEvt__extensionSlotWidget_armorer_K2Node_ComponentBoundEvent_24_OnButtonHoverEvent__DelegateSignature();
    void BndEvt__extensionSlotWidget_fletcher_K2Node_ComponentBoundEvent_25_OnButtonHoverEvent__DelegateSignature();
    void BndEvt__extensionSlotWidget_butcher_K2Node_ComponentBoundEvent_26_OnButtonHoverEvent__DelegateSignature();
    void BndEvt__extensionSlotWidget_orchard_K2Node_ComponentBoundEvent_27_OnButtonHoverEvent__DelegateSignature();
    void BndEvt__extensionSlotWidget_goat_K2Node_ComponentBoundEvent_28_OnButtonHoverEvent__DelegateSignature();
    void BndEvt__extensionSlotWidget_coop_K2Node_ComponentBoundEvent_29_OnButtonHoverEvent__DelegateSignature();
    void BndEvt__extensionSlotWidget_garden_K2Node_ComponentBoundEvent_30_OnButtonHoverEvent__DelegateSignature();
    void BndEvt__extensionSlotWidget_apiary_K2Node_ComponentBoundEvent_31_OnButtonReleasedEvent__DelegateSignature();
    void ExecuteUbergraph_extensionSlotWidget(int32 EntryPoint);
}; // Size: 0x63E

#endif
