#ifndef UE4SS_SDK_quickSettings_HPP
#define UE4SS_SDK_quickSettings_HPP

class UquickSettings_C : public UNaviSubGrid
{
    FPointerToUberGraphFrame UberGraphFrame;                                          // 0x0348 (size: 0x8)
    class UWidgetAnimation* animateCategory;                                          // 0x0350 (size: 0x8)
    class UVerticalBox* AA_VB;                                                        // 0x0358 (size: 0x8)
    class UVerticalBox* bindings_vb;                                                  // 0x0360 (size: 0x8)
    class UButton* boop_mode;                                                         // 0x0368 (size: 0x8)
    class UButton* boop_mode_1;                                                       // 0x0370 (size: 0x8)
    class UBorder* category_bar_border_bottom;                                        // 0x0378 (size: 0x8)
    class UBorder* category_bar_border_top;                                           // 0x0380 (size: 0x8)
    class UMLDefaultCheckbox_C* checkbox_CameraShake;                                 // 0x0388 (size: 0x8)
    class UMLDefaultCheckbox_C* checkbox_MultipleCtrlGroups;                          // 0x0390 (size: 0x8)
    class UHorizontalBox* color_coding_hb;                                            // 0x0398 (size: 0x8)
    class UButton* colorcoding_off;                                                   // 0x03A0 (size: 0x8)
    class UButton* colorcoding_off_1;                                                 // 0x03A8 (size: 0x8)
    class UButton* colorcoding_off_2;                                                 // 0x03B0 (size: 0x8)
    class UButton* colorcoding_off_3;                                                 // 0x03B8 (size: 0x8)
    class UButton* colorcoding_on;                                                    // 0x03C0 (size: 0x8)
    class UComboBoxString* ComboBox_Language;                                         // 0x03C8 (size: 0x8)
    class UCheckBox* debug_chkb;                                                      // 0x03D0 (size: 0x8)
    class UCheckBox* debug_chkb_1;                                                    // 0x03D8 (size: 0x8)
    class UCheckBox* debug_chkb_2;                                                    // 0x03E0 (size: 0x8)
    class UButton* default_viewDistMul;                                               // 0x03E8 (size: 0x8)
    class UHorizontalBox* dlss_framegen_hb;                                           // 0x03F0 (size: 0x8)
    class UButton* dlss_off;                                                          // 0x03F8 (size: 0x8)
    class UButton* dlss_perf;                                                         // 0x0400 (size: 0x8)
    class UButton* dlss_quality;                                                      // 0x0408 (size: 0x8)
    class UButton* dlss_quality_1;                                                    // 0x0410 (size: 0x8)
    class UHorizontalBox* dlss_quality_hb;                                            // 0x0418 (size: 0x8)
    class UVerticalBox* DLSS_VB;                                                      // 0x0420 (size: 0x8)
    class UVerticalBox* DuringGameOnly_VB;                                            // 0x0428 (size: 0x8)
    class UHorizontalBox* edgeScroll_HB;                                              // 0x0430 (size: 0x8)
    class UScaleBox* fps_scalebox;                                                    // 0x0438 (size: 0x8)
    class UVerticalBox* FPS_VB;                                                       // 0x0440 (size: 0x8)
    class UHorizontalBox* fsr_framegen_hb;                                            // 0x0448 (size: 0x8)
    class UHorizontalBox* fsr_quality_hb;                                             // 0x0450 (size: 0x8)
    class UVerticalBox* FSR_VB;                                                       // 0x0458 (size: 0x8)
    class UScaleBox* globalSB;                                                        // 0x0460 (size: 0x8)
    class UHorizontalRadioSelect_C* HorizontalRadioSelect;                            // 0x0468 (size: 0x8)
    class UHorizontalRadioSelect_C* HorizontalRadioSelect_bottom;                     // 0x0470 (size: 0x8)
    class UImage* Image;                                                              // 0x0478 (size: 0x8)
    class UImage* Image_13;                                                           // 0x0480 (size: 0x8)
    class UImage* Image_15;                                                           // 0x0488 (size: 0x8)
    class UImage* Image_80;                                                           // 0x0490 (size: 0x8)
    class UBorder* insideBorder;                                                      // 0x0498 (size: 0x8)
    class UHorizontalBox* language_text_hb;                                           // 0x04A0 (size: 0x8)
    class UlocalizedTextBox_C* localizedTextBox;                                      // 0x04A8 (size: 0x8)
    class UlocalizedTextBox_C* localizedTextBox_1;                                    // 0x04B0 (size: 0x8)
    class UlocalizedTextBox_C* localizedTextBox_132;                                  // 0x04B8 (size: 0x8)
    class UlocalizedTextBox_C* localizedTextBox_212;                                  // 0x04C0 (size: 0x8)
    class UlocalizedTextBox_C* localizedTextBox_C;                                    // 0x04C8 (size: 0x8)
    class UlocalizedTextBox_C* localizedTextBox_C_0;                                  // 0x04D0 (size: 0x8)
    class UlocalizedTextBox_C* localizedTextBox_C_1;                                  // 0x04D8 (size: 0x8)
    class UlocalizedTextBox_C* localizedTextBox_C_2;                                  // 0x04E0 (size: 0x8)
    class UlocalizedTextBox_C* localizedTextBox_C_3;                                  // 0x04E8 (size: 0x8)
    class UlocalizedTextBox_C* localizedTextBox_C_4;                                  // 0x04F0 (size: 0x8)
    class UlocalizedTextBox_C* localizedTextBox_C_5;                                  // 0x04F8 (size: 0x8)
    class UlocalizedTextBox_C* localizedTextBox_C_6;                                  // 0x0500 (size: 0x8)
    class UlocalizedTextBox_C* localizedTextBox_C_8;                                  // 0x0508 (size: 0x8)
    class UlocalizedTextBox_C* localizedTextBox_C_9;                                  // 0x0510 (size: 0x8)
    class UlocalizedTextBox_C* localizedTextBox_C_10;                                 // 0x0518 (size: 0x8)
    class UlocalizedTextBox_C* localizedTextBox_C_11;                                 // 0x0520 (size: 0x8)
    class UlocalizedTextBox_C* localizedTextBox_C_12;                                 // 0x0528 (size: 0x8)
    class UlocalizedTextBox_C* localizedTextBox_C_13;                                 // 0x0530 (size: 0x8)
    class UlocalizedTextBox_C* localizedTextBox_C_14;                                 // 0x0538 (size: 0x8)
    class UlocalizedTextBox_C* localizedTextBox_C_15;                                 // 0x0540 (size: 0x8)
    class UlocalizedTextBox_C* localizedTextBox_C_16;                                 // 0x0548 (size: 0x8)
    class UlocalizedTextBox_C* localizedTextBox_C_17;                                 // 0x0550 (size: 0x8)
    class UlocalizedTextBox_C* localizedTextBox_C_18;                                 // 0x0558 (size: 0x8)
    class UlocalizedTextBox_C* localizedTextBox_C_19;                                 // 0x0560 (size: 0x8)
    class UlocalizedTextBox_C* localizedTextBox_C_20;                                 // 0x0568 (size: 0x8)
    class UlocalizedTextBox_C* localizedTextBox_C_21;                                 // 0x0570 (size: 0x8)
    class UlocalizedTextBox_C* localizedTextBox_C_22;                                 // 0x0578 (size: 0x8)
    class UlocalizedTextBox_C* localizedTextBox_C_23;                                 // 0x0580 (size: 0x8)
    class UlocalizedTextBox_C* localizedTextBox_C_24;                                 // 0x0588 (size: 0x8)
    class UlocalizedTextBox_C* localizedTextBox_C_25;                                 // 0x0590 (size: 0x8)
    class UlocalizedTextBox_C* localizedTextBox_C_26;                                 // 0x0598 (size: 0x8)
    class UlocalizedTextBox_C* localizedTextBox_C_27;                                 // 0x05A0 (size: 0x8)
    class UlocalizedTextBox_C* localizedTextBox_C_28;                                 // 0x05A8 (size: 0x8)
    class UlocalizedTextBox_C* localizedTextBox_C_29;                                 // 0x05B0 (size: 0x8)
    class UlocalizedTextBox_C* localizedTextBox_C_30;                                 // 0x05B8 (size: 0x8)
    class UlocalizedTextBox_C* localizedTextBox_C_31;                                 // 0x05C0 (size: 0x8)
    class UlocalizedTextBox_C* localizedTextBox_C_32;                                 // 0x05C8 (size: 0x8)
    class UlocalizedTextBox_C* localizedTextBox_C_33;                                 // 0x05D0 (size: 0x8)
    class UlocalizedTextBox_C* localizedTextBox_C_34;                                 // 0x05D8 (size: 0x8)
    class UlocalizedTextBox_C* localizedTextBox_C_35;                                 // 0x05E0 (size: 0x8)
    class UlocalizedTextBox_C* localizedTextBox_C_36;                                 // 0x05E8 (size: 0x8)
    class UlocalizedTextBox_C* localizedTextBox_C_37;                                 // 0x05F0 (size: 0x8)
    class UlocalizedTextBox_C* localizedTextBox_C_38;                                 // 0x05F8 (size: 0x8)
    class UlocalizedTextBox_C* localizedTextBox_C_39;                                 // 0x0600 (size: 0x8)
    class UlocalizedTextBox_C* localizedTextBox_C_40;                                 // 0x0608 (size: 0x8)
    class UlocalizedTextBox_C* localizedTextBox_C_41;                                 // 0x0610 (size: 0x8)
    class UlocalizedTextBox_C* localizedTextBox_C_42;                                 // 0x0618 (size: 0x8)
    class UlocalizedTextBox_C* localizedTextBox_C_43;                                 // 0x0620 (size: 0x8)
    class UlocalizedTextBox_C* localizedTextBox_C_44;                                 // 0x0628 (size: 0x8)
    class UlocalizedTextBox_C* localizedTextBox_C_45;                                 // 0x0630 (size: 0x8)
    class UlocalizedTextBox_C* localizedTextBox_C_46;                                 // 0x0638 (size: 0x8)
    class UlocalizedTextBox_C* localizedTextBox_C_47;                                 // 0x0640 (size: 0x8)
    class UlocalizedTextBox_C* localizedTextBox_C_48;                                 // 0x0648 (size: 0x8)
    class UBorder* main_border;                                                       // 0x0650 (size: 0x8)
    class USizeBox* main_sb;                                                          // 0x0658 (size: 0x8)
    class UMD_NaviComboBoxWrapper_C* MD_NaviComboBoxWrapper;                          // 0x0660 (size: 0x8)
    class UML_DefaultComboBoxSetting_C* ML_DefaultComboBoxSetting;                    // 0x0668 (size: 0x8)
    class UML_DefaultRadioSelectSetting_C* ML_DefaultRadioSelectSetting_aaAlgo;       // 0x0670 (size: 0x8)
    class UML_DefaultRadioSelectSetting_C* ML_DefaultRadioSelectSetting_windowmode;   // 0x0678 (size: 0x8)
    class UHorizontalBox* mouseLock_vb;                                               // 0x0680 (size: 0x8)
    class UHorizontalBox* multipleCtrlGroups_HB;                                      // 0x0688 (size: 0x8)
    class UButton* playtest_battle;                                                   // 0x0690 (size: 0x8)
    class UHorizontalRadioSelect_C* PresetSelect;                                     // 0x0698 (size: 0x8)
    class UHorizontalRadioSelect_C* PresetSelector;                                   // 0x06A0 (size: 0x8)
    class UDefaultRadioSelectSetting_C* Radio_AA_Resolution;                          // 0x06A8 (size: 0x8)
    class UDefaultRadioSelectSetting_C* Radio_DLSS_Framegen;                          // 0x06B0 (size: 0x8)
    class UDefaultRadioSelectSetting_C* Radio_DLSS_Quality;                           // 0x06B8 (size: 0x8)
    class UDefaultRadioSelectSetting_C* Radio_FSR_Framegen;                           // 0x06C0 (size: 0x8)
    class UDefaultRadioSelectSetting_C* Radio_FSR_Quality;                            // 0x06C8 (size: 0x8)
    class UDefaultRadioSelectSetting_C* Radio_XeSS_Framegen;                          // 0x06D0 (size: 0x8)
    class UDefaultRadioSelectSetting_C* Radio_XeSS_Quality;                           // 0x06D8 (size: 0x8)
    class UHorizontalBox* resolution_HB;                                              // 0x06E0 (size: 0x8)
    class UImage* ResolutionLockIcon;                                                 // 0x06E8 (size: 0x8)
    class UHorizontalBox* resolutionscale_hb;                                         // 0x06F0 (size: 0x8)
    class USlider* sc_postpro;                                                        // 0x06F8 (size: 0x8)
    class USlider* sc_postpro_1;                                                      // 0x0700 (size: 0x8)
    class USlider* sc_postpro_3;                                                      // 0x0708 (size: 0x8)
    class USlider* sc_postpro_5;                                                      // 0x0710 (size: 0x8)
    class USlider* sc_shadows;                                                        // 0x0718 (size: 0x8)
    class USlider* sc_shadows_1;                                                      // 0x0720 (size: 0x8)
    class USlider* sc_shadows_2;                                                      // 0x0728 (size: 0x8)
    class USlider* sc_viewDistance;                                                   // 0x0730 (size: 0x8)
    class UComboBoxString* screenResolution_CB;                                       // 0x0738 (size: 0x8)
    class UButton* screenshot;                                                        // 0x0740 (size: 0x8)
    class UScrollBox* scrollbox_main;                                                 // 0x0748 (size: 0x8)
    class UVerticalBox* SECRET_VB;                                                    // 0x0750 (size: 0x8)
    class UHorizontalBox* setting_specular_hb;                                        // 0x0758 (size: 0x8)
    class UVerticalBox* settings_audio;                                               // 0x0760 (size: 0x8)
    class UVerticalBox* settings_camera;                                              // 0x0768 (size: 0x8)
    class UVerticalBox* settings_controls;                                            // 0x0770 (size: 0x8)
    class UVerticalBox* settings_gameplay;                                            // 0x0778 (size: 0x8)
    class UVerticalBox* settings_graphics;                                            // 0x0780 (size: 0x8)
    class UVerticalBox* settings_language_accessibility;                              // 0x0788 (size: 0x8)
    class UMLDefaultSlider_C* slider_CameraMoveSpeed;                                 // 0x0790 (size: 0x8)
    class UMLDefaultSlider_C* slider_CameraRotateSpeed;                               // 0x0798 (size: 0x8)
    class UMLDefaultSlider_C* slider_CameraSmoothness;                                // 0x07A0 (size: 0x8)
    class UMLDefaultSlider_C* slider_CameraZoomSpeed;                                 // 0x07A8 (size: 0x8)
    class UMLDefaultSlider_C* slider_CameraZoomToMouse;                               // 0x07B0 (size: 0x8)
    class UMLDefaultSlider_C* Slider_UiScale;                                         // 0x07B8 (size: 0x8)
    class UMLDefaultSlider_C* slider_volume_ambience;                                 // 0x07C0 (size: 0x8)
    class UMLDefaultSlider_C* slider_volume_barks;                                    // 0x07C8 (size: 0x8)
    class UMLDefaultSlider_C* slider_volume_master;                                   // 0x07D0 (size: 0x8)
    class UMLDefaultSlider_C* slider_volume_music;                                    // 0x07D8 (size: 0x8)
    class UMLDefaultSlider_C* slider_volume_notifs;                                   // 0x07E0 (size: 0x8)
    class UMLDefaultSlider_C* slider_volume_sfx;                                      // 0x07E8 (size: 0x8)
    class UMLDefaultSlider_C* slider_volume_ui;                                       // 0x07F0 (size: 0x8)
    class UMLDefaultSlider_C* slider_volume_voice;                                    // 0x07F8 (size: 0x8)
    class UImage* spacer_wide;                                                        // 0x0800 (size: 0x8)
    class UHorizontalBox* TAA_Sharpness_HB;                                           // 0x0808 (size: 0x8)
    class UTextBlock* TextBlock_15;                                                   // 0x0810 (size: 0x8)
    class UTextBlock* TextBlock_16;                                                   // 0x0818 (size: 0x8)
    class UTextBlock* TextBlock_23;                                                   // 0x0820 (size: 0x8)
    class UTextBlock* TextBlock_37;                                                   // 0x0828 (size: 0x8)
    class UTextBlock* TextBlock_38;                                                   // 0x0830 (size: 0x8)
    class UTextBlock* TextBlock_41;                                                   // 0x0838 (size: 0x8)
    class UTextBlock* TextBlock_75;                                                   // 0x0840 (size: 0x8)
    class UTextBlock* TextBlock_76;                                                   // 0x0848 (size: 0x8)
    class UTextBlock* TextBlock_79;                                                   // 0x0850 (size: 0x8)
    class UTextBlock* TextBlock_83;                                                   // 0x0858 (size: 0x8)
    class UTextBlock* TextBlock_84;                                                   // 0x0860 (size: 0x8)
    class UTextBlock* TextBlock_87;                                                   // 0x0868 (size: 0x8)
    class UTextBlock* TextBlock_88;                                                   // 0x0870 (size: 0x8)
    class UTextBlock* TextBlock_89;                                                   // 0x0878 (size: 0x8)
    class UCheckBox* vsync_chmb_1;                                                    // 0x0880 (size: 0x8)
    class UButton* walkaround_mode_button;                                            // 0x0888 (size: 0x8)
    class UHorizontalBox* xess_framegen_hb;                                           // 0x0890 (size: 0x8)
    class UHorizontalBox* xess_quality_hb;                                            // 0x0898 (size: 0x8)
    class UVerticalBox* XeSS_VB;                                                      // 0x08A0 (size: 0x8)
    class UHorizontalBox* zoomToMouse_hb;                                             // 0x08A8 (size: 0x8)
    class UMLGameInstance* MLGameInstance;                                            // 0x08B0 (size: 0x8)
    int32 currentCategory;                                                            // 0x08B8 (size: 0x4)
    double prevFPS;                                                                   // 0x08C0 (size: 0x8)
    bool isMainMenu;                                                                  // 0x08C8 (size: 0x1)
    bool hideBorders;                                                                 // 0x08C9 (size: 0x1)
    bool scrollUpCauseDropboxResolution;                                              // 0x08CA (size: 0x1)
    double resolutionLockedScrollAt;                                                  // 0x08D0 (size: 0x8)
    int32 tempResolutionSelectedIndex;                                                // 0x08D8 (size: 0x4)
    FString lastWorkingResolution;                                                    // 0x08E0 (size: 0x10)
    class UresolutionConfirmation_C* resolutionConfirmationWidget;                    // 0x08F0 (size: 0x8)

    void SetLanguageAndAccessibilityTabText(bool isInGame);
    void FindQualityRadioByBackendId(EPixelFedBackendId InputPin, class UDefaultRadioSelectSetting_C*& Radio_DLSS_Framegen);
    void FindFramegenRadioByBackendId(EPixelFedBackendId InputPin, class UDefaultRadioSelectSetting_C*& Radio_DLSS_Framegen);
    void RebuildGenericRadioChoices(class UDefaultRadioSelectSetting_C* TargetRadio, TArray<FName>& choices);
    void RebuildAaChoices();
    void setPresetValue(class UMLGameInstance* Game Instance, class UHorizontalRadioSelect_C* Radio Select);
    void ApplyPlatformLimits();
    bool HandleTabShift(int32 tabDelta);
    void ScrollWidgetIntoViewUponFocusChange(bool HasFocus);
    void HookOnFocusChangeForScrolling();
    void DetermineDefaultScreenPercentage(FString& OutputPin);
    FNaviSubGridLayout ComputeSubGridLayout();
    void Adjust Upscale Options For Platform();
    void updateMPCViewportResolutionScale();
    void filterAADetailedSettingsBasedOnMainAAMode(FString currentAASetting);
    class UWidget* OnGenerateWidget_0(FString Item);
    void filterSettingVisiblityBasedOnOtherSettings();
    void highlightChildrenWidgetsIfHovered(class UPanelWidget* self2, double Alpha);
    void setTestPercentageValueFromSliderValue(class USlider* Slider, class UTextBlock* Text);
    void adjustForMainMenu();
    void checkBoxIfNotCheckedProperly(class UCheckBox* CheckBox, bool ShouldBeChecked);
    void setCursors();
    void refresh_fps();
    void saveAndApply();
    void SaveSettings();
    void updateTranslationMainUI();
    void ApplySettings();
    void setCategoryVisibility(int32 categoryID, class UWidget* VerticalBox);
    void changeCategory(int32 Category);
    void Open();
    void PreConstruct(bool IsDesignTime);
    void Construct();
    void Tick(FGeometry MyGeometry, float InDeltaTime);
    void BndEvt__ComboBoxString_54_K2Node_ComponentBoundEvent_0_OnSelectionChangedEvent__DelegateSignature(FString SelectedItem, TEnumAsByte<ESelectInfo::Type> SelectionType);
    void BndEvt__AA_TAA_1_K2Node_ComponentBoundEvent_23_OnButtonReleasedEvent__DelegateSignature();
    void BndEvt__colorcoding_off_K2Node_ComponentBoundEvent_24_OnButtonReleasedEvent__DelegateSignature();
    void BndEvt__colorcoding_off_2_K2Node_ComponentBoundEvent_31_OnButtonReleasedEvent__DelegateSignature();
    void BndEvt__colorcoding_off_3_K2Node_ComponentBoundEvent_32_OnButtonReleasedEvent__DelegateSignature();
    void BndEvt__screenResolution_CB_K2Node_ComponentBoundEvent_36_OnSelectionChangedEvent__DelegateSignature(FString SelectedItem, TEnumAsByte<ESelectInfo::Type> SelectionType);
    void BndEvt__colorcoding_off_4_K2Node_ComponentBoundEvent_43_OnButtonReleasedEvent__DelegateSignature();
    void BndEvt__debug_chkb_K2Node_ComponentBoundEvent_44_OnCheckBoxComponentStateChanged__DelegateSignature(bool bIsChecked);
    void BndEvt__sc_shadows_K2Node_ComponentBoundEvent_45_OnMouseCaptureEndEvent__DelegateSignature();
    void BndEvt__sc_shadows_K2Node_ComponentBoundEvent_46_OnFloatValueChangedEvent__DelegateSignature(float Value);
    void BndEvt__sc_shadows_1_K2Node_ComponentBoundEvent_47_OnMouseCaptureEndEvent__DelegateSignature();
    void BndEvt__sc_shadows_1_K2Node_ComponentBoundEvent_48_OnFloatValueChangedEvent__DelegateSignature(float Value);
    void BndEvt__sc_viewDistance_K2Node_ComponentBoundEvent_53_OnMouseCaptureEndEvent__DelegateSignature();
    void BndEvt__default_viewDistMul_K2Node_ComponentBoundEvent_50_OnButtonReleasedEvent__DelegateSignature();
    void BndEvt__quickSettings_screenshot_K2Node_ComponentBoundEvent_64_OnButtonReleasedEvent__DelegateSignature();
    void BndEvt__quickSettings_boop_mode_K2Node_ComponentBoundEvent_74_OnButtonReleasedEvent__DelegateSignature();
    void BndEvt__quickSettings_debug_chkb_1_K2Node_ComponentBoundEvent_76_OnCheckBoxComponentStateChanged__DelegateSignature(bool bIsChecked);
    void BndEvt__quickSettings_debug_chkb_2_K2Node_ComponentBoundEvent_77_OnCheckBoxComponentStateChanged__DelegateSignature(bool bIsChecked);
    void BndEvt__quickSettings_boop_mode_1_K2Node_ComponentBoundEvent_51_OnButtonReleasedEvent__DelegateSignature();
    void BndEvt__quickSettings_ML_DefaultComboBoxSetting_K2Node_ComponentBoundEvent_80_onOpen__DelegateSignature();
    void BndEvt__quickSettings_scrollbox_main_K2Node_ComponentBoundEvent_81_OnUserScrolledEvent__DelegateSignature(float CurrentOffset);
    void BndEvt__quickSettings_ML_DefaultComboBoxSetting_K2Node_ComponentBoundEvent_1_onSelectionChanged__DelegateSignature(FString Item, TEnumAsByte<ESelectInfo::Type> Type);
    void abortResolutionChange();
    void BndEvt__quickSettings_HorizontalRadioSelect_K2Node_ComponentBoundEvent_8_RadioSelectedSignature__DelegateSignature(FString Value);
    void BndEvt__quickSettings_HorizontalRadioSelect_1_K2Node_ComponentBoundEvent_10_RadioSelectedSignature__DelegateSignature(FString Value);
    void BndEvt__quickSettings_ML_DefaultRadioSelectSetting_windowmode_K2Node_ComponentBoundEvent_21_OnSelectionChangedML__DelegateSignature(FString NextValue);
    void BndEvt__quickSettings_ML_DefaultRadioSelectSetting_aaAlgo_K2Node_ComponentBoundEvent_34_OnSelectionChangedML__DelegateSignature(FString NextValue);
    void BndEvt__quickSettings_MLDefaultSlider_K2Node_ComponentBoundEvent_6_OnValueCommited__DelegateSignature(double CommitedValue);
    void BndEvt__quickSettings_slider_volume_master_K2Node_ComponentBoundEvent_5_OnValueChange__DelegateSignature(double Value);
    void BndEvt__quickSettings_slider_volume_master_K2Node_ComponentBoundEvent_20_OnValueCommited__DelegateSignature(double CommitedValue);
    void BndEvt__quickSettings_slider_volume_music_K2Node_ComponentBoundEvent_37_OnValueChange__DelegateSignature(double Value);
    void BndEvt__quickSettings_slider_volume_music_K2Node_ComponentBoundEvent_57_OnValueCommited__DelegateSignature(double CommitedValue);
    void BndEvt__quickSettings_slider_volume_sfx_K2Node_ComponentBoundEvent_66_OnValueChange__DelegateSignature(double Value);
    void BndEvt__quickSettings_slider_volume_sfx_K2Node_ComponentBoundEvent_71_OnValueCommited__DelegateSignature(double CommitedValue);
    void BndEvt__quickSettings_slider_volume_barks_K2Node_ComponentBoundEvent_79_OnValueChange__DelegateSignature(double Value);
    void BndEvt__quickSettings_slider_volume_barks_K2Node_ComponentBoundEvent_82_OnValueCommited__DelegateSignature(double CommitedValue);
    void BndEvt__quickSettings_slider_volume_ambience_K2Node_ComponentBoundEvent_83_OnValueChange__DelegateSignature(double Value);
    void BndEvt__quickSettings_slider_volume_ambience_K2Node_ComponentBoundEvent_84_OnValueCommited__DelegateSignature(double CommitedValue);
    void BndEvt__quickSettings_slider_volume_notifs_K2Node_ComponentBoundEvent_85_OnValueChange__DelegateSignature(double Value);
    void BndEvt__quickSettings_slider_volume_notifs_K2Node_ComponentBoundEvent_86_OnValueCommited__DelegateSignature(double CommitedValue);
    void BndEvt__quickSettings_slider_volume_ui_K2Node_ComponentBoundEvent_87_OnValueChange__DelegateSignature(double Value);
    void BndEvt__quickSettings_slider_volume_ui_K2Node_ComponentBoundEvent_88_OnValueCommited__DelegateSignature(double CommitedValue);
    void BndEvt__quickSettings_slider_volume_voice_K2Node_ComponentBoundEvent_89_OnValueChange__DelegateSignature(double Value);
    void BndEvt__quickSettings_slider_volume_voice_K2Node_ComponentBoundEvent_90_OnValueCommited__DelegateSignature(double CommitedValue);
    void BndEvt__quickSettings_slider_CameraMoveSpeed_K2Node_ComponentBoundEvent_7_OnValueCommited__DelegateSignature(double CommitedValue);
    void BndEvt__quickSettings_slider_CameraRotateSpeed_K2Node_ComponentBoundEvent_28_OnValueCommited__DelegateSignature(double CommitedValue);
    void BndEvt__quickSettings_slider_CameraZoomSpeed_K2Node_ComponentBoundEvent_33_OnValueCommited__DelegateSignature(double CommitedValue);
    void BndEvt__quickSettings_slider_CameraZoomToMouse_K2Node_ComponentBoundEvent_52_OnValueCommited__DelegateSignature(double CommitedValue);
    void BndEvt__quickSettings_slider_CameraSmoothness_K2Node_ComponentBoundEvent_58_OnValueCommited__DelegateSignature(double CommitedValue);
    void BndEvt__quickSettings_checkbox_CameraShake_K2Node_ComponentBoundEvent_2_OnValueChange__DelegateSignature(bool IsChecked);
    void BndEvt__quickSettings_checkbox_MultipleCtrlGroups_K2Node_ComponentBoundEvent_3_OnValueChange__DelegateSignature(bool IsChecked);
    void BndEvt__quickSettings_PresetSelect_K2Node_ComponentBoundEvent_4_RadioSelectedSignature__DelegateSignature(FString Value);
    void CustomEvent(FAutoSettingData SettingData);
    void ExecuteUbergraph_quickSettings(int32 EntryPoint);
}; // Size: 0x8F8

#endif
