#ifndef UE4SS_SDK_RetinueSet_HPP
#define UE4SS_SDK_RetinueSet_HPP

struct FRetinueSet
{
    FString name_15_072528D14BEEC84C0330FB9B946C2E59;                                 // 0x0000 (size: 0x10)
    int32 slot_2_629BF78F472E81759551E8BEF888E7D7;                                    // 0x0010 (size: 0x4)
    class USkeletalMesh* skeletalMesh_5_C7FAEF814F4B582E8689F0A3F9137D1B;             // 0x0018 (size: 0x8)
    FUnitTemplate equipment_9_49F059494AD5678A9BE6E1BC09357F2C;                       // 0x0020 (size: 0x118)
    int32 price_12_A77B497A4AA24D2AB0C4A09DD580498B;                                  // 0x0138 (size: 0x4)
    TArray<int32> variations_19_AEE86B7D4055C02AD0FA3A8DBE7B24F0;                     // 0x0140 (size: 0x10)
    bool twoHanded_21_E113B7FB4A7726F1CB796E93D0D90788;                               // 0x0150 (size: 0x1)
    bool spearIdle_23_F2A064854FDB137382BF07AC4850E5DB;                               // 0x0151 (size: 0x1)
    TArray<FGood> requiredEquipment_29_CF6CDE34472B174430DDA2A5B3827C6F;              // 0x0158 (size: 0x10)
    int32 tier_32_457B62C94AC25E4ACE232695997A02C4;                                   // 0x0168 (size: 0x4)
    TArray<FName> tags_36_9955ABE547C8DC0EC0CD7387A100485A;                           // 0x0170 (size: 0x10)

}; // Size: 0x180

#endif
