#ifndef UE4SS_SDK_retinueEditor_HPP
#define UE4SS_SDK_retinueEditor_HPP

class UretinueEditor_C : public UNaviSubGrid
{
    FPointerToUberGraphFrame UberGraphFrame;                                          // 0x0348 (size: 0x8)
    class UWidgetAnimation* OpeningAnimation;                                         // 0x0350 (size: 0x8)
    class UOverlay* armorUpgrade_overlay;                                             // 0x0358 (size: 0x8)
    class UOverlay* armours_t1;                                                       // 0x0360 (size: 0x8)
    class UOverlay* armours_t1_1;                                                     // 0x0368 (size: 0x8)
    class UOverlay* armours_t1_2;                                                     // 0x0370 (size: 0x8)
    class UOverlay* armours_t1_3;                                                     // 0x0378 (size: 0x8)
    class UOverlay* armours_t1_4;                                                     // 0x0380 (size: 0x8)
    class UOverlay* armours_t1_5;                                                     // 0x0388 (size: 0x8)
    class UVerticalBox* armoury_vb;                                                   // 0x0390 (size: 0x8)
    class UBorder* blackbg;                                                           // 0x0398 (size: 0x8)
    class UHorizontalBox* bodyPattern_HB;                                             // 0x03A0 (size: 0x8)
    class UButton* Button_1;                                                          // 0x03A8 (size: 0x8)
    class UButton* cat_next_1;                                                        // 0x03B0 (size: 0x8)
    class UButton* cat_next_6;                                                        // 0x03B8 (size: 0x8)
    class UImage* circl_2;                                                            // 0x03C0 (size: 0x8)
    class UImage* circl_3;                                                            // 0x03C8 (size: 0x8)
    class UHorizontalBox* close_HB;                                                   // 0x03D0 (size: 0x8)
    class UmenuButton_C* closeButton;                                                 // 0x03D8 (size: 0x8)
    class UComboBoxString* ColorA_CB;                                                 // 0x03E0 (size: 0x8)
    class UComboBoxString* colorB_CB;                                                 // 0x03E8 (size: 0x8)
    class UComboBoxString* colorC_CB_1;                                               // 0x03F0 (size: 0x8)
    class UComboBoxString* ComboBoxString_128;                                        // 0x03F8 (size: 0x8)
    class UComboBoxString* ComboBoxString_297;                                        // 0x0400 (size: 0x8)
    class UComboBoxString* ComboBoxString_298;                                        // 0x0408 (size: 0x8)
    class UImage* crestBGOverlay;                                                     // 0x0410 (size: 0x8)
    class UequipmentVariationCustomizationWidget_C* equipmentVariationCustomizationWidget; // 0x0418 (size: 0x8)
    class UequipmentVariationCustomizationWidget_C* equipmentVariationCustomizationWidget_1; // 0x0420 (size: 0x8)
    class UequipmentVariationCustomizationWidget_C* equipmentVariationCustomizationWidget_2; // 0x0428 (size: 0x8)
    class UequipmentVariationCustomizationWidget_C* equipmentVariationCustomizationWidget_3; // 0x0430 (size: 0x8)
    class UequipmentVariationCustomizationWidget_C* equipmentVariationCustomizationWidget_4; // 0x0438 (size: 0x8)
    class UButton* exit_button1;                                                      // 0x0440 (size: 0x8)
    class UImage* exit_img;                                                           // 0x0448 (size: 0x8)
    class UBorder* Grunge;                                                            // 0x0450 (size: 0x8)
    class UImage* icon_img;                                                           // 0x0458 (size: 0x8)
    class UImage* icon_img_1;                                                         // 0x0460 (size: 0x8)
    class UImage* icon_img_2;                                                         // 0x0468 (size: 0x8)
    class UImage* icon_img_3;                                                         // 0x0470 (size: 0x8)
    class UImage* icon_img_4;                                                         // 0x0478 (size: 0x8)
    class UImage* icon_img_5;                                                         // 0x0480 (size: 0x8)
    class UImage* icon_img_6;                                                         // 0x0488 (size: 0x8)
    class UImage* icon_img_7;                                                         // 0x0490 (size: 0x8)
    class UImage* icon_img_8;                                                         // 0x0498 (size: 0x8)
    class UImage* icon_img_9;                                                         // 0x04A0 (size: 0x8)
    class UImage* Image;                                                              // 0x04A8 (size: 0x8)
    class UImage* Image_1;                                                            // 0x04B0 (size: 0x8)
    class UImage* Image_12;                                                           // 0x04B8 (size: 0x8)
    class UImage* Image_13;                                                           // 0x04C0 (size: 0x8)
    class UImage* Image_14;                                                           // 0x04C8 (size: 0x8)
    class UImage* Image_18;                                                           // 0x04D0 (size: 0x8)
    class UImage* Image_28;                                                           // 0x04D8 (size: 0x8)
    class UImage* Image_29;                                                           // 0x04E0 (size: 0x8)
    class UImage* Image_30;                                                           // 0x04E8 (size: 0x8)
    class UImage* Image_31;                                                           // 0x04F0 (size: 0x8)
    class UImage* Image_84;                                                           // 0x04F8 (size: 0x8)
    class UImage* Image_89;                                                           // 0x0500 (size: 0x8)
    class UImage* Image_90;                                                           // 0x0508 (size: 0x8)
    class UImage* Image_104;                                                          // 0x0510 (size: 0x8)
    class UImage* Image_118;                                                          // 0x0518 (size: 0x8)
    class UImage* Image_134;                                                          // 0x0520 (size: 0x8)
    class UImage* Image_185;                                                          // 0x0528 (size: 0x8)
    class UImage* Image_278;                                                          // 0x0530 (size: 0x8)
    class UImage* Image_326;                                                          // 0x0538 (size: 0x8)
    class UImage* Image_384;                                                          // 0x0540 (size: 0x8)
    class UImage* Image_506;                                                          // 0x0548 (size: 0x8)
    class UImage* Image_507;                                                          // 0x0550 (size: 0x8)
    class UVerticalBox* left_side_VB;                                                 // 0x0558 (size: 0x8)
    class UTextBlock* mail_amt_txt;                                                   // 0x0560 (size: 0x8)
    class UTextBlock* maxSize_txt;                                                    // 0x0568 (size: 0x8)
    class UVerticalBox* midSide_VB;                                                   // 0x0570 (size: 0x8)
    class UVerticalBox* names_vb;                                                     // 0x0578 (size: 0x8)
    class UMD_NaviAutoButton_C* navi_RecruitMinisterialis;                            // 0x0580 (size: 0x8)
    class UMD_NaviAutoButton_C* navi_RecruitNobles;                                   // 0x0588 (size: 0x8)
    class UMD_NaviHijackProxy_C* navi_retainerName;                                   // 0x0590 (size: 0x8)
    class UMD_NaviHijackProxy_C* navi_squadRename;                                    // 0x0598 (size: 0x8)
    class UMD_NaviAutoButton_C* naviBtn_funds;                                        // 0x05A0 (size: 0x8)
    class UMD_NaviAutoButton_C* naviBtn_local;                                        // 0x05A8 (size: 0x8)
    class UVerticalBox* old_color_cosmetics;                                          // 0x05B0 (size: 0x8)
    class UImage* paper;                                                              // 0x05B8 (size: 0x8)
    class UVerticalBox* personalizationItems_VB;                                      // 0x05C0 (size: 0x8)
    class UTextBlock* plate_amt_txt;                                                  // 0x05C8 (size: 0x8)
    class UTextBlock* polearms_amt_txt;                                               // 0x05D0 (size: 0x8)
    class UButton* prev_pattern_body;                                                 // 0x05D8 (size: 0x8)
    class UButton* prev_pattern_shield;                                               // 0x05E0 (size: 0x8)
    class UProgressBar* ProgressBar_73;                                               // 0x05E8 (size: 0x8)
    class UTextBlock* quirks_text;                                                    // 0x05F0 (size: 0x8)
    class UButton* recruit_ministerialis;                                             // 0x05F8 (size: 0x8)
    class UButton* recruit_nobles;                                                    // 0x0600 (size: 0x8)
    class UTextBlock* regionName-txt;                                                 // 0x0608 (size: 0x8)
    class UTextBlock* retainerName_txt;                                               // 0x0610 (size: 0x8)
    class UEditableText* retainerNameEditable;                                        // 0x0618 (size: 0x8)
    class UUniformGridPanel* retinueHeadsParent;                                      // 0x0620 (size: 0x8)
    class UHorizontalBox* retinueRecrutiment_HB;                                      // 0x0628 (size: 0x8)
    class UretinueSkill_C* retinueSkill;                                              // 0x0630 (size: 0x8)
    class UretinueSkill_C* retinueSkill_1;                                            // 0x0638 (size: 0x8)
    class UretinueSkill_C* retinueSkill_2;                                            // 0x0640 (size: 0x8)
    class UretinueSkill_C* retinueSkill_3;                                            // 0x0648 (size: 0x8)
    class UretinueSkill_C* retinueSkill_4;                                            // 0x0650 (size: 0x8)
    class UretinueSkill_C* retinueSkill_5;                                            // 0x0658 (size: 0x8)
    class UretinueSkill_C* retinueSkill_6;                                            // 0x0660 (size: 0x8)
    class UretinueSkill_C* retinueSkill_7;                                            // 0x0668 (size: 0x8)
    class UretinueSkill_C* retinueSkill_8;                                            // 0x0670 (size: 0x8)
    class UretinueSkill_C* retinueSkill_9;                                            // 0x0678 (size: 0x8)
    class UretinueSkill_C* retinueSkill_10;                                           // 0x0680 (size: 0x8)
    class UretinueSkill_C* retinueSkill_11;                                           // 0x0688 (size: 0x8)
    class UretinueSkill_C* retinueSkill_12;                                           // 0x0690 (size: 0x8)
    class UretinueSkill_C* retinueSkill_13;                                           // 0x0698 (size: 0x8)
    class UretinueSkill_C* retinueSkill_14;                                           // 0x06A0 (size: 0x8)
    class UretinueSkill_C* retinueSkill_15;                                           // 0x06A8 (size: 0x8)
    class UretinueHead_C* retiunueHead;                                               // 0x06B0 (size: 0x8)
    class UretinueHead_C* retiunueHead_1;                                             // 0x06B8 (size: 0x8)
    class UretinueHead_C* retiunueHead_2;                                             // 0x06C0 (size: 0x8)
    class UretinueHead_C* retiunueHead_3;                                             // 0x06C8 (size: 0x8)
    class UretinueHead_C* retiunueHead_4;                                             // 0x06D0 (size: 0x8)
    class UretinueHead_C* retiunueHead_5;                                             // 0x06D8 (size: 0x8)
    class UretinueHead_C* retiunueHead_6;                                             // 0x06E0 (size: 0x8)
    class UretinueHead_C* retiunueHead_7;                                             // 0x06E8 (size: 0x8)
    class UretinueHead_C* retiunueHead_8;                                             // 0x06F0 (size: 0x8)
    class UretinueHead_C* retiunueHead_9;                                             // 0x06F8 (size: 0x8)
    class UretinueHead_C* retiunueHead_10;                                            // 0x0700 (size: 0x8)
    class UretinueHead_C* retiunueHead_11;                                            // 0x0708 (size: 0x8)
    class UretinueHead_C* retiunueHead_12;                                            // 0x0710 (size: 0x8)
    class UretinueHead_C* retiunueHead_13;                                            // 0x0718 (size: 0x8)
    class UretinueHead_C* retiunueHead_14;                                            // 0x0720 (size: 0x8)
    class UretinueHead_C* retiunueHead_15;                                            // 0x0728 (size: 0x8)
    class UretinueHead_C* retiunueHead_16;                                            // 0x0730 (size: 0x8)
    class UretinueHead_C* retiunueHead_17;                                            // 0x0738 (size: 0x8)
    class UretinueHead_C* retiunueHead_18;                                            // 0x0740 (size: 0x8)
    class UretinueHead_C* retiunueHead_19;                                            // 0x0748 (size: 0x8)
    class UretinueHead_C* retiunueHead_20;                                            // 0x0750 (size: 0x8)
    class UretinueHead_C* retiunueHead_21;                                            // 0x0758 (size: 0x8)
    class UretinueHead_C* retiunueHead_22;                                            // 0x0760 (size: 0x8)
    class UretinueHead_C* retiunueHead_23;                                            // 0x0768 (size: 0x8)
    class UretinueHead_C* retiunueHead_24;                                            // 0x0770 (size: 0x8)
    class UretinueHead_C* retiunueHead_25;                                            // 0x0778 (size: 0x8)
    class UretinueHead_C* retiunueHead_26;                                            // 0x0780 (size: 0x8)
    class UretinueHead_C* retiunueHead_27;                                            // 0x0788 (size: 0x8)
    class UretinueHead_C* retiunueHead_28;                                            // 0x0790 (size: 0x8)
    class UretinueHead_C* retiunueHead_29;                                            // 0x0798 (size: 0x8)
    class UretinueHead_C* retiunueHead_30;                                            // 0x07A0 (size: 0x8)
    class UretinueHead_C* retiunueHead_31;                                            // 0x07A8 (size: 0x8)
    class UretinueHead_C* retiunueHead_32;                                            // 0x07B0 (size: 0x8)
    class UretinueHead_C* retiunueHead_33;                                            // 0x07B8 (size: 0x8)
    class UretinueHead_C* retiunueHead_34;                                            // 0x07C0 (size: 0x8)
    class UretinueHead_C* retiunueHead_35;                                            // 0x07C8 (size: 0x8)
    class UretinueHead_C* retiunueHead_36;                                            // 0x07D0 (size: 0x8)
    class UretinueHead_C* retiunueHead_37;                                            // 0x07D8 (size: 0x8)
    class UretinueHead_C* retiunueHead_38;                                            // 0x07E0 (size: 0x8)
    class UretinueHead_C* retiunueHead_39;                                            // 0x07E8 (size: 0x8)
    class UretinueHead_C* retiunueHead_40;                                            // 0x07F0 (size: 0x8)
    class UretinueHead_C* retiunueHead_41;                                            // 0x07F8 (size: 0x8)
    class UretinueHead_C* retiunueHead_42;                                            // 0x0800 (size: 0x8)
    class UretinueHead_C* retiunueHead_43;                                            // 0x0808 (size: 0x8)
    class UretinueHead_C* retiunueHead_44;                                            // 0x0810 (size: 0x8)
    class UretinueHead_C* retiunueHead_45;                                            // 0x0818 (size: 0x8)
    class UretinueHead_C* retiunueHead_46;                                            // 0x0820 (size: 0x8)
    class UretinueHead_C* retiunueHead_47;                                            // 0x0828 (size: 0x8)
    class UVerticalBox* right_side_VB;                                                // 0x0830 (size: 0x8)
    class UHorizontalBox* shieldPattern_HB;                                           // 0x0838 (size: 0x8)
    class UTextBlock* sidearms_amt_txt;                                               // 0x0840 (size: 0x8)
    class USlider* size_slider;                                                       // 0x0848 (size: 0x8)
    class UTextBlock* size_txt;                                                       // 0x0850 (size: 0x8)
    class UVerticalBox* skill_vb;                                                     // 0x0858 (size: 0x8)
    class UHorizontalBox* skills_hb_tier1;                                            // 0x0860 (size: 0x8)
    class UHorizontalBox* skills_hb_tier1_1;                                          // 0x0868 (size: 0x8)
    class UHorizontalBox* skills_hb_tier1_2;                                          // 0x0870 (size: 0x8)
    class UHorizontalBox* skills_hb_tier1_3;                                          // 0x0878 (size: 0x8)
    class UskillTier_C* skillTier;                                                    // 0x0880 (size: 0x8)
    class UskillTier_C* skillTier_1;                                                  // 0x0888 (size: 0x8)
    class UskillTier_C* skillTier_2;                                                  // 0x0890 (size: 0x8)
    class UskillTier_C* skillTier_3;                                                  // 0x0898 (size: 0x8)
    class UImage* spacer_eq;                                                          // 0x08A0 (size: 0x8)
    class UImage* spacer_eq_2;                                                        // 0x08A8 (size: 0x8)
    class UImage* spacer_eq_4;                                                        // 0x08B0 (size: 0x8)
    class UImage* spacer_eq_5;                                                        // 0x08B8 (size: 0x8)
    class UImage* spacer_eq_6;                                                        // 0x08C0 (size: 0x8)
    class UEditableText* squadName_Editable;                                          // 0x08C8 (size: 0x8)
    class UTextBlock* TextBlock_13;                                                   // 0x08D0 (size: 0x8)
    class UTextBlock* TextBlock_112;                                                  // 0x08D8 (size: 0x8)
    class UTextBlock* TextBlock_596;                                                  // 0x08E0 (size: 0x8)
    class UTextBlock* txt_expertise;                                                  // 0x08E8 (size: 0x8)
    class UTextBlock* txt_expertise_1;                                                // 0x08F0 (size: 0x8)
    class UTextBlock* txt_foesDefeated;                                               // 0x08F8 (size: 0x8)
    class UTextBlock* txt_retainerNumber;                                             // 0x0900 (size: 0x8)
    class UImage* unitView;                                                           // 0x0908 (size: 0x8)
    class UButton* upgrade_armor_funds;                                               // 0x0910 (size: 0x8)
    class UButton* upgrade_armor_local;                                               // 0x0918 (size: 0x8)
    class UButton* upgrade_armour_button;                                             // 0x0920 (size: 0x8)
    int32 Size;                                                                       // 0x0928 (size: 0x4)
    int32 MaxSize;                                                                    // 0x092C (size: 0x4)
    class UMainUICPP_C* mainUIref;                                                    // 0x0930 (size: 0x8)
    int32 squadID;                                                                    // 0x0938 (size: 0x4)
    class ARegion* selectedRegion;                                                    // 0x0940 (size: 0x8)
    FEquipment equippedOld;                                                           // 0x0948 (size: 0x1C)
    TArray<class UArmoryItem_C*> armoryWidgets;                                       // 0x0968 (size: 0x10)
    int32 maxColumns;                                                                 // 0x0978 (size: 0x4)
    FSquadEquipment Equipment;                                                        // 0x0980 (size: 0x90)
    int32 ID_Body;                                                                    // 0x0A10 (size: 0x4)
    TArray<FRetinueSet> RS_Body;                                                      // 0x0A18 (size: 0x10)
    TArray<class UMaterialInstanceDynamic*> dynamicMaterials;                         // 0x0A28 (size: 0x10)
    int32 ID_Helmet;                                                                  // 0x0A38 (size: 0x4)
    TArray<FRetinueSet> RS_Helmet;                                                    // 0x0A40 (size: 0x10)
    FVector2D mousePressed2d;                                                         // 0x0A50 (size: 0x10)
    bool LMBPressed;                                                                  // 0x0A60 (size: 0x1)
    double retinue_previousRotation;                                                  // 0x0A68 (size: 0x8)
    double RotationSpeed;                                                             // 0x0A70 (size: 0x8)
    TArray<FRetinueSet> RS_Weapons;                                                   // 0x0A78 (size: 0x10)
    int32 ID_Weapon;                                                                  // 0x0A88 (size: 0x4)
    int32 ID_Shield;                                                                  // 0x0A8C (size: 0x4)
    TArray<FRetinueSet> RS_Shields;                                                   // 0x0A90 (size: 0x10)
    TArray<FRetinueSet> RS_Mounts;                                                    // 0x0AA0 (size: 0x10)
    int32 ID_Mount;                                                                   // 0x0AB0 (size: 0x4)
    bool isTwoHanded;                                                                 // 0x0AB4 (size: 0x1)
    double colorA_UV;                                                                 // 0x0AB8 (size: 0x8)
    double colorB_UV;                                                                 // 0x0AC0 (size: 0x8)
    double helardryA;                                                                 // 0x0AC8 (size: 0x8)
    double heraldryB;                                                                 // 0x0AD0 (size: 0x8)
    FSquad Squad;                                                                     // 0x0AD8 (size: 0x3C0)
    bool isSpear;                                                                     // 0x0E98 (size: 0x1)
    int32 dudeColumns;                                                                // 0x0E9C (size: 0x4)
    class ASMUnit* selectedRetainer;                                                  // 0x0EA0 (size: 0x8)
    FEquipment individualsEquipmentOnRally;                                           // 0x0EA8 (size: 0x1C)
    class ASMBuildingMaster* ManorRef;                                                // 0x0EC8 (size: 0x8)
    TArray<class ASMUnit*> retinue;                                                   // 0x0ED0 (size: 0x10)
    ELocomotionStance currentStance;                                                  // 0x0EE0 (size: 0x1)
    int32 retainerNameCharLimit;                                                      // 0x0EE4 (size: 0x4)
    int32 heavyArmorPriceFull;                                                        // 0x0EE8 (size: 0x4)
    double ControllerRotateSpeed;                                                     // 0x0EF0 (size: 0x8)
    float UnitRotationYaw;                                                            // 0x0EF8 (size: 0x4)
    int32 NameMaxLength;                                                              // 0x0EFC (size: 0x4)

    void RespawnOrUpdateRetinueHireTooltip();
    void ApplyPlatformLimits();
    void AddRotationToUnit(float DeltaRotation_Yaw);
    FNaviSubGridLayout ComputeSubGridLayout();
    void CleanupVirtualKeyboard();
    FText getRetinueDisplayName(class APawnCPP* pawnRef);
    void armorUpgradeTooltipAndPrices();
    bool isCurrentRetainerUpgraded();
    void upgradeCurrentRetainersArmor(bool buyLocally);
    void updateTreasury(class APawnCPP* playerRef);
    void updateExpertise();
    void dressVAMPVariation(EEquipmentSlot Slot, int32 ItemId, class UVAISMController* VAISM, ELocomotionStance& Stance);
    void getItemVariationName(uint8 variationIndex, int32 ItemId, FName& VariationName, ELocomotionStance& Stance);
    void redressPreviewGuyVAMP(bool bReinitPose);
    void setPreviewGuyHiddenInGame(bool NewHidden);
    void Update Hire Retinue and Upgrade Availability();
    void translateText();
    void setSelectedRetainer(class ASMUnit* newSelectedRetainer);
    void populateRetainerGrid();
    void resetSelectedRetainer(bool chooseLastOne);
    void Close();
    void setCaptureUnitPreview(bool shouldRenderPreviewUnit);
    void Set Squad to Squad ID();
    void rotateCharacter();
    void propagateColorChange();
    void addColorOptions();
    class UWidget* OnGenerateWidget_color(FString Item);
    FEventReply OnMouseButtonUp(FGeometry MyGeometry, const FPointerEvent& MouseEvent);
    FEventReply OnMouseButtonDown(FGeometry MyGeometry, const FPointerEvent& MouseEvent);
    void closeAndUpdateMainUIArmy();
    void Open(class ASMBuildingMaster* ManorRef);
    void Tick(FGeometry MyGeometry, float InDeltaTime);
    void Construct();
    void PreConstruct(bool IsDesignTime);
    void BndEvt__ColorA_CB_K2Node_ComponentBoundEvent_11_OnSelectionChangedEvent__DelegateSignature(FString SelectedItem, TEnumAsByte<ESelectInfo::Type> SelectionType);
    void BndEvt__colorB_CB_K2Node_ComponentBoundEvent_12_OnSelectionChangedEvent__DelegateSignature(FString SelectedItem, TEnumAsByte<ESelectInfo::Type> SelectionType);
    void BndEvt__cat_next_1_K2Node_ComponentBoundEvent_13_OnButtonReleasedEvent__DelegateSignature();
    void BndEvt__cat_next_6_K2Node_ComponentBoundEvent_14_OnButtonReleasedEvent__DelegateSignature();
    void BndEvt__prev_pattern_body_K2Node_ComponentBoundEvent_15_OnButtonReleasedEvent__DelegateSignature();
    void BndEvt__prev_pattern_shield_K2Node_ComponentBoundEvent_16_OnButtonReleasedEvent__DelegateSignature();
    void BndEvt__retinueEditor_exit_button1_K2Node_ComponentBoundEvent_18_OnButtonReleasedEvent__DelegateSignature();
    void BndEvt__retinueEditor_recruit_nobles_K2Node_ComponentBoundEvent_0_OnButtonReleasedEvent__DelegateSignature();
    void BndEvt__retinueEditor_closeButton_K2Node_ComponentBoundEvent_17_onReleased__DelegateSignature();
    void onAppearanceCustomizationChanged();
    void BndEvt__retinueEditor_retainerNameEditable_K2Node_ComponentBoundEvent_19_OnEditableTextCommittedEvent__DelegateSignature(const FText& Text, TEnumAsByte<ETextCommit::Type> CommitMethod);
    void BndEvt__retinueEditor_retainerNameEditable_K2Node_ComponentBoundEvent_20_OnEditableTextChangedEvent__DelegateSignature(const FText& Text);
    void BndEvt__retinueEditor_upgrade_armor_K2Node_ComponentBoundEvent_21_OnButtonReleasedEvent__DelegateSignature();
    void BndEvt__retinueEditor_upgrade_armor_funds_K2Node_ComponentBoundEvent_22_OnButtonReleasedEvent__DelegateSignature();
    void BndEvt__retinueEditor_squadName_Editable_K2Node_ComponentBoundEvent_1_OnEditableTextCommittedEvent__DelegateSignature(const FText& Text, TEnumAsByte<ETextCommit::Type> CommitMethod);
    void BndEvt__retinueEditor_navi_retainerName_K2Node_ComponentBoundEvent_2_HijackedHandleInput__DelegateSignature(ENaviUiIntent intent);
    void BndEvt__retinueEditor_navi_squadRename_K2Node_ComponentBoundEvent_4_HijackedHandleInput__DelegateSignature(ENaviUiIntent intent);
    void BndEvt__retinueEditor_squadName_Editable_K2Node_ComponentBoundEvent_6_OnEditableTextChangedEvent__DelegateSignature(const FText& Text);
    void InpAxisEvt_Controller_RightAnalog_Right_K2Node_InputAxisEvent_3(float AxisValue);
    void ExecuteUbergraph_retinueEditor(int32 EntryPoint);
}; // Size: 0xF00

#endif
