#ifndef UE4SS_SDK_BM_FoodStall_HPP
#define UE4SS_SDK_BM_FoodStall_HPP

class ABM_FoodStall_C : public AStaticMeshActor
{
    class UStaticMeshComponent* clutter_30;                                           // 0x02A0 (size: 0x8)
    class UStaticMeshComponent* clutter_29;                                           // 0x02A8 (size: 0x8)
    class UStaticMeshComponent* clutter_28;                                           // 0x02B0 (size: 0x8)
    class UStaticMeshComponent* clutter_27;                                           // 0x02B8 (size: 0x8)
    class UStaticMeshComponent* clutter_26;                                           // 0x02C0 (size: 0x8)
    class UStaticMeshComponent* clutter_25;                                           // 0x02C8 (size: 0x8)
    class UStaticMeshComponent* clutter_24;                                           // 0x02D0 (size: 0x8)
    class UStaticMeshComponent* res_171_6;                                            // 0x02D8 (size: 0x8)
    class UStaticMeshComponent* res_171_5;                                            // 0x02E0 (size: 0x8)
    class UStaticMeshComponent* res_147_4;                                            // 0x02E8 (size: 0x8)
    class UStaticMeshComponent* res_147_3;                                            // 0x02F0 (size: 0x8)
    class UStaticMeshComponent* clutter_23;                                           // 0x02F8 (size: 0x8)
    class UStaticMeshComponent* clutter_22;                                           // 0x0300 (size: 0x8)
    class UStaticMeshComponent* clutter_21;                                           // 0x0308 (size: 0x8)
    class UStaticMeshComponent* clutter_20;                                           // 0x0310 (size: 0x8)
    class UStaticMeshComponent* clutter_19;                                           // 0x0318 (size: 0x8)
    class UStaticMeshComponent* clutter_18;                                           // 0x0320 (size: 0x8)
    class UStaticMeshComponent* clutter_17;                                           // 0x0328 (size: 0x8)
    class UStaticMeshComponent* clutter_16;                                           // 0x0330 (size: 0x8)
    class UStaticMeshComponent* clutter_15;                                           // 0x0338 (size: 0x8)
    class UStaticMeshComponent* clutter_14;                                           // 0x0340 (size: 0x8)
    class UStaticMeshComponent* clutter_13;                                           // 0x0348 (size: 0x8)
    class UStaticMeshComponent* clutter_12;                                           // 0x0350 (size: 0x8)
    class UStaticMeshComponent* clutter_11;                                           // 0x0358 (size: 0x8)
    class UStaticMeshComponent* clutter_10;                                           // 0x0360 (size: 0x8)
    class UStaticMeshComponent* clutter_9;                                            // 0x0368 (size: 0x8)
    class UStaticMeshComponent* clutter_8;                                            // 0x0370 (size: 0x8)
    class UStaticMeshComponent* clutter_7;                                            // 0x0378 (size: 0x8)
    class UStaticMeshComponent* clutter_6;                                            // 0x0380 (size: 0x8)
    class UStaticMeshComponent* clutter_5;                                            // 0x0388 (size: 0x8)
    class UStaticMeshComponent* res_171_4;                                            // 0x0390 (size: 0x8)
    class UStaticMeshComponent* clutter_4;                                            // 0x0398 (size: 0x8)
    class UStaticMeshComponent* clutter_3;                                            // 0x03A0 (size: 0x8)
    class UStaticMeshComponent* clutter_2;                                            // 0x03A8 (size: 0x8)
    class UStaticMeshComponent* res_230_4;                                            // 0x03B0 (size: 0x8)
    class UStaticMeshComponent* res_230_3;                                            // 0x03B8 (size: 0x8)
    class UStaticMeshComponent* res_230_2;                                            // 0x03C0 (size: 0x8)
    class UStaticMeshComponent* res_230_1;                                            // 0x03C8 (size: 0x8)
    class UStaticMeshComponent* res_230_0;                                            // 0x03D0 (size: 0x8)
    class UStaticMeshComponent* clutter_1;                                            // 0x03D8 (size: 0x8)
    class UStaticMeshComponent* res_171_3;                                            // 0x03E0 (size: 0x8)
    class UStaticMeshComponent* res_171_2;                                            // 0x03E8 (size: 0x8)
    class UStaticMeshComponent* res_172_2;                                            // 0x03F0 (size: 0x8)
    class UStaticMeshComponent* res_172_1;                                            // 0x03F8 (size: 0x8)
    class UStaticMeshComponent* res_172_0;                                            // 0x0400 (size: 0x8)
    class UStaticMeshComponent* res_171_1;                                            // 0x0408 (size: 0x8)
    class UStaticMeshComponent* res_147_2;                                            // 0x0410 (size: 0x8)
    class UStaticMeshComponent* res_147_1;                                            // 0x0418 (size: 0x8)
    class UStaticMeshComponent* res_147;                                              // 0x0420 (size: 0x8)
    class USceneComponent* gathering;                                                 // 0x0428 (size: 0x8)
    class UStaticMeshComponent* Dirt_0_1;                                             // 0x0430 (size: 0x8)
    class UStaticMeshComponent* MainBld_33;                                           // 0x0438 (size: 0x8)

}; // Size: 0x440

#endif
