#ifndef UE4SS_SDK_BM_SG_Manor_Lv1_Tower__HPP
#define UE4SS_SDK_BM_SG_Manor_Lv1_Tower__HPP

class ABM_SG_Manor_Lv1_Tower__C : public AStaticMeshActor
{
    class UStaticMeshComponent* Dirt_3_1;                                             // 0x02A0 (size: 0x8)
    class UStaticMeshComponent* Dirt_0_2;                                             // 0x02A8 (size: 0x8)
    class UStaticMeshComponent* MainBld_472;                                          // 0x02B0 (size: 0x8)
    class UStaticMeshComponent* Clutter4;                                             // 0x02B8 (size: 0x8)
    class UStaticMeshComponent* Clutter3;                                             // 0x02C0 (size: 0x8)
    class UStaticMeshComponent* Clutter2;                                             // 0x02C8 (size: 0x8)
    class UStaticMeshComponent* Clutter1;                                             // 0x02D0 (size: 0x8)
    class USceneComponent* Scene;                                                     // 0x02D8 (size: 0x8)

}; // Size: 0x2E0

#endif
