#ifndef UE4SS_SDK_BM_SG_Townhouse_LV3_C_HPP
#define UE4SS_SDK_BM_SG_Townhouse_LV3_C_HPP

class ABM_SG_Townhouse_LV3_C_C : public AStaticMeshActor
{
    class UStaticMeshComponent* FullBld_477;                                          // 0x02A0 (size: 0x8)
    class USceneComponent* bounce;                                                    // 0x02A8 (size: 0x8)
    class UStaticMeshComponent* clutter_9;                                            // 0x02B0 (size: 0x8)
    class UStaticMeshComponent* clutter_8;                                            // 0x02B8 (size: 0x8)
    class UStaticMeshComponent* clutter_7;                                            // 0x02C0 (size: 0x8)
    class UStaticMeshComponent* clutter_6;                                            // 0x02C8 (size: 0x8)
    class UStaticMeshComponent* clutter_52;                                           // 0x02D0 (size: 0x8)
    class UStaticMeshComponent* clutter_pavement9;                                    // 0x02D8 (size: 0x8)
    class UStaticMeshComponent* clutter_pavement8;                                    // 0x02E0 (size: 0x8)
    class UStaticMeshComponent* clutter_pavement7;                                    // 0x02E8 (size: 0x8)
    class UStaticMeshComponent* clutter_pavement6;                                    // 0x02F0 (size: 0x8)
    class UStaticMeshComponent* clutter_pavement5;                                    // 0x02F8 (size: 0x8)
    class UStaticMeshComponent* clutter_pavement4;                                    // 0x0300 (size: 0x8)
    class UStaticMeshComponent* clutter_12;                                           // 0x0308 (size: 0x8)
    class UStaticMeshComponent* clutter_5;                                            // 0x0310 (size: 0x8)
    class UStaticMeshComponent* clutter_36;                                           // 0x0318 (size: 0x8)
    class UStaticMeshComponent* Dirt_0_0;                                             // 0x0320 (size: 0x8)
    class UStaticMeshComponent* dirt_4_0;                                             // 0x0328 (size: 0x8)
    class UStaticMeshComponent* MainBld_451;                                          // 0x0330 (size: 0x8)

}; // Size: 0x338

#endif
