#ifndef UE4SS_SDK_BM_SG_Church_Lv2_HPP
#define UE4SS_SDK_BM_SG_Church_Lv2_HPP

class ABM_SG_Church_Lv2_C : public AStaticMeshActor
{
    class USceneComponent* gatheringSpot;                                             // 0x02A0 (size: 0x8)
    class UStaticMeshComponent* FullBld_145_5;                                        // 0x02A8 (size: 0x8)
    class UStaticMeshComponent* FullBld_145_4;                                        // 0x02B0 (size: 0x8)
    class UStaticMeshComponent* FullBld_145_3;                                        // 0x02B8 (size: 0x8)
    class UStaticMeshComponent* FullBld_145_2;                                        // 0x02C0 (size: 0x8)
    class UStaticMeshComponent* FullBld_145_1;                                        // 0x02C8 (size: 0x8)
    class UStaticMeshComponent* Bld_Ossuary;                                          // 0x02D0 (size: 0x8)
    class UStaticMeshComponent* FullBld_446;                                          // 0x02D8 (size: 0x8)
    class UStaticMeshComponent* MainBld_447;                                          // 0x02E0 (size: 0x8)
    class UStaticMeshComponent* clutter_bush20;                                       // 0x02E8 (size: 0x8)
    class UStaticMeshComponent* clutter_bush19;                                       // 0x02F0 (size: 0x8)
    class UStaticMeshComponent* clutter_bush18;                                       // 0x02F8 (size: 0x8)
    class UStaticMeshComponent* clutter_bush17;                                       // 0x0300 (size: 0x8)
    class UStaticMeshComponent* clutter_stones20;                                     // 0x0308 (size: 0x8)
    class UStaticMeshComponent* clutter_stones19;                                     // 0x0310 (size: 0x8)
    class UStaticMeshComponent* clutter_stones18;                                     // 0x0318 (size: 0x8)
    class UStaticMeshComponent* clutter_stones17;                                     // 0x0320 (size: 0x8)
    class UStaticMeshComponent* clutter_stones16;                                     // 0x0328 (size: 0x8)
    class UStaticMeshComponent* clutter_stones15;                                     // 0x0330 (size: 0x8)
    class UStaticMeshComponent* clutter_stones14;                                     // 0x0338 (size: 0x8)
    class UStaticMeshComponent* clutter_stones13;                                     // 0x0340 (size: 0x8)
    class UStaticMeshComponent* clutter_stones12;                                     // 0x0348 (size: 0x8)
    class UStaticMeshComponent* clutter_stones11;                                     // 0x0350 (size: 0x8)
    class USceneComponent* gahering;                                                  // 0x0358 (size: 0x8)
    class UStaticMeshComponent* clutter_stones10;                                     // 0x0360 (size: 0x8)
    class UStaticMeshComponent* clutter_stones9;                                      // 0x0368 (size: 0x8)
    class UStaticMeshComponent* clutter_stones8;                                      // 0x0370 (size: 0x8)
    class UStaticMeshComponent* clutter_stones7;                                      // 0x0378 (size: 0x8)
    class UStaticMeshComponent* clutter_stones6;                                      // 0x0380 (size: 0x8)
    class UStaticMeshComponent* clutter_stones5;                                      // 0x0388 (size: 0x8)
    class UStaticMeshComponent* clutter_stones4;                                      // 0x0390 (size: 0x8)
    class UStaticMeshComponent* clutter_bush16;                                       // 0x0398 (size: 0x8)
    class UStaticMeshComponent* clutter_bush15;                                       // 0x03A0 (size: 0x8)
    class UStaticMeshComponent* clutter_bush14;                                       // 0x03A8 (size: 0x8)
    class UStaticMeshComponent* clutter_bush13;                                       // 0x03B0 (size: 0x8)
    class UStaticMeshComponent* clutter_bush12;                                       // 0x03B8 (size: 0x8)
    class UStaticMeshComponent* clutter_bush11;                                       // 0x03C0 (size: 0x8)
    class UStaticMeshComponent* clutter_bush10;                                       // 0x03C8 (size: 0x8)
    class UStaticMeshComponent* clutter_bush9;                                        // 0x03D0 (size: 0x8)
    class UStaticMeshComponent* clutter_bush8;                                        // 0x03D8 (size: 0x8)
    class UStaticMeshComponent* clutter_bush7;                                        // 0x03E0 (size: 0x8)
    class UStaticMeshComponent* res_16_7;                                             // 0x03E8 (size: 0x8)
    class UStaticMeshComponent* res_16_6;                                             // 0x03F0 (size: 0x8)
    class UStaticMeshComponent* res_16_5;                                             // 0x03F8 (size: 0x8)
    class UStaticMeshComponent* res_16_4;                                             // 0x0400 (size: 0x8)
    class UStaticMeshComponent* res_16_3;                                             // 0x0408 (size: 0x8)
    class UStaticMeshComponent* res_16_2;                                             // 0x0410 (size: 0x8)
    class UStaticMeshComponent* res_16_1;                                             // 0x0418 (size: 0x8)
    class UStaticMeshComponent* res_16_0;                                             // 0x0420 (size: 0x8)
    class UStaticMeshComponent* Dirt_3_2;                                             // 0x0428 (size: 0x8)
    class UStaticMeshComponent* Dirt_3_1;                                             // 0x0430 (size: 0x8)
    class UStaticMeshComponent* Dirt_0_0;                                             // 0x0438 (size: 0x8)
    class UStaticMeshComponent* bench_233_11;                                         // 0x0440 (size: 0x8)
    class UStaticMeshComponent* bench_233_10;                                         // 0x0448 (size: 0x8)
    class UStaticMeshComponent* bench_233_9;                                          // 0x0450 (size: 0x8)
    class UStaticMeshComponent* bench_233_8;                                          // 0x0458 (size: 0x8)
    class UStaticMeshComponent* bench_233_7;                                          // 0x0460 (size: 0x8)
    class UStaticMeshComponent* bench_233_6;                                          // 0x0468 (size: 0x8)
    class UStaticMeshComponent* bench_233_5;                                          // 0x0470 (size: 0x8)
    class UStaticMeshComponent* bench_233_4;                                          // 0x0478 (size: 0x8)
    class UStaticMeshComponent* bench_233_3;                                          // 0x0480 (size: 0x8)
    class UStaticMeshComponent* bench_233_2;                                          // 0x0488 (size: 0x8)
    class UStaticMeshComponent* bench_233_1;                                          // 0x0490 (size: 0x8)
    class UStaticMeshComponent* dirt_2_3;                                             // 0x0498 (size: 0x8)
    class UStaticMeshComponent* dirt_2_2;                                             // 0x04A0 (size: 0x8)
    class UStaticMeshComponent* dirt_2_1;                                             // 0x04A8 (size: 0x8)
    class UStaticMeshComponent* dirt_2_0;                                             // 0x04B0 (size: 0x8)
    class UStaticMeshComponent* Bld_406_3;                                            // 0x04B8 (size: 0x8)
    class UStaticMeshComponent* Bld_406_2;                                            // 0x04C0 (size: 0x8)
    class UStaticMeshComponent* Bld_405_14;                                           // 0x04C8 (size: 0x8)
    class UStaticMeshComponent* Bld_406_1;                                            // 0x04D0 (size: 0x8)
    class UStaticMeshComponent* Bld_405_28;                                           // 0x04D8 (size: 0x8)
    class UStaticMeshComponent* Bld_405_27;                                           // 0x04E0 (size: 0x8)
    class UStaticMeshComponent* Bld_405_26;                                           // 0x04E8 (size: 0x8)
    class UStaticMeshComponent* Bld_405_25;                                           // 0x04F0 (size: 0x8)
    class UStaticMeshComponent* Bld_405_24;                                           // 0x04F8 (size: 0x8)
    class UStaticMeshComponent* Bld_405_23;                                           // 0x0500 (size: 0x8)
    class UStaticMeshComponent* Bld_405_22;                                           // 0x0508 (size: 0x8)
    class UStaticMeshComponent* Bld_405_21;                                           // 0x0510 (size: 0x8)
    class UStaticMeshComponent* Bld_405_20;                                           // 0x0518 (size: 0x8)
    class UStaticMeshComponent* Bld_405_19;                                           // 0x0520 (size: 0x8)
    class UStaticMeshComponent* Bld_405_18;                                           // 0x0528 (size: 0x8)
    class UStaticMeshComponent* Bld_405_17;                                           // 0x0530 (size: 0x8)
    class UStaticMeshComponent* Bld_405_16;                                           // 0x0538 (size: 0x8)
    class UStaticMeshComponent* Bld_405_15;                                           // 0x0540 (size: 0x8)
    class UStaticMeshComponent* Bld_405_13;                                           // 0x0548 (size: 0x8)
    class UStaticMeshComponent* Bld_405_12;                                           // 0x0550 (size: 0x8)
    class UStaticMeshComponent* Bld_405_11;                                           // 0x0558 (size: 0x8)
    class UStaticMeshComponent* Bld_405_10;                                           // 0x0560 (size: 0x8)
    class UStaticMeshComponent* Bld_405_9;                                            // 0x0568 (size: 0x8)
    class UStaticMeshComponent* Bld_405_8;                                            // 0x0570 (size: 0x8)
    class UStaticMeshComponent* Bld_405_7;                                            // 0x0578 (size: 0x8)
    class UStaticMeshComponent* Bld_405_6;                                            // 0x0580 (size: 0x8)
    class UStaticMeshComponent* Bld_405_5;                                            // 0x0588 (size: 0x8)
    class UStaticMeshComponent* Bld_405_4;                                            // 0x0590 (size: 0x8)
    class UStaticMeshComponent* Bld_405_3;                                            // 0x0598 (size: 0x8)
    class UStaticMeshComponent* Bld_405_2;                                            // 0x05A0 (size: 0x8)
    class UStaticMeshComponent* Bld_405_1;                                            // 0x05A8 (size: 0x8)

}; // Size: 0x5B0

#endif
