#ifndef UE4SS_SDK_BM_SG_Brewery_HPP
#define UE4SS_SDK_BM_SG_Brewery_HPP

class ABM_SG_Brewery_C : public AStaticMeshActor
{
    class UStaticMeshComponent* res_28_6;                                             // 0x02A0 (size: 0x8)
    class UStaticMeshComponent* res_28_5;                                             // 0x02A8 (size: 0x8)
    class UStaticMeshComponent* res_28_4;                                             // 0x02B0 (size: 0x8)
    class UStaticMeshComponent* res_28_3;                                             // 0x02B8 (size: 0x8)
    class UStaticMeshComponent* res_28_2;                                             // 0x02C0 (size: 0x8)
    class UStaticMeshComponent* res_28_1;                                             // 0x02C8 (size: 0x8)
    class UStaticMeshComponent* FullBld_306;                                          // 0x02D0 (size: 0x8)
    class UStaticMeshComponent* MainBld_198;                                          // 0x02D8 (size: 0x8)
    class USceneComponent* Scene;                                                     // 0x02E0 (size: 0x8)
    class UStaticMeshComponent* clutter_9;                                            // 0x02E8 (size: 0x8)
    class UStaticMeshComponent* clutter_8;                                            // 0x02F0 (size: 0x8)
    class UStaticMeshComponent* clutter_7;                                            // 0x02F8 (size: 0x8)
    class UStaticMeshComponent* clutter_6;                                            // 0x0300 (size: 0x8)
    class UStaticMeshComponent* clutter_4;                                            // 0x0308 (size: 0x8)
    class UStaticMeshComponent* clutter_3;                                            // 0x0310 (size: 0x8)
    class UStaticMeshComponent* clutter_2;                                            // 0x0318 (size: 0x8)
    class UStaticMeshComponent* clutter_1;                                            // 0x0320 (size: 0x8)
    class UStaticMeshComponent* clutter_0;                                            // 0x0328 (size: 0x8)
    class USceneComponent* workPos_4;                                                 // 0x0330 (size: 0x8)
    class USceneComponent* workPos_3;                                                 // 0x0338 (size: 0x8)
    class UStaticMeshComponent* res_29_3;                                             // 0x0340 (size: 0x8)
    class UStaticMeshComponent* res_29_2;                                             // 0x0348 (size: 0x8)
    class UStaticMeshComponent* res_29_1;                                             // 0x0350 (size: 0x8)
    class UStaticMeshComponent* res_29_0;                                             // 0x0358 (size: 0x8)
    class UStaticMeshComponent* Dirt_1_4;                                             // 0x0360 (size: 0x8)
    class UStaticMeshComponent* MainBld_430;                                          // 0x0368 (size: 0x8)
    class USceneComponent* workPos_2;                                                 // 0x0370 (size: 0x8)
    class USceneComponent* workPos_1;                                                 // 0x0378 (size: 0x8)
    class USceneComponent* workPos_0;                                                 // 0x0380 (size: 0x8)
    class UStaticMeshComponent* Bld_brewery_4;                                        // 0x0388 (size: 0x8)
    class UStaticMeshComponent* FullBld_431;                                          // 0x0390 (size: 0x8)
    class UStaticMeshComponent* Bld_brewery_3;                                        // 0x0398 (size: 0x8)
    class UStaticMeshComponent* Bld_brewery_2;                                        // 0x03A0 (size: 0x8)
    class UStaticMeshComponent* Bld_brewery_0;                                        // 0x03A8 (size: 0x8)
    class UStaticMeshComponent* Dirt_0_3;                                             // 0x03B0 (size: 0x8)
    class UStaticMeshComponent* Dirt_0_2;                                             // 0x03B8 (size: 0x8)
    class UStaticMeshComponent* Dirt_3_0;                                             // 0x03C0 (size: 0x8)
    class UStaticMeshComponent* Dirt_1_3;                                             // 0x03C8 (size: 0x8)
    class UStaticMeshComponent* Clutter1;                                             // 0x03D0 (size: 0x8)
    class UStaticMeshComponent* Bld_401_16;                                           // 0x03D8 (size: 0x8)
    class UStaticMeshComponent* Bld_401_13;                                           // 0x03E0 (size: 0x8)
    class UStaticMeshComponent* Bld_401_8;                                            // 0x03E8 (size: 0x8)
    class UStaticMeshComponent* Bld_401_7;                                            // 0x03F0 (size: 0x8)
    class UStaticMeshComponent* Bld_401_6;                                            // 0x03F8 (size: 0x8)
    class UStaticMeshComponent* Bld_401_4;                                            // 0x0400 (size: 0x8)
    class UStaticMeshComponent* clutter;                                              // 0x0408 (size: 0x8)
    class UStaticMeshComponent* Dirt_1_0;                                             // 0x0410 (size: 0x8)

}; // Size: 0x418

#endif
