#ifndef UE4SS_SDK_BM_SG_Tannery_LV1_HPP
#define UE4SS_SDK_BM_SG_Tannery_LV1_HPP

class ABM_SG_Tannery_LV1_C : public AStaticMeshActor
{
    class UStaticMeshComponent* res_3_1;                                              // 0x02A0 (size: 0x8)
    class UStaticMeshComponent* res_3_0;                                              // 0x02A8 (size: 0x8)
    class UStaticMeshComponent* res_4_5;                                              // 0x02B0 (size: 0x8)
    class UStaticMeshComponent* res_4_4;                                              // 0x02B8 (size: 0x8)
    class UStaticMeshComponent* res_4_3;                                              // 0x02C0 (size: 0x8)
    class UStaticMeshComponent* res_4_2;                                              // 0x02C8 (size: 0x8)
    class UStaticMeshComponent* res_4_1;                                              // 0x02D0 (size: 0x8)
    class UStaticMeshComponent* res_4_0;                                              // 0x02D8 (size: 0x8)
    class UStaticMeshComponent* res_16_5;                                             // 0x02E0 (size: 0x8)
    class UStaticMeshComponent* res_16_4;                                             // 0x02E8 (size: 0x8)
    class UStaticMeshComponent* res_16_3;                                             // 0x02F0 (size: 0x8)
    class UStaticMeshComponent* res_16_2;                                             // 0x02F8 (size: 0x8)
    class UStaticMeshComponent* Dirt_3_2;                                             // 0x0300 (size: 0x8)
    class UStaticMeshComponent* Dirt_0_1;                                             // 0x0308 (size: 0x8)
    class UStaticMeshComponent* Dirt_0_0;                                             // 0x0310 (size: 0x8)
    class UStaticMeshComponent* bench_3_2;                                            // 0x0318 (size: 0x8)
    class UStaticMeshComponent* bench_3_1;                                            // 0x0320 (size: 0x8)
    class UStaticMeshComponent* bench_3_0;                                            // 0x0328 (size: 0x8)
    class UStaticMeshComponent* bld_0_6;                                              // 0x0330 (size: 0x8)
    class UStaticMeshComponent* bld_0_5;                                              // 0x0338 (size: 0x8)
    class UStaticMeshComponent* bld_0_4;                                              // 0x0340 (size: 0x8)
    class UStaticMeshComponent* clutter;                                              // 0x0348 (size: 0x8)
    class UStaticMeshComponent* bld_0_3;                                              // 0x0350 (size: 0x8)
    class UStaticMeshComponent* bld_0_2;                                              // 0x0358 (size: 0x8)
    class UStaticMeshComponent* bld_0_1;                                              // 0x0360 (size: 0x8)
    class UStaticMeshComponent* bld_0;                                                // 0x0368 (size: 0x8)
    class UStaticMeshComponent* dirt_2_1;                                             // 0x0370 (size: 0x8)
    class UStaticMeshComponent* dirt_2_0;                                             // 0x0378 (size: 0x8)
    class UStaticMeshComponent* FullBld_306;                                          // 0x0380 (size: 0x8)
    class UStaticMeshComponent* FullBld_273;                                          // 0x0388 (size: 0x8)
    class UStaticMeshComponent* Dirt_3_0;                                             // 0x0390 (size: 0x8)
    class UStaticMeshComponent* MainBld_434;                                          // 0x0398 (size: 0x8)

}; // Size: 0x3A0

#endif
