#ifndef UE4SS_SDK_BM_SG_Beehives_HPP
#define UE4SS_SDK_BM_SG_Beehives_HPP

class ABM_SG_Beehives_C : public AStaticMeshActor
{
    class UStaticMeshComponent* PS_Bees-4;                                            // 0x02A0 (size: 0x8)
    class UStaticMeshComponent* PS_Bees-3;                                            // 0x02A8 (size: 0x8)
    class UStaticMeshComponent* PS_Bees-2;                                            // 0x02B0 (size: 0x8)
    class UStaticMeshComponent* PS_Bees-1;                                            // 0x02B8 (size: 0x8)
    class UStaticMeshComponent* clutter_2;                                            // 0x02C0 (size: 0x8)
    class UStaticMeshComponent* clutter_1;                                            // 0x02C8 (size: 0x8)
    class UStaticMeshComponent* clutter_0;                                            // 0x02D0 (size: 0x8)
    class UStaticMeshComponent* bld_0;                                                // 0x02D8 (size: 0x8)
    class UStaticMeshComponent* MainBld_456_0;                                        // 0x02E0 (size: 0x8)
    class UStaticMeshComponent* Dirt_0_2;                                             // 0x02E8 (size: 0x8)
    class UStaticMeshComponent* MainBld_456;                                          // 0x02F0 (size: 0x8)

}; // Size: 0x2F8

#endif
