#ifndef UE4SS_SDK_BM_SG_Ext_BakeryOven_HPP
#define UE4SS_SDK_BM_SG_Ext_BakeryOven_HPP

class ABM_SG_Ext_BakeryOven_C : public AStaticMeshActor
{
    class USceneComponent* workpos1;                                                  // 0x02A0 (size: 0x8)
    class USceneComponent* workPos;                                                   // 0x02A8 (size: 0x8)
    class UStaticMeshComponent* clutter_3;                                            // 0x02B0 (size: 0x8)
    class UStaticMeshComponent* Dirt_3_2;                                             // 0x02B8 (size: 0x8)
    class UStaticMeshComponent* clutter_1;                                            // 0x02C0 (size: 0x8)
    class UStaticMeshComponent* bld_workdoor;                                         // 0x02C8 (size: 0x8)
    class UStaticMeshComponent* clutter_stones8;                                      // 0x02D0 (size: 0x8)
    class UStaticMeshComponent* clutter_stones7;                                      // 0x02D8 (size: 0x8)
    class UStaticMeshComponent* clutter_stones3;                                      // 0x02E0 (size: 0x8)
    class UStaticMeshComponent* clutter_stones2;                                      // 0x02E8 (size: 0x8)
    class UStaticMeshComponent* res_5_2;                                              // 0x02F0 (size: 0x8)
    class UStaticMeshComponent* res_5_0;                                              // 0x02F8 (size: 0x8)
    class UStaticMeshComponent* clutter_0;                                            // 0x0300 (size: 0x8)
    class UStaticMeshComponent* bld_oven;                                             // 0x0308 (size: 0x8)
    class UStaticMeshComponent* res_16_0;                                             // 0x0310 (size: 0x8)
    class UStaticMeshComponent* clutter_stones1;                                      // 0x0318 (size: 0x8)
    class UStaticMeshComponent* Dirt_0_0;                                             // 0x0320 (size: 0x8)
    class UStaticMeshComponent* FullBld_441;                                          // 0x0328 (size: 0x8)
    class USceneComponent* Scene;                                                     // 0x0330 (size: 0x8)

}; // Size: 0x338

#endif
