#ifndef UE4SS_SDK_C_Ext_AnimalStableLow_HPP
#define UE4SS_SDK_C_Ext_AnimalStableLow_HPP

class AC_Ext_AnimalStableLow_C : public AConstructionBP_C
{
    class UStaticMeshComponent* UGable_WideBoarding2_StaticMeshComponent0;            // 0x0550 (size: 0x8)
    class UStaticMeshComponent* UGable_Half_Low4_StaticMeshComponent0;                // 0x0558 (size: 0x8)
    class UStaticMeshComponent* UGable_Half_Low3_StaticMeshComponent0;                // 0x0560 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_05_Curved31_StaticMeshComponent0;      // 0x0568 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_05_Curved30_StaticMeshComponent0;      // 0x0570 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_05_Curved29_StaticMeshComponent0;      // 0x0578 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_05_Curved28_StaticMeshComponent0;      // 0x0580 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_05_Curved27_StaticMeshComponent0;      // 0x0588 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_05_Curved26_StaticMeshComponent0;      // 0x0590 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m200_StaticMeshComponent0;                     // 0x0598 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m199_StaticMeshComponent0;                     // 0x05A0 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m198_StaticMeshComponent0;                     // 0x05A8 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m197_StaticMeshComponent0;                     // 0x05B0 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m196_StaticMeshComponent0;                     // 0x05B8 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m195_StaticMeshComponent0;                     // 0x05C0 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m194_StaticMeshComponent0;                     // 0x05C8 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m193_StaticMeshComponent0;                     // 0x05D0 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m192_StaticMeshComponent0;                     // 0x05D8 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m191_StaticMeshComponent0;                     // 0x05E0 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m190_StaticMeshComponent0;                     // 0x05E8 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m189_StaticMeshComponent0;                     // 0x05F0 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m188_StaticMeshComponent0;                     // 0x05F8 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m187_StaticMeshComponent0;                     // 0x0600 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m186_StaticMeshComponent0;                     // 0x0608 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m185_StaticMeshComponent0;                     // 0x0610 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m184_StaticMeshComponent0;                     // 0x0618 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m183_StaticMeshComponent0;                     // 0x0620 (size: 0x8)
    class UStaticMeshComponent* roofWoodShedD6_StaticMeshComponent0;                  // 0x0628 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m182_StaticMeshComponent0;                     // 0x0630 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m181_StaticMeshComponent0;                     // 0x0638 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m180_StaticMeshComponent0;                     // 0x0640 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m179_StaticMeshComponent0;                     // 0x0648 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m178_StaticMeshComponent0;                     // 0x0650 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m177_StaticMeshComponent0;                     // 0x0658 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m176_StaticMeshComponent0;                     // 0x0660 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m175_StaticMeshComponent0;                     // 0x0668 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m174_StaticMeshComponent0;                     // 0x0670 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m173_StaticMeshComponent0;                     // 0x0678 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m172_StaticMeshComponent0;                     // 0x0680 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m171_StaticMeshComponent0;                     // 0x0688 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m170_StaticMeshComponent0;                     // 0x0690 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m169_StaticMeshComponent0;                     // 0x0698 (size: 0x8)
    class USceneComponent* SG_AnimalPenLow2_DefaultSceneRoot;                         // 0x06A0 (size: 0x8)

}; // Size: 0x6A8

#endif
