#ifndef UE4SS_SDK_C_SG_FurnacePlatform_HPP
#define UE4SS_SDK_C_SG_FurnacePlatform_HPP

class AC_SG_FurnacePlatform_C : public AConstructionBP_C
{
    class UStaticMeshComponent* UBeam_3m50_StaticMeshComponent0;                      // 0x0550 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m49_StaticMeshComponent0;                      // 0x0558 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m48_StaticMeshComponent0;                      // 0x0560 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m47_StaticMeshComponent0;                      // 0x0568 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA48_StaticMeshComponent0;            // 0x0570 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA47_StaticMeshComponent0;            // 0x0578 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA46_StaticMeshComponent0;            // 0x0580 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA45_StaticMeshComponent0;            // 0x0588 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA44_StaticMeshComponent0;            // 0x0590 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA43_StaticMeshComponent0;            // 0x0598 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA42_StaticMeshComponent0;            // 0x05A0 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA41_StaticMeshComponent0;            // 0x05A8 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA40_StaticMeshComponent0;            // 0x05B0 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m46_StaticMeshComponent0;                      // 0x05B8 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m45_StaticMeshComponent0;                      // 0x05C0 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m44_StaticMeshComponent0;                      // 0x05C8 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m43_StaticMeshComponent0;                      // 0x05D0 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m42_StaticMeshComponent0;                      // 0x05D8 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m41_StaticMeshComponent0;                      // 0x05E0 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m40_StaticMeshComponent0;                      // 0x05E8 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m39_StaticMeshComponent0;                      // 0x05F0 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m38_StaticMeshComponent0;                      // 0x05F8 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m37_StaticMeshComponent0;                      // 0x0600 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m36_StaticMeshComponent0;                      // 0x0608 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA39_StaticMeshComponent0;            // 0x0610 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA38_StaticMeshComponent0;            // 0x0618 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA37_StaticMeshComponent0;            // 0x0620 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA36_StaticMeshComponent0;            // 0x0628 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA35_StaticMeshComponent0;            // 0x0630 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA34_StaticMeshComponent0;            // 0x0638 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA33_StaticMeshComponent0;            // 0x0640 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA32_StaticMeshComponent0;            // 0x0648 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA31_StaticMeshComponent0;            // 0x0650 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA30_StaticMeshComponent0;            // 0x0658 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA29_StaticMeshComponent0;            // 0x0660 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA28_StaticMeshComponent0;            // 0x0668 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA27_StaticMeshComponent0;            // 0x0670 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA26_StaticMeshComponent0;            // 0x0678 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m35_StaticMeshComponent0;                      // 0x0680 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m34_StaticMeshComponent0;                      // 0x0688 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m33_StaticMeshComponent0;                      // 0x0690 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m32_StaticMeshComponent0;                      // 0x0698 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m31_StaticMeshComponent0;                      // 0x06A0 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m30_StaticMeshComponent0;                      // 0x06A8 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m29_StaticMeshComponent0;                      // 0x06B0 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m28_StaticMeshComponent0;                      // 0x06B8 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m27_StaticMeshComponent0;                      // 0x06C0 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m26_StaticMeshComponent0;                      // 0x06C8 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA16_StaticMeshComponent0;            // 0x06D0 (size: 0x8)
    class USceneComponent* platform2_DefaultSceneRoot;                                // 0x06D8 (size: 0x8)

}; // Size: 0x6E0

#endif
