#ifndef UE4SS_SDK_C_SG_Tavern_MainBuilding_HPP
#define UE4SS_SDK_C_SG_Tavern_MainBuilding_HPP

class AC_SG_Tavern_MainBuilding_C : public AConstructionBP_C
{
    class UStaticMeshComponent* strut_short24_StaticMeshComponent0;                   // 0x0550 (size: 0x8)
    class UStaticMeshComponent* strut_short23_StaticMeshComponent0;                   // 0x0558 (size: 0x8)
    class UStaticMeshComponent* strut_short22_StaticMeshComponent0;                   // 0x0560 (size: 0x8)
    class UStaticMeshComponent* strut_short21_StaticMeshComponent0;                   // 0x0568 (size: 0x8)
    class UStaticMeshComponent* strut_short20_StaticMeshComponent0;                   // 0x0570 (size: 0x8)
    class UStaticMeshComponent* strut_short19_StaticMeshComponent0;                   // 0x0578 (size: 0x8)
    class UStaticMeshComponent* strut_short18_StaticMeshComponent0;                   // 0x0580 (size: 0x8)
    class UStaticMeshComponent* strut_short17_StaticMeshComponent0;                   // 0x0588 (size: 0x8)
    class UStaticMeshComponent* strut_short16_StaticMeshComponent0;                   // 0x0590 (size: 0x8)
    class UStaticMeshComponent* strut_short15_StaticMeshComponent0;                   // 0x0598 (size: 0x8)
    class UStaticMeshComponent* strut_short14_StaticMeshComponent0;                   // 0x05A0 (size: 0x8)
    class UStaticMeshComponent* strut_short13_StaticMeshComponent0;                   // 0x05A8 (size: 0x8)
    class UStaticMeshComponent* thatch_roof_tavern2_StaticMeshComponent0;             // 0x05B0 (size: 0x8)
    class UStaticMeshComponent* sg_shutterA8_StaticMeshComponent0;                    // 0x05B8 (size: 0x8)
    class UStaticMeshComponent* sg_shutterA7_StaticMeshComponent0;                    // 0x05C0 (size: 0x8)
    class UStaticMeshComponent* sg_shutterA6_StaticMeshComponent0;                    // 0x05C8 (size: 0x8)
    class UStaticMeshComponent* sg_shutterA5_StaticMeshComponent0;                    // 0x05D0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly87_StaticMeshComponent0;    // 0x05D8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly86_StaticMeshComponent0;    // 0x05E0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly85_StaticMeshComponent0;    // 0x05E8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly84_StaticMeshComponent0;    // 0x05F0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly83_StaticMeshComponent0;    // 0x05F8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly82_StaticMeshComponent0;    // 0x0600 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly81_StaticMeshComponent0;    // 0x0608 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly80_StaticMeshComponent0;    // 0x0610 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly79_StaticMeshComponent0;    // 0x0618 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly78_StaticMeshComponent0;    // 0x0620 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly77_StaticMeshComponent0;    // 0x0628 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly76_StaticMeshComponent0;    // 0x0630 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly75_StaticMeshComponent0;    // 0x0638 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly74_StaticMeshComponent0;    // 0x0640 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly73_StaticMeshComponent0;    // 0x0648 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly72_StaticMeshComponent0;    // 0x0650 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly71_StaticMeshComponent0;    // 0x0658 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly70_StaticMeshComponent0;    // 0x0660 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly69_StaticMeshComponent0;    // 0x0668 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly68_StaticMeshComponent0;    // 0x0670 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly67_StaticMeshComponent0;    // 0x0678 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly66_StaticMeshComponent0;    // 0x0680 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly65_StaticMeshComponent0;    // 0x0688 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly64_StaticMeshComponent0;    // 0x0690 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly63_StaticMeshComponent0;    // 0x0698 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly62_StaticMeshComponent0;    // 0x06A0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly61_StaticMeshComponent0;    // 0x06A8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly60_StaticMeshComponent0;    // 0x06B0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly59_StaticMeshComponent0;    // 0x06B8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly58_StaticMeshComponent0;    // 0x06C0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly57_StaticMeshComponent0;    // 0x06C8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly56_StaticMeshComponent0;    // 0x06D0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly55_StaticMeshComponent0;    // 0x06D8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly54_StaticMeshComponent0;    // 0x06E0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly53_StaticMeshComponent0;    // 0x06E8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly52_StaticMeshComponent0;    // 0x06F0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly51_StaticMeshComponent0;    // 0x06F8 (size: 0x8)
    class UStaticMeshComponent* PlaneDenseSmallSegment16_StaticMeshComponent0;        // 0x0700 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short122_StaticMeshComponent0;       // 0x0708 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short121_StaticMeshComponent0;       // 0x0710 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short120_StaticMeshComponent0;       // 0x0718 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed28_StaticMeshComponent0;           // 0x0720 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed27_StaticMeshComponent0;           // 0x0728 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed26_StaticMeshComponent0;           // 0x0730 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed25_StaticMeshComponent0;           // 0x0738 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed24_StaticMeshComponent0;           // 0x0740 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed23_StaticMeshComponent0;           // 0x0748 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed22_StaticMeshComponent0;           // 0x0750 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed21_StaticMeshComponent0;           // 0x0758 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed20_StaticMeshComponent0;           // 0x0760 (size: 0x8)
    class UStaticMeshComponent* LevitatingOuthouse2_StaticMeshComponent0;             // 0x0768 (size: 0x8)
    class UStaticMeshComponent* foundationTiling_A_detailed44_StaticMeshComponent0;   // 0x0770 (size: 0x8)
    class UStaticMeshComponent* foundationTiling_A_detailed43_StaticMeshComponent0;   // 0x0778 (size: 0x8)
    class UStaticMeshComponent* foundationTiling_A_detailed42_StaticMeshComponent0;   // 0x0780 (size: 0x8)
    class UStaticMeshComponent* planeDenseBeveledA8_StaticMeshComponent0;             // 0x0788 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short119_StaticMeshComponent0;       // 0x0790 (size: 0x8)
    class UStaticMeshComponent* PlaneDenseBeveledWide12_StaticMeshComponent0;         // 0x0798 (size: 0x8)
    class UStaticMeshComponent* PlaneDenseWindowPaintedSingleNarrow3_StaticMeshComponent0; // 0x07A0 (size: 0x8)
    class UStaticMeshComponent* PlaneDenseWindowsWidePainted8_StaticMeshComponent0;   // 0x07A8 (size: 0x8)
    class UStaticMeshComponent* PlaneDenseWindowsWidePainted7_StaticMeshComponent0;   // 0x07B0 (size: 0x8)
    class UStaticMeshComponent* PlaneDenseWindowsWidePainted6_StaticMeshComponent0;   // 0x07B8 (size: 0x8)
    class UStaticMeshComponent* PlaneDenseBeveledWide11_StaticMeshComponent0;         // 0x07C0 (size: 0x8)
    class UStaticMeshComponent* PlaneDenseSmallSegment15_StaticMeshComponent0;        // 0x07C8 (size: 0x8)
    class UStaticMeshComponent* PlaneDenseSmallSegment14_StaticMeshComponent0;        // 0x07D0 (size: 0x8)
    class UStaticMeshComponent* PlaneDenseSmallSegmentNarrower2_StaticMeshComponent0; // 0x07D8 (size: 0x8)
    class UStaticMeshComponent* PlaneDenseCorner4_StaticMeshComponent0;               // 0x07E0 (size: 0x8)
    class UStaticMeshComponent* PlaneDenseCorner3_StaticMeshComponent0;               // 0x07E8 (size: 0x8)
    class UStaticMeshComponent* PlaneDenseSmallSegment13_StaticMeshComponent0;        // 0x07F0 (size: 0x8)
    class UStaticMeshComponent* PlaneDenseSmallSegment12_StaticMeshComponent0;        // 0x07F8 (size: 0x8)
    class UStaticMeshComponent* PlaneDenseBeveledWide10_StaticMeshComponent0;         // 0x0800 (size: 0x8)
    class UStaticMeshComponent* planeDenseBeveledA7_StaticMeshComponent0;             // 0x0808 (size: 0x8)
    class UStaticMeshComponent* planeDenseBeveledA6_StaticMeshComponent0;             // 0x0810 (size: 0x8)
    class UStaticMeshComponent* planeDenseBeveledA5_StaticMeshComponent0;             // 0x0818 (size: 0x8)
    class UStaticMeshComponent* PlaneDenseBeveledWide9_StaticMeshComponent0;          // 0x0820 (size: 0x8)
    class UStaticMeshComponent* PlaneDenseBeveledWide8_StaticMeshComponent0;          // 0x0828 (size: 0x8)
    class UStaticMeshComponent* PlaneDenseWindowsWidePainted5_StaticMeshComponent0;   // 0x0830 (size: 0x8)
    class UStaticMeshComponent* PlaneDenseBeveledWide7_StaticMeshComponent0;          // 0x0838 (size: 0x8)
    class UStaticMeshComponent* PlaneDenseSmallSegment11_StaticMeshComponent0;        // 0x0840 (size: 0x8)
    class UStaticMeshComponent* PlaneDenseSmallSegment10_StaticMeshComponent0;        // 0x0848 (size: 0x8)
    class UStaticMeshComponent* PlaneDenseSmallSegment9_StaticMeshComponent0;         // 0x0850 (size: 0x8)
    class UStaticMeshComponent* planeDenseBeveled_ThinTinyWindow2_StaticMeshComponent0; // 0x0858 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m232_StaticMeshComponent0;                // 0x0860 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m231_StaticMeshComponent0;                // 0x0868 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m230_StaticMeshComponent0;                // 0x0870 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m229_StaticMeshComponent0;                // 0x0878 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m228_StaticMeshComponent0;                // 0x0880 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m227_StaticMeshComponent0;                // 0x0888 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m226_StaticMeshComponent0;                // 0x0890 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m225_StaticMeshComponent0;                // 0x0898 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m224_StaticMeshComponent0;                // 0x08A0 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Tapered_Cut43_StaticMeshComponent0;         // 0x08A8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m223_StaticMeshComponent0;                // 0x08B0 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_74_StaticMeshComponent0; // 0x08B8 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_73_StaticMeshComponent0; // 0x08C0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m222_StaticMeshComponent0;                // 0x08C8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m221_StaticMeshComponent0;                // 0x08D0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m220_StaticMeshComponent0;                // 0x08D8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m219_StaticMeshComponent0;                // 0x08E0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m218_StaticMeshComponent0;                // 0x08E8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m217_StaticMeshComponent0;                // 0x08F0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m216_StaticMeshComponent0;                // 0x08F8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m215_StaticMeshComponent0;                // 0x0900 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m214_StaticMeshComponent0;                // 0x0908 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m213_StaticMeshComponent0;                // 0x0910 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m212_StaticMeshComponent0;                // 0x0918 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Tapered_Cut42_StaticMeshComponent0;         // 0x0920 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Tapered_Cut41_StaticMeshComponent0;         // 0x0928 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Tapered_Cut40_StaticMeshComponent0;         // 0x0930 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Tapered_Cut39_StaticMeshComponent0;         // 0x0938 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Tapered_Cut38_StaticMeshComponent0;         // 0x0940 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m211_StaticMeshComponent0;                // 0x0948 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m210_StaticMeshComponent0;                // 0x0950 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m209_StaticMeshComponent0;                // 0x0958 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m208_StaticMeshComponent0;                // 0x0960 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m207_StaticMeshComponent0;                // 0x0968 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m206_StaticMeshComponent0;                // 0x0970 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m205_StaticMeshComponent0;                // 0x0978 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m204_StaticMeshComponent0;                // 0x0980 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Tapered_Cut37_StaticMeshComponent0;         // 0x0988 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m203_StaticMeshComponent0;                // 0x0990 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m202_StaticMeshComponent0;                // 0x0998 (size: 0x8)
    class UStaticMeshComponent* foundationTiling_A_detailed41_StaticMeshComponent0;   // 0x09A0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short118_StaticMeshComponent0;       // 0x09A8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short117_StaticMeshComponent0;       // 0x09B0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short116_StaticMeshComponent0;       // 0x09B8 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Tapered_Cut36_StaticMeshComponent0;         // 0x09C0 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Tapered_Cut35_StaticMeshComponent0;         // 0x09C8 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Tapered_Cut34_StaticMeshComponent0;         // 0x09D0 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Tapered_Cut33_StaticMeshComponent0;         // 0x09D8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m201_StaticMeshComponent0;                // 0x09E0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m200_StaticMeshComponent0;                // 0x09E8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m199_StaticMeshComponent0;                // 0x09F0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam1_5m_orSth24_StaticMeshComponent0;         // 0x09F8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam1_5m_orSth23_StaticMeshComponent0;         // 0x0A00 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m198_StaticMeshComponent0;                // 0x0A08 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m197_StaticMeshComponent0;                // 0x0A10 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m196_StaticMeshComponent0;                // 0x0A18 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m195_StaticMeshComponent0;                // 0x0A20 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m194_StaticMeshComponent0;                // 0x0A28 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m193_StaticMeshComponent0;                // 0x0A30 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m192_StaticMeshComponent0;                // 0x0A38 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_72_StaticMeshComponent0; // 0x0A40 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_71_StaticMeshComponent0; // 0x0A48 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_70_StaticMeshComponent0; // 0x0A50 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m191_StaticMeshComponent0;                // 0x0A58 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_69_StaticMeshComponent0; // 0x0A60 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_68_StaticMeshComponent0; // 0x0A68 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_20_StaticMeshComponent0; // 0x0A70 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_19_StaticMeshComponent0; // 0x0A78 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_18_StaticMeshComponent0; // 0x0A80 (size: 0x8)
    class UStaticMeshComponent* J_SG_WoodenBracketA8_StaticMeshComponent0;            // 0x0A88 (size: 0x8)
    class UStaticMeshComponent* J_SG_WoodenBracketA7_StaticMeshComponent0;            // 0x0A90 (size: 0x8)
    class UStaticMeshComponent* J_SG_WoodenBracketA6_StaticMeshComponent0;            // 0x0A98 (size: 0x8)
    class UStaticMeshComponent* J_SG_WoodenBracketA5_StaticMeshComponent0;            // 0x0AA0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m190_StaticMeshComponent0;                // 0x0AA8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m189_StaticMeshComponent0;                // 0x0AB0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m188_StaticMeshComponent0;                // 0x0AB8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m187_StaticMeshComponent0;                // 0x0AC0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m186_StaticMeshComponent0;                // 0x0AC8 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_17_StaticMeshComponent0; // 0x0AD0 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_16_StaticMeshComponent0; // 0x0AD8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short115_StaticMeshComponent0;       // 0x0AE0 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_15_StaticMeshComponent0; // 0x0AE8 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_14_StaticMeshComponent0; // 0x0AF0 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_13_StaticMeshComponent0; // 0x0AF8 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_12_StaticMeshComponent0; // 0x0B00 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_11_StaticMeshComponent0; // 0x0B08 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_2_StaticMeshComponent0; // 0x0B10 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short114_StaticMeshComponent0;       // 0x0B18 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short113_StaticMeshComponent0;       // 0x0B20 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth_tapered2_StaticMeshComponent0;    // 0x0B28 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Tapered_Cut32_StaticMeshComponent0;         // 0x0B30 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short112_StaticMeshComponent0;       // 0x0B38 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short111_StaticMeshComponent0;       // 0x0B40 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short110_StaticMeshComponent0;       // 0x0B48 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_67_StaticMeshComponent0; // 0x0B50 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_66_StaticMeshComponent0; // 0x0B58 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam1_5m_orSth22_StaticMeshComponent0;         // 0x0B60 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short109_StaticMeshComponent0;       // 0x0B68 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam1_5m_orSth21_StaticMeshComponent0;         // 0x0B70 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam1_5m_orSth20_StaticMeshComponent0;         // 0x0B78 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m185_StaticMeshComponent0;                // 0x0B80 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m184_StaticMeshComponent0;                // 0x0B88 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_65_StaticMeshComponent0; // 0x0B90 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_64_StaticMeshComponent0; // 0x0B98 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_63_StaticMeshComponent0; // 0x0BA0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short108_StaticMeshComponent0;       // 0x0BA8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short107_StaticMeshComponent0;       // 0x0BB0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short106_StaticMeshComponent0;       // 0x0BB8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam1_5m_orSth19_StaticMeshComponent0;         // 0x0BC0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam1_5m_orSth18_StaticMeshComponent0;         // 0x0BC8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam1_5m_orSth17_StaticMeshComponent0;         // 0x0BD0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam1_5m_orSth16_StaticMeshComponent0;         // 0x0BD8 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_62_StaticMeshComponent0; // 0x0BE0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m183_StaticMeshComponent0;                // 0x0BE8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m182_StaticMeshComponent0;                // 0x0BF0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m181_StaticMeshComponent0;                // 0x0BF8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short105_StaticMeshComponent0;       // 0x0C00 (size: 0x8)
    class UStaticMeshComponent* doorHeadA_angled2_StaticMeshComponent0;               // 0x0C08 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Tapered_Cut31_StaticMeshComponent0;         // 0x0C10 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_61_StaticMeshComponent0; // 0x0C18 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_60_StaticMeshComponent0; // 0x0C20 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_59_StaticMeshComponent0; // 0x0C28 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_58_StaticMeshComponent0; // 0x0C30 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_57_StaticMeshComponent0; // 0x0C38 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_56_StaticMeshComponent0; // 0x0C40 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_55_StaticMeshComponent0; // 0x0C48 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short104_StaticMeshComponent0;       // 0x0C50 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short103_StaticMeshComponent0;       // 0x0C58 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short102_StaticMeshComponent0;       // 0x0C60 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Tapered_Cut30_StaticMeshComponent0;         // 0x0C68 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Tapered_Cut29_StaticMeshComponent0;         // 0x0C70 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Tapered_Cut28_StaticMeshComponent0;         // 0x0C78 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m180_StaticMeshComponent0;                // 0x0C80 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m179_StaticMeshComponent0;                // 0x0C88 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m178_StaticMeshComponent0;                // 0x0C90 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m177_StaticMeshComponent0;                // 0x0C98 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short101_StaticMeshComponent0;       // 0x0CA0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short100_StaticMeshComponent0;       // 0x0CA8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short99_StaticMeshComponent0;        // 0x0CB0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short98_StaticMeshComponent0;        // 0x0CB8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short97_StaticMeshComponent0;        // 0x0CC0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short96_StaticMeshComponent0;        // 0x0CC8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short95_StaticMeshComponent0;        // 0x0CD0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short94_StaticMeshComponent0;        // 0x0CD8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short93_StaticMeshComponent0;        // 0x0CE0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short92_StaticMeshComponent0;        // 0x0CE8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short91_StaticMeshComponent0;        // 0x0CF0 (size: 0x8)
    class UStaticMeshComponent* foundationTiling_A_detailed40_StaticMeshComponent0;   // 0x0CF8 (size: 0x8)
    class UStaticMeshComponent* foundationTiling_A_detailed39_StaticMeshComponent0;   // 0x0D00 (size: 0x8)
    class UStaticMeshComponent* foundationTiling_A_detailed38_StaticMeshComponent0;   // 0x0D08 (size: 0x8)
    class UStaticMeshComponent* foundationTiling_A_detailed37_StaticMeshComponent0;   // 0x0D10 (size: 0x8)
    class UStaticMeshComponent* foundationTiling_A_detailed36_StaticMeshComponent0;   // 0x0D18 (size: 0x8)
    class UStaticMeshComponent* foundationTiling_A_detailed35_StaticMeshComponent0;   // 0x0D20 (size: 0x8)
    class UStaticMeshComponent* foundationTiling_A_detailed34_StaticMeshComponent0;   // 0x0D28 (size: 0x8)
    class UStaticMeshComponent* foundationTiling_A_detailed33_StaticMeshComponent0;   // 0x0D30 (size: 0x8)
    class UStaticMeshComponent* foundationTiling_A_detailed32_StaticMeshComponent0;   // 0x0D38 (size: 0x8)
    class UStaticMeshComponent* foundationTiling_A_detailed31_StaticMeshComponent0;   // 0x0D40 (size: 0x8)
    class USceneComponent* sg_tavern_mainBuilding2_DefaultSceneRoot;                  // 0x0D48 (size: 0x8)

}; // Size: 0xD50

#endif
