#ifndef UE4SS_SDK_C_SG_Shed_Small_Planked_HPP
#define UE4SS_SDK_C_SG_Shed_Small_Planked_HPP

class AC_SG_Shed_Small_Planked_C : public AConstructionBP_C
{
    class UStaticMeshComponent* owidzThatch_luv_packedCentered_TaperedVery4_StaticMeshComponent0; // 0x0550 (size: 0x8)
    class UStaticMeshComponent* owidzThatch_luv_packedCentered_TaperedVery3_StaticMeshComponent0; // 0x0558 (size: 0x8)
    class UStaticMeshComponent* owidzThatch_halfHip4_StaticMeshComponent0;            // 0x0560 (size: 0x8)
    class UStaticMeshComponent* owidzThatch_halfHip3_StaticMeshComponent0;            // 0x0568 (size: 0x8)
    class UStaticMeshComponent* sg_WallRough_C30_StaticMeshComponent0;                // 0x0570 (size: 0x8)
    class UStaticMeshComponent* sg_WallRough_C29_StaticMeshComponent0;                // 0x0578 (size: 0x8)
    class UStaticMeshComponent* sg_WallRough_B15_StaticMeshComponent0;                // 0x0580 (size: 0x8)
    class UStaticMeshComponent* sg_WallRough_A31_StaticMeshComponent0;                // 0x0588 (size: 0x8)
    class UStaticMeshComponent* sg_WallRough_C28_StaticMeshComponent0;                // 0x0590 (size: 0x8)
    class UStaticMeshComponent* sg_WallRough_C27_StaticMeshComponent0;                // 0x0598 (size: 0x8)
    class UStaticMeshComponent* sg_WallRough_B14_StaticMeshComponent0;                // 0x05A0 (size: 0x8)
    class UStaticMeshComponent* sg_WallRough_A30_StaticMeshComponent0;                // 0x05A8 (size: 0x8)
    class UStaticMeshComponent* sg_WallRough_C26_StaticMeshComponent0;                // 0x05B0 (size: 0x8)
    class UStaticMeshComponent* sg_WallRough_C25_StaticMeshComponent0;                // 0x05B8 (size: 0x8)
    class UStaticMeshComponent* sg_WallRough_B13_StaticMeshComponent0;                // 0x05C0 (size: 0x8)
    class UStaticMeshComponent* sg_WallRough_A29_StaticMeshComponent0;                // 0x05C8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam1_5m_orSth17_StaticMeshComponent0;         // 0x05D0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam1_5m_orSth16_StaticMeshComponent0;         // 0x05D8 (size: 0x8)
    class UStaticMeshComponent* sg_WallRough_A28_StaticMeshComponent0;                // 0x05E0 (size: 0x8)
    class UStaticMeshComponent* sg_WallRough_C24_StaticMeshComponent0;                // 0x05E8 (size: 0x8)
    class UStaticMeshComponent* sg_WallRough_A27_StaticMeshComponent0;                // 0x05F0 (size: 0x8)
    class UStaticMeshComponent* sg_WallRough_C23_StaticMeshComponent0;                // 0x05F8 (size: 0x8)
    class UStaticMeshComponent* sg_WallRough_B12_StaticMeshComponent0;                // 0x0600 (size: 0x8)
    class UStaticMeshComponent* sg_WallRough_A26_StaticMeshComponent0;                // 0x0608 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed29_StaticMeshComponent0;           // 0x0610 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed28_StaticMeshComponent0;           // 0x0618 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed27_StaticMeshComponent0;           // 0x0620 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed26_StaticMeshComponent0;           // 0x0628 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed25_StaticMeshComponent0;           // 0x0630 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed24_StaticMeshComponent0;           // 0x0638 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed23_StaticMeshComponent0;           // 0x0640 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed22_StaticMeshComponent0;           // 0x0648 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed21_StaticMeshComponent0;           // 0x0650 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed20_StaticMeshComponent0;           // 0x0658 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m188_StaticMeshComponent0;                // 0x0660 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m187_StaticMeshComponent0;                // 0x0668 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m186_StaticMeshComponent0;                // 0x0670 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m185_StaticMeshComponent0;                // 0x0678 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m184_StaticMeshComponent0;                // 0x0680 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m183_StaticMeshComponent0;                // 0x0688 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m182_StaticMeshComponent0;                // 0x0690 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m181_StaticMeshComponent0;                // 0x0698 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m180_StaticMeshComponent0;                // 0x06A0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m179_StaticMeshComponent0;                // 0x06A8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short96_StaticMeshComponent0;        // 0x06B0 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Tapered_Cut30_StaticMeshComponent0;         // 0x06B8 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Tapered_Cut29_StaticMeshComponent0;         // 0x06C0 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Tapered_Cut28_StaticMeshComponent0;         // 0x06C8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m178_StaticMeshComponent0;                // 0x06D0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m177_StaticMeshComponent0;                // 0x06D8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short95_StaticMeshComponent0;        // 0x06E0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short94_StaticMeshComponent0;        // 0x06E8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short93_StaticMeshComponent0;        // 0x06F0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short92_StaticMeshComponent0;        // 0x06F8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short91_StaticMeshComponent0;        // 0x0700 (size: 0x8)
    class UStaticMeshComponent* foundationTiling_A_detailed34_StaticMeshComponent0;   // 0x0708 (size: 0x8)
    class UStaticMeshComponent* foundationTiling_A_detailed33_StaticMeshComponent0;   // 0x0710 (size: 0x8)
    class UStaticMeshComponent* foundationTiling_A_detailed32_StaticMeshComponent0;   // 0x0718 (size: 0x8)
    class UStaticMeshComponent* foundationTiling_A_detailed31_StaticMeshComponent0;   // 0x0720 (size: 0x8)
    class USceneComponent* sg_shed_small_planked2_DefaultSceneRoot;                   // 0x0728 (size: 0x8)

}; // Size: 0x730

#endif
