#ifndef UE4SS_SDK_C_SG_Cottage_Lv1_B_Ubeam_00_HPP
#define UE4SS_SDK_C_SG_Cottage_Lv1_B_Ubeam_00_HPP

class AC_SG_Cottage_Lv1_B_Ubeam_00_C : public AConstructionBP_C
{
    class UStaticMeshComponent* UDaubPlane_ManyWindows2_StaticMeshComponent0;         // 0x0550 (size: 0x8)
    class UStaticMeshComponent* inter4_StaticMeshComponent0;                          // 0x0558 (size: 0x8)
    class UStaticMeshComponent* inter3_StaticMeshComponent0;                          // 0x0560 (size: 0x8)
    class UStaticMeshComponent* Foundation_SG_Cottage_Lv1_B_Ubeam2_StaticMeshComponent0; // 0x0568 (size: 0x8)
    class UStaticMeshComponent* UBeam_WindowFrame8_StaticMeshComponent0;              // 0x0570 (size: 0x8)
    class UStaticMeshComponent* UBeam_WindowFrame7_StaticMeshComponent0;              // 0x0578 (size: 0x8)
    class UStaticMeshComponent* UBeam_WindowFrame6_StaticMeshComponent0;              // 0x0580 (size: 0x8)
    class UStaticMeshComponent* UBeam_WindowFrame5_StaticMeshComponent0;              // 0x0588 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m204_StaticMeshComponent0;                // 0x0590 (size: 0x8)
    class UStaticMeshComponent* UBeam_windowBoardD_square__longer4_StaticMeshComponent0; // 0x0598 (size: 0x8)
    class UStaticMeshComponent* UBeam_windowBoardD_square__longer3_StaticMeshComponent0; // 0x05A0 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA50_StaticMeshComponent0;            // 0x05A8 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA49_StaticMeshComponent0;            // 0x05B0 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA48_StaticMeshComponent0;            // 0x05B8 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA47_StaticMeshComponent0;            // 0x05C0 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA46_StaticMeshComponent0;            // 0x05C8 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA45_StaticMeshComponent0;            // 0x05D0 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA44_StaticMeshComponent0;            // 0x05D8 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA43_StaticMeshComponent0;            // 0x05E0 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA42_StaticMeshComponent0;            // 0x05E8 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA41_StaticMeshComponent0;            // 0x05F0 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA40_StaticMeshComponent0;            // 0x05F8 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA39_StaticMeshComponent0;            // 0x0600 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA38_StaticMeshComponent0;            // 0x0608 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA37_StaticMeshComponent0;            // 0x0610 (size: 0x8)
    class UStaticMeshComponent* UBeam_windowBoard_TwoRoundedWindows2_StaticMeshComponent0; // 0x0618 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA36_StaticMeshComponent0;            // 0x0620 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Narrow8_StaticMeshComponent0;              // 0x0628 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Narrow7_StaticMeshComponent0;              // 0x0630 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Narrow6_StaticMeshComponent0;              // 0x0638 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Narrow5_StaticMeshComponent0;              // 0x0640 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg42_StaticMeshComponent0;     // 0x0648 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg41_StaticMeshComponent0;     // 0x0650 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg40_StaticMeshComponent0;     // 0x0658 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg39_StaticMeshComponent0;     // 0x0660 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg38_StaticMeshComponent0;     // 0x0668 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg37_StaticMeshComponent0;     // 0x0670 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg36_StaticMeshComponent0;     // 0x0678 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_45_StaticMeshComponent0;               // 0x0680 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg35_StaticMeshComponent0;     // 0x0688 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg34_StaticMeshComponent0;     // 0x0690 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg33_StaticMeshComponent0;     // 0x0698 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg32_StaticMeshComponent0;     // 0x06A0 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg31_StaticMeshComponent0;     // 0x06A8 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg30_StaticMeshComponent0;     // 0x06B0 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg29_StaticMeshComponent0;     // 0x06B8 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg28_StaticMeshComponent0;     // 0x06C0 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg27_StaticMeshComponent0;     // 0x06C8 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_TwoWindowsStandard2_StaticMeshComponent0;  // 0x06D0 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg26_StaticMeshComponent0;     // 0x06D8 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg25_StaticMeshComponent0;     // 0x06E0 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg24_StaticMeshComponent0;     // 0x06E8 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg23_StaticMeshComponent0;     // 0x06F0 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg22_StaticMeshComponent0;     // 0x06F8 (size: 0x8)
    class UStaticMeshComponent* sg_ubeam_gable_planks_half4_StaticMeshComponent0;     // 0x0700 (size: 0x8)
    class UStaticMeshComponent* sg_ubeam_gable_planks_half3_StaticMeshComponent0;     // 0x0708 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_StandardSingleWindow2_StaticMeshComponent0; // 0x0710 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_TwoWindowsStandard_Wider2_StaticMeshComponent0; // 0x0718 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_44_StaticMeshComponent0;               // 0x0720 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_43_StaticMeshComponent0;               // 0x0728 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_42_StaticMeshComponent0;               // 0x0730 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_05_Curved_B6_StaticMeshComponent0;     // 0x0738 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_41_StaticMeshComponent0;               // 0x0740 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_40_StaticMeshComponent0;               // 0x0748 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_39_StaticMeshComponent0;               // 0x0750 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_38_StaticMeshComponent0;               // 0x0758 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_37_StaticMeshComponent0;               // 0x0760 (size: 0x8)
    class UStaticMeshComponent* UBeam_TaperedCutB42_StaticMeshComponent0;             // 0x0768 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_5_StaticMeshComponent0;                // 0x0770 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_36_StaticMeshComponent0;               // 0x0778 (size: 0x8)
    class UStaticMeshComponent* UBeam_TaperedCutB41_StaticMeshComponent0;             // 0x0780 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m203_StaticMeshComponent0;                // 0x0788 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m202_StaticMeshComponent0;                // 0x0790 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m201_StaticMeshComponent0;                // 0x0798 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m200_StaticMeshComponent0;                // 0x07A0 (size: 0x8)
    class UStaticMeshComponent* UBeam_TaperedCutB40_StaticMeshComponent0;             // 0x07A8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m199_StaticMeshComponent0;                // 0x07B0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m198_StaticMeshComponent0;                // 0x07B8 (size: 0x8)
    class UStaticMeshComponent* UBeam_TaperedCutB39_StaticMeshComponent0;             // 0x07C0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m197_StaticMeshComponent0;                // 0x07C8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m196_StaticMeshComponent0;                // 0x07D0 (size: 0x8)
    class UStaticMeshComponent* UBeam_TaperedCutB38_StaticMeshComponent0;             // 0x07D8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m195_StaticMeshComponent0;                // 0x07E0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m194_StaticMeshComponent0;                // 0x07E8 (size: 0x8)
    class UStaticMeshComponent* UBeam_TaperedCutB37_StaticMeshComponent0;             // 0x07F0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m193_StaticMeshComponent0;                // 0x07F8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m192_StaticMeshComponent0;                // 0x0800 (size: 0x8)
    class UStaticMeshComponent* UBeam_TaperedCutB36_StaticMeshComponent0;             // 0x0808 (size: 0x8)
    class UStaticMeshComponent* UBeam_TaperedCutB35_StaticMeshComponent0;             // 0x0810 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m191_StaticMeshComponent0;                // 0x0818 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m190_StaticMeshComponent0;                // 0x0820 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m189_StaticMeshComponent0;                // 0x0828 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m188_StaticMeshComponent0;                // 0x0830 (size: 0x8)
    class UStaticMeshComponent* UBeam_TaperedCutB34_StaticMeshComponent0;             // 0x0838 (size: 0x8)
    class UStaticMeshComponent* UBeam_TaperedCutB33_StaticMeshComponent0;             // 0x0840 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m187_StaticMeshComponent0;                // 0x0848 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m186_StaticMeshComponent0;                // 0x0850 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_4_StaticMeshComponent0;                // 0x0858 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_35_StaticMeshComponent0;               // 0x0860 (size: 0x8)
    class UStaticMeshComponent* UBeam_TaperedCutB32_StaticMeshComponent0;             // 0x0868 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m185_StaticMeshComponent0;                // 0x0870 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m184_StaticMeshComponent0;                // 0x0878 (size: 0x8)
    class UStaticMeshComponent* UBeam_TaperedCutB31_StaticMeshComponent0;             // 0x0880 (size: 0x8)
    class UStaticMeshComponent* UBeam_TaperedCutB30_StaticMeshComponent0;             // 0x0888 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m183_StaticMeshComponent0;                // 0x0890 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m182_StaticMeshComponent0;                // 0x0898 (size: 0x8)
    class UStaticMeshComponent* UBeam_TaperedCutB29_StaticMeshComponent0;             // 0x08A0 (size: 0x8)
    class UStaticMeshComponent* UBeam_TaperedCutB28_StaticMeshComponent0;             // 0x08A8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m181_StaticMeshComponent0;                // 0x08B0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m180_StaticMeshComponent0;                // 0x08B8 (size: 0x8)
    class UStaticMeshComponent* UBeam_TaperedCutB27_StaticMeshComponent0;             // 0x08C0 (size: 0x8)
    class UStaticMeshComponent* UBeam_TaperedCutB26_StaticMeshComponent0;             // 0x08C8 (size: 0x8)
    class UStaticMeshComponent* UBeam_TaperedCutB25_StaticMeshComponent0;             // 0x08D0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m179_StaticMeshComponent0;                // 0x08D8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m178_StaticMeshComponent0;                // 0x08E0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m177_StaticMeshComponent0;                // 0x08E8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m176_StaticMeshComponent0;                // 0x08F0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m175_StaticMeshComponent0;                // 0x08F8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m174_StaticMeshComponent0;                // 0x0900 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m173_StaticMeshComponent0;                // 0x0908 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m172_StaticMeshComponent0;                // 0x0910 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m171_StaticMeshComponent0;                // 0x0918 (size: 0x8)
    class UStaticMeshComponent* UBeam_TaperedCutB24_StaticMeshComponent0;             // 0x0920 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_05_Curved_B5_StaticMeshComponent0;     // 0x0928 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m170_StaticMeshComponent0;                // 0x0930 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m169_StaticMeshComponent0;                // 0x0938 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m168_StaticMeshComponent0;                // 0x0940 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m167_StaticMeshComponent0;                // 0x0948 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_34_StaticMeshComponent0;               // 0x0950 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_33_StaticMeshComponent0;               // 0x0958 (size: 0x8)
    class UStaticMeshComponent* UBeam_TaperedCutB23_StaticMeshComponent0;             // 0x0960 (size: 0x8)
    class UStaticMeshComponent* UBeam_TaperedCutB22_StaticMeshComponent0;             // 0x0968 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m166_StaticMeshComponent0;                // 0x0970 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m165_StaticMeshComponent0;                // 0x0978 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m164_StaticMeshComponent0;                // 0x0980 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m163_StaticMeshComponent0;                // 0x0988 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m162_StaticMeshComponent0;                // 0x0990 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m161_StaticMeshComponent0;                // 0x0998 (size: 0x8)
    class UStaticMeshComponent* UBeam_DoorHeadA2_StaticMeshComponent0;                // 0x09A0 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_32_StaticMeshComponent0;               // 0x09A8 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_31_StaticMeshComponent0;               // 0x09B0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m160_StaticMeshComponent0;                // 0x09B8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m159_StaticMeshComponent0;                // 0x09C0 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_30_StaticMeshComponent0;               // 0x09C8 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_29_StaticMeshComponent0;               // 0x09D0 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_28_StaticMeshComponent0;               // 0x09D8 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_27_StaticMeshComponent0;               // 0x09E0 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_26_StaticMeshComponent0;               // 0x09E8 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_05_Curved_B4_StaticMeshComponent0;     // 0x09F0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m158_StaticMeshComponent0;                // 0x09F8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m157_StaticMeshComponent0;                // 0x0A00 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m156_StaticMeshComponent0;                // 0x0A08 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m155_StaticMeshComponent0;                // 0x0A10 (size: 0x8)
    class UStaticMeshComponent* diagonal15_StaticMeshComponent0;                      // 0x0A18 (size: 0x8)
    class UStaticMeshComponent* diagonal14_StaticMeshComponent0;                      // 0x0A20 (size: 0x8)
    class UStaticMeshComponent* diagonal13_StaticMeshComponent0;                      // 0x0A28 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long_dialogonalD16_StaticMeshComponent0; // 0x0A30 (size: 0x8)
    class UStaticMeshComponent* diagonal12_StaticMeshComponent0;                      // 0x0A38 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long_dialogonalD15_StaticMeshComponent0; // 0x0A40 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long_dialogonalD14_StaticMeshComponent0; // 0x0A48 (size: 0x8)
    class UStaticMeshComponent* diagonal11_StaticMeshComponent0;                      // 0x0A50 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m154_StaticMeshComponent0;                // 0x0A58 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m153_StaticMeshComponent0;                // 0x0A60 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m152_StaticMeshComponent0;                // 0x0A68 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m90_StaticMeshComponent0;                 // 0x0A70 (size: 0x8)
    class UStaticMeshComponent* owidzThatch_halfHip3_StaticMeshComponent0;            // 0x0A78 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA35_StaticMeshComponent0;            // 0x0A80 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA34_StaticMeshComponent0;            // 0x0A88 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA33_StaticMeshComponent0;            // 0x0A90 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA32_StaticMeshComponent0;            // 0x0A98 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA31_StaticMeshComponent0;            // 0x0AA0 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA30_StaticMeshComponent0;            // 0x0AA8 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA29_StaticMeshComponent0;            // 0x0AB0 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA28_StaticMeshComponent0;            // 0x0AB8 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA27_StaticMeshComponent0;            // 0x0AC0 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA26_StaticMeshComponent0;            // 0x0AC8 (size: 0x8)
    class UStaticMeshComponent* WattleOwidzTriangle4_StaticMeshComponent0;            // 0x0AD0 (size: 0x8)
    class UStaticMeshComponent* WattleOwidzTriangle3_StaticMeshComponent0;            // 0x0AD8 (size: 0x8)
    class USceneComponent* SG_Cottage1_B3_DefaultSceneRoot;                           // 0x0AE0 (size: 0x8)

}; // Size: 0xAE8

#endif
