#ifndef UE4SS_SDK_C_SG_Forester_HPP
#define UE4SS_SDK_C_SG_Forester_HPP

class AC_SG_Forester_C : public AConstructionBP_C
{
    class UStaticMeshComponent* strut_short24_StaticMeshComponent0;                   // 0x0550 (size: 0x8)
    class UStaticMeshComponent* strut_short23_StaticMeshComponent0;                   // 0x0558 (size: 0x8)
    class UStaticMeshComponent* strut_short22_StaticMeshComponent0;                   // 0x0560 (size: 0x8)
    class UStaticMeshComponent* strut_short21_StaticMeshComponent0;                   // 0x0568 (size: 0x8)
    class UStaticMeshComponent* strut_short20_StaticMeshComponent0;                   // 0x0570 (size: 0x8)
    class UStaticMeshComponent* strut_short19_StaticMeshComponent0;                   // 0x0578 (size: 0x8)
    class UStaticMeshComponent* strut_short18_StaticMeshComponent0;                   // 0x0580 (size: 0x8)
    class UStaticMeshComponent* strut_short17_StaticMeshComponent0;                   // 0x0588 (size: 0x8)
    class UStaticMeshComponent* strut_short16_StaticMeshComponent0;                   // 0x0590 (size: 0x8)
    class UStaticMeshComponent* strut_short15_StaticMeshComponent0;                   // 0x0598 (size: 0x8)
    class UStaticMeshComponent* strut_short14_StaticMeshComponent0;                   // 0x05A0 (size: 0x8)
    class UStaticMeshComponent* strut_short13_StaticMeshComponent0;                   // 0x05A8 (size: 0x8)
    class UStaticMeshComponent* all_aboard_pivot_boardB6_StaticMeshComponent0;        // 0x05B0 (size: 0x8)
    class UStaticMeshComponent* all_aboard_pivot_boardB5_StaticMeshComponent0;        // 0x05B8 (size: 0x8)
    class UStaticMeshComponent* all_aboard_pivot_boardB4_StaticMeshComponent0;        // 0x05C0 (size: 0x8)
    class UStaticMeshComponent* hromada_hlina_01_30k_f8_StaticMeshComponent0;         // 0x05C8 (size: 0x8)
    class UStaticMeshComponent* hromada_hlina_01_30k_f7_StaticMeshComponent0;         // 0x05D0 (size: 0x8)
    class UStaticMeshComponent* hromada_hlina_01_30k_f6_StaticMeshComponent0;         // 0x05D8 (size: 0x8)
    class UStaticMeshComponent* hromada_hlina_01_30k_f5_StaticMeshComponent0;         // 0x05E0 (size: 0x8)
    class UStaticMeshComponent* LOG_V36_StaticMeshComponent0;                         // 0x05E8 (size: 0x8)
    class UStaticMeshComponent* LOG_V35_StaticMeshComponent0;                         // 0x05F0 (size: 0x8)
    class UStaticMeshComponent* LogWall_ExtractedLogA20_StaticMeshComponent0;         // 0x05F8 (size: 0x8)
    class UStaticMeshComponent* LogWall_ExtractedLogA19_StaticMeshComponent0;         // 0x0600 (size: 0x8)
    class UStaticMeshComponent* LogWall_ClippedSym6_StaticMeshComponent0;             // 0x0608 (size: 0x8)
    class UStaticMeshComponent* LOG_V34_StaticMeshComponent0;                         // 0x0610 (size: 0x8)
    class UStaticMeshComponent* LOG_V33_StaticMeshComponent0;                         // 0x0618 (size: 0x8)
    class UStaticMeshComponent* LogWall_ExtractedLogA18_StaticMeshComponent0;         // 0x0620 (size: 0x8)
    class UStaticMeshComponent* LogWall_ExtractedLogA17_StaticMeshComponent0;         // 0x0628 (size: 0x8)
    class UStaticMeshComponent* LogWall_ClippedSym5_StaticMeshComponent0;             // 0x0630 (size: 0x8)
    class UStaticMeshComponent* LOG_V32_StaticMeshComponent0;                         // 0x0638 (size: 0x8)
    class UStaticMeshComponent* LOG_V31_StaticMeshComponent0;                         // 0x0640 (size: 0x8)
    class UStaticMeshComponent* LogWall_ExtractedLogA16_StaticMeshComponent0;         // 0x0648 (size: 0x8)
    class UStaticMeshComponent* LogWall_ExtractedLogA15_StaticMeshComponent0;         // 0x0650 (size: 0x8)
    class UStaticMeshComponent* LogWall_ClippedSym4_StaticMeshComponent0;             // 0x0658 (size: 0x8)
    class UStaticMeshComponent* LogWall_ExtractedLogA14_StaticMeshComponent0;         // 0x0660 (size: 0x8)
    class UStaticMeshComponent* LOG_V30_StaticMeshComponent0;                         // 0x0668 (size: 0x8)
    class UStaticMeshComponent* LOG_V29_StaticMeshComponent0;                         // 0x0670 (size: 0x8)
    class UStaticMeshComponent* LOG_V28_StaticMeshComponent0;                         // 0x0678 (size: 0x8)
    class UStaticMeshComponent* LOG_V27_StaticMeshComponent0;                         // 0x0680 (size: 0x8)
    class UStaticMeshComponent* WALL_V13_StaticMeshComponent0;                        // 0x0688 (size: 0x8)
    class UStaticMeshComponent* LogWall_ExtractedLogA13_StaticMeshComponent0;         // 0x0690 (size: 0x8)
    class UStaticMeshComponent* LogWall_ExtractedLogA12_StaticMeshComponent0;         // 0x0698 (size: 0x8)
    class UStaticMeshComponent* LogWall_ExtractedLogA11_StaticMeshComponent0;         // 0x06A0 (size: 0x8)
    class UStaticMeshComponent* LOG_V26_StaticMeshComponent0;                         // 0x06A8 (size: 0x8)
    class UStaticMeshComponent* LOG_V25_StaticMeshComponent0;                         // 0x06B0 (size: 0x8)
    class UStaticMeshComponent* LOG_V24_StaticMeshComponent0;                         // 0x06B8 (size: 0x8)
    class UStaticMeshComponent* LOG_V23_StaticMeshComponent0;                         // 0x06C0 (size: 0x8)
    class UStaticMeshComponent* WALL_V12_StaticMeshComponent0;                        // 0x06C8 (size: 0x8)
    class UStaticMeshComponent* LOG_V22_StaticMeshComponent0;                         // 0x06D0 (size: 0x8)
    class UStaticMeshComponent* LOG_V21_StaticMeshComponent0;                         // 0x06D8 (size: 0x8)
    class UStaticMeshComponent* LOG_V20_StaticMeshComponent0;                         // 0x06E0 (size: 0x8)
    class UStaticMeshComponent* LOG_V19_StaticMeshComponent0;                         // 0x06E8 (size: 0x8)
    class UStaticMeshComponent* WALL_V9_StaticMeshComponent0;                         // 0x06F0 (size: 0x8)
    class UStaticMeshComponent* thatchForester2_StaticMeshComponent0;                 // 0x06F8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short79_StaticMeshComponent0;        // 0x0700 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short78_StaticMeshComponent0;        // 0x0708 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short77_StaticMeshComponent0;        // 0x0710 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short76_StaticMeshComponent0;        // 0x0718 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short75_StaticMeshComponent0;        // 0x0720 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed52_StaticMeshComponent0;           // 0x0728 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed51_StaticMeshComponent0;           // 0x0730 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed50_StaticMeshComponent0;           // 0x0738 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed49_StaticMeshComponent0;           // 0x0740 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed48_StaticMeshComponent0;           // 0x0748 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed47_StaticMeshComponent0;           // 0x0750 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed46_StaticMeshComponent0;           // 0x0758 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed45_StaticMeshComponent0;           // 0x0760 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed44_StaticMeshComponent0;           // 0x0768 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed43_StaticMeshComponent0;           // 0x0770 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed42_StaticMeshComponent0;           // 0x0778 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed41_StaticMeshComponent0;           // 0x0780 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed40_StaticMeshComponent0;           // 0x0788 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed39_StaticMeshComponent0;           // 0x0790 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed38_StaticMeshComponent0;           // 0x0798 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed37_StaticMeshComponent0;           // 0x07A0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m132_StaticMeshComponent0;                // 0x07A8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m131_StaticMeshComponent0;                // 0x07B0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m130_StaticMeshComponent0;                // 0x07B8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m129_StaticMeshComponent0;                // 0x07C0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m128_StaticMeshComponent0;                // 0x07C8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m127_StaticMeshComponent0;                // 0x07D0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m126_StaticMeshComponent0;                // 0x07D8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m125_StaticMeshComponent0;                // 0x07E0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m124_StaticMeshComponent0;                // 0x07E8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m123_StaticMeshComponent0;                // 0x07F0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m122_StaticMeshComponent0;                // 0x07F8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m121_StaticMeshComponent0;                // 0x0800 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m120_StaticMeshComponent0;                // 0x0808 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short74_StaticMeshComponent0;        // 0x0810 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed36_StaticMeshComponent0;           // 0x0818 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed35_StaticMeshComponent0;           // 0x0820 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed34_StaticMeshComponent0;           // 0x0828 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed33_StaticMeshComponent0;           // 0x0830 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed32_StaticMeshComponent0;           // 0x0838 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed31_StaticMeshComponent0;           // 0x0840 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed30_StaticMeshComponent0;           // 0x0848 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed29_StaticMeshComponent0;           // 0x0850 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed28_StaticMeshComponent0;           // 0x0858 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed27_StaticMeshComponent0;           // 0x0860 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardB_thin5_StaticMeshComponent0;           // 0x0868 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardB_thin3_StaticMeshComponent0;           // 0x0870 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m119_StaticMeshComponent0;                // 0x0878 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m118_StaticMeshComponent0;                // 0x0880 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short73_StaticMeshComponent0;        // 0x0888 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short72_StaticMeshComponent0;        // 0x0890 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short71_StaticMeshComponent0;        // 0x0898 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_19_StaticMeshComponent0; // 0x08A0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short70_StaticMeshComponent0;        // 0x08A8 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_18_StaticMeshComponent0; // 0x08B0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m117_StaticMeshComponent0;                // 0x08B8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m116_StaticMeshComponent0;                // 0x08C0 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_17_StaticMeshComponent0; // 0x08C8 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_16_StaticMeshComponent0; // 0x08D0 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_15_StaticMeshComponent0; // 0x08D8 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_14_StaticMeshComponent0; // 0x08E0 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_13_StaticMeshComponent0; // 0x08E8 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_12_StaticMeshComponent0; // 0x08F0 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_11_StaticMeshComponent0; // 0x08F8 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_10_StaticMeshComponent0; // 0x0900 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Tapered_CutE14_StaticMeshComponent0;        // 0x0908 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Tapered_CutE13_StaticMeshComponent0;        // 0x0910 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Tapered_CutE12_StaticMeshComponent0;        // 0x0918 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Tapered_CutE11_StaticMeshComponent0;        // 0x0920 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Tapered_CutE10_StaticMeshComponent0;        // 0x0928 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Tapered_CutE6_StaticMeshComponent0;         // 0x0930 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Tapered_CutE2_StaticMeshComponent0;         // 0x0938 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m103_StaticMeshComponent0;                // 0x0940 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m102_StaticMeshComponent0;                // 0x0948 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m100_StaticMeshComponent0;                // 0x0950 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short69_StaticMeshComponent0;        // 0x0958 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short68_StaticMeshComponent0;        // 0x0960 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short67_StaticMeshComponent0;        // 0x0968 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short66_StaticMeshComponent0;        // 0x0970 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short65_StaticMeshComponent0;        // 0x0978 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short64_StaticMeshComponent0;        // 0x0980 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short63_StaticMeshComponent0;        // 0x0988 (size: 0x8)
    class UStaticMeshComponent* foundationTiling_A_detailed18_StaticMeshComponent0;   // 0x0990 (size: 0x8)
    class UStaticMeshComponent* foundationTiling_A_detailed17_StaticMeshComponent0;   // 0x0998 (size: 0x8)
    class UStaticMeshComponent* foundationTiling_A_detailed16_StaticMeshComponent0;   // 0x09A0 (size: 0x8)
    class UStaticMeshComponent* foundationTiling_A_detailed15_StaticMeshComponent0;   // 0x09A8 (size: 0x8)
    class UStaticMeshComponent* foundationTiling_A_detailed14_StaticMeshComponent0;   // 0x09B0 (size: 0x8)
    class UStaticMeshComponent* foundationTiling_A_detailed13_StaticMeshComponent0;   // 0x09B8 (size: 0x8)
    class UStaticMeshComponent* foundationTiling_A_detailed12_StaticMeshComponent0;   // 0x09C0 (size: 0x8)
    class UStaticMeshComponent* foundationTiling_A_detailed11_StaticMeshComponent0;   // 0x09C8 (size: 0x8)
    class UStaticMeshComponent* foundationTiling_A_detailed10_StaticMeshComponent0;   // 0x09D0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly38_StaticMeshComponent0;    // 0x09D8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly37_StaticMeshComponent0;    // 0x09E0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly36_StaticMeshComponent0;    // 0x09E8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly35_StaticMeshComponent0;    // 0x09F0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly34_StaticMeshComponent0;    // 0x09F8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly33_StaticMeshComponent0;    // 0x0A00 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly32_StaticMeshComponent0;    // 0x0A08 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly31_StaticMeshComponent0;    // 0x0A10 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly30_StaticMeshComponent0;    // 0x0A18 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly29_StaticMeshComponent0;    // 0x0A20 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly28_StaticMeshComponent0;    // 0x0A28 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly27_StaticMeshComponent0;    // 0x0A30 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly26_StaticMeshComponent0;    // 0x0A38 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly25_StaticMeshComponent0;    // 0x0A40 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly24_StaticMeshComponent0;    // 0x0A48 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly23_StaticMeshComponent0;    // 0x0A50 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly22_StaticMeshComponent0;    // 0x0A58 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly21_StaticMeshComponent0;    // 0x0A60 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly20_StaticMeshComponent0;    // 0x0A68 (size: 0x8)
    class USceneComponent* Actor2_DefaultSceneRoot;                                   // 0x0A70 (size: 0x8)

}; // Size: 0xA78

#endif
