#ifndef UE4SS_SDK_C_SG_Smithy_HPP
#define UE4SS_SDK_C_SG_Smithy_HPP

class AC_SG_Smithy_C : public AConstructionBP_C
{
    class UStaticMeshComponent* PlaneDenseSmallSegmentNarrower8_StaticMeshComponent0; // 0x0550 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed42_StaticMeshComponent0;           // 0x0558 (size: 0x8)
    class UStaticMeshComponent* PlaneDenseSmallSegmentNarrower7_StaticMeshComponent0; // 0x0560 (size: 0x8)
    class UStaticMeshComponent* PlaneDenseSmallSegmentNarrower6_StaticMeshComponent0; // 0x0568 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed41_StaticMeshComponent0;           // 0x0570 (size: 0x8)
    class UStaticMeshComponent* PlaneDenseSmallSegmentNarrower5_StaticMeshComponent0; // 0x0578 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed40_StaticMeshComponent0;           // 0x0580 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed39_StaticMeshComponent0;           // 0x0588 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed38_StaticMeshComponent0;           // 0x0590 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed32_StaticMeshComponent0;           // 0x0598 (size: 0x8)
    class UStaticMeshComponent* sg_woodenGableA4_StaticMeshComponent0;                // 0x05A0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly31_StaticMeshComponent0;    // 0x05A8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly30_StaticMeshComponent0;    // 0x05B0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short29_StaticMeshComponent0;        // 0x05B8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short28_StaticMeshComponent0;        // 0x05C0 (size: 0x8)
    class UStaticMeshComponent* roofSingleDisplaced_cutdownTiny2_StaticMeshComponent0; // 0x05C8 (size: 0x8)
    class UStaticMeshComponent* roofSingleDisplaced4_StaticMeshComponent0;            // 0x05D0 (size: 0x8)
    class UStaticMeshComponent* roofSingleDisplaced3_StaticMeshComponent0;            // 0x05D8 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Tapered_CutB22_StaticMeshComponent0;        // 0x05E0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly29_StaticMeshComponent0;    // 0x05E8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly28_StaticMeshComponent0;    // 0x05F0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly27_StaticMeshComponent0;    // 0x05F8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly26_StaticMeshComponent0;    // 0x0600 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly25_StaticMeshComponent0;    // 0x0608 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly24_StaticMeshComponent0;    // 0x0610 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly23_StaticMeshComponent0;    // 0x0618 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly22_StaticMeshComponent0;    // 0x0620 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed24_StaticMeshComponent0;           // 0x0628 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed23_StaticMeshComponent0;           // 0x0630 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed22_StaticMeshComponent0;           // 0x0638 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed21_StaticMeshComponent0;           // 0x0640 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed20_StaticMeshComponent0;           // 0x0648 (size: 0x8)
    class UStaticMeshComponent* sg_woodenGableA3_StaticMeshComponent0;                // 0x0650 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed19_StaticMeshComponent0;           // 0x0658 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed18_StaticMeshComponent0;           // 0x0660 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_9_StaticMeshComponent0; // 0x0668 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_8_StaticMeshComponent0; // 0x0670 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short27_StaticMeshComponent0;        // 0x0678 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short26_StaticMeshComponent0;        // 0x0680 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Tapered_CutB21_StaticMeshComponent0;        // 0x0688 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth16_StaticMeshComponent0;           // 0x0690 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth15_StaticMeshComponent0;           // 0x0698 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Tapered_CutB20_StaticMeshComponent0;        // 0x06A0 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Tapered_CutB19_StaticMeshComponent0;        // 0x06A8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth14_StaticMeshComponent0;           // 0x06B0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth13_StaticMeshComponent0;           // 0x06B8 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Tapered_CutB18_StaticMeshComponent0;        // 0x06C0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth12_StaticMeshComponent0;           // 0x06C8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth11_StaticMeshComponent0;           // 0x06D0 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Tapered_CutB17_StaticMeshComponent0;        // 0x06D8 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_7_StaticMeshComponent0; // 0x06E0 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_6_StaticMeshComponent0; // 0x06E8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short25_StaticMeshComponent0;        // 0x06F0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short24_StaticMeshComponent0;        // 0x06F8 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Tapered_CutB16_StaticMeshComponent0;        // 0x0700 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth8_StaticMeshComponent0;            // 0x0708 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth7_StaticMeshComponent0;            // 0x0710 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Tapered_CutB15_StaticMeshComponent0;        // 0x0718 (size: 0x8)
    class UStaticMeshComponent* foundationTiling_A_detailed12_StaticMeshComponent0;   // 0x0720 (size: 0x8)
    class UStaticMeshComponent* foundationTiling_A_detailed11_StaticMeshComponent0;   // 0x0728 (size: 0x8)
    class UStaticMeshComponent* foundationTiling_A_detailed10_StaticMeshComponent0;   // 0x0730 (size: 0x8)
    class UStaticMeshComponent* foundationTiling_A_detailed9_StaticMeshComponent0;    // 0x0738 (size: 0x8)
    class UStaticMeshComponent* foundationTiling_A_detailed8_StaticMeshComponent0;    // 0x0740 (size: 0x8)
    class UStaticMeshComponent* foundationTiling_A_detailed7_StaticMeshComponent0;    // 0x0748 (size: 0x8)
    class USceneComponent* Actor4_DefaultSceneRoot;                                   // 0x0750 (size: 0x8)

}; // Size: 0x758

#endif
