#ifndef UE4SS_SDK_C_SG_Weaver_Workshop_HPP
#define UE4SS_SDK_C_SG_Weaver_Workshop_HPP

class AC_SG_Weaver_Workshop_C : public AConstructionBP_C
{
    class UStaticMeshComponent* palisade_strut16_StaticMeshComponent0;                // 0x0550 (size: 0x8)
    class UStaticMeshComponent* palisade_strut15_StaticMeshComponent0;                // 0x0558 (size: 0x8)
    class UStaticMeshComponent* palisade_strut14_StaticMeshComponent0;                // 0x0560 (size: 0x8)
    class UStaticMeshComponent* palisade_strut13_StaticMeshComponent0;                // 0x0568 (size: 0x8)
    class UStaticMeshComponent* palisade_strut12_StaticMeshComponent0;                // 0x0570 (size: 0x8)
    class UStaticMeshComponent* palisade_strut11_StaticMeshComponent0;                // 0x0578 (size: 0x8)
    class UStaticMeshComponent* palisade_strut10_StaticMeshComponent0;                // 0x0580 (size: 0x8)
    class UStaticMeshComponent* palisade_strut9_StaticMeshComponent0;                 // 0x0588 (size: 0x8)
    class UStaticMeshComponent* Aset_castle_wall_M_sdAta_LOD19_StaticMeshComponent0;  // 0x0590 (size: 0x8)
    class UStaticMeshComponent* Cube9_StaticMeshComponent0;                           // 0x0598 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise455_StaticMeshComponent0;              // 0x05A0 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise454_StaticMeshComponent0;              // 0x05A8 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise453_StaticMeshComponent0;              // 0x05B0 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise452_StaticMeshComponent0;              // 0x05B8 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise451_StaticMeshComponent0;              // 0x05C0 (size: 0x8)
    class UStaticMeshComponent* planeDenseBeveledA59_StaticMeshComponent0;            // 0x05C8 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise447_StaticMeshComponent0;              // 0x05D0 (size: 0x8)
    class UStaticMeshComponent* doorHeadA_angled6_StaticMeshComponent0;               // 0x05D8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m601_StaticMeshComponent0;                // 0x05E0 (size: 0x8)
    class UStaticMeshComponent* Aset_castle_wall_M_sdAta_LOD18_StaticMeshComponent0;  // 0x05E8 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise446_StaticMeshComponent0;              // 0x05F0 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise445_StaticMeshComponent0;              // 0x05F8 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise444_StaticMeshComponent0;              // 0x0600 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise443_StaticMeshComponent0;              // 0x0608 (size: 0x8)
    class UStaticMeshComponent* sg_thatch_square2_StaticMeshComponent0;               // 0x0610 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise442_StaticMeshComponent0;              // 0x0618 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise441_StaticMeshComponent0;              // 0x0620 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise440_StaticMeshComponent0;              // 0x0628 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise439_StaticMeshComponent0;              // 0x0630 (size: 0x8)
    class UStaticMeshComponent* planeDenseBeveledA58_StaticMeshComponent0;            // 0x0638 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m600_StaticMeshComponent0;                // 0x0640 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m599_StaticMeshComponent0;                // 0x0648 (size: 0x8)
    class UStaticMeshComponent* planeDenseBeveledA57_StaticMeshComponent0;            // 0x0650 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise438_StaticMeshComponent0;              // 0x0658 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise437_StaticMeshComponent0;              // 0x0660 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise436_StaticMeshComponent0;              // 0x0668 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise435_StaticMeshComponent0;              // 0x0670 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise434_StaticMeshComponent0;              // 0x0678 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise433_StaticMeshComponent0;              // 0x0680 (size: 0x8)
    class UStaticMeshComponent* planeDenseBeveledA56_StaticMeshComponent0;            // 0x0688 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise432_StaticMeshComponent0;              // 0x0690 (size: 0x8)
    class UStaticMeshComponent* doorHeadA_angled5_StaticMeshComponent0;               // 0x0698 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m598_StaticMeshComponent0;                // 0x06A0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m597_StaticMeshComponent0;                // 0x06A8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m596_StaticMeshComponent0;                // 0x06B0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m595_StaticMeshComponent0;                // 0x06B8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m594_StaticMeshComponent0;                // 0x06C0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m593_StaticMeshComponent0;                // 0x06C8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m592_StaticMeshComponent0;                // 0x06D0 (size: 0x8)
    class UStaticMeshComponent* pebbleWallDisplaced64_StaticMeshComponent0;           // 0x06D8 (size: 0x8)
    class UStaticMeshComponent* pebbleWallDisplaced63_StaticMeshComponent0;           // 0x06E0 (size: 0x8)
    class UStaticMeshComponent* pebbleWallDisplaced62_StaticMeshComponent0;           // 0x06E8 (size: 0x8)
    class UStaticMeshComponent* pebbleWallDisplaced61_StaticMeshComponent0;           // 0x06F0 (size: 0x8)
    class UStaticMeshComponent* pebbleWallDisplaced60_StaticMeshComponent0;           // 0x06F8 (size: 0x8)
    class UStaticMeshComponent* pebbleWallDisplaced59_StaticMeshComponent0;           // 0x0700 (size: 0x8)
    class UStaticMeshComponent* pebbleWallDisplaced58_StaticMeshComponent0;           // 0x0708 (size: 0x8)
    class UStaticMeshComponent* pebbleWallDisplaced57_StaticMeshComponent0;           // 0x0710 (size: 0x8)
    class USceneComponent* sg_weaver_workshop2_DefaultSceneRoot;                      // 0x0718 (size: 0x8)

}; // Size: 0x720

#endif
