#ifndef UE4SS_SDK_C_SG_Townhouse_LV3_E_Wide_HPP
#define UE4SS_SDK_C_SG_Townhouse_LV3_E_Wide_HPP

class AC_SG_Townhouse_LV3_E_Wide_C : public AConstructionBP_C
{
    class UStaticMeshComponent* foundations_townhouse_wide2_StaticMeshComponent0;     // 0x0550 (size: 0x8)
    class UStaticMeshComponent* WattleOwidzTriangle4_StaticMeshComponent0;            // 0x0558 (size: 0x8)
    class UStaticMeshComponent* WattleOwidzTriangle3_StaticMeshComponent0;            // 0x0560 (size: 0x8)
    class UStaticMeshComponent* ClayRoof_Townhouse_wide2_StaticMeshComponent0;        // 0x0568 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg340_StaticMeshComponent0;    // 0x0570 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg339_StaticMeshComponent0;    // 0x0578 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg338_StaticMeshComponent0;    // 0x0580 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg337_StaticMeshComponent0;    // 0x0588 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg336_StaticMeshComponent0;    // 0x0590 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg335_StaticMeshComponent0;    // 0x0598 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg334_StaticMeshComponent0;    // 0x05A0 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg333_StaticMeshComponent0;    // 0x05A8 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Standard102_StaticMeshComponent0;          // 0x05B0 (size: 0x8)
    class UStaticMeshComponent* megascansRoof_sculpted_tiny2_StaticMeshComponent0;    // 0x05B8 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardB18_StaticMeshComponent0;            // 0x05C0 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardB17_StaticMeshComponent0;            // 0x05C8 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardB16_StaticMeshComponent0;            // 0x05D0 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardB15_StaticMeshComponent0;            // 0x05D8 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardB14_StaticMeshComponent0;            // 0x05E0 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardB13_StaticMeshComponent0;            // 0x05E8 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardB12_StaticMeshComponent0;            // 0x05F0 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardB11_StaticMeshComponent0;            // 0x05F8 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardB10_StaticMeshComponent0;            // 0x0600 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_150_StaticMeshComponent0;              // 0x0608 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_149_StaticMeshComponent0;              // 0x0610 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_148_StaticMeshComponent0;              // 0x0618 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_147_StaticMeshComponent0;              // 0x0620 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_146_StaticMeshComponent0;              // 0x0628 (size: 0x8)
    class UStaticMeshComponent* sg_chimneyTop2_StaticMeshComponent0;                  // 0x0630 (size: 0x8)
    class UStaticMeshComponent* ChimneyLP2_StaticMeshComponent0;                      // 0x0638 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m136_StaticMeshComponent0;                  // 0x0640 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m135_StaticMeshComponent0;                  // 0x0648 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m134_StaticMeshComponent0;                  // 0x0650 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m133_StaticMeshComponent0;                  // 0x0658 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m132_StaticMeshComponent0;                  // 0x0660 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m131_StaticMeshComponent0;                  // 0x0668 (size: 0x8)
    class UStaticMeshComponent* UBeam_WindowFrame16_StaticMeshComponent0;             // 0x0670 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m130_StaticMeshComponent0;                  // 0x0678 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m129_StaticMeshComponent0;                  // 0x0680 (size: 0x8)
    class UStaticMeshComponent* UBeam_WindowFrame15_StaticMeshComponent0;             // 0x0688 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m128_StaticMeshComponent0;                  // 0x0690 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m127_StaticMeshComponent0;                  // 0x0698 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m126_StaticMeshComponent0;                  // 0x06A0 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m125_StaticMeshComponent0;                  // 0x06A8 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m124_StaticMeshComponent0;                  // 0x06B0 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m123_StaticMeshComponent0;                  // 0x06B8 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m122_StaticMeshComponent0;                  // 0x06C0 (size: 0x8)
    class UStaticMeshComponent* UBeam_WindowFrame14_StaticMeshComponent0;             // 0x06C8 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m121_StaticMeshComponent0;                  // 0x06D0 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m120_StaticMeshComponent0;                  // 0x06D8 (size: 0x8)
    class UStaticMeshComponent* UBeam_WindowFrame13_StaticMeshComponent0;             // 0x06E0 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m119_StaticMeshComponent0;                  // 0x06E8 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m118_StaticMeshComponent0;                  // 0x06F0 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m117_StaticMeshComponent0;                  // 0x06F8 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m116_StaticMeshComponent0;                  // 0x0700 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m115_StaticMeshComponent0;                  // 0x0708 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m114_StaticMeshComponent0;                  // 0x0710 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m113_StaticMeshComponent0;                  // 0x0718 (size: 0x8)
    class UStaticMeshComponent* UBeam_WindowFrame12_StaticMeshComponent0;             // 0x0720 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m112_StaticMeshComponent0;                  // 0x0728 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m111_StaticMeshComponent0;                  // 0x0730 (size: 0x8)
    class UStaticMeshComponent* UBeam_WindowFrame11_StaticMeshComponent0;             // 0x0738 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m110_StaticMeshComponent0;                  // 0x0740 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m109_StaticMeshComponent0;                  // 0x0748 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m108_StaticMeshComponent0;                  // 0x0750 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m107_StaticMeshComponent0;                  // 0x0758 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m106_StaticMeshComponent0;                  // 0x0760 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m105_StaticMeshComponent0;                  // 0x0768 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m104_StaticMeshComponent0;                  // 0x0770 (size: 0x8)
    class UStaticMeshComponent* UBeam_WindowFrame10_StaticMeshComponent0;             // 0x0778 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m103_StaticMeshComponent0;                  // 0x0780 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m102_StaticMeshComponent0;                  // 0x0788 (size: 0x8)
    class UStaticMeshComponent* UBeam_WindowFrame9_StaticMeshComponent0;              // 0x0790 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m101_StaticMeshComponent0;                  // 0x0798 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Standard101_StaticMeshComponent0;          // 0x07A0 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Standard100_StaticMeshComponent0;          // 0x07A8 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Standard99_StaticMeshComponent0;           // 0x07B0 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Standard98_StaticMeshComponent0;           // 0x07B8 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Standard97_StaticMeshComponent0;           // 0x07C0 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Standard96_StaticMeshComponent0;           // 0x07C8 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Standard95_StaticMeshComponent0;           // 0x07D0 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Standard94_StaticMeshComponent0;           // 0x07D8 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Standard93_StaticMeshComponent0;           // 0x07E0 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Standard92_StaticMeshComponent0;           // 0x07E8 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Standard91_StaticMeshComponent0;           // 0x07F0 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Standard90_StaticMeshComponent0;           // 0x07F8 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Standard89_StaticMeshComponent0;           // 0x0800 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Standard88_StaticMeshComponent0;           // 0x0808 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Standard87_StaticMeshComponent0;           // 0x0810 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Standard86_StaticMeshComponent0;           // 0x0818 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Standard85_StaticMeshComponent0;           // 0x0820 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Standard84_StaticMeshComponent0;           // 0x0828 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Standard83_StaticMeshComponent0;           // 0x0830 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Standard82_StaticMeshComponent0;           // 0x0838 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Standard81_StaticMeshComponent0;           // 0x0840 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Standard80_StaticMeshComponent0;           // 0x0848 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Standard79_StaticMeshComponent0;           // 0x0850 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Standard78_StaticMeshComponent0;           // 0x0858 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Standard77_StaticMeshComponent0;           // 0x0860 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Standard76_StaticMeshComponent0;           // 0x0868 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Standard75_StaticMeshComponent0;           // 0x0870 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Standard74_StaticMeshComponent0;           // 0x0878 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Standard73_StaticMeshComponent0;           // 0x0880 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m322_StaticMeshComponent0;                     // 0x0888 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m321_StaticMeshComponent0;                     // 0x0890 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m320_StaticMeshComponent0;                     // 0x0898 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m319_StaticMeshComponent0;                     // 0x08A0 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Standard72_StaticMeshComponent0;           // 0x08A8 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Standard71_StaticMeshComponent0;           // 0x08B0 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Standard70_StaticMeshComponent0;           // 0x08B8 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Standard69_StaticMeshComponent0;           // 0x08C0 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Standard68_StaticMeshComponent0;           // 0x08C8 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Standard67_StaticMeshComponent0;           // 0x08D0 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Standard66_StaticMeshComponent0;           // 0x08D8 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Standard65_StaticMeshComponent0;           // 0x08E0 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Standard64_StaticMeshComponent0;           // 0x08E8 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Standard63_StaticMeshComponent0;           // 0x08F0 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Standard62_StaticMeshComponent0;           // 0x08F8 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Standard61_StaticMeshComponent0;           // 0x0900 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Standard60_StaticMeshComponent0;           // 0x0908 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Standard59_StaticMeshComponent0;           // 0x0910 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Standard58_StaticMeshComponent0;           // 0x0918 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Standard57_StaticMeshComponent0;           // 0x0920 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Standard56_StaticMeshComponent0;           // 0x0928 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Standard55_StaticMeshComponent0;           // 0x0930 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Standard54_StaticMeshComponent0;           // 0x0938 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Standard40_StaticMeshComponent0;           // 0x0940 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Standard38_StaticMeshComponent0;           // 0x0948 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_145_StaticMeshComponent0;              // 0x0950 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_144_StaticMeshComponent0;              // 0x0958 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_143_StaticMeshComponent0;              // 0x0960 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_142_StaticMeshComponent0;              // 0x0968 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_141_StaticMeshComponent0;              // 0x0970 (size: 0x8)
    class UStaticMeshComponent* UBeam_WoodenBracketA8_StaticMeshComponent0;           // 0x0978 (size: 0x8)
    class UStaticMeshComponent* UBeam_WoodenBracketA7_StaticMeshComponent0;           // 0x0980 (size: 0x8)
    class UStaticMeshComponent* UBeam_WoodenBracketA6_StaticMeshComponent0;           // 0x0988 (size: 0x8)
    class UStaticMeshComponent* UBeam_WoodenBracketA5_StaticMeshComponent0;           // 0x0990 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg332_StaticMeshComponent0;    // 0x0998 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg331_StaticMeshComponent0;    // 0x09A0 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg330_StaticMeshComponent0;    // 0x09A8 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg329_StaticMeshComponent0;    // 0x09B0 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg328_StaticMeshComponent0;    // 0x09B8 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg327_StaticMeshComponent0;    // 0x09C0 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg326_StaticMeshComponent0;    // 0x09C8 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg325_StaticMeshComponent0;    // 0x09D0 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg324_StaticMeshComponent0;    // 0x09D8 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg323_StaticMeshComponent0;    // 0x09E0 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg322_StaticMeshComponent0;    // 0x09E8 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg321_StaticMeshComponent0;    // 0x09F0 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg320_StaticMeshComponent0;    // 0x09F8 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg319_StaticMeshComponent0;    // 0x0A00 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg318_StaticMeshComponent0;    // 0x0A08 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg317_StaticMeshComponent0;    // 0x0A10 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg316_StaticMeshComponent0;    // 0x0A18 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg315_StaticMeshComponent0;    // 0x0A20 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg314_StaticMeshComponent0;    // 0x0A28 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg313_StaticMeshComponent0;    // 0x0A30 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg312_StaticMeshComponent0;    // 0x0A38 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg311_StaticMeshComponent0;    // 0x0A40 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg310_StaticMeshComponent0;    // 0x0A48 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg309_StaticMeshComponent0;    // 0x0A50 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg308_StaticMeshComponent0;    // 0x0A58 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg307_StaticMeshComponent0;    // 0x0A60 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg306_StaticMeshComponent0;    // 0x0A68 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg305_StaticMeshComponent0;    // 0x0A70 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg304_StaticMeshComponent0;    // 0x0A78 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg303_StaticMeshComponent0;    // 0x0A80 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg302_StaticMeshComponent0;    // 0x0A88 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg301_StaticMeshComponent0;    // 0x0A90 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg300_StaticMeshComponent0;    // 0x0A98 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg299_StaticMeshComponent0;    // 0x0AA0 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg298_StaticMeshComponent0;    // 0x0AA8 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg297_StaticMeshComponent0;    // 0x0AB0 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg296_StaticMeshComponent0;    // 0x0AB8 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg295_StaticMeshComponent0;    // 0x0AC0 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg294_StaticMeshComponent0;    // 0x0AC8 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg293_StaticMeshComponent0;    // 0x0AD0 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg292_StaticMeshComponent0;    // 0x0AD8 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg291_StaticMeshComponent0;    // 0x0AE0 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg290_StaticMeshComponent0;    // 0x0AE8 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg289_StaticMeshComponent0;    // 0x0AF0 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg288_StaticMeshComponent0;    // 0x0AF8 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg287_StaticMeshComponent0;    // 0x0B00 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg286_StaticMeshComponent0;    // 0x0B08 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg285_StaticMeshComponent0;    // 0x0B10 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg284_StaticMeshComponent0;    // 0x0B18 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg283_StaticMeshComponent0;    // 0x0B20 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg282_StaticMeshComponent0;    // 0x0B28 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg281_StaticMeshComponent0;    // 0x0B30 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg280_StaticMeshComponent0;    // 0x0B38 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg279_StaticMeshComponent0;    // 0x0B40 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg278_StaticMeshComponent0;    // 0x0B48 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg277_StaticMeshComponent0;    // 0x0B50 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg276_StaticMeshComponent0;    // 0x0B58 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg275_StaticMeshComponent0;    // 0x0B60 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg274_StaticMeshComponent0;    // 0x0B68 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg273_StaticMeshComponent0;    // 0x0B70 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg272_StaticMeshComponent0;    // 0x0B78 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg271_StaticMeshComponent0;    // 0x0B80 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg270_StaticMeshComponent0;    // 0x0B88 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg269_StaticMeshComponent0;    // 0x0B90 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg268_StaticMeshComponent0;    // 0x0B98 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg267_StaticMeshComponent0;    // 0x0BA0 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg266_StaticMeshComponent0;    // 0x0BA8 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg265_StaticMeshComponent0;    // 0x0BB0 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg264_StaticMeshComponent0;    // 0x0BB8 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg263_StaticMeshComponent0;    // 0x0BC0 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg262_StaticMeshComponent0;    // 0x0BC8 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg261_StaticMeshComponent0;    // 0x0BD0 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg260_StaticMeshComponent0;    // 0x0BD8 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg259_StaticMeshComponent0;    // 0x0BE0 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg258_StaticMeshComponent0;    // 0x0BE8 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg257_StaticMeshComponent0;    // 0x0BF0 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg256_StaticMeshComponent0;    // 0x0BF8 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg255_StaticMeshComponent0;    // 0x0C00 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg254_StaticMeshComponent0;    // 0x0C08 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg253_StaticMeshComponent0;    // 0x0C10 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg252_StaticMeshComponent0;    // 0x0C18 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg251_StaticMeshComponent0;    // 0x0C20 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg250_StaticMeshComponent0;    // 0x0C28 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg249_StaticMeshComponent0;    // 0x0C30 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg248_StaticMeshComponent0;    // 0x0C38 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg247_StaticMeshComponent0;    // 0x0C40 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg246_StaticMeshComponent0;    // 0x0C48 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg245_StaticMeshComponent0;    // 0x0C50 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg244_StaticMeshComponent0;    // 0x0C58 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg243_StaticMeshComponent0;    // 0x0C60 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg242_StaticMeshComponent0;    // 0x0C68 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg241_StaticMeshComponent0;    // 0x0C70 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg240_StaticMeshComponent0;    // 0x0C78 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg239_StaticMeshComponent0;    // 0x0C80 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg238_StaticMeshComponent0;    // 0x0C88 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg237_StaticMeshComponent0;    // 0x0C90 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg236_StaticMeshComponent0;    // 0x0C98 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg235_StaticMeshComponent0;    // 0x0CA0 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg234_StaticMeshComponent0;    // 0x0CA8 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg233_StaticMeshComponent0;    // 0x0CB0 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg232_StaticMeshComponent0;    // 0x0CB8 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg231_StaticMeshComponent0;    // 0x0CC0 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg230_StaticMeshComponent0;    // 0x0CC8 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg229_StaticMeshComponent0;    // 0x0CD0 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg228_StaticMeshComponent0;    // 0x0CD8 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg227_StaticMeshComponent0;    // 0x0CE0 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg226_StaticMeshComponent0;    // 0x0CE8 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg225_StaticMeshComponent0;    // 0x0CF0 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg224_StaticMeshComponent0;    // 0x0CF8 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg223_StaticMeshComponent0;    // 0x0D00 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg222_StaticMeshComponent0;    // 0x0D08 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg221_StaticMeshComponent0;    // 0x0D10 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg220_StaticMeshComponent0;    // 0x0D18 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg219_StaticMeshComponent0;    // 0x0D20 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg218_StaticMeshComponent0;    // 0x0D28 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg217_StaticMeshComponent0;    // 0x0D30 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg216_StaticMeshComponent0;    // 0x0D38 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg215_StaticMeshComponent0;    // 0x0D40 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg214_StaticMeshComponent0;    // 0x0D48 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg213_StaticMeshComponent0;    // 0x0D50 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg212_StaticMeshComponent0;    // 0x0D58 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg211_StaticMeshComponent0;    // 0x0D60 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg210_StaticMeshComponent0;    // 0x0D68 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg209_StaticMeshComponent0;    // 0x0D70 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg208_StaticMeshComponent0;    // 0x0D78 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg207_StaticMeshComponent0;    // 0x0D80 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg206_StaticMeshComponent0;    // 0x0D88 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg205_StaticMeshComponent0;    // 0x0D90 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg204_StaticMeshComponent0;    // 0x0D98 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg203_StaticMeshComponent0;    // 0x0DA0 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg202_StaticMeshComponent0;    // 0x0DA8 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg201_StaticMeshComponent0;    // 0x0DB0 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg200_StaticMeshComponent0;    // 0x0DB8 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg199_StaticMeshComponent0;    // 0x0DC0 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg198_StaticMeshComponent0;    // 0x0DC8 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg197_StaticMeshComponent0;    // 0x0DD0 (size: 0x8)
    class UStaticMeshComponent* UBeam_Shutter28_StaticMeshComponent0;                 // 0x0DD8 (size: 0x8)
    class UStaticMeshComponent* UBeam_Shutter27_StaticMeshComponent0;                 // 0x0DE0 (size: 0x8)
    class UStaticMeshComponent* UBeam_Shutter26_StaticMeshComponent0;                 // 0x0DE8 (size: 0x8)
    class UStaticMeshComponent* UBeam_Shutter25_StaticMeshComponent0;                 // 0x0DF0 (size: 0x8)
    class UStaticMeshComponent* UBeam_Shutter24_StaticMeshComponent0;                 // 0x0DF8 (size: 0x8)
    class UStaticMeshComponent* UBeam_Shutter23_StaticMeshComponent0;                 // 0x0E00 (size: 0x8)
    class UStaticMeshComponent* UBeam_Shutter22_StaticMeshComponent0;                 // 0x0E08 (size: 0x8)
    class UStaticMeshComponent* UBeam_Shutter21_StaticMeshComponent0;                 // 0x0E10 (size: 0x8)
    class UStaticMeshComponent* UBeam_Shutter20_StaticMeshComponent0;                 // 0x0E18 (size: 0x8)
    class UStaticMeshComponent* UBeam_Shutter19_StaticMeshComponent0;                 // 0x0E20 (size: 0x8)
    class UStaticMeshComponent* UBeam_Shutter18_StaticMeshComponent0;                 // 0x0E28 (size: 0x8)
    class UStaticMeshComponent* UBeam_Shutter17_StaticMeshComponent0;                 // 0x0E30 (size: 0x8)
    class UStaticMeshComponent* UBeam_Shutter16_StaticMeshComponent0;                 // 0x0E38 (size: 0x8)
    class UStaticMeshComponent* UBeam_Shutter15_StaticMeshComponent0;                 // 0x0E40 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_SlitThinner10_StaticMeshComponent0;        // 0x0E48 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_SlitThinner9_StaticMeshComponent0;         // 0x0E50 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Narrow_Var35_StaticMeshComponent0;         // 0x0E58 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Corner16_StaticMeshComponent0;             // 0x0E60 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Corner15_StaticMeshComponent0;             // 0x0E68 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Corner14_StaticMeshComponent0;             // 0x0E70 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Corner13_StaticMeshComponent0;             // 0x0E78 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Corner12_StaticMeshComponent0;             // 0x0E80 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Corner11_StaticMeshComponent0;             // 0x0E88 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Corner10_StaticMeshComponent0;             // 0x0E90 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Corner9_StaticMeshComponent0;              // 0x0E98 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Narrow_Var34_StaticMeshComponent0;         // 0x0EA0 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Narrow_Var33_StaticMeshComponent0;         // 0x0EA8 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Narrow_Var32_StaticMeshComponent0;         // 0x0EB0 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Narrow_Var31_StaticMeshComponent0;         // 0x0EB8 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Narrow_Var30_StaticMeshComponent0;         // 0x0EC0 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Narrow_Var29_StaticMeshComponent0;         // 0x0EC8 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Narrow_Var28_StaticMeshComponent0;         // 0x0ED0 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Narrow_Var27_StaticMeshComponent0;         // 0x0ED8 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Narrow_Var26_StaticMeshComponent0;         // 0x0EE0 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Narrow2_StaticMeshComponent0;              // 0x0EE8 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_TwoWindowsStandard_Wide8_StaticMeshComponent0; // 0x0EF0 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_TwoWindowsStandard_Wide7_StaticMeshComponent0; // 0x0EF8 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_TwoWindowsStandard_Wide6_StaticMeshComponent0; // 0x0F00 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_StandardSingleWindow2_StaticMeshComponent0; // 0x0F08 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Narrow_Var25_StaticMeshComponent0;         // 0x0F10 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Narrow_Var24_StaticMeshComponent0;         // 0x0F18 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_SlitThinner8_StaticMeshComponent0;         // 0x0F20 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_SlitThinner7_StaticMeshComponent0;         // 0x0F28 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_SlitThinner6_StaticMeshComponent0;         // 0x0F30 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Narrow_Var23_StaticMeshComponent0;         // 0x0F38 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Narrow_Var22_StaticMeshComponent0;         // 0x0F40 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg196_StaticMeshComponent0;    // 0x0F48 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg195_StaticMeshComponent0;    // 0x0F50 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg194_StaticMeshComponent0;    // 0x0F58 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg193_StaticMeshComponent0;    // 0x0F60 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg192_StaticMeshComponent0;    // 0x0F68 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg191_StaticMeshComponent0;    // 0x0F70 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg190_StaticMeshComponent0;    // 0x0F78 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg189_StaticMeshComponent0;    // 0x0F80 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg188_StaticMeshComponent0;    // 0x0F88 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg187_StaticMeshComponent0;    // 0x0F90 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg186_StaticMeshComponent0;    // 0x0F98 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg185_StaticMeshComponent0;    // 0x0FA0 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg184_StaticMeshComponent0;    // 0x0FA8 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg183_StaticMeshComponent0;    // 0x0FB0 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg182_StaticMeshComponent0;    // 0x0FB8 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg181_StaticMeshComponent0;    // 0x0FC0 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg180_StaticMeshComponent0;    // 0x0FC8 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg179_StaticMeshComponent0;    // 0x0FD0 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg178_StaticMeshComponent0;    // 0x0FD8 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg137_StaticMeshComponent0;    // 0x0FE0 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg136_StaticMeshComponent0;    // 0x0FE8 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg133_StaticMeshComponent0;    // 0x0FF0 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg83_StaticMeshComponent0;     // 0x0FF8 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg82_StaticMeshComponent0;     // 0x1000 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg75_StaticMeshComponent0;     // 0x1008 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Slit2_StaticMeshComponent0;                // 0x1010 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Narrow_Var21_StaticMeshComponent0;         // 0x1018 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Slit_SmokeHole_LessWide2_StaticMeshComponent0; // 0x1020 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Narrow_Var20_StaticMeshComponent0;         // 0x1028 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Narrow_Var19_StaticMeshComponent0;         // 0x1030 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_TwoWindowsStandard_Wide5_StaticMeshComponent0; // 0x1038 (size: 0x8)
    class UStaticMeshComponent* SG_SmallGlassWindowB_Frame4_StaticMeshComponent0;     // 0x1040 (size: 0x8)
    class UStaticMeshComponent* SG_SmallGlassWindowB_Frame3_StaticMeshComponent0;     // 0x1048 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m100_StaticMeshComponent0;                  // 0x1050 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m318_StaticMeshComponent0;                     // 0x1058 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m317_StaticMeshComponent0;                     // 0x1060 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m99_StaticMeshComponent0;                   // 0x1068 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m316_StaticMeshComponent0;                     // 0x1070 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m315_StaticMeshComponent0;                     // 0x1078 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m314_StaticMeshComponent0;                     // 0x1080 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m313_StaticMeshComponent0;                     // 0x1088 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_140_StaticMeshComponent0;              // 0x1090 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m312_StaticMeshComponent0;                     // 0x1098 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m311_StaticMeshComponent0;                     // 0x10A0 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m98_StaticMeshComponent0;                   // 0x10A8 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m310_StaticMeshComponent0;                     // 0x10B0 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m309_StaticMeshComponent0;                     // 0x10B8 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m308_StaticMeshComponent0;                     // 0x10C0 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m97_StaticMeshComponent0;                   // 0x10C8 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m307_StaticMeshComponent0;                     // 0x10D0 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m96_StaticMeshComponent0;                   // 0x10D8 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m323_StaticMeshComponent0;                     // 0x10E0 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m305_StaticMeshComponent0;                     // 0x10E8 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m304_StaticMeshComponent0;                     // 0x10F0 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m303_StaticMeshComponent0;                     // 0x10F8 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m95_StaticMeshComponent0;                   // 0x1100 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m302_StaticMeshComponent0;                     // 0x1108 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m301_StaticMeshComponent0;                     // 0x1110 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m94_StaticMeshComponent0;                   // 0x1118 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m300_StaticMeshComponent0;                     // 0x1120 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m299_StaticMeshComponent0;                     // 0x1128 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m298_StaticMeshComponent0;                     // 0x1130 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_01_8_StaticMeshComponent0;             // 0x1138 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_01_7_StaticMeshComponent0;             // 0x1140 (size: 0x8)
    class UStaticMeshComponent* LevitatingOuthouse2_StaticMeshComponent0;             // 0x1148 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m93_StaticMeshComponent0;                   // 0x1150 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_139_StaticMeshComponent0;              // 0x1158 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m92_StaticMeshComponent0;                   // 0x1160 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m91_StaticMeshComponent0;                   // 0x1168 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m90_StaticMeshComponent0;                   // 0x1170 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m297_StaticMeshComponent0;                     // 0x1178 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_138_StaticMeshComponent0;              // 0x1180 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_137_StaticMeshComponent0;              // 0x1188 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_136_StaticMeshComponent0;              // 0x1190 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_135_StaticMeshComponent0;              // 0x1198 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_134_StaticMeshComponent0;              // 0x11A0 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_133_StaticMeshComponent0;              // 0x11A8 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_132_StaticMeshComponent0;              // 0x11B0 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_131_StaticMeshComponent0;              // 0x11B8 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_130_StaticMeshComponent0;              // 0x11C0 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_129_StaticMeshComponent0;              // 0x11C8 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_128_StaticMeshComponent0;              // 0x11D0 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_127_StaticMeshComponent0;              // 0x11D8 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_126_StaticMeshComponent0;              // 0x11E0 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_125_StaticMeshComponent0;              // 0x11E8 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_124_StaticMeshComponent0;              // 0x11F0 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_123_StaticMeshComponent0;              // 0x11F8 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_122_StaticMeshComponent0;              // 0x1200 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_121_StaticMeshComponent0;              // 0x1208 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_120_StaticMeshComponent0;              // 0x1210 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m296_StaticMeshComponent0;                     // 0x1218 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m89_StaticMeshComponent0;                   // 0x1220 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m295_StaticMeshComponent0;                     // 0x1228 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m294_StaticMeshComponent0;                     // 0x1230 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m88_StaticMeshComponent0;                   // 0x1238 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m293_StaticMeshComponent0;                     // 0x1240 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m292_StaticMeshComponent0;                     // 0x1248 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg70_StaticMeshComponent0;     // 0x1250 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_01_6_StaticMeshComponent0;             // 0x1258 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_01_5_StaticMeshComponent0;             // 0x1260 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m291_StaticMeshComponent0;                     // 0x1268 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m290_StaticMeshComponent0;                     // 0x1270 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m289_StaticMeshComponent0;                     // 0x1278 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m288_StaticMeshComponent0;                     // 0x1280 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m287_StaticMeshComponent0;                     // 0x1288 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m286_StaticMeshComponent0;                     // 0x1290 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m285_StaticMeshComponent0;                     // 0x1298 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m284_StaticMeshComponent0;                     // 0x12A0 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m283_StaticMeshComponent0;                     // 0x12A8 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m282_StaticMeshComponent0;                     // 0x12B0 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m281_StaticMeshComponent0;                     // 0x12B8 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m280_StaticMeshComponent0;                     // 0x12C0 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m279_StaticMeshComponent0;                     // 0x12C8 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m278_StaticMeshComponent0;                     // 0x12D0 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m277_StaticMeshComponent0;                     // 0x12D8 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m276_StaticMeshComponent0;                     // 0x12E0 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m275_StaticMeshComponent0;                     // 0x12E8 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m274_StaticMeshComponent0;                     // 0x12F0 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m273_StaticMeshComponent0;                     // 0x12F8 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m272_StaticMeshComponent0;                     // 0x1300 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m271_StaticMeshComponent0;                     // 0x1308 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m270_StaticMeshComponent0;                     // 0x1310 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m269_StaticMeshComponent0;                     // 0x1318 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m268_StaticMeshComponent0;                     // 0x1320 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m267_StaticMeshComponent0;                     // 0x1328 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m266_StaticMeshComponent0;                     // 0x1330 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m265_StaticMeshComponent0;                     // 0x1338 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m264_StaticMeshComponent0;                     // 0x1340 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m263_StaticMeshComponent0;                     // 0x1348 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m262_StaticMeshComponent0;                     // 0x1350 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m261_StaticMeshComponent0;                     // 0x1358 (size: 0x8)
    class UStaticMeshComponent* UBeam_TaperedCutB_ShorterEnds46_StaticMeshComponent0; // 0x1360 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m_ThinnerUV36_StaticMeshComponent0;            // 0x1368 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m_ThinnerUV35_StaticMeshComponent0;            // 0x1370 (size: 0x8)
    class UStaticMeshComponent* UBeam_TaperedCutB_ShorterEnds45_StaticMeshComponent0; // 0x1378 (size: 0x8)
    class UStaticMeshComponent* UBeam_TaperedCutB_ShorterEnds44_StaticMeshComponent0; // 0x1380 (size: 0x8)
    class UStaticMeshComponent* UBeam_TaperedCutB_ShorterEnds43_StaticMeshComponent0; // 0x1388 (size: 0x8)
    class UStaticMeshComponent* UBeam_TaperedCutB_ShorterEnds42_StaticMeshComponent0; // 0x1390 (size: 0x8)
    class UStaticMeshComponent* UBeam_TaperedCutB_ShorterEnds41_StaticMeshComponent0; // 0x1398 (size: 0x8)
    class UStaticMeshComponent* UBeam_TaperedCutB_ShorterEnds40_StaticMeshComponent0; // 0x13A0 (size: 0x8)
    class UStaticMeshComponent* UBeam_TaperedCutB_ShorterEnds39_StaticMeshComponent0; // 0x13A8 (size: 0x8)
    class UStaticMeshComponent* UBeam_TaperedCutB_ShorterEnds38_StaticMeshComponent0; // 0x13B0 (size: 0x8)
    class UStaticMeshComponent* UBeam_TaperedCutB_ShorterEnds37_StaticMeshComponent0; // 0x13B8 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m_ThinnerUV34_StaticMeshComponent0;            // 0x13C0 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m_ThinnerUV33_StaticMeshComponent0;            // 0x13C8 (size: 0x8)
    class UStaticMeshComponent* UBeam_TaperedCutB_ShorterEnds36_StaticMeshComponent0; // 0x13D0 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m_ThinnerUV32_StaticMeshComponent0;            // 0x13D8 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m_ThinnerUV31_StaticMeshComponent0;            // 0x13E0 (size: 0x8)
    class UStaticMeshComponent* UBeam_TaperedCutB_ShorterEnds35_StaticMeshComponent0; // 0x13E8 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m_ThinnerUV30_StaticMeshComponent0;            // 0x13F0 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m_ThinnerUV29_StaticMeshComponent0;            // 0x13F8 (size: 0x8)
    class UStaticMeshComponent* UBeam_TaperedCutB_ShorterEnds34_StaticMeshComponent0; // 0x1400 (size: 0x8)
    class UStaticMeshComponent* UBeam_TaperedCutB_ShorterEnds33_StaticMeshComponent0; // 0x1408 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m_ThinnerUV28_StaticMeshComponent0;            // 0x1410 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m_ThinnerUV27_StaticMeshComponent0;            // 0x1418 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m_ThinnerUV26_StaticMeshComponent0;            // 0x1420 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m_ThinnerUV25_StaticMeshComponent0;            // 0x1428 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m_ThinnerUV24_StaticMeshComponent0;            // 0x1430 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m_ThinnerUV23_StaticMeshComponent0;            // 0x1438 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m_ThinnerUV22_StaticMeshComponent0;            // 0x1440 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m_ThinnerUV21_StaticMeshComponent0;            // 0x1448 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m_ThinnerUV20_StaticMeshComponent0;            // 0x1450 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m_ThinnerUV19_StaticMeshComponent0;            // 0x1458 (size: 0x8)
    class UStaticMeshComponent* UBeam_TaperedCutB_ShorterEnds32_StaticMeshComponent0; // 0x1460 (size: 0x8)
    class UStaticMeshComponent* UBeam_TaperedCutB_ShorterEnds31_StaticMeshComponent0; // 0x1468 (size: 0x8)
    class UStaticMeshComponent* UBeam_TaperedCutB_ShorterEnds30_StaticMeshComponent0; // 0x1470 (size: 0x8)
    class UStaticMeshComponent* UBeam_TaperedCutB_ShorterEnds29_StaticMeshComponent0; // 0x1478 (size: 0x8)
    class UStaticMeshComponent* UBeam_TaperedCutB_ShorterEnds28_StaticMeshComponent0; // 0x1480 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m_ConnectorEnd100_StaticMeshComponent0;        // 0x1488 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m_ConnectorEnd99_StaticMeshComponent0;         // 0x1490 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m_ConnectorEnd98_StaticMeshComponent0;         // 0x1498 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m_ConnectorEnd97_StaticMeshComponent0;         // 0x14A0 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m_ConnectorEnd96_StaticMeshComponent0;         // 0x14A8 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m_ConnectorEnd95_StaticMeshComponent0;         // 0x14B0 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m_ConnectorEnd94_StaticMeshComponent0;         // 0x14B8 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m_ConnectorEnd93_StaticMeshComponent0;         // 0x14C0 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m_ConnectorEnd92_StaticMeshComponent0;         // 0x14C8 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m_ConnectorEnd91_StaticMeshComponent0;         // 0x14D0 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m_ConnectorEnd90_StaticMeshComponent0;         // 0x14D8 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m_ConnectorEnd89_StaticMeshComponent0;         // 0x14E0 (size: 0x8)
    class UStaticMeshComponent* UBeam_TaperedCutB_ShorterEnds27_StaticMeshComponent0; // 0x14E8 (size: 0x8)
    class UStaticMeshComponent* UBeam_TaperedCutB_ShorterEnds26_StaticMeshComponent0; // 0x14F0 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m260_StaticMeshComponent0;                     // 0x14F8 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m259_StaticMeshComponent0;                     // 0x1500 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m258_StaticMeshComponent0;                     // 0x1508 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m257_StaticMeshComponent0;                     // 0x1510 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m256_StaticMeshComponent0;                     // 0x1518 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m255_StaticMeshComponent0;                     // 0x1520 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m254_StaticMeshComponent0;                     // 0x1528 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m253_StaticMeshComponent0;                     // 0x1530 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m252_StaticMeshComponent0;                     // 0x1538 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m251_StaticMeshComponent0;                     // 0x1540 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m250_StaticMeshComponent0;                     // 0x1548 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m249_StaticMeshComponent0;                     // 0x1550 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_119_StaticMeshComponent0;              // 0x1558 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_118_StaticMeshComponent0;              // 0x1560 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_117_StaticMeshComponent0;              // 0x1568 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_116_StaticMeshComponent0;              // 0x1570 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m87_StaticMeshComponent0;                   // 0x1578 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m248_StaticMeshComponent0;                     // 0x1580 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m247_StaticMeshComponent0;                     // 0x1588 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m246_StaticMeshComponent0;                     // 0x1590 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m245_StaticMeshComponent0;                     // 0x1598 (size: 0x8)
    class UStaticMeshComponent* UBeam_TaperedCutB_ShorterEnds4_StaticMeshComponent0;  // 0x15A0 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m_ConnectorEnd88_StaticMeshComponent0;         // 0x15A8 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m_ConnectorEnd87_StaticMeshComponent0;         // 0x15B0 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m_ConnectorEnd86_StaticMeshComponent0;         // 0x15B8 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m_ConnectorEnd85_StaticMeshComponent0;         // 0x15C0 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m244_StaticMeshComponent0;                     // 0x15C8 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m243_StaticMeshComponent0;                     // 0x15D0 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m_ConnectorEnd84_StaticMeshComponent0;         // 0x15D8 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m_ConnectorEnd83_StaticMeshComponent0;         // 0x15E0 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m_ConnectorEnd82_StaticMeshComponent0;         // 0x15E8 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m_ConnectorEnd81_StaticMeshComponent0;         // 0x15F0 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m242_StaticMeshComponent0;                     // 0x15F8 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m241_StaticMeshComponent0;                     // 0x1600 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m240_StaticMeshComponent0;                     // 0x1608 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_115_StaticMeshComponent0;              // 0x1610 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_114_StaticMeshComponent0;              // 0x1618 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m239_StaticMeshComponent0;                     // 0x1620 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_113_StaticMeshComponent0;              // 0x1628 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_112_StaticMeshComponent0;              // 0x1630 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_111_StaticMeshComponent0;              // 0x1638 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_110_StaticMeshComponent0;              // 0x1640 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_109_StaticMeshComponent0;              // 0x1648 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m238_StaticMeshComponent0;                     // 0x1650 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_108_StaticMeshComponent0;              // 0x1658 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_107_StaticMeshComponent0;              // 0x1660 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_106_StaticMeshComponent0;              // 0x1668 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_105_StaticMeshComponent0;              // 0x1670 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_104_StaticMeshComponent0;              // 0x1678 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_103_StaticMeshComponent0;              // 0x1680 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_102_StaticMeshComponent0;              // 0x1688 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_101_StaticMeshComponent0;              // 0x1690 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m237_StaticMeshComponent0;                     // 0x1698 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_100_StaticMeshComponent0;              // 0x16A0 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_99_StaticMeshComponent0;               // 0x16A8 (size: 0x8)
    class UStaticMeshComponent* SG_SmallGlassWindowA14_StaticMeshComponent0;          // 0x16B0 (size: 0x8)
    class UStaticMeshComponent* SG_SmallGlassWindowA13_StaticMeshComponent0;          // 0x16B8 (size: 0x8)
    class UStaticMeshComponent* SG_SmallGlassWindowA12_StaticMeshComponent0;          // 0x16C0 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m86_StaticMeshComponent0;                   // 0x16C8 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m85_StaticMeshComponent0;                   // 0x16D0 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m84_StaticMeshComponent0;                   // 0x16D8 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m83_StaticMeshComponent0;                   // 0x16E0 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_98_StaticMeshComponent0;               // 0x16E8 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_97_StaticMeshComponent0;               // 0x16F0 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m236_StaticMeshComponent0;                     // 0x16F8 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m235_StaticMeshComponent0;                     // 0x1700 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_96_StaticMeshComponent0;               // 0x1708 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_95_StaticMeshComponent0;               // 0x1710 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_94_StaticMeshComponent0;               // 0x1718 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m82_StaticMeshComponent0;                   // 0x1720 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m234_StaticMeshComponent0;                     // 0x1728 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m233_StaticMeshComponent0;                     // 0x1730 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m81_StaticMeshComponent0;                   // 0x1738 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m232_StaticMeshComponent0;                     // 0x1740 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m231_StaticMeshComponent0;                     // 0x1748 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m80_StaticMeshComponent0;                   // 0x1750 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m230_StaticMeshComponent0;                     // 0x1758 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m79_StaticMeshComponent0;                   // 0x1760 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m229_StaticMeshComponent0;                     // 0x1768 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m78_StaticMeshComponent0;                   // 0x1770 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m228_StaticMeshComponent0;                     // 0x1778 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m227_StaticMeshComponent0;                     // 0x1780 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_93_StaticMeshComponent0;               // 0x1788 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_92_StaticMeshComponent0;               // 0x1790 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_91_StaticMeshComponent0;               // 0x1798 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_90_StaticMeshComponent0;               // 0x17A0 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_89_StaticMeshComponent0;               // 0x17A8 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_88_StaticMeshComponent0;               // 0x17B0 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m226_StaticMeshComponent0;                     // 0x17B8 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m225_StaticMeshComponent0;                     // 0x17C0 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m224_StaticMeshComponent0;                     // 0x17C8 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m223_StaticMeshComponent0;                     // 0x17D0 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m_ConnectorEnd80_StaticMeshComponent0;         // 0x17D8 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m_ConnectorEnd79_StaticMeshComponent0;         // 0x17E0 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m_ConnectorEnd78_StaticMeshComponent0;         // 0x17E8 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m_ConnectorEnd77_StaticMeshComponent0;         // 0x17F0 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m_ConnectorEnd76_StaticMeshComponent0;         // 0x17F8 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m_ConnectorEnd75_StaticMeshComponent0;         // 0x1800 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m222_StaticMeshComponent0;                     // 0x1808 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m221_StaticMeshComponent0;                     // 0x1810 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m220_StaticMeshComponent0;                     // 0x1818 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m219_StaticMeshComponent0;                     // 0x1820 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m218_StaticMeshComponent0;                     // 0x1828 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m217_StaticMeshComponent0;                     // 0x1830 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m77_StaticMeshComponent0;                   // 0x1838 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m216_StaticMeshComponent0;                     // 0x1840 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m215_StaticMeshComponent0;                     // 0x1848 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m76_StaticMeshComponent0;                   // 0x1850 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m214_StaticMeshComponent0;                     // 0x1858 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m213_StaticMeshComponent0;                     // 0x1860 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m75_StaticMeshComponent0;                   // 0x1868 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m74_StaticMeshComponent0;                   // 0x1870 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m212_StaticMeshComponent0;                     // 0x1878 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m211_StaticMeshComponent0;                     // 0x1880 (size: 0x8)
    class UStaticMeshComponent* SG_SmallGlassWindowA11_StaticMeshComponent0;          // 0x1888 (size: 0x8)
    class UStaticMeshComponent* SG_SmallGlassWindowA10_StaticMeshComponent0;          // 0x1890 (size: 0x8)
    class UStaticMeshComponent* SG_SmallGlassWindowA9_StaticMeshComponent0;           // 0x1898 (size: 0x8)
    class UStaticMeshComponent* SG_SmallGlassWindowA5_StaticMeshComponent0;           // 0x18A0 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m73_StaticMeshComponent0;                   // 0x18A8 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m72_StaticMeshComponent0;                   // 0x18B0 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m71_StaticMeshComponent0;                   // 0x18B8 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m70_StaticMeshComponent0;                   // 0x18C0 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m69_StaticMeshComponent0;                   // 0x18C8 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m_ConnectorEnd74_StaticMeshComponent0;         // 0x18D0 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m_ConnectorEnd73_StaticMeshComponent0;         // 0x18D8 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m_ConnectorEnd72_StaticMeshComponent0;         // 0x18E0 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m_ConnectorEnd71_StaticMeshComponent0;         // 0x18E8 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m_ConnectorEnd70_StaticMeshComponent0;         // 0x18F0 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m_ConnectorEnd69_StaticMeshComponent0;         // 0x18F8 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m210_StaticMeshComponent0;                     // 0x1900 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_87_StaticMeshComponent0;               // 0x1908 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_86_StaticMeshComponent0;               // 0x1910 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_85_StaticMeshComponent0;               // 0x1918 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_84_StaticMeshComponent0;               // 0x1920 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_83_StaticMeshComponent0;               // 0x1928 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_82_StaticMeshComponent0;               // 0x1930 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_81_StaticMeshComponent0;               // 0x1938 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_80_StaticMeshComponent0;               // 0x1940 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_79_StaticMeshComponent0;               // 0x1948 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_64_StaticMeshComponent0;               // 0x1950 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_58_StaticMeshComponent0;               // 0x1958 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_37_StaticMeshComponent0;               // 0x1960 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m209_StaticMeshComponent0;                     // 0x1968 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m208_StaticMeshComponent0;                     // 0x1970 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m207_StaticMeshComponent0;                     // 0x1978 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m206_StaticMeshComponent0;                     // 0x1980 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m_ConnectorEnd68_StaticMeshComponent0;         // 0x1988 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m_ConnectorEnd67_StaticMeshComponent0;         // 0x1990 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m_ConnectorEnd66_StaticMeshComponent0;         // 0x1998 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m_ConnectorEnd65_StaticMeshComponent0;         // 0x19A0 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m_ConnectorEnd64_StaticMeshComponent0;         // 0x19A8 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m_ConnectorEnd63_StaticMeshComponent0;         // 0x19B0 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m_ConnectorEnd62_StaticMeshComponent0;         // 0x19B8 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m_ConnectorEnd61_StaticMeshComponent0;         // 0x19C0 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m_ConnectorEnd60_StaticMeshComponent0;         // 0x19C8 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m_ConnectorEnd59_StaticMeshComponent0;         // 0x19D0 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m_ConnectorEnd58_StaticMeshComponent0;         // 0x19D8 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m_ConnectorEnd57_StaticMeshComponent0;         // 0x19E0 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m_ConnectorEnd56_StaticMeshComponent0;         // 0x19E8 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m_ConnectorEnd55_StaticMeshComponent0;         // 0x19F0 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m_ConnectorEnd54_StaticMeshComponent0;         // 0x19F8 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m_ConnectorEnd53_StaticMeshComponent0;         // 0x1A00 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m205_StaticMeshComponent0;                     // 0x1A08 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m204_StaticMeshComponent0;                     // 0x1A10 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m203_StaticMeshComponent0;                     // 0x1A18 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m202_StaticMeshComponent0;                     // 0x1A20 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m201_StaticMeshComponent0;                     // 0x1A28 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m200_StaticMeshComponent0;                     // 0x1A30 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m199_StaticMeshComponent0;                     // 0x1A38 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m198_StaticMeshComponent0;                     // 0x1A40 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m197_StaticMeshComponent0;                     // 0x1A48 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m196_StaticMeshComponent0;                     // 0x1A50 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m195_StaticMeshComponent0;                     // 0x1A58 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m194_StaticMeshComponent0;                     // 0x1A60 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m193_StaticMeshComponent0;                     // 0x1A68 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m192_StaticMeshComponent0;                     // 0x1A70 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m191_StaticMeshComponent0;                     // 0x1A78 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m190_StaticMeshComponent0;                     // 0x1A80 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m189_StaticMeshComponent0;                     // 0x1A88 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m188_StaticMeshComponent0;                     // 0x1A90 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m187_StaticMeshComponent0;                     // 0x1A98 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m186_StaticMeshComponent0;                     // 0x1AA0 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m185_StaticMeshComponent0;                     // 0x1AA8 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m184_StaticMeshComponent0;                     // 0x1AB0 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m183_StaticMeshComponent0;                     // 0x1AB8 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m182_StaticMeshComponent0;                     // 0x1AC0 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m181_StaticMeshComponent0;                     // 0x1AC8 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m180_StaticMeshComponent0;                     // 0x1AD0 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m179_StaticMeshComponent0;                     // 0x1AD8 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m178_StaticMeshComponent0;                     // 0x1AE0 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m177_StaticMeshComponent0;                     // 0x1AE8 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m176_StaticMeshComponent0;                     // 0x1AF0 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m175_StaticMeshComponent0;                     // 0x1AF8 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m174_StaticMeshComponent0;                     // 0x1B00 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m173_StaticMeshComponent0;                     // 0x1B08 (size: 0x8)
    class UStaticMeshComponent* J_SG_BaseTownhouseA2_StaticMeshComponent0;            // 0x1B10 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m172_StaticMeshComponent0;                     // 0x1B18 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m171_StaticMeshComponent0;                     // 0x1B20 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m170_StaticMeshComponent0;                     // 0x1B28 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m169_StaticMeshComponent0;                     // 0x1B30 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m168_StaticMeshComponent0;                     // 0x1B38 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m167_StaticMeshComponent0;                     // 0x1B40 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m166_StaticMeshComponent0;                     // 0x1B48 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m165_StaticMeshComponent0;                     // 0x1B50 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m_ConnectorEnd52_StaticMeshComponent0;         // 0x1B58 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m_ConnectorEnd51_StaticMeshComponent0;         // 0x1B60 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m164_StaticMeshComponent0;                     // 0x1B68 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m163_StaticMeshComponent0;                     // 0x1B70 (size: 0x8)
    class UStaticMeshComponent* Cube24_StaticMeshComponent0;                          // 0x1B78 (size: 0x8)
    class UStaticMeshComponent* Cube23_StaticMeshComponent0;                          // 0x1B80 (size: 0x8)
    class UStaticMeshComponent* Cube22_StaticMeshComponent0;                          // 0x1B88 (size: 0x8)
    class UStaticMeshComponent* Cube21_StaticMeshComponent0;                          // 0x1B90 (size: 0x8)
    class UStaticMeshComponent* Cube20_StaticMeshComponent0;                          // 0x1B98 (size: 0x8)
    class UStaticMeshComponent* Cube19_StaticMeshComponent0;                          // 0x1BA0 (size: 0x8)
    class UStaticMeshComponent* Cube18_StaticMeshComponent0;                          // 0x1BA8 (size: 0x8)
    class UStaticMeshComponent* Cube17_StaticMeshComponent0;                          // 0x1BB0 (size: 0x8)
    class UStaticMeshComponent* Cube16_StaticMeshComponent0;                          // 0x1BB8 (size: 0x8)
    class UStaticMeshComponent* Cube15_StaticMeshComponent0;                          // 0x1BC0 (size: 0x8)
    class UStaticMeshComponent* Cube14_StaticMeshComponent0;                          // 0x1BC8 (size: 0x8)
    class UStaticMeshComponent* Cube13_StaticMeshComponent0;                          // 0x1BD0 (size: 0x8)
    class UStaticMeshComponent* SG_stoneWindow2_Luv_centered2_StaticMeshComponent0;   // 0x1BD8 (size: 0x8)
    class UStaticMeshComponent* SG_CurbA26_StaticMeshComponent0;                      // 0x1BE0 (size: 0x8)
    class UStaticMeshComponent* SG_CurbA25_StaticMeshComponent0;                      // 0x1BE8 (size: 0x8)
    class UStaticMeshComponent* SG_CurbA24_StaticMeshComponent0;                      // 0x1BF0 (size: 0x8)
    class UStaticMeshComponent* SG_CurbA23_StaticMeshComponent0;                      // 0x1BF8 (size: 0x8)
    class UStaticMeshComponent* SG_CurbA22_StaticMeshComponent0;                      // 0x1C00 (size: 0x8)
    class UStaticMeshComponent* SG_CurbA21_StaticMeshComponent0;                      // 0x1C08 (size: 0x8)
    class UStaticMeshComponent* SG_CurbA20_StaticMeshComponent0;                      // 0x1C10 (size: 0x8)
    class UStaticMeshComponent* SG_CurbA19_StaticMeshComponent0;                      // 0x1C18 (size: 0x8)
    class UStaticMeshComponent* SG_CurbA18_StaticMeshComponent0;                      // 0x1C20 (size: 0x8)
    class UStaticMeshComponent* SG_CurbA17_StaticMeshComponent0;                      // 0x1C28 (size: 0x8)
    class UStaticMeshComponent* SG_CurbA16_StaticMeshComponent0;                      // 0x1C30 (size: 0x8)
    class UStaticMeshComponent* SG_CurbA15_StaticMeshComponent0;                      // 0x1C38 (size: 0x8)
    class UStaticMeshComponent* SG_CurbA14_StaticMeshComponent0;                      // 0x1C40 (size: 0x8)
    class UStaticMeshComponent* Aset_castle_wall_M_sdAta_LOD6_StaticMeshComponent0;   // 0x1C48 (size: 0x8)
    class UStaticMeshComponent* J_SG_WoodenDoorA3_StaticMeshComponent0;               // 0x1C50 (size: 0x8)
    class UStaticMeshComponent* StoneGateArch_LUV_SuppEdgesResym2_StaticMeshComponent0; // 0x1C58 (size: 0x8)
    class UStaticMeshComponent* J_SG_StoneWindow3_Luv4_StaticMeshComponent0;          // 0x1C60 (size: 0x8)
    class UStaticMeshComponent* J_SG_StoneWindow3_Luv3_StaticMeshComponent0;          // 0x1C68 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m324_StaticMeshComponent0;                     // 0x1C70 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m306_StaticMeshComponent0;                     // 0x1C78 (size: 0x8)
    class USceneComponent* Scene;                                                     // 0x1C80 (size: 0x8)
    class USceneComponent* townhouse_lv3_wide2_DefaultSceneRoot;                      // 0x1C88 (size: 0x8)

}; // Size: 0x1C90

#endif
