#ifndef UE4SS_SDK_C_SG_Windmill_Base_HPP
#define UE4SS_SDK_C_SG_Windmill_Base_HPP

class AC_SG_Windmill_Base_C : public AConstructionBP_C
{
    class UStaticMeshComponent* Cube4;                                                // 0x0550 (size: 0x8)
    class UStaticMeshComponent* Cube3;                                                // 0x0558 (size: 0x8)
    class UStaticMeshComponent* Cube2;                                                // 0x0560 (size: 0x8)
    class UStaticMeshComponent* Cube1;                                                // 0x0568 (size: 0x8)
    class UStaticMeshComponent* UBeam_PivotShort9_StaticMeshComponent0;               // 0x0570 (size: 0x8)
    class UStaticMeshComponent* UBeam_PivotShort10_StaticMeshComponent0;              // 0x0578 (size: 0x8)
    class UStaticMeshComponent* UBeam_PivotShort11_StaticMeshComponent0;              // 0x0580 (size: 0x8)
    class UStaticMeshComponent* UBeam_PivotShort12_StaticMeshComponent0;              // 0x0588 (size: 0x8)
    class UStaticMeshComponent* UBeam_PivotShort13_StaticMeshComponent0;              // 0x0590 (size: 0x8)
    class UStaticMeshComponent* UBeam_PivotShort14_StaticMeshComponent0;              // 0x0598 (size: 0x8)
    class UStaticMeshComponent* UBeam_PivotShort15_StaticMeshComponent0;              // 0x05A0 (size: 0x8)
    class USceneComponent* SG_WindmillBase2_DefaultSceneRoot;                         // 0x05A8 (size: 0x8)

}; // Size: 0x5B0

#endif
