#ifndef UE4SS_SDK_C_SG_PithouseA_HPP
#define UE4SS_SDK_C_SG_PithouseA_HPP

class AC_SG_PithouseA_C : public AConstructionBP_C
{
    class UStaticMeshComponent* PlaneDenseCorner9_StaticMeshComponent0;               // 0x0550 (size: 0x8)
    class UStaticMeshComponent* planeDenseTopBevel4_StaticMeshComponent0;             // 0x0558 (size: 0x8)
    class UStaticMeshComponent* PlaneDenseCorner8_StaticMeshComponent0;               // 0x0560 (size: 0x8)
    class UStaticMeshComponent* planeDenseTopBevel3_StaticMeshComponent0;             // 0x0568 (size: 0x8)
    class UStaticMeshComponent* PlaneDenseCorner7_StaticMeshComponent0;               // 0x0570 (size: 0x8)
    class UStaticMeshComponent* PlaneDenseCorner6_StaticMeshComponent0;               // 0x0578 (size: 0x8)
    class UStaticMeshComponent* owidzThatch_luv_packedCentered5_StaticMeshComponent0; // 0x0580 (size: 0x8)
    class UStaticMeshComponent* owidzThatch_luv_packedCentered4_StaticMeshComponent0; // 0x0588 (size: 0x8)
    class UStaticMeshComponent* ropeKnotA8_StaticMeshComponent0;                      // 0x0590 (size: 0x8)
    class UStaticMeshComponent* ropeKnotA7_StaticMeshComponent0;                      // 0x0598 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed61_StaticMeshComponent0;           // 0x05A0 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed60_StaticMeshComponent0;           // 0x05A8 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed59_StaticMeshComponent0;           // 0x05B0 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed58_StaticMeshComponent0;           // 0x05B8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly16_StaticMeshComponent0;    // 0x05C0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly15_StaticMeshComponent0;    // 0x05C8 (size: 0x8)
    class UStaticMeshComponent* all_aboard_pivot_boardB12_StaticMeshComponent0;       // 0x05D0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly14_StaticMeshComponent0;    // 0x05D8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly13_StaticMeshComponent0;    // 0x05E0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly12_StaticMeshComponent0;    // 0x05E8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly11_StaticMeshComponent0;    // 0x05F0 (size: 0x8)
    class UStaticMeshComponent* all_aboard_pivot_boardB11_StaticMeshComponent0;       // 0x05F8 (size: 0x8)
    class UStaticMeshComponent* all_aboard_pivot_boardB10_StaticMeshComponent0;       // 0x0600 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed57_StaticMeshComponent0;           // 0x0608 (size: 0x8)
    class UStaticMeshComponent* all_aboard_pivot_boardB9_StaticMeshComponent0;        // 0x0610 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed56_StaticMeshComponent0;           // 0x0618 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed55_StaticMeshComponent0;           // 0x0620 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed54_StaticMeshComponent0;           // 0x0628 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed53_StaticMeshComponent0;           // 0x0630 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed52_StaticMeshComponent0;           // 0x0638 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed51_StaticMeshComponent0;           // 0x0640 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed50_StaticMeshComponent0;           // 0x0648 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed49_StaticMeshComponent0;           // 0x0650 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed48_StaticMeshComponent0;           // 0x0658 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed47_StaticMeshComponent0;           // 0x0660 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed46_StaticMeshComponent0;           // 0x0668 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed45_StaticMeshComponent0;           // 0x0670 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed44_StaticMeshComponent0;           // 0x0678 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed43_StaticMeshComponent0;           // 0x0680 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed42_StaticMeshComponent0;           // 0x0688 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed41_StaticMeshComponent0;           // 0x0690 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed40_StaticMeshComponent0;           // 0x0698 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed39_StaticMeshComponent0;           // 0x06A0 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed38_StaticMeshComponent0;           // 0x06A8 (size: 0x8)
    class USceneComponent* sg_PithouseA2_DefaultSceneRoot;                            // 0x06B0 (size: 0x8)

}; // Size: 0x6B8

#endif
