#ifndef UE4SS_SDK_C_SG_Townhouse_Lv3_B_HPP
#define UE4SS_SDK_C_SG_Townhouse_Lv3_B_HPP

class AC_SG_Townhouse_Lv3_B_C : public AConstructionBP_C
{
    class UStaticMeshComponent* roofWoodShed2_StaticMeshComponent0;                   // 0x0550 (size: 0x8)
    class UStaticMeshComponent* ClayRoofTownhouse_LV3_B2_StaticMeshComponent0;        // 0x0558 (size: 0x8)
    class UStaticMeshComponent* planeDenseBeveledA42_StaticMeshComponent0;            // 0x0560 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_TwoWindowsStandard_Wider58_StaticMeshComponent0; // 0x0568 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_TwoWindowsStandard_Wider57_StaticMeshComponent0; // 0x0570 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_TwoWindowsStandard_Wider56_StaticMeshComponent0; // 0x0578 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_TwoWindowsStandard_Wider55_StaticMeshComponent0; // 0x0580 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_TwoWindowsStandard_Wider54_StaticMeshComponent0; // 0x0588 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_TwoWindowsStandard_Wider53_StaticMeshComponent0; // 0x0590 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_TwoWindowsStandard_Wider52_StaticMeshComponent0; // 0x0598 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_TwoWindowsStandard_Wider51_StaticMeshComponent0; // 0x05A0 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_TwoWindowsStandard_Wider50_StaticMeshComponent0; // 0x05A8 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_TwoWindowsStandard_Wider49_StaticMeshComponent0; // 0x05B0 (size: 0x8)
    class UStaticMeshComponent* planeDenseBeveledA41_StaticMeshComponent0;            // 0x05B8 (size: 0x8)
    class UStaticMeshComponent* planeDenseBeveledA40_StaticMeshComponent0;            // 0x05C0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m172_StaticMeshComponent0;                // 0x05C8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m171_StaticMeshComponent0;                // 0x05D0 (size: 0x8)
    class UStaticMeshComponent* planeDenseBeveledA39_StaticMeshComponent0;            // 0x05D8 (size: 0x8)
    class UStaticMeshComponent* planeDenseBeveledA38_StaticMeshComponent0;            // 0x05E0 (size: 0x8)
    class UStaticMeshComponent* planeDenseBeveledA37_StaticMeshComponent0;            // 0x05E8 (size: 0x8)
    class UStaticMeshComponent* planeDenseBeveledA36_StaticMeshComponent0;            // 0x05F0 (size: 0x8)
    class UStaticMeshComponent* planeDenseBeveledA35_StaticMeshComponent0;            // 0x05F8 (size: 0x8)
    class UStaticMeshComponent* planeDenseBeveledA34_StaticMeshComponent0;            // 0x0600 (size: 0x8)
    class UStaticMeshComponent* planeDenseBeveledA33_StaticMeshComponent0;            // 0x0608 (size: 0x8)
    class UStaticMeshComponent* planeDenseBeveledA32_StaticMeshComponent0;            // 0x0610 (size: 0x8)
    class UStaticMeshComponent* planeDenseBeveledA31_StaticMeshComponent0;            // 0x0618 (size: 0x8)
    class UStaticMeshComponent* planeDenseBeveledA30_StaticMeshComponent0;            // 0x0620 (size: 0x8)
    class UStaticMeshComponent* planeDenseBeveledA29_StaticMeshComponent0;            // 0x0628 (size: 0x8)
    class UStaticMeshComponent* planeDenseBeveledA28_StaticMeshComponent0;            // 0x0630 (size: 0x8)
    class UStaticMeshComponent* planeDenseBeveledA27_StaticMeshComponent0;            // 0x0638 (size: 0x8)
    class UStaticMeshComponent* planeDenseBeveledA26_StaticMeshComponent0;            // 0x0640 (size: 0x8)
    class UStaticMeshComponent* planeDenseBeveledA25_StaticMeshComponent0;            // 0x0648 (size: 0x8)
    class UStaticMeshComponent* planeDenseBeveledA24_StaticMeshComponent0;            // 0x0650 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Tapered_CutB30_StaticMeshComponent0;        // 0x0658 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m170_StaticMeshComponent0;                // 0x0660 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m169_StaticMeshComponent0;                // 0x0668 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_TwoWindowsStandard_Wider48_StaticMeshComponent0; // 0x0670 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_TwoWindowsStandard_Wider47_StaticMeshComponent0; // 0x0678 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_TwoWindowsStandard_Wider46_StaticMeshComponent0; // 0x0680 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_TwoWindowsStandard_Wider45_StaticMeshComponent0; // 0x0688 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_TwoWindowsStandard_Wider44_StaticMeshComponent0; // 0x0690 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_TwoWindowsStandard_Wider43_StaticMeshComponent0; // 0x0698 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_TwoWindowsStandard_Wider42_StaticMeshComponent0; // 0x06A0 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_TwoWindowsStandard_Wider41_StaticMeshComponent0; // 0x06A8 (size: 0x8)
    class UStaticMeshComponent* interior4_StaticMeshComponent0;                       // 0x06B0 (size: 0x8)
    class UStaticMeshComponent* interior3_StaticMeshComponent0;                       // 0x06B8 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_TwoWindowsStandard_Wider40_StaticMeshComponent0; // 0x06C0 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_TwoWindowsStandard_Wider39_StaticMeshComponent0; // 0x06C8 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_TwoWindowsStandard_Wider38_StaticMeshComponent0; // 0x06D0 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_TwoWindowsStandard_Wider37_StaticMeshComponent0; // 0x06D8 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_TwoWindowsStandard_Wider36_StaticMeshComponent0; // 0x06E0 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Tapered_CutB29_StaticMeshComponent0;        // 0x06E8 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_136_StaticMeshComponent0; // 0x06F0 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_135_StaticMeshComponent0; // 0x06F8 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_134_StaticMeshComponent0; // 0x0700 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_133_StaticMeshComponent0; // 0x0708 (size: 0x8)
    class UStaticMeshComponent* PlaneDenseCorner12_StaticMeshComponent0;              // 0x0710 (size: 0x8)
    class UStaticMeshComponent* PlaneDenseCorner11_StaticMeshComponent0;              // 0x0718 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_132_StaticMeshComponent0; // 0x0720 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_131_StaticMeshComponent0; // 0x0728 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_130_StaticMeshComponent0; // 0x0730 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_129_StaticMeshComponent0; // 0x0738 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_128_StaticMeshComponent0; // 0x0740 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_127_StaticMeshComponent0; // 0x0748 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_126_StaticMeshComponent0; // 0x0750 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_125_StaticMeshComponent0; // 0x0758 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_124_StaticMeshComponent0; // 0x0760 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_123_StaticMeshComponent0; // 0x0768 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_122_StaticMeshComponent0; // 0x0770 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_121_StaticMeshComponent0; // 0x0778 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_120_StaticMeshComponent0; // 0x0780 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_119_StaticMeshComponent0; // 0x0788 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m168_StaticMeshComponent0;                // 0x0790 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_118_StaticMeshComponent0; // 0x0798 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_117_StaticMeshComponent0; // 0x07A0 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_116_StaticMeshComponent0; // 0x07A8 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_2_StaticMeshComponent0; // 0x07B0 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_115_StaticMeshComponent0; // 0x07B8 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_114_StaticMeshComponent0; // 0x07C0 (size: 0x8)
    class UStaticMeshComponent* SG_SmallGlassWindowA11_StaticMeshComponent0;          // 0x07C8 (size: 0x8)
    class UStaticMeshComponent* SG_SmallGlassWindowA10_StaticMeshComponent0;          // 0x07D0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m167_StaticMeshComponent0;                // 0x07D8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m166_StaticMeshComponent0;                // 0x07E0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m165_StaticMeshComponent0;                // 0x07E8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m164_StaticMeshComponent0;                // 0x07F0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m163_StaticMeshComponent0;                // 0x07F8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m162_StaticMeshComponent0;                // 0x0800 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m161_StaticMeshComponent0;                // 0x0808 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m160_StaticMeshComponent0;                // 0x0810 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short84_StaticMeshComponent0;        // 0x0818 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m159_StaticMeshComponent0;                // 0x0820 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short83_StaticMeshComponent0;        // 0x0828 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m158_StaticMeshComponent0;                // 0x0830 (size: 0x8)
    class UStaticMeshComponent* PlaneDenseCorner10_StaticMeshComponent0;              // 0x0838 (size: 0x8)
    class UStaticMeshComponent* PlaneDenseCorner9_StaticMeshComponent0;               // 0x0840 (size: 0x8)
    class UStaticMeshComponent* SG_SmallGlassWindowA9_StaticMeshComponent0;           // 0x0848 (size: 0x8)
    class UStaticMeshComponent* SG_SmallGlassWindowA8_StaticMeshComponent0;           // 0x0850 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m157_StaticMeshComponent0;                // 0x0858 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m156_StaticMeshComponent0;                // 0x0860 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m155_StaticMeshComponent0;                // 0x0868 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m154_StaticMeshComponent0;                // 0x0870 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m153_StaticMeshComponent0;                // 0x0878 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m152_StaticMeshComponent0;                // 0x0880 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m151_StaticMeshComponent0;                // 0x0888 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m150_StaticMeshComponent0;                // 0x0890 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m149_StaticMeshComponent0;                // 0x0898 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m148_StaticMeshComponent0;                // 0x08A0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m147_StaticMeshComponent0;                // 0x08A8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m146_StaticMeshComponent0;                // 0x08B0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m145_StaticMeshComponent0;                // 0x08B8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m144_StaticMeshComponent0;                // 0x08C0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m143_StaticMeshComponent0;                // 0x08C8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m142_StaticMeshComponent0;                // 0x08D0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m141_StaticMeshComponent0;                // 0x08D8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m140_StaticMeshComponent0;                // 0x08E0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m139_StaticMeshComponent0;                // 0x08E8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m138_StaticMeshComponent0;                // 0x08F0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m137_StaticMeshComponent0;                // 0x08F8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m136_StaticMeshComponent0;                // 0x0900 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m135_StaticMeshComponent0;                // 0x0908 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m134_StaticMeshComponent0;                // 0x0910 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m133_StaticMeshComponent0;                // 0x0918 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m132_StaticMeshComponent0;                // 0x0920 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m131_StaticMeshComponent0;                // 0x0928 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m130_StaticMeshComponent0;                // 0x0930 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m129_StaticMeshComponent0;                // 0x0938 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_113_StaticMeshComponent0; // 0x0940 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m128_StaticMeshComponent0;                // 0x0948 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m127_StaticMeshComponent0;                // 0x0950 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Tapered_CutB28_StaticMeshComponent0;        // 0x0958 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_112_StaticMeshComponent0; // 0x0960 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_111_StaticMeshComponent0; // 0x0968 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_110_StaticMeshComponent0; // 0x0970 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_109_StaticMeshComponent0; // 0x0978 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short82_StaticMeshComponent0;        // 0x0980 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short81_StaticMeshComponent0;        // 0x0988 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Tapered_CutB27_StaticMeshComponent0;        // 0x0990 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_108_StaticMeshComponent0; // 0x0998 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_107_StaticMeshComponent0; // 0x09A0 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_106_StaticMeshComponent0; // 0x09A8 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_105_StaticMeshComponent0; // 0x09B0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short80_StaticMeshComponent0;        // 0x09B8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short79_StaticMeshComponent0;        // 0x09C0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth111_StaticMeshComponent0;          // 0x09C8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth110_StaticMeshComponent0;          // 0x09D0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth109_StaticMeshComponent0;          // 0x09D8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth108_StaticMeshComponent0;          // 0x09E0 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Tapered_CutB26_StaticMeshComponent0;        // 0x09E8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m126_StaticMeshComponent0;                // 0x09F0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m125_StaticMeshComponent0;                // 0x09F8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m124_StaticMeshComponent0;                // 0x0A00 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m123_StaticMeshComponent0;                // 0x0A08 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m122_StaticMeshComponent0;                // 0x0A10 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m121_StaticMeshComponent0;                // 0x0A18 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m120_StaticMeshComponent0;                // 0x0A20 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m119_StaticMeshComponent0;                // 0x0A28 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m118_StaticMeshComponent0;                // 0x0A30 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m117_StaticMeshComponent0;                // 0x0A38 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m116_StaticMeshComponent0;                // 0x0A40 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m115_StaticMeshComponent0;                // 0x0A48 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m114_StaticMeshComponent0;                // 0x0A50 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m113_StaticMeshComponent0;                // 0x0A58 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_104_StaticMeshComponent0; // 0x0A60 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_103_StaticMeshComponent0; // 0x0A68 (size: 0x8)
    class UStaticMeshComponent* doorHeadA_angled4_StaticMeshComponent0;               // 0x0A70 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short78_StaticMeshComponent0;        // 0x0A78 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m112_StaticMeshComponent0;                // 0x0A80 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m111_StaticMeshComponent0;                // 0x0A88 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m110_StaticMeshComponent0;                // 0x0A90 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_102_StaticMeshComponent0; // 0x0A98 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_101_StaticMeshComponent0; // 0x0AA0 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_100_StaticMeshComponent0; // 0x0AA8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m109_StaticMeshComponent0;                // 0x0AB0 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_99_StaticMeshComponent0; // 0x0AB8 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_98_StaticMeshComponent0; // 0x0AC0 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_97_StaticMeshComponent0; // 0x0AC8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m108_StaticMeshComponent0;                // 0x0AD0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m107_StaticMeshComponent0;                // 0x0AD8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m106_StaticMeshComponent0;                // 0x0AE0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m105_StaticMeshComponent0;                // 0x0AE8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m104_StaticMeshComponent0;                // 0x0AF0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m103_StaticMeshComponent0;                // 0x0AF8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m102_StaticMeshComponent0;                // 0x0B00 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m101_StaticMeshComponent0;                // 0x0B08 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m100_StaticMeshComponent0;                // 0x0B10 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m99_StaticMeshComponent0;                 // 0x0B18 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m98_StaticMeshComponent0;                 // 0x0B20 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m97_StaticMeshComponent0;                 // 0x0B28 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m96_StaticMeshComponent0;                 // 0x0B30 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m95_StaticMeshComponent0;                 // 0x0B38 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m94_StaticMeshComponent0;                 // 0x0B40 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m51_StaticMeshComponent0;                 // 0x0B48 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m50_StaticMeshComponent0;                 // 0x0B50 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m41_StaticMeshComponent0;                 // 0x0B58 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m40_StaticMeshComponent0;                 // 0x0B60 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m33_StaticMeshComponent0;                 // 0x0B68 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_96_StaticMeshComponent0; // 0x0B70 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_95_StaticMeshComponent0; // 0x0B78 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_94_StaticMeshComponent0; // 0x0B80 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_93_StaticMeshComponent0; // 0x0B88 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_92_StaticMeshComponent0; // 0x0B90 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_91_StaticMeshComponent0; // 0x0B98 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_90_StaticMeshComponent0; // 0x0BA0 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_89_StaticMeshComponent0; // 0x0BA8 (size: 0x8)
    class UStaticMeshComponent* doorHeadA_angled3_StaticMeshComponent0;               // 0x0BB0 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Tapered_CutB25_StaticMeshComponent0;        // 0x0BB8 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_88_StaticMeshComponent0; // 0x0BC0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short77_StaticMeshComponent0;        // 0x0BC8 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_87_StaticMeshComponent0; // 0x0BD0 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_86_StaticMeshComponent0; // 0x0BD8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m32_StaticMeshComponent0;                 // 0x0BE0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m30_StaticMeshComponent0;                 // 0x0BE8 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Tapered_CutB24_StaticMeshComponent0;        // 0x0BF0 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Tapered_CutB17_StaticMeshComponent0;        // 0x0BF8 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Tapered_CutB16_StaticMeshComponent0;        // 0x0C00 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Tapered_CutB14_StaticMeshComponent0;        // 0x0C08 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Tapered_CutB12_StaticMeshComponent0;        // 0x0C10 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Tapered_CutB4_StaticMeshComponent0;         // 0x0C18 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth107_StaticMeshComponent0;          // 0x0C20 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth106_StaticMeshComponent0;          // 0x0C28 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth15_StaticMeshComponent0;           // 0x0C30 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short76_StaticMeshComponent0;        // 0x0C38 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short75_StaticMeshComponent0;        // 0x0C40 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short74_StaticMeshComponent0;        // 0x0C48 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short73_StaticMeshComponent0;        // 0x0C50 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short72_StaticMeshComponent0;        // 0x0C58 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short51_StaticMeshComponent0;        // 0x0C60 (size: 0x8)
    class UStaticMeshComponent* sg_shutterA22_StaticMeshComponent0;                   // 0x0C68 (size: 0x8)
    class UStaticMeshComponent* sg_shutterA21_StaticMeshComponent0;                   // 0x0C70 (size: 0x8)
    class UStaticMeshComponent* sg_shutterA20_StaticMeshComponent0;                   // 0x0C78 (size: 0x8)
    class UStaticMeshComponent* sg_shutterA19_StaticMeshComponent0;                   // 0x0C80 (size: 0x8)
    class UStaticMeshComponent* sg_shutterA18_StaticMeshComponent0;                   // 0x0C88 (size: 0x8)
    class UStaticMeshComponent* sg_shutterA17_StaticMeshComponent0;                   // 0x0C90 (size: 0x8)
    class UStaticMeshComponent* sg_shutterA16_StaticMeshComponent0;                   // 0x0C98 (size: 0x8)
    class UStaticMeshComponent* sg_shutterA15_StaticMeshComponent0;                   // 0x0CA0 (size: 0x8)
    class UStaticMeshComponent* sg_shutterA14_StaticMeshComponent0;                   // 0x0CA8 (size: 0x8)
    class UStaticMeshComponent* sg_shutterA13_StaticMeshComponent0;                   // 0x0CB0 (size: 0x8)
    class UStaticMeshComponent* sg_shutterA12_StaticMeshComponent0;                   // 0x0CB8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly182_StaticMeshComponent0;   // 0x0CC0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly181_StaticMeshComponent0;   // 0x0CC8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly180_StaticMeshComponent0;   // 0x0CD0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly179_StaticMeshComponent0;   // 0x0CD8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly178_StaticMeshComponent0;   // 0x0CE0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly177_StaticMeshComponent0;   // 0x0CE8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly176_StaticMeshComponent0;   // 0x0CF0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly175_StaticMeshComponent0;   // 0x0CF8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly174_StaticMeshComponent0;   // 0x0D00 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly173_StaticMeshComponent0;   // 0x0D08 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly172_StaticMeshComponent0;   // 0x0D10 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly171_StaticMeshComponent0;   // 0x0D18 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly170_StaticMeshComponent0;   // 0x0D20 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly169_StaticMeshComponent0;   // 0x0D28 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly168_StaticMeshComponent0;   // 0x0D30 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly167_StaticMeshComponent0;   // 0x0D38 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly166_StaticMeshComponent0;   // 0x0D40 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly165_StaticMeshComponent0;   // 0x0D48 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly164_StaticMeshComponent0;   // 0x0D50 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly163_StaticMeshComponent0;   // 0x0D58 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly162_StaticMeshComponent0;   // 0x0D60 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly161_StaticMeshComponent0;   // 0x0D68 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly160_StaticMeshComponent0;   // 0x0D70 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly159_StaticMeshComponent0;   // 0x0D78 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly158_StaticMeshComponent0;   // 0x0D80 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly157_StaticMeshComponent0;   // 0x0D88 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly156_StaticMeshComponent0;   // 0x0D90 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly155_StaticMeshComponent0;   // 0x0D98 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly154_StaticMeshComponent0;   // 0x0DA0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly153_StaticMeshComponent0;   // 0x0DA8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly152_StaticMeshComponent0;   // 0x0DB0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly151_StaticMeshComponent0;   // 0x0DB8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly150_StaticMeshComponent0;   // 0x0DC0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly149_StaticMeshComponent0;   // 0x0DC8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly148_StaticMeshComponent0;   // 0x0DD0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly147_StaticMeshComponent0;   // 0x0DD8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly146_StaticMeshComponent0;   // 0x0DE0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly145_StaticMeshComponent0;   // 0x0DE8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly144_StaticMeshComponent0;   // 0x0DF0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly143_StaticMeshComponent0;   // 0x0DF8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly142_StaticMeshComponent0;   // 0x0E00 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly141_StaticMeshComponent0;   // 0x0E08 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly140_StaticMeshComponent0;   // 0x0E10 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly139_StaticMeshComponent0;   // 0x0E18 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly138_StaticMeshComponent0;   // 0x0E20 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly137_StaticMeshComponent0;   // 0x0E28 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly136_StaticMeshComponent0;   // 0x0E30 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly135_StaticMeshComponent0;   // 0x0E38 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly134_StaticMeshComponent0;   // 0x0E40 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly133_StaticMeshComponent0;   // 0x0E48 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly132_StaticMeshComponent0;   // 0x0E50 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly131_StaticMeshComponent0;   // 0x0E58 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly130_StaticMeshComponent0;   // 0x0E60 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly129_StaticMeshComponent0;   // 0x0E68 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly128_StaticMeshComponent0;   // 0x0E70 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly127_StaticMeshComponent0;   // 0x0E78 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly126_StaticMeshComponent0;   // 0x0E80 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly125_StaticMeshComponent0;   // 0x0E88 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly124_StaticMeshComponent0;   // 0x0E90 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly123_StaticMeshComponent0;   // 0x0E98 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly122_StaticMeshComponent0;   // 0x0EA0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly121_StaticMeshComponent0;   // 0x0EA8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly120_StaticMeshComponent0;   // 0x0EB0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly119_StaticMeshComponent0;   // 0x0EB8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly118_StaticMeshComponent0;   // 0x0EC0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly117_StaticMeshComponent0;   // 0x0EC8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly116_StaticMeshComponent0;   // 0x0ED0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly115_StaticMeshComponent0;   // 0x0ED8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly114_StaticMeshComponent0;   // 0x0EE0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly113_StaticMeshComponent0;   // 0x0EE8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly112_StaticMeshComponent0;   // 0x0EF0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly111_StaticMeshComponent0;   // 0x0EF8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly110_StaticMeshComponent0;   // 0x0F00 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly109_StaticMeshComponent0;   // 0x0F08 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly108_StaticMeshComponent0;   // 0x0F10 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly107_StaticMeshComponent0;   // 0x0F18 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly106_StaticMeshComponent0;   // 0x0F20 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly105_StaticMeshComponent0;   // 0x0F28 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly104_StaticMeshComponent0;   // 0x0F30 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly103_StaticMeshComponent0;   // 0x0F38 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly102_StaticMeshComponent0;   // 0x0F40 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly101_StaticMeshComponent0;   // 0x0F48 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly100_StaticMeshComponent0;   // 0x0F50 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly99_StaticMeshComponent0;    // 0x0F58 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly98_StaticMeshComponent0;    // 0x0F60 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly97_StaticMeshComponent0;    // 0x0F68 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly96_StaticMeshComponent0;    // 0x0F70 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly95_StaticMeshComponent0;    // 0x0F78 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly94_StaticMeshComponent0;    // 0x0F80 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly93_StaticMeshComponent0;    // 0x0F88 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly92_StaticMeshComponent0;    // 0x0F90 (size: 0x8)
    class UStaticMeshComponent* planeDenseBeveledA23_StaticMeshComponent0;            // 0x0F98 (size: 0x8)
    class UStaticMeshComponent* PlaneDenseCorner4_StaticMeshComponent0;               // 0x0FA0 (size: 0x8)
    class UStaticMeshComponent* PlaneDenseCorner3_StaticMeshComponent0;               // 0x0FA8 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_TwoWindowsStandard_Wider35_StaticMeshComponent0; // 0x0FB0 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_TwoWindowsStandard_Wider34_StaticMeshComponent0; // 0x0FB8 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_TwoWindowsStandard_Wider33_StaticMeshComponent0; // 0x0FC0 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_TwoWindowsStandard_Wider32_StaticMeshComponent0; // 0x0FC8 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_TwoWindowsStandard_Wider31_StaticMeshComponent0; // 0x0FD0 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_TwoWindowsStandard_Wider30_StaticMeshComponent0; // 0x0FD8 (size: 0x8)
    class UStaticMeshComponent* FoundationSeamless_Corner_500x511_StaticMeshComponent0; // 0x0FE0 (size: 0x8)
    class UStaticMeshComponent* FoundationSeamless_Corner_500x510_StaticMeshComponent0; // 0x0FE8 (size: 0x8)
    class UStaticMeshComponent* FoundationSeamless_Corner_500x509_StaticMeshComponent0; // 0x0FF0 (size: 0x8)
    class UStaticMeshComponent* FoundationSeamless_Corner_500x508_StaticMeshComponent0; // 0x0FF8 (size: 0x8)
    class UStaticMeshComponent* FoundationSeamless_Corner_500x507_StaticMeshComponent0; // 0x1000 (size: 0x8)
    class UStaticMeshComponent* FoundationSeamless_Corner_500x506_StaticMeshComponent0; // 0x1008 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m4_StaticMeshComponent0;                       // 0x1010 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m3_StaticMeshComponent0;                       // 0x1018 (size: 0x8)
    class UStaticMeshComponent* UBeam_GableSimpleA2_StaticMeshComponent0;             // 0x1020 (size: 0x8)
    class USceneComponent* Actor3_DefaultSceneRoot;                                   // 0x1028 (size: 0x8)

}; // Size: 0x1030

#endif
