#ifndef UE4SS_SDK_C_SG_Hearth_HPP
#define UE4SS_SDK_C_SG_Hearth_HPP

class AC_SG_Hearth_C : public AConstructionBP_C
{
    class UStaticMeshComponent* ropeKnotA12_StaticMeshComponent0;                     // 0x0550 (size: 0x8)
    class UStaticMeshComponent* ropeTubeC6_StaticMeshComponent0;                      // 0x0558 (size: 0x8)
    class UStaticMeshComponent* ropeTubeC5_StaticMeshComponent0;                      // 0x0560 (size: 0x8)
    class UStaticMeshComponent* ropeTubeC4_StaticMeshComponent0;                      // 0x0568 (size: 0x8)
    class UStaticMeshComponent* ropeKnotA11_StaticMeshComponent0;                     // 0x0570 (size: 0x8)
    class UStaticMeshComponent* ropeKnotA10_StaticMeshComponent0;                     // 0x0578 (size: 0x8)
    class UStaticMeshComponent* ropeKnotA9_StaticMeshComponent0;                      // 0x0580 (size: 0x8)
    class UStaticMeshComponent* ropeShort4_StaticMeshComponent0;                      // 0x0588 (size: 0x8)
    class UStaticMeshComponent* ropeShort3_StaticMeshComponent0;                      // 0x0590 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed32_StaticMeshComponent0;           // 0x0598 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed24_StaticMeshComponent0;           // 0x05A0 (size: 0x8)
    class UStaticMeshComponent* SM_MERGED_sittingLog3_StaticMeshComponent0;           // 0x05A8 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed23_StaticMeshComponent0;           // 0x05B0 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed22_StaticMeshComponent0;           // 0x05B8 (size: 0x8)
    class UStaticMeshComponent* bellows_luv2_StaticMeshComponent0;                    // 0x05C0 (size: 0x8)
    class UStaticMeshComponent* SM_Scree002b2_StaticMeshComponent0;                   // 0x05C8 (size: 0x8)
    class UStaticMeshComponent* foundationTiling_A_detailed17_StaticMeshComponent0;   // 0x05D0 (size: 0x8)
    class UStaticMeshComponent* foundationTiling_A_detailed16_StaticMeshComponent0;   // 0x05D8 (size: 0x8)
    class UStaticMeshComponent* foundationTiling_A_detailed15_StaticMeshComponent0;   // 0x05E0 (size: 0x8)
    class UStaticMeshComponent* foundationTiling_A_detailed14_StaticMeshComponent0;   // 0x05E8 (size: 0x8)
    class UStaticMeshComponent* foundationTiling_A_detailed13_StaticMeshComponent0;   // 0x05F0 (size: 0x8)
    class USceneComponent* sg_hearth2_DefaultSceneRoot;                               // 0x05F8 (size: 0x8)

}; // Size: 0x600

#endif
