#ifndef UE4SS_SDK_C_SG_Townhouse_Lv3_H_HPP
#define UE4SS_SDK_C_SG_Townhouse_Lv3_H_HPP

class AC_SG_Townhouse_Lv3_H_C : public AConstructionBP_C
{
    class UStaticMeshComponent* UBeam_6m_ConnectorEnd16_StaticMeshComponent0;         // 0x0550 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m_ConnectorEnd15_StaticMeshComponent0;         // 0x0558 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg210_StaticMeshComponent0;    // 0x0560 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg209_StaticMeshComponent0;    // 0x0568 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg208_StaticMeshComponent0;    // 0x0570 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg207_StaticMeshComponent0;    // 0x0578 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg206_StaticMeshComponent0;    // 0x0580 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg205_StaticMeshComponent0;    // 0x0588 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg204_StaticMeshComponent0;    // 0x0590 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg203_StaticMeshComponent0;    // 0x0598 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg202_StaticMeshComponent0;    // 0x05A0 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg201_StaticMeshComponent0;    // 0x05A8 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg200_StaticMeshComponent0;    // 0x05B0 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg199_StaticMeshComponent0;    // 0x05B8 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg198_StaticMeshComponent0;    // 0x05C0 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg197_StaticMeshComponent0;    // 0x05C8 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg196_StaticMeshComponent0;    // 0x05D0 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg195_StaticMeshComponent0;    // 0x05D8 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg194_StaticMeshComponent0;    // 0x05E0 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg193_StaticMeshComponent0;    // 0x05E8 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg192_StaticMeshComponent0;    // 0x05F0 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg191_StaticMeshComponent0;    // 0x05F8 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg190_StaticMeshComponent0;    // 0x0600 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg189_StaticMeshComponent0;    // 0x0608 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg188_StaticMeshComponent0;    // 0x0610 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg187_StaticMeshComponent0;    // 0x0618 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg186_StaticMeshComponent0;    // 0x0620 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg185_StaticMeshComponent0;    // 0x0628 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg184_StaticMeshComponent0;    // 0x0630 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg183_StaticMeshComponent0;    // 0x0638 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg182_StaticMeshComponent0;    // 0x0640 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg181_StaticMeshComponent0;    // 0x0648 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg180_StaticMeshComponent0;    // 0x0650 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg179_StaticMeshComponent0;    // 0x0658 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg178_StaticMeshComponent0;    // 0x0660 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg177_StaticMeshComponent0;    // 0x0668 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg176_StaticMeshComponent0;    // 0x0670 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg175_StaticMeshComponent0;    // 0x0678 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg174_StaticMeshComponent0;    // 0x0680 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg173_StaticMeshComponent0;    // 0x0688 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg172_StaticMeshComponent0;    // 0x0690 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg171_StaticMeshComponent0;    // 0x0698 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg170_StaticMeshComponent0;    // 0x06A0 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg169_StaticMeshComponent0;    // 0x06A8 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg168_StaticMeshComponent0;    // 0x06B0 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg167_StaticMeshComponent0;    // 0x06B8 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg166_StaticMeshComponent0;    // 0x06C0 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg165_StaticMeshComponent0;    // 0x06C8 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg164_StaticMeshComponent0;    // 0x06D0 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg163_StaticMeshComponent0;    // 0x06D8 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg162_StaticMeshComponent0;    // 0x06E0 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg161_StaticMeshComponent0;    // 0x06E8 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg160_StaticMeshComponent0;    // 0x06F0 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg159_StaticMeshComponent0;    // 0x06F8 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg158_StaticMeshComponent0;    // 0x0700 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg157_StaticMeshComponent0;    // 0x0708 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg156_StaticMeshComponent0;    // 0x0710 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg155_StaticMeshComponent0;    // 0x0718 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg154_StaticMeshComponent0;    // 0x0720 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg153_StaticMeshComponent0;    // 0x0728 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg152_StaticMeshComponent0;    // 0x0730 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg151_StaticMeshComponent0;    // 0x0738 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg150_StaticMeshComponent0;    // 0x0740 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg149_StaticMeshComponent0;    // 0x0748 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg148_StaticMeshComponent0;    // 0x0750 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg147_StaticMeshComponent0;    // 0x0758 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg146_StaticMeshComponent0;    // 0x0760 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg145_StaticMeshComponent0;    // 0x0768 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg144_StaticMeshComponent0;    // 0x0770 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg143_StaticMeshComponent0;    // 0x0778 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg142_StaticMeshComponent0;    // 0x0780 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg141_StaticMeshComponent0;    // 0x0788 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg140_StaticMeshComponent0;    // 0x0790 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg139_StaticMeshComponent0;    // 0x0798 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg138_StaticMeshComponent0;    // 0x07A0 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m164_StaticMeshComponent0;                     // 0x07A8 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m163_StaticMeshComponent0;                     // 0x07B0 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m162_StaticMeshComponent0;                     // 0x07B8 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m161_StaticMeshComponent0;                     // 0x07C0 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg137_StaticMeshComponent0;    // 0x07C8 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg136_StaticMeshComponent0;    // 0x07D0 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg135_StaticMeshComponent0;    // 0x07D8 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg134_StaticMeshComponent0;    // 0x07E0 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg133_StaticMeshComponent0;    // 0x07E8 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg132_StaticMeshComponent0;    // 0x07F0 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg131_StaticMeshComponent0;    // 0x07F8 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg130_StaticMeshComponent0;    // 0x0800 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg129_StaticMeshComponent0;    // 0x0808 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg128_StaticMeshComponent0;    // 0x0810 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg127_StaticMeshComponent0;    // 0x0818 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg126_StaticMeshComponent0;    // 0x0820 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg125_StaticMeshComponent0;    // 0x0828 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg124_StaticMeshComponent0;    // 0x0830 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg123_StaticMeshComponent0;    // 0x0838 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg122_StaticMeshComponent0;    // 0x0840 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg121_StaticMeshComponent0;    // 0x0848 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg120_StaticMeshComponent0;    // 0x0850 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg119_StaticMeshComponent0;    // 0x0858 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg118_StaticMeshComponent0;    // 0x0860 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg117_StaticMeshComponent0;    // 0x0868 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg116_StaticMeshComponent0;    // 0x0870 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg115_StaticMeshComponent0;    // 0x0878 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg114_StaticMeshComponent0;    // 0x0880 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg113_StaticMeshComponent0;    // 0x0888 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg112_StaticMeshComponent0;    // 0x0890 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg111_StaticMeshComponent0;    // 0x0898 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg110_StaticMeshComponent0;    // 0x08A0 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg109_StaticMeshComponent0;    // 0x08A8 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg108_StaticMeshComponent0;    // 0x08B0 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg34_StaticMeshComponent0;     // 0x08B8 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg9_StaticMeshComponent0;      // 0x08C0 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m160_StaticMeshComponent0;                     // 0x08C8 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m159_StaticMeshComponent0;                     // 0x08D0 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m158_StaticMeshComponent0;                     // 0x08D8 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m157_StaticMeshComponent0;                     // 0x08E0 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m156_StaticMeshComponent0;                     // 0x08E8 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m155_StaticMeshComponent0;                     // 0x08F0 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m154_StaticMeshComponent0;                     // 0x08F8 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m153_StaticMeshComponent0;                     // 0x0900 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m152_StaticMeshComponent0;                     // 0x0908 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m151_StaticMeshComponent0;                     // 0x0910 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m150_StaticMeshComponent0;                     // 0x0918 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m149_StaticMeshComponent0;                     // 0x0920 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m148_StaticMeshComponent0;                     // 0x0928 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m147_StaticMeshComponent0;                     // 0x0930 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_98_StaticMeshComponent0;               // 0x0938 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_97_StaticMeshComponent0;               // 0x0940 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_96_StaticMeshComponent0;               // 0x0948 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_95_StaticMeshComponent0;               // 0x0950 (size: 0x8)
    class UStaticMeshComponent* UBeam_TaperedCutB_ShorterEnds40_StaticMeshComponent0; // 0x0958 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m48_StaticMeshComponent0;                      // 0x0960 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m47_StaticMeshComponent0;                      // 0x0968 (size: 0x8)
    class UStaticMeshComponent* UBeam_TaperedCutB_ShorterEnds39_StaticMeshComponent0; // 0x0970 (size: 0x8)
    class UStaticMeshComponent* UBeam_TaperedCutB_ShorterEnds38_StaticMeshComponent0; // 0x0978 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m46_StaticMeshComponent0;                      // 0x0980 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m45_StaticMeshComponent0;                      // 0x0988 (size: 0x8)
    class UStaticMeshComponent* UBeam_TaperedCutB_ShorterEnds37_StaticMeshComponent0; // 0x0990 (size: 0x8)
    class UStaticMeshComponent* UBeam_TaperedCutB_ShorterEnds36_StaticMeshComponent0; // 0x0998 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m44_StaticMeshComponent0;                      // 0x09A0 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m43_StaticMeshComponent0;                      // 0x09A8 (size: 0x8)
    class UStaticMeshComponent* UBeam_TaperedCutB_ShorterEnds35_StaticMeshComponent0; // 0x09B0 (size: 0x8)
    class UStaticMeshComponent* UBeam_TaperedCutB_ShorterEnds34_StaticMeshComponent0; // 0x09B8 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m42_StaticMeshComponent0;                      // 0x09C0 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m41_StaticMeshComponent0;                      // 0x09C8 (size: 0x8)
    class UStaticMeshComponent* UBeam_TaperedCutB_ShorterEnds33_StaticMeshComponent0; // 0x09D0 (size: 0x8)
    class UStaticMeshComponent* UBeam_TaperedCutB_ShorterEnds32_StaticMeshComponent0; // 0x09D8 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m40_StaticMeshComponent0;                      // 0x09E0 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m39_StaticMeshComponent0;                      // 0x09E8 (size: 0x8)
    class UStaticMeshComponent* UBeam_TaperedCutB_ShorterEnds31_StaticMeshComponent0; // 0x09F0 (size: 0x8)
    class UStaticMeshComponent* UBeam_TaperedCutB_ShorterEnds30_StaticMeshComponent0; // 0x09F8 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m38_StaticMeshComponent0;                      // 0x0A00 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m37_StaticMeshComponent0;                      // 0x0A08 (size: 0x8)
    class UStaticMeshComponent* UBeam_TaperedCutB_ShorterEnds29_StaticMeshComponent0; // 0x0A10 (size: 0x8)
    class UStaticMeshComponent* UBeam_TaperedCutB_ShorterEnds28_StaticMeshComponent0; // 0x0A18 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m36_StaticMeshComponent0;                      // 0x0A20 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m35_StaticMeshComponent0;                      // 0x0A28 (size: 0x8)
    class UStaticMeshComponent* UBeam_TaperedCutB_ShorterEnds27_StaticMeshComponent0; // 0x0A30 (size: 0x8)
    class UStaticMeshComponent* UBeam_TaperedCutB_ShorterEnds26_StaticMeshComponent0; // 0x0A38 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m34_StaticMeshComponent0;                      // 0x0A40 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m33_StaticMeshComponent0;                      // 0x0A48 (size: 0x8)
    class UStaticMeshComponent* UBeam_TaperedCutB_ShorterEnds25_StaticMeshComponent0; // 0x0A50 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m146_StaticMeshComponent0;                     // 0x0A58 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m2_StaticMeshComponent0;                    // 0x0A60 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m145_StaticMeshComponent0;                     // 0x0A68 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m144_StaticMeshComponent0;                     // 0x0A70 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m143_StaticMeshComponent0;                     // 0x0A78 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m142_StaticMeshComponent0;                     // 0x0A80 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m141_StaticMeshComponent0;                     // 0x0A88 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m140_StaticMeshComponent0;                     // 0x0A90 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m139_StaticMeshComponent0;                     // 0x0A98 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m138_StaticMeshComponent0;                     // 0x0AA0 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m137_StaticMeshComponent0;                     // 0x0AA8 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m136_StaticMeshComponent0;                     // 0x0AB0 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m135_StaticMeshComponent0;                     // 0x0AB8 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m134_StaticMeshComponent0;                     // 0x0AC0 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m133_StaticMeshComponent0;                     // 0x0AC8 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m132_StaticMeshComponent0;                     // 0x0AD0 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m131_StaticMeshComponent0;                     // 0x0AD8 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m130_StaticMeshComponent0;                     // 0x0AE0 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m129_StaticMeshComponent0;                     // 0x0AE8 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m128_StaticMeshComponent0;                     // 0x0AF0 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m127_StaticMeshComponent0;                     // 0x0AF8 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m126_StaticMeshComponent0;                     // 0x0B00 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m125_StaticMeshComponent0;                     // 0x0B08 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m124_StaticMeshComponent0;                     // 0x0B10 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_94_StaticMeshComponent0;               // 0x0B18 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_93_StaticMeshComponent0;               // 0x0B20 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_92_StaticMeshComponent0;               // 0x0B28 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_91_StaticMeshComponent0;               // 0x0B30 (size: 0x8)
    class UStaticMeshComponent* UBeam_TaperedCutB_ShorterEnds24_StaticMeshComponent0; // 0x0B38 (size: 0x8)
    class UStaticMeshComponent* UBeam_TaperedCutB_ShorterEnds23_StaticMeshComponent0; // 0x0B40 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m123_StaticMeshComponent0;                     // 0x0B48 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m122_StaticMeshComponent0;                     // 0x0B50 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m121_StaticMeshComponent0;                     // 0x0B58 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m120_StaticMeshComponent0;                     // 0x0B60 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m119_StaticMeshComponent0;                     // 0x0B68 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m32_StaticMeshComponent0;                      // 0x0B70 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m31_StaticMeshComponent0;                      // 0x0B78 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m118_StaticMeshComponent0;                     // 0x0B80 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m117_StaticMeshComponent0;                     // 0x0B88 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_90_StaticMeshComponent0;               // 0x0B90 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_89_StaticMeshComponent0;               // 0x0B98 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_88_StaticMeshComponent0;               // 0x0BA0 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_87_StaticMeshComponent0;               // 0x0BA8 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_86_StaticMeshComponent0;               // 0x0BB0 (size: 0x8)
    class UStaticMeshComponent* UBeam_TaperedCutB_ShorterEnds22_StaticMeshComponent0; // 0x0BB8 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m116_StaticMeshComponent0;                     // 0x0BC0 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_85_StaticMeshComponent0;               // 0x0BC8 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_84_StaticMeshComponent0;               // 0x0BD0 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_83_StaticMeshComponent0;               // 0x0BD8 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_82_StaticMeshComponent0;               // 0x0BE0 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m115_StaticMeshComponent0;                     // 0x0BE8 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_81_StaticMeshComponent0;               // 0x0BF0 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m114_StaticMeshComponent0;                     // 0x0BF8 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_80_StaticMeshComponent0;               // 0x0C00 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_79_StaticMeshComponent0;               // 0x0C08 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_78_StaticMeshComponent0;               // 0x0C10 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m113_StaticMeshComponent0;                     // 0x0C18 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_77_StaticMeshComponent0;               // 0x0C20 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_76_StaticMeshComponent0;               // 0x0C28 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_75_StaticMeshComponent0;               // 0x0C30 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_74_StaticMeshComponent0;               // 0x0C38 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m112_StaticMeshComponent0;                     // 0x0C40 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m111_StaticMeshComponent0;                     // 0x0C48 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_73_StaticMeshComponent0;               // 0x0C50 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_72_StaticMeshComponent0;               // 0x0C58 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_71_StaticMeshComponent0;               // 0x0C60 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_70_StaticMeshComponent0;               // 0x0C68 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m110_StaticMeshComponent0;                     // 0x0C70 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m109_StaticMeshComponent0;                     // 0x0C78 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m108_StaticMeshComponent0;                     // 0x0C80 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_69_StaticMeshComponent0;               // 0x0C88 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_68_StaticMeshComponent0;               // 0x0C90 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_67_StaticMeshComponent0;               // 0x0C98 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_66_StaticMeshComponent0;               // 0x0CA0 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_65_StaticMeshComponent0;               // 0x0CA8 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_64_StaticMeshComponent0;               // 0x0CB0 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_63_StaticMeshComponent0;               // 0x0CB8 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_62_StaticMeshComponent0;               // 0x0CC0 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_61_StaticMeshComponent0;               // 0x0CC8 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m107_StaticMeshComponent0;                     // 0x0CD0 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m106_StaticMeshComponent0;                     // 0x0CD8 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m105_StaticMeshComponent0;                     // 0x0CE0 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_60_StaticMeshComponent0;               // 0x0CE8 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_59_StaticMeshComponent0;               // 0x0CF0 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_58_StaticMeshComponent0;               // 0x0CF8 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_57_StaticMeshComponent0;               // 0x0D00 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_56_StaticMeshComponent0;               // 0x0D08 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_55_StaticMeshComponent0;               // 0x0D10 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_54_StaticMeshComponent0;               // 0x0D18 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_53_StaticMeshComponent0;               // 0x0D20 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_52_StaticMeshComponent0;               // 0x0D28 (size: 0x8)
    class UStaticMeshComponent* UBeam_TaperedCutB_ShorterEnds21_StaticMeshComponent0; // 0x0D30 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m30_StaticMeshComponent0;                      // 0x0D38 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m_ConnectorEnd14_StaticMeshComponent0;         // 0x0D40 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m_ConnectorEnd13_StaticMeshComponent0;         // 0x0D48 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m_ConnectorEnd12_StaticMeshComponent0;         // 0x0D50 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m_ConnectorEnd11_StaticMeshComponent0;         // 0x0D58 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m_ConnectorEnd10_StaticMeshComponent0;         // 0x0D60 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m_ConnectorEnd9_StaticMeshComponent0;          // 0x0D68 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m104_StaticMeshComponent0;                     // 0x0D70 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m29_StaticMeshComponent0;                      // 0x0D78 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m103_StaticMeshComponent0;                     // 0x0D80 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m102_StaticMeshComponent0;                     // 0x0D88 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m101_StaticMeshComponent0;                     // 0x0D90 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m100_StaticMeshComponent0;                     // 0x0D98 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m99_StaticMeshComponent0;                      // 0x0DA0 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m98_StaticMeshComponent0;                      // 0x0DA8 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m97_StaticMeshComponent0;                      // 0x0DB0 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m96_StaticMeshComponent0;                      // 0x0DB8 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m95_StaticMeshComponent0;                      // 0x0DC0 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m94_StaticMeshComponent0;                      // 0x0DC8 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m93_StaticMeshComponent0;                      // 0x0DD0 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m92_StaticMeshComponent0;                      // 0x0DD8 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m91_StaticMeshComponent0;                      // 0x0DE0 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m90_StaticMeshComponent0;                      // 0x0DE8 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m28_StaticMeshComponent0;                      // 0x0DF0 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m27_StaticMeshComponent0;                      // 0x0DF8 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m26_StaticMeshComponent0;                      // 0x0E00 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m25_StaticMeshComponent0;                      // 0x0E08 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m89_StaticMeshComponent0;                      // 0x0E10 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m88_StaticMeshComponent0;                      // 0x0E18 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_51_StaticMeshComponent0;               // 0x0E20 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_50_StaticMeshComponent0;               // 0x0E28 (size: 0x8)
    class UStaticMeshComponent* UBeam_DoorHeadA2_StaticMeshComponent0;                // 0x0E30 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m87_StaticMeshComponent0;                      // 0x0E38 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m86_StaticMeshComponent0;                      // 0x0E40 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m85_StaticMeshComponent0;                      // 0x0E48 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m84_StaticMeshComponent0;                      // 0x0E50 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m83_StaticMeshComponent0;                      // 0x0E58 (size: 0x8)
    class UStaticMeshComponent* foundations_townhouse_h2_StaticMeshComponent0;        // 0x0E60 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA8_StaticMeshComponent0;             // 0x0E68 (size: 0x8)
    class UStaticMeshComponent* ClayRoof_Townhouse_H2_StaticMeshComponent0;           // 0x0E70 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_TwoWindowsStandard_Wide6_StaticMeshComponent0; // 0x0E78 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_TwoWindowsStandard_Wide5_StaticMeshComponent0; // 0x0E80 (size: 0x8)
    class UStaticMeshComponent* Cube5_StaticMeshComponent0;                           // 0x0E88 (size: 0x8)
    class UStaticMeshComponent* Cube4_StaticMeshComponent0;                           // 0x0E90 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA7_StaticMeshComponent0;             // 0x0E98 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA6_StaticMeshComponent0;             // 0x0EA0 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA5_StaticMeshComponent0;             // 0x0EA8 (size: 0x8)
    class UStaticMeshComponent* ChimneyLP2_StaticMeshComponent0;                      // 0x0EB0 (size: 0x8)
    class UStaticMeshComponent* SG_SmallGlassWindowA10_StaticMeshComponent0;          // 0x0EB8 (size: 0x8)
    class UStaticMeshComponent* SG_SmallGlassWindowA9_StaticMeshComponent0;           // 0x0EC0 (size: 0x8)
    class UStaticMeshComponent* SG_SmallGlassWindowA8_StaticMeshComponent0;           // 0x0EC8 (size: 0x8)
    class UStaticMeshComponent* SG_SmallGlassWindowA7_StaticMeshComponent0;           // 0x0ED0 (size: 0x8)
    class UStaticMeshComponent* SG_SmallGlassWindowA6_StaticMeshComponent0;           // 0x0ED8 (size: 0x8)
    class UStaticMeshComponent* SG_BigWindowA8_StaticMeshComponent0;                  // 0x0EE0 (size: 0x8)
    class UStaticMeshComponent* SG_BigWindowA7_StaticMeshComponent0;                  // 0x0EE8 (size: 0x8)
    class UStaticMeshComponent* SG_BigWindowA6_StaticMeshComponent0;                  // 0x0EF0 (size: 0x8)
    class UStaticMeshComponent* SG_BigWindowA5_StaticMeshComponent0;                  // 0x0EF8 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Narrow28_StaticMeshComponent0;             // 0x0F00 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Narrow27_StaticMeshComponent0;             // 0x0F08 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Narrow26_StaticMeshComponent0;             // 0x0F10 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Narrow_Var27_StaticMeshComponent0;         // 0x0F18 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Slit2_StaticMeshComponent0;                // 0x0F20 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Narrow25_StaticMeshComponent0;             // 0x0F28 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Narrow24_StaticMeshComponent0;             // 0x0F30 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Narrow23_StaticMeshComponent0;             // 0x0F38 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Narrow_Var26_StaticMeshComponent0;         // 0x0F40 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Narrow22_StaticMeshComponent0;             // 0x0F48 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Narrow21_StaticMeshComponent0;             // 0x0F50 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Narrow20_StaticMeshComponent0;             // 0x0F58 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Narrow_Var25_StaticMeshComponent0;         // 0x0F60 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Narrow19_StaticMeshComponent0;             // 0x0F68 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Narrow18_StaticMeshComponent0;             // 0x0F70 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Narrow17_StaticMeshComponent0;             // 0x0F78 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Corner4_StaticMeshComponent0;              // 0x0F80 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Corner3_StaticMeshComponent0;              // 0x0F88 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Narrow_Var24_StaticMeshComponent0;         // 0x0F90 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Slit_SmokeHole_LessWide2_StaticMeshComponent0; // 0x0F98 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Slit_SmokeHole2_StaticMeshComponent0;      // 0x0FA0 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Standard2_StaticMeshComponent0;            // 0x0FA8 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_TwoWindowsStandard6_StaticMeshComponent0;  // 0x0FB0 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Narrow16_StaticMeshComponent0;             // 0x0FB8 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_TwoWindowsStandard_Wide4_StaticMeshComponent0; // 0x0FC0 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_TwoWindowsStandard5_StaticMeshComponent0;  // 0x0FC8 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_TwoWindowsStandard4_StaticMeshComponent0;  // 0x0FD0 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_StandardSingleWindow4_StaticMeshComponent0; // 0x0FD8 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_TwoWindowsStandard_Wide_RightPadding2_StaticMeshComponent0; // 0x0FE0 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Narrow_Var23_StaticMeshComponent0;         // 0x0FE8 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Narrow_Var22_StaticMeshComponent0;         // 0x0FF0 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Narrow_Var21_StaticMeshComponent0;         // 0x0FF8 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Narrow_Var20_StaticMeshComponent0;         // 0x1000 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Narrow_Var19_StaticMeshComponent0;         // 0x1008 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Narrow_Var18_StaticMeshComponent0;         // 0x1010 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Narrow_Var17_StaticMeshComponent0;         // 0x1018 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Narrow_Var16_StaticMeshComponent0;         // 0x1020 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Narrow_Var15_StaticMeshComponent0;         // 0x1028 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_SingleWindowNarrow2_StaticMeshComponent0;  // 0x1030 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Narrow15_StaticMeshComponent0;             // 0x1038 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_StandardSingleWindow3_StaticMeshComponent0; // 0x1040 (size: 0x8)
    class USceneComponent* Actor2_DefaultSceneRoot;                                   // 0x1048 (size: 0x8)

}; // Size: 0x1050

#endif
