#ifndef UE4SS_SDK_C_SG_CrudePlatformA_HPP
#define UE4SS_SDK_C_SG_CrudePlatformA_HPP

class AC_SG_CrudePlatformA_C : public AConstructionBP_C
{
    class UStaticMeshComponent* SM_Beam6m_Noise7_StaticMeshComponent1;                // 0x0550 (size: 0x8)
    class UStaticMeshComponent* sg_peg4_StaticMeshComponent0;                         // 0x0558 (size: 0x8)
    class UStaticMeshComponent* sg_peg3_StaticMeshComponent0;                         // 0x0560 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_6_StaticMeshComponent0; // 0x0568 (size: 0x8)
    class UStaticMeshComponent* sg_WallRough_A35_StaticMeshComponent0;                // 0x0570 (size: 0x8)
    class UStaticMeshComponent* sg_WallRough_A34_StaticMeshComponent0;                // 0x0578 (size: 0x8)
    class UStaticMeshComponent* sg_WallRough_A33_StaticMeshComponent0;                // 0x0580 (size: 0x8)
    class UStaticMeshComponent* sg_WallRough_A32_StaticMeshComponent0;                // 0x0588 (size: 0x8)
    class UStaticMeshComponent* sg_WallRough_A31_StaticMeshComponent0;                // 0x0590 (size: 0x8)
    class UStaticMeshComponent* sg_WallRough_A30_StaticMeshComponent0;                // 0x0598 (size: 0x8)
    class UStaticMeshComponent* sg_WallRough_A29_StaticMeshComponent0;                // 0x05A0 (size: 0x8)
    class UStaticMeshComponent* sg_WallRough_A28_StaticMeshComponent0;                // 0x05A8 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise8_StaticMeshComponent0;                // 0x05B0 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise7_StaticMeshComponent0;                // 0x05B8 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise6_StaticMeshComponent0;                // 0x05C0 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise5_StaticMeshComponent0;                // 0x05C8 (size: 0x8)
    class UStaticMeshComponent* sg_WallRough_A27_StaticMeshComponent0;                // 0x05D0 (size: 0x8)
    class UStaticMeshComponent* sg_WallRough_A26_StaticMeshComponent0;                // 0x05D8 (size: 0x8)
    class UStaticMeshComponent* sg_WallRough_A25_StaticMeshComponent0;                // 0x05E0 (size: 0x8)
    class USceneComponent* platform2_DefaultSceneRoot;                                // 0x05E8 (size: 0x8)

}; // Size: 0x5F0

#endif
