#ifndef UE4SS_SDK_C_SG_ShedC_HPP
#define UE4SS_SDK_C_SG_ShedC_HPP

class AC_SG_ShedC_C : public AConstructionBP_C
{
    class UStaticMeshComponent* RopeKnotA19_StaticMeshComponent0;                     // 0x0550 (size: 0x8)
    class UStaticMeshComponent* RopeKnotA18_StaticMeshComponent0;                     // 0x0558 (size: 0x8)
    class UStaticMeshComponent* SM_Rope27_StaticMeshComponent0;                       // 0x0560 (size: 0x8)
    class UStaticMeshComponent* SM_Rope26_StaticMeshComponent0;                       // 0x0568 (size: 0x8)
    class UStaticMeshComponent* all_aboard_pivot_boardE43_StaticMeshComponent0;       // 0x0570 (size: 0x8)
    class UStaticMeshComponent* all_aboard_pivot_boardA103_StaticMeshComponent0;      // 0x0578 (size: 0x8)
    class UStaticMeshComponent* all_aboard_pivot_boardE42_StaticMeshComponent0;       // 0x0580 (size: 0x8)
    class UStaticMeshComponent* all_aboard_pivot_boardD22_StaticMeshComponent0;       // 0x0588 (size: 0x8)
    class UStaticMeshComponent* all_aboard_pivot_boardC41_StaticMeshComponent0;       // 0x0590 (size: 0x8)
    class UStaticMeshComponent* all_aboard_pivot_boardB9_StaticMeshComponent0;        // 0x0598 (size: 0x8)
    class UStaticMeshComponent* all_aboard_pivot_boardA102_StaticMeshComponent0;      // 0x05A0 (size: 0x8)
    class UStaticMeshComponent* all_aboard_pivot_boardE41_StaticMeshComponent0;       // 0x05A8 (size: 0x8)
    class UStaticMeshComponent* all_aboard_pivot_boardD21_StaticMeshComponent0;       // 0x05B0 (size: 0x8)
    class UStaticMeshComponent* all_aboard_pivot_boardC40_StaticMeshComponent0;       // 0x05B8 (size: 0x8)
    class UStaticMeshComponent* all_aboard_pivot_boardB8_StaticMeshComponent0;        // 0x05C0 (size: 0x8)
    class UStaticMeshComponent* all_aboard_pivot_boardA101_StaticMeshComponent0;      // 0x05C8 (size: 0x8)
    class UStaticMeshComponent* ropeKnotA15_StaticMeshComponent0;                     // 0x05D0 (size: 0x8)
    class UStaticMeshComponent* ropeKnotA14_StaticMeshComponent0;                     // 0x05D8 (size: 0x8)
    class UStaticMeshComponent* Modular_Fence_3_M_LOD5_ufflaitdw_1_Ultralong34_StaticMeshComponent0; // 0x05E0 (size: 0x8)
    class UStaticMeshComponent* Modular_Fence_3_M_LOD5_ufflaitdw_1_Ultralong33_StaticMeshComponent0; // 0x05E8 (size: 0x8)
    class UStaticMeshComponent* Modular_Fence_3_M_LOD5_ufflaitdw_1_Ultralong32_StaticMeshComponent0; // 0x05F0 (size: 0x8)
    class UStaticMeshComponent* Modular_Fence_3_M_LOD5_ufflaitdw_126_StaticMeshComponent0; // 0x05F8 (size: 0x8)
    class UStaticMeshComponent* Modular_Fence_3_M_LOD5_ufflaitdw_125_StaticMeshComponent0; // 0x0600 (size: 0x8)
    class UStaticMeshComponent* Modular_Fence_3_M_LOD5_ufflaitdw_1_Ultralong31_StaticMeshComponent0; // 0x0608 (size: 0x8)
    class UStaticMeshComponent* Modular_Fence_3_M_LOD5_ufflaitdw_124_StaticMeshComponent0; // 0x0610 (size: 0x8)
    class UStaticMeshComponent* Modular_Fence_3_M_LOD5_ufflaitdw_123_StaticMeshComponent0; // 0x0618 (size: 0x8)
    class USceneComponent* sg_shedC2_DefaultSceneRoot;                                // 0x0620 (size: 0x8)

}; // Size: 0x628

#endif
