#ifndef UE4SS_SDK_C_SG_Guardhouse_lv1_Prison_HPP
#define UE4SS_SDK_C_SG_Guardhouse_lv1_Prison_HPP

class AC_SG_Guardhouse_lv1_Prison_C : public AConstructionBP_C
{
    class UStaticMeshComponent* quoinB_luv16_StaticMeshComponent0;                    // 0x0550 (size: 0x8)
    class UStaticMeshComponent* quoinB_luv15_StaticMeshComponent0;                    // 0x0558 (size: 0x8)
    class UStaticMeshComponent* quoinB_luv14_StaticMeshComponent0;                    // 0x0560 (size: 0x8)
    class UStaticMeshComponent* quoinB_luv13_StaticMeshComponent0;                    // 0x0568 (size: 0x8)
    class UStaticMeshComponent* roofWoodGuardhouse2_StaticMeshComponent0;             // 0x0570 (size: 0x8)
    class UStaticMeshComponent* SG_windowBoardD_square__longer6_StaticMeshComponent0; // 0x0578 (size: 0x8)
    class UStaticMeshComponent* fakeInteriorB2_StaticMeshComponent0;                  // 0x0580 (size: 0x8)
    class UStaticMeshComponent* fakeinteriorA2_StaticMeshComponent0;                  // 0x0588 (size: 0x8)
    class UStaticMeshComponent* Dirty_Castle_Stone_LOD5_sdAta2_StaticMeshComponent0;  // 0x0590 (size: 0x8)
    class UStaticMeshComponent* sg_gatehouseDoor_low2_StaticMeshComponent0;           // 0x0598 (size: 0x8)
    class UStaticMeshComponent* quoinB_luv12_StaticMeshComponent0;                    // 0x05A0 (size: 0x8)
    class UStaticMeshComponent* quoinB_luv11_StaticMeshComponent0;                    // 0x05A8 (size: 0x8)
    class UStaticMeshComponent* quoinB_luv10_StaticMeshComponent0;                    // 0x05B0 (size: 0x8)
    class UStaticMeshComponent* quoinB_luv9_StaticMeshComponent0;                     // 0x05B8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly79_StaticMeshComponent0;    // 0x05C0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly78_StaticMeshComponent0;    // 0x05C8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly77_StaticMeshComponent0;    // 0x05D0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly76_StaticMeshComponent0;    // 0x05D8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly75_StaticMeshComponent0;    // 0x05E0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly74_StaticMeshComponent0;    // 0x05E8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly73_StaticMeshComponent0;    // 0x05F0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly72_StaticMeshComponent0;    // 0x05F8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly71_StaticMeshComponent0;    // 0x0600 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly70_StaticMeshComponent0;    // 0x0608 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly69_StaticMeshComponent0;    // 0x0610 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly68_StaticMeshComponent0;    // 0x0618 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly67_StaticMeshComponent0;    // 0x0620 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly66_StaticMeshComponent0;    // 0x0628 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly65_StaticMeshComponent0;    // 0x0630 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly64_StaticMeshComponent0;    // 0x0638 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly63_StaticMeshComponent0;    // 0x0640 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly62_StaticMeshComponent0;    // 0x0648 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly61_StaticMeshComponent0;    // 0x0650 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly60_StaticMeshComponent0;    // 0x0658 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly59_StaticMeshComponent0;    // 0x0660 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly58_StaticMeshComponent0;    // 0x0668 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly57_StaticMeshComponent0;    // 0x0670 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly56_StaticMeshComponent0;    // 0x0678 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly55_StaticMeshComponent0;    // 0x0680 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly54_StaticMeshComponent0;    // 0x0688 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly53_StaticMeshComponent0;    // 0x0690 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly52_StaticMeshComponent0;    // 0x0698 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly51_StaticMeshComponent0;    // 0x06A0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly50_StaticMeshComponent0;    // 0x06A8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly49_StaticMeshComponent0;    // 0x06B0 (size: 0x8)
    class UStaticMeshComponent* ropeKnotA4_StaticMeshComponent0;                      // 0x06B8 (size: 0x8)
    class UStaticMeshComponent* ropeKnotA3_StaticMeshComponent0;                      // 0x06C0 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed12_StaticMeshComponent0;           // 0x06C8 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed11_StaticMeshComponent0;           // 0x06D0 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed10_StaticMeshComponent0;           // 0x06D8 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed9_StaticMeshComponent0;            // 0x06E0 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed8_StaticMeshComponent0;            // 0x06E8 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed7_StaticMeshComponent0;            // 0x06F0 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardB_thin24_StaticMeshComponent0;          // 0x06F8 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardC_thinner22_StaticMeshComponent0;       // 0x0700 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardB_thin23_StaticMeshComponent0;          // 0x0708 (size: 0x8)
    class UStaticMeshComponent* SG_windowBoardD_square__longer5_StaticMeshComponent0; // 0x0710 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardC_thinner_23_StaticMeshComponent0;      // 0x0718 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardC_thinner21_StaticMeshComponent0;       // 0x0720 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardB_thin22_StaticMeshComponent0;          // 0x0728 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardC_thinner_22_StaticMeshComponent0;      // 0x0730 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardC_thinner20_StaticMeshComponent0;       // 0x0738 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardB_thin21_StaticMeshComponent0;          // 0x0740 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardC_thinner_21_StaticMeshComponent0;      // 0x0748 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardC_thinner19_StaticMeshComponent0;       // 0x0750 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardB_thin20_StaticMeshComponent0;          // 0x0758 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardC_thinner_20_StaticMeshComponent0;      // 0x0760 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardC_thinner_19_StaticMeshComponent0;      // 0x0768 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardC_thinner18_StaticMeshComponent0;       // 0x0770 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardB_thin19_StaticMeshComponent0;          // 0x0778 (size: 0x8)
    class UStaticMeshComponent* SG_windowBoardC_square2_StaticMeshComponent0;         // 0x0780 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardC_thinner_18_StaticMeshComponent0;      // 0x0788 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardC_thinner17_StaticMeshComponent0;       // 0x0790 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardB_thin18_StaticMeshComponent0;          // 0x0798 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardC_thinner_17_StaticMeshComponent0;      // 0x07A0 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardC_thinner16_StaticMeshComponent0;       // 0x07A8 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardB_thin17_StaticMeshComponent0;          // 0x07B0 (size: 0x8)
    class UStaticMeshComponent* SG_windowBoardD_square__longer4_StaticMeshComponent0; // 0x07B8 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardC_thinner_16_StaticMeshComponent0;      // 0x07C0 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardC_thinner15_StaticMeshComponent0;       // 0x07C8 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardB_thin16_StaticMeshComponent0;          // 0x07D0 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardC_thinner_15_StaticMeshComponent0;      // 0x07D8 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardC_thinner14_StaticMeshComponent0;       // 0x07E0 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardB_thin15_StaticMeshComponent0;          // 0x07E8 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardC_thinner_14_StaticMeshComponent0;      // 0x07F0 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardC_thinner13_StaticMeshComponent0;       // 0x07F8 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardB_thin14_StaticMeshComponent0;          // 0x0800 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardC_thinner_13_StaticMeshComponent0;      // 0x0808 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardC_thinner12_StaticMeshComponent0;       // 0x0810 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardB_thin13_StaticMeshComponent0;          // 0x0818 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_57_StaticMeshComponent0; // 0x0820 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_56_StaticMeshComponent0; // 0x0828 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_55_StaticMeshComponent0; // 0x0830 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_54_StaticMeshComponent0; // 0x0838 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_53_StaticMeshComponent0; // 0x0840 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_52_StaticMeshComponent0; // 0x0848 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_51_StaticMeshComponent0; // 0x0850 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_50_StaticMeshComponent0; // 0x0858 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_49_StaticMeshComponent0; // 0x0860 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_48_StaticMeshComponent0; // 0x0868 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_47_StaticMeshComponent0; // 0x0870 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_46_StaticMeshComponent0; // 0x0878 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_45_StaticMeshComponent0; // 0x0880 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_44_StaticMeshComponent0; // 0x0888 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_43_StaticMeshComponent0; // 0x0890 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_42_StaticMeshComponent0; // 0x0898 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_24_StaticMeshComponent0; // 0x08A0 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_23_StaticMeshComponent0; // 0x08A8 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_22_StaticMeshComponent0; // 0x08B0 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_21_StaticMeshComponent0; // 0x08B8 (size: 0x8)
    class UStaticMeshComponent* doorHeadA_angled2_StaticMeshComponent0;               // 0x08C0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short73_StaticMeshComponent0;        // 0x08C8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short72_StaticMeshComponent0;        // 0x08D0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short71_StaticMeshComponent0;        // 0x08D8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short70_StaticMeshComponent0;        // 0x08E0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short69_StaticMeshComponent0;        // 0x08E8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short68_StaticMeshComponent0;        // 0x08F0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short67_StaticMeshComponent0;        // 0x08F8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short66_StaticMeshComponent0;        // 0x0900 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m112_StaticMeshComponent0;                // 0x0908 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m111_StaticMeshComponent0;                // 0x0910 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m110_StaticMeshComponent0;                // 0x0918 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m109_StaticMeshComponent0;                // 0x0920 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m108_StaticMeshComponent0;                // 0x0928 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m107_StaticMeshComponent0;                // 0x0930 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m106_StaticMeshComponent0;                // 0x0938 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m105_StaticMeshComponent0;                // 0x0940 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m104_StaticMeshComponent0;                // 0x0948 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m103_StaticMeshComponent0;                // 0x0950 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m102_StaticMeshComponent0;                // 0x0958 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m101_StaticMeshComponent0;                // 0x0960 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m100_StaticMeshComponent0;                // 0x0968 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m99_StaticMeshComponent0;                 // 0x0970 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m98_StaticMeshComponent0;                 // 0x0978 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m97_StaticMeshComponent0;                 // 0x0980 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m96_StaticMeshComponent0;                 // 0x0988 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m95_StaticMeshComponent0;                 // 0x0990 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth_tapered33_StaticMeshComponent0;   // 0x0998 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth_tapered32_StaticMeshComponent0;   // 0x09A0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth_tapered31_StaticMeshComponent0;   // 0x09A8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth_tapered30_StaticMeshComponent0;   // 0x09B0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth_tapered29_StaticMeshComponent0;   // 0x09B8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth_tapered28_StaticMeshComponent0;   // 0x09C0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m55_StaticMeshComponent0;                 // 0x09C8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m54_StaticMeshComponent0;                 // 0x09D0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short65_StaticMeshComponent0;        // 0x09D8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short64_StaticMeshComponent0;        // 0x09E0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short63_StaticMeshComponent0;        // 0x09E8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short62_StaticMeshComponent0;        // 0x09F0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short61_StaticMeshComponent0;        // 0x09F8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short60_StaticMeshComponent0;        // 0x0A00 (size: 0x8)
    class UStaticMeshComponent* J_SG_BasePrison2_StaticMeshComponent0;                // 0x0A08 (size: 0x8)
    class USceneComponent* Actor3_DefaultSceneRoot;                                   // 0x0A10 (size: 0x8)

}; // Size: 0xA18

#endif
