#ifndef UE4SS_SDK_quarry_prefab_C_HPP
#define UE4SS_SDK_quarry_prefab_C_HPP

class Aquarry_prefab_C_C : public AConstructionBP_C
{
    class UStaticMeshComponent* StaticMeshComponent19;                                // 0x0550 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent18;                                // 0x0558 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent17;                                // 0x0560 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent14;                                // 0x0568 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent13;                                // 0x0570 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent12;                                // 0x0578 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent11;                                // 0x0580 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent4;                                 // 0x0588 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent16;                                // 0x0590 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent15;                                // 0x0598 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent9;                                 // 0x05A0 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent8;                                 // 0x05A8 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent7;                                 // 0x05B0 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent6;                                 // 0x05B8 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent5;                                 // 0x05C0 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent10;                                // 0x05C8 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent37;                                // 0x05D0 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent36;                                // 0x05D8 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent35;                                // 0x05E0 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent34;                                // 0x05E8 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent33;                                // 0x05F0 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent32;                                // 0x05F8 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent31;                                // 0x0600 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent30;                                // 0x0608 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent21;                                // 0x0610 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent28;                                // 0x0618 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent27;                                // 0x0620 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent26;                                // 0x0628 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent25;                                // 0x0630 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent24;                                // 0x0638 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent23;                                // 0x0640 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent22;                                // 0x0648 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent29;                                // 0x0650 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent54;                                // 0x0658 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent53;                                // 0x0660 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent52;                                // 0x0668 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent51;                                // 0x0670 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent50;                                // 0x0678 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent49;                                // 0x0680 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent48;                                // 0x0688 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent47;                                // 0x0690 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent38;                                // 0x0698 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent45;                                // 0x06A0 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent44;                                // 0x06A8 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent43;                                // 0x06B0 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent42;                                // 0x06B8 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent41;                                // 0x06C0 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent40;                                // 0x06C8 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent39;                                // 0x06D0 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent46;                                // 0x06D8 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent55;                                // 0x06E0 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent64;                                // 0x06E8 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent57;                                // 0x06F0 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent56;                                // 0x06F8 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent3;                                 // 0x0700 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent2;                                 // 0x0708 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent1;                                 // 0x0710 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent0;                                 // 0x0718 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent20;                                // 0x0720 (size: 0x8)
    class USceneComponent* Scene;                                                     // 0x0728 (size: 0x8)

}; // Size: 0x730

#endif
