[
  {
    "Type": "DataTable",
    "Name": "DT_Translation_in_progress",
    "Class": "UScriptClass'DataTable'",
    "Properties": {
      "RowStruct": {
        "ObjectName": "ScriptStruct'LocalizedText'",
        "ObjectPath": "/Script/ManorLords"
      }
    },
    "Rows": {
      "barter_warning": {
        "en_US": "Both Regions must offer something for barter to work",
        "zh_CN": "两个区域必须互相提供一些物品才能进行交换",
        "zh_TW": "兩個地區都必須提供某些物品，才能順利交換",
        "ja_JA": "物々交換を成立させるには、互いに何らかの物品を差し出さなければならない",
        "ko_KR": "물물 교환이 되려면 두 지역이 모두 물자를 제공해야 합니다.",
        "de_DE": "Damit ein Tauschhandel zustande kommt, müssen beide Regionen Tauschgut anbieten.",
        "es_ES": "Ambas regiones deben ofrecer algo para que se pueda hacer un trueque.",
        "fr_FR": "Pour que l'échange fonctionne, chaque région doit proposer quelque chose",
        "pt_BR": "Ambas as regiões devem oferecer algum produto para que a permuta seja possível.",
        "pl_PL": "Aby wymiana była możliwa, oba regiony muszą coś oferować",
        "ru_RU": "Чтобы обмен состоялся, оба региона должны что-то предложить.",
        "it_IT": "Entrambe le regioni devono offrire qualcosa per rendere valido il baratto",
        "tr_TR": "Değiş tokuş yapılabilmesi için iki Bölge de bir şeyler teklif etmelidir",
        "cs_CZ": "Aby mohl směnný obchod fungovat, musí oba regiony něco nabídnout",
        "hu_HU": "Mindkét régiónak fel kell ajánlania valamit a cserekereskedelemhez",
        "uk_UA": "Обидва регіони повинні запропонувати щось на обмін, щоб відбувся бартер.",
        "da_DK": "Begge regioner skal tilbyde noget, før der kan handles",
        "nl_NL": "Beide gebieden moeten iets aanbieden om de ruilhandel te laten slagen",
        "sv_SE": "Båda regionerna måste erbjuda handelsvaror"
      },
      "market_supply_descr": {
        "en_US": "This view doesn't show physical locations of goods, but instead it shows their <h>AVAILABILITY</>. Burgage plots nearest to the Marketplace have the best availability of goods, and therefore can be upgraded faster. It creates a cascading effect, and houses on the outskirts will always have a worse time upgrading.",
        "zh_CN": "此视图不会显示货物的具体位置，而是显示货物的 <h>供应情况</>。靠近市场的堡地因货物供应充足升级更快。与之相对地，距离市场越远的外围房屋将始终难以升级。",
        "zh_TW": "本圖並未顯示貨物的具體位置，而是貨物的 <h>取得方便程度</>。距離市場最近的城鎮區就最容易獲得貨物，升級速度也更快。如同漣漪越是擴散就越淡薄，最外圍的房屋升級的難度也最高。",
        "ja_JA": "この表示は、商品が実際に置かれている場所ではなく、その「入手可能性」を示すものです。市場の近い生活区画は品揃えが充実しているため、他に比べて早くアップグレードができます。もしそうした場合、郊外の家は連鎖反応でアップグレードが遅れがちになります。",
        "ko_KR": "상품의 실제 위치가 아닌 <h>가용성</>을 나타냅니다. 시장과 가장 가까이 위치한 거주 구획은 상품 가용성이 높기 때문에 가장 빠르게 업그레이드할 수 있습니다. 효과는 계단식으로 발생하며, 외곽 쪽에 위치한 거주 구획은 업그레이드 속도가 가장 느립니다.",
        "de_DE": "In dieser Ansicht seht Ihr anstelle der Warenstandorte die <h>VERFÜGBARKEIT</> von Waren. Für jene Hofstätten, die dem Marktplatz am nächsten sind, ist die Verfügbarkeit von Waren besonders hoch, weshalb sie schneller ausgebaut werden können. Die Verfügbarkeit nimmt mit zunehmender Entfernung sukzessive ab, weshalb Häuser am Stadtrand schwerer ausgebaut werden können.",
        "es_ES": "Esta vista no muestra las ubicaciones físicas en las que se encuentran los recursos, sino su <h>DISPONIBILIDAD</>. Aquellos señoríos que se encuentren cerca del mercado disfrutan de un acceso mayor a estos recursos, por lo que podrán mejorar con más facilidad. Así, se produce un efecto cascada, aunque las casas más lejanas lo tienen más difícil.",
        "fr_FR": "Ce calque n'affiche pas l'emplacement physique des biens, mais il indique leur <h>DISPONIBILITÉ</>. Les censives les plus proches du marché auront un meilleur accès aux biens et pourront dont être améliorées plus rapidement. À l'inverse, il sera toujours plus long d'améliorer les maisons les plus éloignées.",
        "pt_BR": "Esta camada não mostra a onde os produtos estão localizados nas residências, mas sim sua <h>DISPONIBILIDADE</> para as residências. Os lotes senhoriais mais próximos aos mercados têm a melhor disponibilidade de produtos e, portanto, podem ser melhorados mais rapidamente. Um efeito cascata é criado, e as casas mais distantes terão mais dificuldade em serem melhoradas.",
        "pl_PL": "Ten widok nie przedstawia lokalizacji towarów, ale ich <h>DOSTĘPNOŚĆ</>. Parcele mieszkalne w pobliżu targu mają najlepszy dostęp do towarów, dzięki czemu można je ulepszać szybciej. Wpływ dostępności działa kaskadowo, więc domy zbudowane na peryferiach zawsze najtrudniej ulepszyć.",
        "ru_RU": "В этом режиме отображаются не сами товары, а их <h>ДОСТУПНОСТЬ</>. Хозяйства, расположенные ближе всего к рынку, имеют самый большой выбор товаров, поэтому их можно усовершенствовать в первую очередь. Это создает каскадный эффект, и дома на окраине всегда будут улучшаться медленнее.",
        "it_IT": "Questa visuale non mostra l'ubicazione fisica delle merci, bensì la loro <h>DISPONIBILITÀ</>. I Burgage più vicini al mercato avranno una maggiore disponibilità di merci e potranno essere migliorati più rapidamente. Ciò risulta in un effetto a cascata, pertanto le case periferiche avranno tempi di miglioramento peggiori.",
        "tr_TR": "Bu görünüm, malların fiziksel konumunu değil <h>MEVCUTLUK</> durumunu gösterir. Malların mevcutluk durumu, pazar yerine en yakın tımar arazilerinde en yüksek olduğu için o araziler daha hızlı yükseltilebilir. Bu etki peş peşe devam eder ve uzaktaki evler her zaman daha zor yükseltilir.",
        "cs_CZ": "Tento pohled nezobrazuje fyzickou lokaci zboží, ale místo toho ukazuje jeho <h>DOSTUPNOST</>. Držební domy nejblíže k tržišti mají nejlepší dostupnost zboží, takže je lze vylepšovat rychleji. Vytváří se tím kaskádový efekt a domy na předměstí se budou vždy vylepšovat pomaleji.",
        "hu_HU": "Ez a nézet nem az áruk fizikai helyét mutatja, hanem az <h>ELÉRHETŐSÉGÜKET</>. A piactérhez legközelebbi polgári telkeken a legjobb az áruk elérhetősége, és ezért gyorsabban fejleszthetők. Ez halmozódó hatást hoz létre, és a külterületeken lévő házak mindig nehezebben fognak felfejlődni.",
        "uk_UA": "Цей екран не показує, де знаходяться товари, а показує лише їхню <h>НАЯВНІСТЬ</>. Найближчі до ринку господарства мають найкращу доступність товарів, тому можуть бути поліпшені швидше. Це створює каскадний ефект, через який будинки на околицях завжди поліпшуються повільніше.",
        "da_DK": "Denne visning viser ikke varers fysiske placering, men deres <h>TILGÆNGELIGHED</>. Borgerlodder tættere på markedet har bedre adgang til varer, og de kan derfor opgraderes hurtigere. Det skaber en kaskadeeffekt, og huse i udkanten vil altid have sværere ved at opgradere.",
        "nl_NL": "Deze weergave toont niet waar goederen zich fysiek bevinden, maar wel de <h>BESCHIKBAARHEID</> van die goederen. Pachtkavels die dicht bij de marktplaats staan, kunnen het beste aan goederen komen en kunnen daarom sneller worden geüpgraded. Dit zorgt voor een domino-effect: huizen aan de randen zullen altijd moeilijker te upgraden zijn.",
        "sv_SE": "Den här vyn visar inte var varor finns rent fysiskt utan vilken <h>TILLGÄNGLIGHET</> de har. Hyrestomterna närmast marknaden har störst tillgänglighet vad gäller varor och kan därför uppgraderas snabbare. Ju längre ifrån marknaden, desto långsammare – hus på ytterkanten tar alltid längst tid på sig."
      },
      "market_limits": {
        "en_US": "Supply limits",
        "zh_CN": "供给上限",
        "zh_TW": "供應上限",
        "ja_JA": "物資供給の上限",
        "ko_KR": "공급 한도",
        "de_DE": "Angebotslimits",
        "es_ES": "Límites de la oferta",
        "fr_FR": "Limites d'approvisionnement",
        "pt_BR": "Limites de suprimento",
        "pl_PL": "Granice podaży",
        "ru_RU": "Ограничение спроса",
        "it_IT": "Limiti di offerta",
        "tr_TR": "Arz sınırları",
        "cs_CZ": "Limity nabídky",
        "hu_HU": "Ellátási korlátok",
        "uk_UA": "Ліміт пропозиції",
        "da_DK": "Forsyningsgrænser",
        "nl_NL": "Voorraadbeperking",
        "sv_SE": "Tillgångsbegränsningar"
      },
      "current_town_size": {
        "en_US": "Settlement size",
        "zh_CN": "定居点规模",
        "zh_TW": "聚落規模",
        "ja_JA": "居留地の規模",
        "ko_KR": "정착지 규모",
        "de_DE": "Siedlungsgröße",
        "es_ES": "Tamaño del asentamiento",
        "fr_FR": "Taille de la colonie",
        "pt_BR": "Tamanho do assentamento",
        "pl_PL": "Wielkość osady",
        "ru_RU": "Размер поселения",
        "it_IT": "Dimensioni dell'insediamento",
        "tr_TR": "Yerleşim boyutu",
        "cs_CZ": "Velikost osady",
        "hu_HU": "Település mérete",
        "uk_UA": "Розмір поселення",
        "da_DK": "Bosættelsens størrelse",
        "nl_NL": "Grootte nederzetting",
        "sv_SE": "Bosättningsstorlek"
      },
      "load_custom_coat": {
        "en_US": "Load a custom texture",
        "zh_CN": "加载自定义纹理",
        "zh_TW": "載入自訂紋理",
        "ja_JA": "カスタムテクスチャのロード",
        "ko_KR": "커스텀 텍스처 불러오기",
        "de_DE": "Benutzerdefinierte Textur laden",
        "es_ES": "Cargar textura personalizada",
        "fr_FR": "Charger une texture personnalisée",
        "pt_BR": "Carregar textura personalizada",
        "pl_PL": "Wczytaj własną teksturę",
        "ru_RU": "Загрузить свою текстуру",
        "it_IT": "Carica una texture personalizzata",
        "tr_TR": "Özel doku yükle",
        "cs_CZ": "Načíst vlastní texturu",
        "hu_HU": "Egyéni textúra betöltése",
        "uk_UA": "Завантажити користувацьку текстуру",
        "da_DK": "Indlæs en brugerdefineret tekstur",
        "nl_NL": "Een aangepaste texture laden",
        "sv_SE": "Ladda en anpassad textur"
      },
      "load_custom_coat_descr": {
        "en_US": "Go to Drive/Users/Username/AppData/Local/ManorLords/Saved/SaveGames/ and place your square custom_coat.png file to import your custom graphic for the coat of arms and the banner.",
        "zh_CN": "前往 Drive/Users/Username/AppData/Local/ManorLords/Saved/SaveGames/ 放置你的 square custom_coat.png 文件，即可自定义家族纹章与旗帜外观。",
        "zh_TW": "前往 Drive/Users/Username/AppData/Local/ManorLords/Saved/SaveGames/ 並放置你的 square custom_coat.png file 即可匯入自訂紋章及橫幅圖案。",
        "ja_JA": "以下のフォルダ（Drive/Users/Username/AppData/Local/ManorLords/Saved/SaveGames/）に正方形の画像ファイル（custom_coat.png）を格納すると、あなたがデザインした紋章と旗が読み込まれます。",
        "ko_KR": "Drive/Users/AppData/ManorLords/Saved/SavedGames 폴더에 custom_coat.png라는 이름으로 사각형 이미지 파일을 넣으면 나만의 커스텀 상징을 게임에 추가할 수 있습니다.",
        "de_DE": "Öffnet Drive/Users/Username/AppData/Local/ManorLords/Saved/SaveGames/ und platziert „square custom_coat.png“, um Eure benutzerdefinierte Graphik als Wappen und Banner importieren zu können.",
        "es_ES": "Ve a (Tu equipo)/Users/(Tu usuario)/AppData/Local/ManorLords/Saved/SaveGames/ y coloca allí tu archivo cuadrado en png con el nombre «custom_coat.png» para importar una imagen personalizada que poder usar en el escudo heráldico y bandera de tu líder.",
        "fr_FR": "Ouvrez le dossier C:/Utilisateurs/(nom d'utilisateur)/AppData/Local/ManorLords/Saved/SaveGames/ et déposez un fichier au format carré nommé custom_coat.png afin d'importer un dessin personnalisé pour votre blason et votre bannière.",
        "pt_BR": "Acesse a pasta Drive/Users/Username/AppData/Local/ManorLords/Saved/SaveGames/ e deixe um arquivo quadrado identificado como custom_coat.png para importar uma imagem personalizada para ser seu brasão e estandarte.",
        "pl_PL": "Przejdź do folderu Drive/Users/Username/AppData/Local/ManorLords/Saved/SaveGames/ i umieść w nim swój kwadratowy obraz custom_coat.png, by móc zaimportować własną grafikę na herb i sztandar.",
        "ru_RU": "В качестве текстуры для герба и знамени вы можете использовать свое изображение: убедитесь, что оно имеет квадратную форму, сохраните его под названием custom_coat.png и скопируйте файл в директорию «[диск]/Users/[имя пользователя]/AppData/Local/ManorLords/Saved/SaveGames/».",
        "it_IT": "Vai in Drive/Users/Username/AppData/Local/ManorLords/Saved/SaveGames/ e inserisci un file custom_coat.png per importare la tua grafica personale per il blasone e il vessillo.",
        "tr_TR": "Arma ve sancak için özel bir görsel yüklemek istersen kare biçimindeki custom_coat.png dosyanı Drive/Users/Username/AppData/Local/ManorLords/Saved/SaveGames/ konumuna yerleştirebilirsin.",
        "cs_CZ": "Pokud chceš importovat vlastní grafiku pro erb a prapor, otevři složku Drive/Users/Username/AppData/Local/ManorLords/Saved/SaveGames/ a vlož tam vlastní soubor custom_coat.png.",
        "hu_HU": "Menj a Drive/Users/Username/AppData/Local/ManorLords/Saved/SaveGames/ mappába, és oda helyezd el a négyzet alakú custom_coat.png fájlt, hogy egyéni képet importálhass a címerhez és a zászlóhoz.",
        "uk_UA": "Виберіть Drive/Users/Username/AppData/Local/ManorLords/Saved/SaveGames/ і розмістіть там ваш файл custom_coat.png, щоб імпортувати користувацьке зображення для герба й прапора.",
        "da_DK": "Placér din kvadratiske custom_coat.png-fil i Drev\\Users\\Brugernavn\\AppData\\Local\\ManorLords\\Saved\\SaveGames\\, så kan du bruge din egen grafik til våbenskjoldet og banneret.",
        "nl_NL": "Ga naar Drive/Users/Username/AppData/Local/ManorLords/Saved/SaveGames/ en plaats daar je vierkante bestand genaamd custom_coat.png om je aangepaste afbeelding te importeren voor het wapen en de vaandel.",
        "sv_SE": "Gå till Enhet/Användare/Användarnamn/AppData/Local/ManorLords/Saved/SaveGames/ och lägg en kvadratisk png-fil med namnet custom_coat.png där för att importera din egen bild till vapenskölden och fanan."
      }
    }
  }
]