#ifndef UE4SS_SDK_BM_Field_HPP
#define UE4SS_SDK_BM_Field_HPP

class ABM_Field_C : public AStaticMeshActor
{
    class UStaticMeshComponent* Res_11_5;                                             // 0x02A0 (size: 0x8)
    class UStaticMeshComponent* Res_11_4;                                             // 0x02A8 (size: 0x8)
    class UStaticMeshComponent* Res_11_3;                                             // 0x02B0 (size: 0x8)
    class UStaticMeshComponent* Res_11_2;                                             // 0x02B8 (size: 0x8)
    class UStaticMeshComponent* Res_11_1;                                             // 0x02C0 (size: 0x8)
    class UStaticMeshComponent* Res_11_0;                                             // 0x02C8 (size: 0x8)
    class UStaticMeshComponent* Res_165_18;                                           // 0x02D0 (size: 0x8)
    class UStaticMeshComponent* Res_165_17;                                           // 0x02D8 (size: 0x8)
    class UStaticMeshComponent* Res_165_14;                                           // 0x02E0 (size: 0x8)
    class UStaticMeshComponent* Res_165_16;                                           // 0x02E8 (size: 0x8)
    class UStaticMeshComponent* Res_165_15;                                           // 0x02F0 (size: 0x8)
    class UStaticMeshComponent* Res_165_13;                                           // 0x02F8 (size: 0x8)
    class UStaticMeshComponent* Res_217_12;                                           // 0x0300 (size: 0x8)
    class UStaticMeshComponent* Res_217_11;                                           // 0x0308 (size: 0x8)
    class UStaticMeshComponent* Res_217_10;                                           // 0x0310 (size: 0x8)
    class UStaticMeshComponent* Res_217_9;                                            // 0x0318 (size: 0x8)
    class UStaticMeshComponent* Res_217_8;                                            // 0x0320 (size: 0x8)
    class UStaticMeshComponent* Res_217_7;                                            // 0x0328 (size: 0x8)
    class UStaticMeshComponent* Res_217_6;                                            // 0x0330 (size: 0x8)
    class UStaticMeshComponent* Res_217_5;                                            // 0x0338 (size: 0x8)
    class UStaticMeshComponent* Res_217_4;                                            // 0x0340 (size: 0x8)
    class UStaticMeshComponent* Res_217_3;                                            // 0x0348 (size: 0x8)
    class UStaticMeshComponent* Res_217_2;                                            // 0x0350 (size: 0x8)
    class UStaticMeshComponent* Res_217_1;                                            // 0x0358 (size: 0x8)

}; // Size: 0x360

#endif
