#ifndef UE4SS_SDK_BM_Guardhouse_Lv1_HPP
#define UE4SS_SDK_BM_Guardhouse_Lv1_HPP

class ABM_Guardhouse_Lv1_C : public AStaticMeshActor
{
    class UStaticMeshComponent* Dirt_3_1;                                             // 0x02A0 (size: 0x8)
    class UStaticMeshComponent* dirt_0_0;                                             // 0x02A8 (size: 0x8)
    class UStaticMeshComponent* Bld_405_26;                                           // 0x02B0 (size: 0x8)
    class UStaticMeshComponent* Bld_405_25;                                           // 0x02B8 (size: 0x8)
    class UStaticMeshComponent* Bld_405_24;                                           // 0x02C0 (size: 0x8)
    class UStaticMeshComponent* Bld_405_23;                                           // 0x02C8 (size: 0x8)
    class UStaticMeshComponent* Bld_405_22;                                           // 0x02D0 (size: 0x8)
    class UStaticMeshComponent* Bld_405_21;                                           // 0x02D8 (size: 0x8)
    class UStaticMeshComponent* Bld_405_20;                                           // 0x02E0 (size: 0x8)
    class UStaticMeshComponent* Bld_405_19;                                           // 0x02E8 (size: 0x8)
    class UStaticMeshComponent* Bld_405_18;                                           // 0x02F0 (size: 0x8)
    class UStaticMeshComponent* Bld_405_17;                                           // 0x02F8 (size: 0x8)
    class UStaticMeshComponent* Bld_405_16;                                           // 0x0300 (size: 0x8)
    class UStaticMeshComponent* Bld_405_15;                                           // 0x0308 (size: 0x8)
    class UStaticMeshComponent* Bld_405_14;                                           // 0x0310 (size: 0x8)
    class UStaticMeshComponent* Bld_406_1;                                            // 0x0318 (size: 0x8)
    class UStaticMeshComponent* MainBld_457;                                          // 0x0320 (size: 0x8)

}; // Size: 0x328

#endif
