#ifndef UE4SS_SDK_BM_HuntingCamp_HPP
#define UE4SS_SDK_BM_HuntingCamp_HPP

class ABM_HuntingCamp_C : public AStaticMeshActor
{
    class UStaticMeshComponent* res_3_1;                                              // 0x02A0 (size: 0x8)
    class UStaticMeshComponent* res_3_0;                                              // 0x02A8 (size: 0x8)
    class UStaticMeshComponent* res_147_5;                                            // 0x02B0 (size: 0x8)
    class UStaticMeshComponent* res_147_4;                                            // 0x02B8 (size: 0x8)
    class UStaticMeshComponent* res_147_3;                                            // 0x02C0 (size: 0x8)
    class UStaticMeshComponent* lazyBld_48_1;                                         // 0x02C8 (size: 0x8)
    class UStaticMeshComponent* lazyBld_48_0;                                         // 0x02D0 (size: 0x8)
    class UStaticMeshComponent* bld_0_table;                                          // 0x02D8 (size: 0x8)
    class USceneComponent* ambience_fireplace;                                        // 0x02E0 (size: 0x8)
    class USceneComponent* ambience_flag;                                             // 0x02E8 (size: 0x8)
    class UStaticMeshComponent* PS_Smoke;                                             // 0x02F0 (size: 0x8)
    class UStaticMeshComponent* Bld_401_3;                                            // 0x02F8 (size: 0x8)
    class UStaticMeshComponent* Bld_401_2;                                            // 0x0300 (size: 0x8)
    class UStaticMeshComponent* Bld_401_1;                                            // 0x0308 (size: 0x8)
    class UStaticMeshComponent* MainBld_35;                                           // 0x0310 (size: 0x8)
    class UStaticMeshComponent* clutter_8;                                            // 0x0318 (size: 0x8)
    class UStaticMeshComponent* clutter_7;                                            // 0x0320 (size: 0x8)
    class UStaticMeshComponent* clutter_6;                                            // 0x0328 (size: 0x8)
    class UStaticMeshComponent* clutter_1;                                            // 0x0330 (size: 0x8)
    class UStaticMeshComponent* MainBld_408;                                          // 0x0338 (size: 0x8)
    class UStaticMeshComponent* MainBld_410;                                          // 0x0340 (size: 0x8)
    class UStaticMeshComponent* dirt_0_1;                                             // 0x0348 (size: 0x8)
    class UStaticMeshComponent* Bench_2_2;                                            // 0x0350 (size: 0x8)
    class UStaticMeshComponent* Bench_2_1;                                            // 0x0358 (size: 0x8)
    class UStaticMeshComponent* MainBld_409;                                          // 0x0360 (size: 0x8)

}; // Size: 0x368

#endif
