#ifndef UE4SS_SDK_BM_SG_Firecutter_HPP
#define UE4SS_SDK_BM_SG_Firecutter_HPP

class ABM_SG_Firecutter_C : public AStaticMeshActor
{
    class UStaticMeshComponent* res_216_6;                                            // 0x02A0 (size: 0x8)
    class UStaticMeshComponent* res_216_5;                                            // 0x02A8 (size: 0x8)
    class UStaticMeshComponent* res_216_4;                                            // 0x02B0 (size: 0x8)
    class UStaticMeshComponent* res_216_3;                                            // 0x02B8 (size: 0x8)
    class UStaticMeshComponent* res_216_2;                                            // 0x02C0 (size: 0x8)
    class UStaticMeshComponent* res_216_1;                                            // 0x02C8 (size: 0x8)
    class UStaticMeshComponent* res_216_0;                                            // 0x02D0 (size: 0x8)
    class UStaticMeshComponent* bench_257_2;                                          // 0x02D8 (size: 0x8)
    class UStaticMeshComponent* Bld_154_6;                                            // 0x02E0 (size: 0x8)
    class UStaticMeshComponent* bench_257_1;                                          // 0x02E8 (size: 0x8)
    class UStaticMeshComponent* Bld_154_7;                                            // 0x02F0 (size: 0x8)
    class UStaticMeshComponent* bench_257;                                            // 0x02F8 (size: 0x8)
    class UStaticMeshComponent* Dirt_3_1;                                             // 0x0300 (size: 0x8)
    class UStaticMeshComponent* lazyBld_48_3;                                         // 0x0308 (size: 0x8)
    class UStaticMeshComponent* lazyBld_48_2;                                         // 0x0310 (size: 0x8)
    class UStaticMeshComponent* Clutter15;                                            // 0x0318 (size: 0x8)
    class UStaticMeshComponent* Clutter14;                                            // 0x0320 (size: 0x8)
    class UStaticMeshComponent* Clutter13;                                            // 0x0328 (size: 0x8)
    class UStaticMeshComponent* Clutter12;                                            // 0x0330 (size: 0x8)
    class UStaticMeshComponent* Clutter11;                                            // 0x0338 (size: 0x8)
    class UStaticMeshComponent* Clutter10;                                            // 0x0340 (size: 0x8)
    class UStaticMeshComponent* Clutter8;                                             // 0x0348 (size: 0x8)
    class UStaticMeshComponent* Clutter7;                                             // 0x0350 (size: 0x8)
    class USceneComponent* gathering;                                                 // 0x0358 (size: 0x8)
    class UStaticMeshComponent* Dirt_3_0;                                             // 0x0360 (size: 0x8)
    class UStaticMeshComponent* Bld_154_5;                                            // 0x0368 (size: 0x8)
    class UStaticMeshComponent* dirt_0_3;                                             // 0x0370 (size: 0x8)
    class UStaticMeshComponent* clutter_fenceEnd3;                                    // 0x0378 (size: 0x8)
    class UStaticMeshComponent* clutter_fenceEnd2;                                    // 0x0380 (size: 0x8)
    class UStaticMeshComponent* clutter_fenceEnd1;                                    // 0x0388 (size: 0x8)
    class UStaticMeshComponent* Bld_401_8;                                            // 0x0390 (size: 0x8)
    class UStaticMeshComponent* Bld_401_7;                                            // 0x0398 (size: 0x8)
    class UStaticMeshComponent* Bld_401_6;                                            // 0x03A0 (size: 0x8)
    class UStaticMeshComponent* Bld_401_2;                                            // 0x03A8 (size: 0x8)
    class UStaticMeshComponent* Bld_401_0;                                            // 0x03B0 (size: 0x8)
    class UStaticMeshComponent* Clutter5;                                             // 0x03B8 (size: 0x8)
    class UStaticMeshComponent* Clutter4;                                             // 0x03C0 (size: 0x8)
    class UStaticMeshComponent* Clutter2;                                             // 0x03C8 (size: 0x8)
    class UStaticMeshComponent* Clutter1;                                             // 0x03D0 (size: 0x8)
    class UStaticMeshComponent* clutter;                                              // 0x03D8 (size: 0x8)
    class UStaticMeshComponent* storage;                                              // 0x03E0 (size: 0x8)
    class UStaticMeshComponent* fullBld_427;                                          // 0x03E8 (size: 0x8)
    class UStaticMeshComponent* PS_Smoke;                                             // 0x03F0 (size: 0x8)
    class UStaticMeshComponent* fullBld_35;                                           // 0x03F8 (size: 0x8)
    class UStaticMeshComponent* MainBld_426;                                          // 0x0400 (size: 0x8)

}; // Size: 0x408

#endif
