#ifndef UE4SS_SDK_BM_SG_Communaloven_HPP
#define UE4SS_SDK_BM_SG_Communaloven_HPP

class ABM_SG_Communaloven_C : public AStaticMeshActor
{
    class USceneComponent* workpos1;                                                  // 0x02A0 (size: 0x8)
    class USceneComponent* workPos;                                                   // 0x02A8 (size: 0x8)
    class UStaticMeshComponent* clutter_3;                                            // 0x02B0 (size: 0x8)
    class UStaticMeshComponent* clutter_2;                                            // 0x02B8 (size: 0x8)
    class UStaticMeshComponent* Dirt_3_2;                                             // 0x02C0 (size: 0x8)
    class UStaticMeshComponent* Dirt_3_1;                                             // 0x02C8 (size: 0x8)
    class UStaticMeshComponent* clutter_1;                                            // 0x02D0 (size: 0x8)
    class UStaticMeshComponent* res_216_8;                                            // 0x02D8 (size: 0x8)
    class UStaticMeshComponent* res_216_7;                                            // 0x02E0 (size: 0x8)
    class UStaticMeshComponent* res_216_6;                                            // 0x02E8 (size: 0x8)
    class UStaticMeshComponent* res_216_5;                                            // 0x02F0 (size: 0x8)
    class UStaticMeshComponent* res_216_4;                                            // 0x02F8 (size: 0x8)
    class UStaticMeshComponent* res_216_3;                                            // 0x0300 (size: 0x8)
    class UStaticMeshComponent* res_216_2;                                            // 0x0308 (size: 0x8)
    class UStaticMeshComponent* res_216_1;                                            // 0x0310 (size: 0x8)
    class UStaticMeshComponent* res_216_0;                                            // 0x0318 (size: 0x8)
    class UStaticMeshComponent* bld_workdoor;                                         // 0x0320 (size: 0x8)
    class UStaticMeshComponent* clutter_stones8;                                      // 0x0328 (size: 0x8)
    class UStaticMeshComponent* clutter_stones7;                                      // 0x0330 (size: 0x8)
    class UStaticMeshComponent* clutter_stones6;                                      // 0x0338 (size: 0x8)
    class UStaticMeshComponent* clutter_stones5;                                      // 0x0340 (size: 0x8)
    class UStaticMeshComponent* clutter_stones4;                                      // 0x0348 (size: 0x8)
    class UStaticMeshComponent* clutter_stones3;                                      // 0x0350 (size: 0x8)
    class UStaticMeshComponent* clutter_stones2;                                      // 0x0358 (size: 0x8)
    class UStaticMeshComponent* res_5_2;                                              // 0x0360 (size: 0x8)
    class UStaticMeshComponent* res_5_1;                                              // 0x0368 (size: 0x8)
    class UStaticMeshComponent* res_5_0;                                              // 0x0370 (size: 0x8)
    class UStaticMeshComponent* MainBld_431;                                          // 0x0378 (size: 0x8)
    class UStaticMeshComponent* clutter_0;                                            // 0x0380 (size: 0x8)
    class UStaticMeshComponent* bld_oven;                                             // 0x0388 (size: 0x8)
    class UStaticMeshComponent* res_16_1;                                             // 0x0390 (size: 0x8)
    class UStaticMeshComponent* res_16_0;                                             // 0x0398 (size: 0x8)
    class UStaticMeshComponent* res_172_8;                                            // 0x03A0 (size: 0x8)
    class UStaticMeshComponent* res_172_7;                                            // 0x03A8 (size: 0x8)
    class UStaticMeshComponent* res_172_6;                                            // 0x03B0 (size: 0x8)
    class UStaticMeshComponent* res_172_5;                                            // 0x03B8 (size: 0x8)
    class UStaticMeshComponent* clutter_stones1;                                      // 0x03C0 (size: 0x8)
    class UStaticMeshComponent* dirt_0_0;                                             // 0x03C8 (size: 0x8)
    class UStaticMeshComponent* MainBld_441;                                          // 0x03D0 (size: 0x8)
    class USceneComponent* workpos2;                                                  // 0x03D8 (size: 0x8)
    class USceneComponent* Scene;                                                     // 0x03E0 (size: 0x8)

}; // Size: 0x3E8

#endif
