#ifndef UE4SS_SDK_BM_SG_Manor_Lv1_Palace_Solo_HPP
#define UE4SS_SDK_BM_SG_Manor_Lv1_Palace_Solo_HPP

class ABM_SG_Manor_Lv1_Palace_Solo_C : public AStaticMeshActor
{
    class UStaticMeshComponent* dirt_0_3;                                             // 0x02A0 (size: 0x8)
    class UStaticMeshComponent* res_17_6;                                             // 0x02A8 (size: 0x8)
    class UStaticMeshComponent* res_17_5;                                             // 0x02B0 (size: 0x8)
    class UStaticMeshComponent* res_17_4;                                             // 0x02B8 (size: 0x8)
    class UStaticMeshComponent* res_17_3;                                             // 0x02C0 (size: 0x8)
    class UStaticMeshComponent* res_17_2;                                             // 0x02C8 (size: 0x8)
    class UStaticMeshComponent* res_17_1;                                             // 0x02D0 (size: 0x8)
    class UStaticMeshComponent* res_17_0;                                             // 0x02D8 (size: 0x8)
    class UStaticMeshComponent* res_15_11;                                            // 0x02E0 (size: 0x8)
    class UStaticMeshComponent* res_15_10;                                            // 0x02E8 (size: 0x8)
    class UStaticMeshComponent* res_15_9;                                             // 0x02F0 (size: 0x8)
    class UStaticMeshComponent* res_15_8;                                             // 0x02F8 (size: 0x8)
    class UStaticMeshComponent* res_15_7;                                             // 0x0300 (size: 0x8)
    class UStaticMeshComponent* res_15_6;                                             // 0x0308 (size: 0x8)
    class UStaticMeshComponent* res_15_1;                                             // 0x0310 (size: 0x8)
    class UStaticMeshComponent* res_15_5;                                             // 0x0318 (size: 0x8)
    class UStaticMeshComponent* res_15_4;                                             // 0x0320 (size: 0x8)
    class UStaticMeshComponent* res_15_3;                                             // 0x0328 (size: 0x8)
    class UStaticMeshComponent* res_15_2;                                             // 0x0330 (size: 0x8)
    class UStaticMeshComponent* res_15_0;                                             // 0x0338 (size: 0x8)
    class USceneComponent* Scene;                                                     // 0x0340 (size: 0x8)
    class UStaticMeshComponent* constr_ladder_2;                                      // 0x0348 (size: 0x8)
    class UStaticMeshComponent* constr_ladder_0;                                      // 0x0350 (size: 0x8)
    class UStaticMeshComponent* res_16_7;                                             // 0x0358 (size: 0x8)
    class UStaticMeshComponent* res_16_6;                                             // 0x0360 (size: 0x8)
    class UStaticMeshComponent* res_16_5;                                             // 0x0368 (size: 0x8)
    class UStaticMeshComponent* res_16_2;                                             // 0x0370 (size: 0x8)
    class UStaticMeshComponent* res_16_1;                                             // 0x0378 (size: 0x8)
    class UStaticMeshComponent* res_16_0;                                             // 0x0380 (size: 0x8)
    class UStaticMeshComponent* clutter_bush7;                                        // 0x0388 (size: 0x8)
    class UStaticMeshComponent* clutter_stones27;                                     // 0x0390 (size: 0x8)
    class UStaticMeshComponent* clutter_stones26;                                     // 0x0398 (size: 0x8)
    class UStaticMeshComponent* clutter_stones25;                                     // 0x03A0 (size: 0x8)
    class UStaticMeshComponent* clutter_stones21;                                     // 0x03A8 (size: 0x8)
    class UStaticMeshComponent* clutter_stones20;                                     // 0x03B0 (size: 0x8)
    class UStaticMeshComponent* clutter_stones19;                                     // 0x03B8 (size: 0x8)
    class UStaticMeshComponent* clutter_stones18;                                     // 0x03C0 (size: 0x8)
    class UStaticMeshComponent* clutter_stones17;                                     // 0x03C8 (size: 0x8)
    class UStaticMeshComponent* clutter_stones16;                                     // 0x03D0 (size: 0x8)
    class UStaticMeshComponent* clutter_stones15;                                     // 0x03D8 (size: 0x8)
    class UStaticMeshComponent* clutter_stones14;                                     // 0x03E0 (size: 0x8)
    class UStaticMeshComponent* clutter_stones13;                                     // 0x03E8 (size: 0x8)
    class UStaticMeshComponent* clutter_stones10;                                     // 0x03F0 (size: 0x8)
    class UStaticMeshComponent* clutter_stones9;                                      // 0x03F8 (size: 0x8)
    class UStaticMeshComponent* clutter_stones8;                                      // 0x0400 (size: 0x8)
    class UStaticMeshComponent* clutter_stones7;                                      // 0x0408 (size: 0x8)
    class UStaticMeshComponent* dirt_0_2;                                             // 0x0410 (size: 0x8)
    class UStaticMeshComponent* MainBld_144;                                          // 0x0418 (size: 0x8)
    class UStaticMeshComponent* Dirt_3_1;                                             // 0x0420 (size: 0x8)

}; // Size: 0x428

#endif
