#ifndef UE4SS_SDK_BM_SG_Tannery_LV1_HPP
#define UE4SS_SDK_BM_SG_Tannery_LV1_HPP

class ABM_SG_Tannery_LV1_C : public AStaticMeshActor
{
    class UStaticMeshComponent* dirt_1_5;                                             // 0x02A0 (size: 0x8)
    class UStaticMeshComponent* dirt_0_2;                                             // 0x02A8 (size: 0x8)
    class UStaticMeshComponent* clutter_barrel04;                                     // 0x02B0 (size: 0x8)
    class UStaticMeshComponent* clutter_bale03;                                       // 0x02B8 (size: 0x8)
    class UStaticMeshComponent* clutter_bale02;                                       // 0x02C0 (size: 0x8)
    class UStaticMeshComponent* clutter_bale01;                                       // 0x02C8 (size: 0x8)
    class UStaticMeshComponent* clutter_bale04;                                       // 0x02D0 (size: 0x8)
    class UStaticMeshComponent* clutter_barrel_2;                                     // 0x02D8 (size: 0x8)
    class UStaticMeshComponent* clutter_barrel_1;                                     // 0x02E0 (size: 0x8)
    class UStaticMeshComponent* clutter_stones29;                                     // 0x02E8 (size: 0x8)
    class UStaticMeshComponent* clutter_stones28;                                     // 0x02F0 (size: 0x8)
    class UStaticMeshComponent* clutter_stones27;                                     // 0x02F8 (size: 0x8)
    class UStaticMeshComponent* clutter_dirt6;                                        // 0x0300 (size: 0x8)
    class UStaticMeshComponent* clutter_dirt5;                                        // 0x0308 (size: 0x8)
    class UStaticMeshComponent* clutter_dirt4;                                        // 0x0310 (size: 0x8)
    class UStaticMeshComponent* clutter_grass_011;                                    // 0x0318 (size: 0x8)
    class UStaticMeshComponent* clutter_grass_010;                                    // 0x0320 (size: 0x8)
    class UStaticMeshComponent* clutter_grass_09;                                     // 0x0328 (size: 0x8)
    class UStaticMeshComponent* res_3_1;                                              // 0x0330 (size: 0x8)
    class UStaticMeshComponent* res_3_0;                                              // 0x0338 (size: 0x8)
    class UStaticMeshComponent* res_4_5;                                              // 0x0340 (size: 0x8)
    class UStaticMeshComponent* res_4_4;                                              // 0x0348 (size: 0x8)
    class UStaticMeshComponent* res_4_3;                                              // 0x0350 (size: 0x8)
    class UStaticMeshComponent* res_4_2;                                              // 0x0358 (size: 0x8)
    class UStaticMeshComponent* res_4_1;                                              // 0x0360 (size: 0x8)
    class UStaticMeshComponent* res_4_0;                                              // 0x0368 (size: 0x8)
    class UStaticMeshComponent* res_16_5;                                             // 0x0370 (size: 0x8)
    class UStaticMeshComponent* res_16_4;                                             // 0x0378 (size: 0x8)
    class UStaticMeshComponent* res_16_3;                                             // 0x0380 (size: 0x8)
    class UStaticMeshComponent* res_16_2;                                             // 0x0388 (size: 0x8)
    class UStaticMeshComponent* Dirt_3_2;                                             // 0x0390 (size: 0x8)
    class UStaticMeshComponent* dirt_0_1;                                             // 0x0398 (size: 0x8)
    class UStaticMeshComponent* dirt_0_0;                                             // 0x03A0 (size: 0x8)
    class UStaticMeshComponent* bench_3_2;                                            // 0x03A8 (size: 0x8)
    class UStaticMeshComponent* bench_3_1;                                            // 0x03B0 (size: 0x8)
    class UStaticMeshComponent* bench_3_0;                                            // 0x03B8 (size: 0x8)
    class UStaticMeshComponent* bld_0_6;                                              // 0x03C0 (size: 0x8)
    class UStaticMeshComponent* bld_0_5;                                              // 0x03C8 (size: 0x8)
    class UStaticMeshComponent* bld_0_4;                                              // 0x03D0 (size: 0x8)
    class UStaticMeshComponent* clutter;                                              // 0x03D8 (size: 0x8)
    class UStaticMeshComponent* bld_0_3;                                              // 0x03E0 (size: 0x8)
    class UStaticMeshComponent* bld_0_2;                                              // 0x03E8 (size: 0x8)
    class UStaticMeshComponent* bld_0_1;                                              // 0x03F0 (size: 0x8)
    class UStaticMeshComponent* bld_0;                                                // 0x03F8 (size: 0x8)
    class UStaticMeshComponent* Dirt_2_1;                                             // 0x0400 (size: 0x8)
    class UStaticMeshComponent* Dirt_2_0;                                             // 0x0408 (size: 0x8)
    class UStaticMeshComponent* fullBld_306;                                          // 0x0410 (size: 0x8)
    class UStaticMeshComponent* fullBld_273;                                          // 0x0418 (size: 0x8)
    class UStaticMeshComponent* Dirt_3_0;                                             // 0x0420 (size: 0x8)
    class UStaticMeshComponent* MainBld_434;                                          // 0x0428 (size: 0x8)

}; // Size: 0x430

#endif
