#ifndef UE4SS_SDK_BM_SG_Cottage_LV1_BPart_B_HPP
#define UE4SS_SDK_BM_SG_Cottage_LV1_BPart_B_HPP

class ABM_SG_Cottage_LV1_BPart_B_C : public AStaticMeshActor
{
    class UStaticMeshComponent* clutter_grass_03;                                     // 0x02A0 (size: 0x8)
    class UStaticMeshComponent* clutter_grass_02;                                     // 0x02A8 (size: 0x8)
    class UStaticMeshComponent* clutter_grass_01;                                     // 0x02B0 (size: 0x8)
    class UStaticMeshComponent* clutter_stones25;                                     // 0x02B8 (size: 0x8)
    class UStaticMeshComponent* clutter_stones24;                                     // 0x02C0 (size: 0x8)
    class UStaticMeshComponent* clutter_stones27;                                     // 0x02C8 (size: 0x8)
    class UStaticMeshComponent* bld_0_foundationStone_8;                              // 0x02D0 (size: 0x8)
    class UStaticMeshComponent* bld_0_foundationStone_7;                              // 0x02D8 (size: 0x8)
    class UStaticMeshComponent* clutter_bag02;                                        // 0x02E0 (size: 0x8)
    class UStaticMeshComponent* clutter_ladder01;                                     // 0x02E8 (size: 0x8)
    class UStaticMeshComponent* clutter_17;                                           // 0x02F0 (size: 0x8)
    class UStaticMeshComponent* clutter_14;                                           // 0x02F8 (size: 0x8)
    class UStaticMeshComponent* clutter_13;                                           // 0x0300 (size: 0x8)
    class UStaticMeshComponent* clutter_12;                                           // 0x0308 (size: 0x8)
    class UStaticMeshComponent* clutter_30;                                           // 0x0310 (size: 0x8)
    class UStaticMeshComponent* clutter_11;                                           // 0x0318 (size: 0x8)
    class UStaticMeshComponent* clutter_bag04;                                        // 0x0320 (size: 0x8)
    class UStaticMeshComponent* clutter_bag03;                                        // 0x0328 (size: 0x8)
    class UStaticMeshComponent* clutter_bag01;                                        // 0x0330 (size: 0x8)
    class UStaticMeshComponent* clutter_bale04;                                       // 0x0338 (size: 0x8)
    class UStaticMeshComponent* clutter_bale03;                                       // 0x0340 (size: 0x8)
    class UStaticMeshComponent* clutter_bale02;                                       // 0x0348 (size: 0x8)
    class UStaticMeshComponent* clutter_pavement2;                                    // 0x0350 (size: 0x8)
    class UStaticMeshComponent* clutter_pavement1;                                    // 0x0358 (size: 0x8)
    class UStaticMeshComponent* clutter_bale01;                                       // 0x0360 (size: 0x8)
    class UStaticMeshComponent* res_16_0;                                             // 0x0368 (size: 0x8)
    class UStaticMeshComponent* dirt_0_0;                                             // 0x0370 (size: 0x8)
    class UStaticMeshComponent* fullBld_486;                                          // 0x0378 (size: 0x8)
    class UStaticMeshComponent* Dirt_3_2;                                             // 0x0380 (size: 0x8)
    class USceneComponent* Scene;                                                     // 0x0388 (size: 0x8)

}; // Size: 0x390

#endif
