#ifndef UE4SS_SDK_BM_SG_HerbsGarden_HPP
#define UE4SS_SDK_BM_SG_HerbsGarden_HPP

class ABM_SG_HerbsGarden_C : public AStaticMeshActor
{
    class UStaticMeshComponent* clutter_bed_8;                                        // 0x02A0 (size: 0x8)
    class UStaticMeshComponent* clutter_bed_7;                                        // 0x02A8 (size: 0x8)
    class UStaticMeshComponent* clutter_bed_6;                                        // 0x02B0 (size: 0x8)
    class UStaticMeshComponent* clutter_bed_5;                                        // 0x02B8 (size: 0x8)
    class UStaticMeshComponent* clutter_bed_4;                                        // 0x02C0 (size: 0x8)
    class UStaticMeshComponent* clutter_bed_3;                                        // 0x02C8 (size: 0x8)
    class UStaticMeshComponent* clutter_bed_2;                                        // 0x02D0 (size: 0x8)
    class UStaticMeshComponent* clutter_bed_1;                                        // 0x02D8 (size: 0x8)
    class USceneComponent* Plant_20;                                                  // 0x02E0 (size: 0x8)
    class USceneComponent* Plant_19;                                                  // 0x02E8 (size: 0x8)
    class USceneComponent* Plant_18;                                                  // 0x02F0 (size: 0x8)
    class USceneComponent* Plant_17;                                                  // 0x02F8 (size: 0x8)
    class USceneComponent* Plant_16;                                                  // 0x0300 (size: 0x8)
    class USceneComponent* Plant_15;                                                  // 0x0308 (size: 0x8)
    class USceneComponent* Plant_14;                                                  // 0x0310 (size: 0x8)
    class USceneComponent* Plant_13;                                                  // 0x0318 (size: 0x8)
    class USceneComponent* Plant_12;                                                  // 0x0320 (size: 0x8)
    class USceneComponent* Plant_9;                                                   // 0x0328 (size: 0x8)
    class USceneComponent* Plant_8;                                                   // 0x0330 (size: 0x8)
    class USceneComponent* Plant_7;                                                   // 0x0338 (size: 0x8)
    class USceneComponent* Plant_6;                                                   // 0x0340 (size: 0x8)
    class USceneComponent* Plant_5;                                                   // 0x0348 (size: 0x8)
    class USceneComponent* Plant_4;                                                   // 0x0350 (size: 0x8)
    class USceneComponent* Plant_3;                                                   // 0x0358 (size: 0x8)
    class USceneComponent* Plant_2;                                                   // 0x0360 (size: 0x8)
    class USceneComponent* Plant_1;                                                   // 0x0368 (size: 0x8)
    class USceneComponent* Plant_0;                                                   // 0x0370 (size: 0x8)
    class UStaticMeshComponent* clutter_dirt1;                                        // 0x0378 (size: 0x8)
    class UStaticMeshComponent* clutter_dirt;                                         // 0x0380 (size: 0x8)
    class UStaticMeshComponent* Bld_401_10;                                           // 0x0388 (size: 0x8)
    class UStaticMeshComponent* Bld_401_13;                                           // 0x0390 (size: 0x8)
    class UStaticMeshComponent* Bld_401_12;                                           // 0x0398 (size: 0x8)
    class UStaticMeshComponent* Bld_401_11;                                           // 0x03A0 (size: 0x8)
    class UStaticMeshComponent* Bld_401_9;                                            // 0x03A8 (size: 0x8)
    class UStaticMeshComponent* Bld_401_8;                                            // 0x03B0 (size: 0x8)
    class UStaticMeshComponent* clutter_stones13;                                     // 0x03B8 (size: 0x8)
    class UStaticMeshComponent* clutter_stones12;                                     // 0x03C0 (size: 0x8)
    class UStaticMeshComponent* clutter_stones10;                                     // 0x03C8 (size: 0x8)
    class UStaticMeshComponent* clutter_stones8;                                      // 0x03D0 (size: 0x8)
    class UStaticMeshComponent* clutter_stones7;                                      // 0x03D8 (size: 0x8)
    class UStaticMeshComponent* Bld_401_5;                                            // 0x03E0 (size: 0x8)
    class UStaticMeshComponent* Dirt_3_1;                                             // 0x03E8 (size: 0x8)
    class UStaticMeshComponent* dirt_1_1;                                             // 0x03F0 (size: 0x8)

}; // Size: 0x3F8

#endif
