#ifndef UE4SS_SDK_C_House_LV2_BPart_C_HPP
#define UE4SS_SDK_C_House_LV2_BPart_C_HPP

class AC_House_LV2_BPart_C_C : public AConstructionBP_C
{
    class UStaticMeshComponent* StaticMesh;                                           // 0x0550 (size: 0x8)
    class UStaticMeshComponent* ThatchRoof_sg_House_LV2_Bpart_C2_StaticMeshComponent0; // 0x0558 (size: 0x8)
    class UStaticMeshComponent* WoodRoof_sg_House_LV2_Bpart_C2_StaticMeshComponent0;  // 0x0560 (size: 0x8)
    class UStaticMeshComponent* UBeam_windowBoardD_square_shorter2_StaticMeshComponent0; // 0x0568 (size: 0x8)
    class UStaticMeshComponent* Foundation_sg_House_LV2_Bpart_C_main2_StaticMeshComponent0; // 0x0570 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_StandardSingleWindow2_StaticMeshComponent0; // 0x0578 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly24_StaticMeshComponent0;    // 0x0580 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly25_StaticMeshComponent0;    // 0x0588 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly26_StaticMeshComponent0;    // 0x0590 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly27_StaticMeshComponent0;    // 0x0598 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly28_StaticMeshComponent0;    // 0x05A0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly29_StaticMeshComponent0;    // 0x05A8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly30_StaticMeshComponent0;    // 0x05B0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly31_StaticMeshComponent0;    // 0x05B8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly32_StaticMeshComponent0;    // 0x05C0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly33_StaticMeshComponent0;    // 0x05C8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly34_StaticMeshComponent0;    // 0x05D0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly35_StaticMeshComponent0;    // 0x05D8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly36_StaticMeshComponent0;    // 0x05E0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly37_StaticMeshComponent0;    // 0x05E8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short20_StaticMeshComponent0;        // 0x05F0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short21_StaticMeshComponent0;        // 0x05F8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short22_StaticMeshComponent0;        // 0x0600 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short23_StaticMeshComponent0;        // 0x0608 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short24_StaticMeshComponent0;        // 0x0610 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short25_StaticMeshComponent0;        // 0x0618 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short26_StaticMeshComponent0;        // 0x0620 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short27_StaticMeshComponent0;        // 0x0628 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short28_StaticMeshComponent0;        // 0x0630 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short29_StaticMeshComponent0;        // 0x0638 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed27_StaticMeshComponent0;           // 0x0640 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed31_StaticMeshComponent0;           // 0x0648 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed32_StaticMeshComponent0;           // 0x0650 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short30_StaticMeshComponent0;        // 0x0658 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_5_StaticMeshComponent0; // 0x0660 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_6_StaticMeshComponent0; // 0x0668 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_18_StaticMeshComponent0; // 0x0670 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_19_StaticMeshComponent0; // 0x0678 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_20_StaticMeshComponent0; // 0x0680 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_21_StaticMeshComponent0; // 0x0688 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_22_StaticMeshComponent0; // 0x0690 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_23_StaticMeshComponent0; // 0x0698 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_24_StaticMeshComponent0; // 0x06A0 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_25_StaticMeshComponent0; // 0x06A8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m60_StaticMeshComponent0;                 // 0x06B0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m61_StaticMeshComponent0;                 // 0x06B8 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Tapered_CutE21_StaticMeshComponent0;        // 0x06C0 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Tapered_CutE22_StaticMeshComponent0;        // 0x06C8 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Tapered_CutE23_StaticMeshComponent0;        // 0x06D0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m62_StaticMeshComponent0;                 // 0x06D8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m63_StaticMeshComponent0;                 // 0x06E0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m64_StaticMeshComponent0;                 // 0x06E8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m65_StaticMeshComponent0;                 // 0x06F0 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Tapered_CutE24_StaticMeshComponent0;        // 0x06F8 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Tapered_CutE25_StaticMeshComponent0;        // 0x0700 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Tapered_CutE26_StaticMeshComponent0;        // 0x0708 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m66_StaticMeshComponent0;                 // 0x0710 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m67_StaticMeshComponent0;                 // 0x0718 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m68_StaticMeshComponent0;                 // 0x0720 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m69_StaticMeshComponent0;                 // 0x0728 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m70_StaticMeshComponent0;                 // 0x0730 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m71_StaticMeshComponent0;                 // 0x0738 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m72_StaticMeshComponent0;                 // 0x0740 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed33_StaticMeshComponent0;           // 0x0748 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed34_StaticMeshComponent0;           // 0x0750 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed35_StaticMeshComponent0;           // 0x0758 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed36_StaticMeshComponent0;           // 0x0760 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed37_StaticMeshComponent0;           // 0x0768 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed38_StaticMeshComponent0;           // 0x0770 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed39_StaticMeshComponent0;           // 0x0778 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed40_StaticMeshComponent0;           // 0x0780 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed41_StaticMeshComponent0;           // 0x0788 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed42_StaticMeshComponent0;           // 0x0790 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed43_StaticMeshComponent0;           // 0x0798 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed44_StaticMeshComponent0;           // 0x07A0 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed45_StaticMeshComponent0;           // 0x07A8 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed46_StaticMeshComponent0;           // 0x07B0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m73_StaticMeshComponent0;                 // 0x07B8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m74_StaticMeshComponent0;                 // 0x07C0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m75_StaticMeshComponent0;                 // 0x07C8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m76_StaticMeshComponent0;                 // 0x07D0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m77_StaticMeshComponent0;                 // 0x07D8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m78_StaticMeshComponent0;                 // 0x07E0 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed47_StaticMeshComponent0;           // 0x07E8 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed48_StaticMeshComponent0;           // 0x07F0 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed49_StaticMeshComponent0;           // 0x07F8 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed50_StaticMeshComponent0;           // 0x0800 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m79_StaticMeshComponent0;                 // 0x0808 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m80_StaticMeshComponent0;                 // 0x0810 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_26_StaticMeshComponent0; // 0x0818 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_27_StaticMeshComponent0; // 0x0820 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m81_StaticMeshComponent0;                 // 0x0828 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_28_StaticMeshComponent0; // 0x0830 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_29_StaticMeshComponent0; // 0x0838 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly38_StaticMeshComponent0;    // 0x0840 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly39_StaticMeshComponent0;    // 0x0848 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_30_StaticMeshComponent0; // 0x0850 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly40_StaticMeshComponent0;    // 0x0858 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly41_StaticMeshComponent0;    // 0x0860 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly42_StaticMeshComponent0;    // 0x0868 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly43_StaticMeshComponent0;    // 0x0870 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly44_StaticMeshComponent0;    // 0x0878 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly45_StaticMeshComponent0;    // 0x0880 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly46_StaticMeshComponent0;    // 0x0888 (size: 0x8)
    class UStaticMeshComponent* UBeam_CrookedPlank3_StaticMeshComponent0;             // 0x0890 (size: 0x8)
    class UStaticMeshComponent* UBeam_CrookedPlank4_StaticMeshComponent0;             // 0x0898 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA11_StaticMeshComponent0;            // 0x08A0 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardB9_StaticMeshComponent0;             // 0x08A8 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA12_StaticMeshComponent0;            // 0x08B0 (size: 0x8)
    class UStaticMeshComponent* UBeam_windowBoardD_square__longer3_StaticMeshComponent0; // 0x08B8 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardB10_StaticMeshComponent0;            // 0x08C0 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA13_StaticMeshComponent0;            // 0x08C8 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardB11_StaticMeshComponent0;            // 0x08D0 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA14_StaticMeshComponent0;            // 0x08D8 (size: 0x8)
    class UStaticMeshComponent* UBeam_windowBoardD_square__longer4_StaticMeshComponent0; // 0x08E0 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardB12_StaticMeshComponent0;            // 0x08E8 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA15_StaticMeshComponent0;            // 0x08F0 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA16_StaticMeshComponent0;            // 0x08F8 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardB13_StaticMeshComponent0;            // 0x0900 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA17_StaticMeshComponent0;            // 0x0908 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardB14_StaticMeshComponent0;            // 0x0910 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA18_StaticMeshComponent0;            // 0x0918 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA19_StaticMeshComponent0;            // 0x0920 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardB15_StaticMeshComponent0;            // 0x0928 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA20_StaticMeshComponent0;            // 0x0930 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardB16_StaticMeshComponent0;            // 0x0938 (size: 0x8)
    class UStaticMeshComponent* UBeam_Tapered_CutE4_StaticMeshComponent0;             // 0x0940 (size: 0x8)
    class UStaticMeshComponent* UBeam_Tapered_CutE5_StaticMeshComponent0;             // 0x0948 (size: 0x8)
    class UStaticMeshComponent* UBeam_Tapered_CutE6_StaticMeshComponent0;             // 0x0950 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Standard4_StaticMeshComponent0;            // 0x0958 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Standard5_StaticMeshComponent0;            // 0x0960 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Standard6_StaticMeshComponent0;            // 0x0968 (size: 0x8)
    class UStaticMeshComponent* UBeam_TaperedCutB_ShorterEnds4_StaticMeshComponent0;  // 0x0970 (size: 0x8)
    class UStaticMeshComponent* UBeam_TaperedCutB_ShorterEnds5_StaticMeshComponent0;  // 0x0978 (size: 0x8)
    class UStaticMeshComponent* UBeam_TaperedCutB_ShorterEnds6_StaticMeshComponent0;  // 0x0980 (size: 0x8)
    class USceneComponent* C_House_LV2_BPart_C_DefaultSceneRoot;                      // 0x0988 (size: 0x8)

}; // Size: 0x990

#endif
