#ifndef UE4SS_SDK_C_larder_HPP
#define UE4SS_SDK_C_larder_HPP

class AC_larder_C : public AConstructionBP_C
{
    class UStaticMeshComponent* woodenRoofMegas2_StaticMeshComponent0;                // 0x0550 (size: 0x8)
    class UStaticMeshComponent* woodenRoofMegas_StaticMeshComponent0;                 // 0x0558 (size: 0x8)
    class UStaticMeshComponent* Wooden_Debris_LOD6_vbuldhujw_LOG2_StaticMeshComponent0; // 0x0560 (size: 0x8)
    class UStaticMeshComponent* Wooden_Debris_LOD6_vbuldhujw_LOG_StaticMeshComponent0; // 0x0568 (size: 0x8)
    class UStaticMeshComponent* Var5_LOD0_10_StaticMeshComponent0;                    // 0x0570 (size: 0x8)
    class UStaticMeshComponent* Var5_LOD0_9_StaticMeshComponent0;                     // 0x0578 (size: 0x8)
    class UStaticMeshComponent* Var5_LOD0_8_StaticMeshComponent0;                     // 0x0580 (size: 0x8)
    class UStaticMeshComponent* Var5_LOD0_7_StaticMeshComponent0;                     // 0x0588 (size: 0x8)
    class UStaticMeshComponent* Var5_LOD0_6_StaticMeshComponent0;                     // 0x0590 (size: 0x8)
    class UStaticMeshComponent* Var5_LOD0_5_StaticMeshComponent0;                     // 0x0598 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed28_StaticMeshComponent0;           // 0x05A0 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed27_StaticMeshComponent0;           // 0x05A8 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed26_StaticMeshComponent0;           // 0x05B0 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed25_StaticMeshComponent0;           // 0x05B8 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed24_StaticMeshComponent0;           // 0x05C0 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed23_StaticMeshComponent0;           // 0x05C8 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed22_StaticMeshComponent0;           // 0x05D0 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed21_StaticMeshComponent0;           // 0x05D8 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed20_StaticMeshComponent0;           // 0x05E0 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed19_StaticMeshComponent0;           // 0x05E8 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed18_StaticMeshComponent0;           // 0x05F0 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed17_StaticMeshComponent0;           // 0x05F8 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed16_StaticMeshComponent0;           // 0x0600 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed15_StaticMeshComponent0;           // 0x0608 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed14_StaticMeshComponent0;           // 0x0610 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed13_StaticMeshComponent0;           // 0x0618 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed12_StaticMeshComponent0;           // 0x0620 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed11_StaticMeshComponent0;           // 0x0628 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed10_StaticMeshComponent0;           // 0x0630 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed9_StaticMeshComponent0;            // 0x0638 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed8_StaticMeshComponent0;            // 0x0640 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed5_StaticMeshComponent0;            // 0x0648 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed4_StaticMeshComponent0;            // 0x0650 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed3_StaticMeshComponent0;            // 0x0658 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed2_StaticMeshComponent0;            // 0x0660 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed_StaticMeshComponent0;             // 0x0668 (size: 0x8)
    class UStaticMeshComponent* SM_Rope5_StaticMeshComponent0;                        // 0x0670 (size: 0x8)
    class UStaticMeshComponent* SM_Rope04_StaticMeshComponent0;                       // 0x0678 (size: 0x8)
    class UStaticMeshComponent* SM_Rope01_StaticMeshComponent0;                       // 0x0680 (size: 0x8)
    class UStaticMeshComponent* ropeKnotA2_StaticMeshComponent0;                      // 0x0688 (size: 0x8)
    class UStaticMeshComponent* ropeKnotA_StaticMeshComponent0;                       // 0x0690 (size: 0x8)
    class UStaticMeshComponent* Plane35_StaticMeshComponent0;                         // 0x0698 (size: 0x8)
    class UStaticMeshComponent* Plane30_StaticMeshComponent0;                         // 0x06A0 (size: 0x8)
    class UStaticMeshComponent* Plane29_StaticMeshComponent0;                         // 0x06A8 (size: 0x8)
    class UStaticMeshComponent* Plane28_StaticMeshComponent0;                         // 0x06B0 (size: 0x8)
    class UStaticMeshComponent* Plane27_StaticMeshComponent0;                         // 0x06B8 (size: 0x8)
    class UStaticMeshComponent* owidzLogWall01_sym3_StaticMeshComponent0;             // 0x06C0 (size: 0x8)
    class UStaticMeshComponent* owidzLogWall01_doorway2_StaticMeshComponent0;         // 0x06C8 (size: 0x8)
    class UStaticMeshComponent* owidzLogWall01_doorway_StaticMeshComponent0;          // 0x06D0 (size: 0x8)
    class UStaticMeshComponent* doorMegaA_StaticMeshComponent0;                       // 0x06D8 (size: 0x8)
    class UStaticMeshComponent* box1_StaticMeshComponent0;                            // 0x06E0 (size: 0x8)
    class UStaticMeshComponent* bale2_StaticMeshComponent0;                           // 0x06E8 (size: 0x8)
    class UStaticMeshComponent* bag3_StaticMeshComponent0;                            // 0x06F0 (size: 0x8)
    class UStaticMeshComponent* Aset_castle_wall_M_sdAta_LOD8_StaticMeshComponent0;   // 0x06F8 (size: 0x8)
    class UStaticMeshComponent* Aset_castle_wall_M_sdAta_LOD7_StaticMeshComponent0;   // 0x0700 (size: 0x8)
    class UStaticMeshComponent* Aset_castle_wall_M_sdAta_LOD6_StaticMeshComponent0;   // 0x0708 (size: 0x8)
    class UStaticMeshComponent* Aset_castle_wall_M_sdAta_LOD5_StaticMeshComponent0;   // 0x0710 (size: 0x8)
    class UStaticMeshComponent* Aset_castle_wall_M_scywx_LOD4_StaticMeshComponent0;   // 0x0718 (size: 0x8)
    class UStaticMeshComponent* Aset_castle_wall_M_scywx_LOD3_StaticMeshComponent0;   // 0x0720 (size: 0x8)
    class UStaticMeshComponent* Aset_castle_wall_M_scywx_LOD2_StaticMeshComponent0;   // 0x0728 (size: 0x8)
    class UStaticMeshComponent* Aset_castle_wall_M_scywx_LOD1_StaticMeshComponent0;   // 0x0730 (size: 0x8)
    class UStaticMeshComponent* Aset_castle_wall_M_scywx_LOD0_StaticMeshComponent0;   // 0x0738 (size: 0x8)
    class UStaticMeshComponent* all_aboard_pivot_boardA15_StaticMeshComponent0;       // 0x0740 (size: 0x8)
    class UStaticMeshComponent* all_aboard_pivot_boardA14_StaticMeshComponent0;       // 0x0748 (size: 0x8)
    class UStaticMeshComponent* all_aboard_pivot_boardA13_StaticMeshComponent0;       // 0x0750 (size: 0x8)
    class UStaticMeshComponent* all_aboard_pivot_boardA12_StaticMeshComponent0;       // 0x0758 (size: 0x8)
    class UStaticMeshComponent* all_aboard_pivot_boardA11_StaticMeshComponent0;       // 0x0760 (size: 0x8)
    class UStaticMeshComponent* all_aboard_pivot_boardA10_StaticMeshComponent0;       // 0x0768 (size: 0x8)
    class UStaticMeshComponent* all_aboard_pivot_boardA9_StaticMeshComponent0;        // 0x0770 (size: 0x8)
    class UStaticMeshComponent* all_aboard_pivot_boardA8_StaticMeshComponent0;        // 0x0778 (size: 0x8)
    class UStaticMeshComponent* all_aboard_pivot_boardA7_StaticMeshComponent0;        // 0x0780 (size: 0x8)
    class UStaticMeshComponent* all_aboard_pivot_boardA6_StaticMeshComponent0;        // 0x0788 (size: 0x8)
    class UStaticMeshComponent* all_aboard_pivot_boardA4_StaticMeshComponent0;        // 0x0790 (size: 0x8)
    class USceneComponent* larder_center_DefaultSceneRoot;                            // 0x0798 (size: 0x8)

}; // Size: 0x7A0

#endif
