#ifndef UE4SS_SDK_c_marketStallA_HPP
#define UE4SS_SDK_c_marketStallA_HPP

class Ac_marketStallA_C : public AConstructionBP_C
{
    class UStaticMeshComponent* StaticMeshComponent13;                                // 0x0550 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent12;                                // 0x0558 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent29;                                // 0x0560 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent28;                                // 0x0568 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent27;                                // 0x0570 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent26;                                // 0x0578 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent25;                                // 0x0580 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent24;                                // 0x0588 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent23;                                // 0x0590 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent22;                                // 0x0598 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent21;                                // 0x05A0 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent20;                                // 0x05A8 (size: 0x8)
    class USceneComponent* SharedRoot;                                                // 0x05B0 (size: 0x8)
    class USceneComponent* Scene;                                                     // 0x05B8 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent19;                                // 0x05C0 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent17;                                // 0x05C8 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent16;                                // 0x05D0 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent11;                                // 0x05D8 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent10;                                // 0x05E0 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent9;                                 // 0x05E8 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent7;                                 // 0x05F0 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent6;                                 // 0x05F8 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent5;                                 // 0x0600 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent4;                                 // 0x0608 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent3;                                 // 0x0610 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent2;                                 // 0x0618 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent1;                                 // 0x0620 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent0;                                 // 0x0628 (size: 0x8)

}; // Size: 0x630

#endif
