#ifndef UE4SS_SDK_C_SG_Gatehouse_LV3_HPP
#define UE4SS_SDK_C_SG_Gatehouse_LV3_HPP

class AC_SG_Gatehouse_LV3_C : public AConstructionBP_C
{
    class UStaticMeshComponent* SM_WoodBeam6m_orSth204_StaticMeshComponent0;          // 0x0550 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth203_StaticMeshComponent0;          // 0x0558 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth202_StaticMeshComponent0;          // 0x0560 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth201_StaticMeshComponent0;          // 0x0568 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth200_StaticMeshComponent0;          // 0x0570 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth199_StaticMeshComponent0;          // 0x0578 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth198_StaticMeshComponent0;          // 0x0580 (size: 0x8)
    class UStaticMeshComponent* ChainCleaned8_StaticMeshComponent0;                   // 0x0588 (size: 0x8)
    class UStaticMeshComponent* Mossy_Stone_Pieces_LOD5_sgmgq6_StaticMeshComponent0;  // 0x0590 (size: 0x8)
    class UStaticMeshComponent* ChainCleaned7_StaticMeshComponent0;                   // 0x0598 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth197_StaticMeshComponent0;          // 0x05A0 (size: 0x8)
    class UStaticMeshComponent* sg_gatehouse_tiledRoof2_StaticMeshComponent0;         // 0x05A8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth196_StaticMeshComponent0;          // 0x05B0 (size: 0x8)
    class UStaticMeshComponent* sg_roundSlit_low9_StaticMeshComponent0;               // 0x05B8 (size: 0x8)
    class UStaticMeshComponent* ChainCleaned6_StaticMeshComponent0;                   // 0x05C0 (size: 0x8)
    class UStaticMeshComponent* ChainCleaned5_StaticMeshComponent0;                   // 0x05C8 (size: 0x8)
    class UStaticMeshComponent* sg_portcullis_low2_StaticMeshComponent0;              // 0x05D0 (size: 0x8)
    class UStaticMeshComponent* sg_roundSlit_low8_StaticMeshComponent0;               // 0x05D8 (size: 0x8)
    class UStaticMeshComponent* sg_roundSlit_low7_StaticMeshComponent0;               // 0x05E0 (size: 0x8)
    class UStaticMeshComponent* sg_roundSlit_low6_StaticMeshComponent0;               // 0x05E8 (size: 0x8)
    class UStaticMeshComponent* quoinB_luv134_StaticMeshComponent0;                   // 0x05F0 (size: 0x8)
    class UStaticMeshComponent* quoinB_luv133_StaticMeshComponent0;                   // 0x05F8 (size: 0x8)
    class UStaticMeshComponent* Aset_castle_structure_M_sgyvB_LOD39_StaticMeshComponent0; // 0x0600 (size: 0x8)
    class UStaticMeshComponent* Aset_castle_structure_M_sgyvB_LOD38_StaticMeshComponent0; // 0x0608 (size: 0x8)
    class UStaticMeshComponent* Aset_castle_structure_M_sgyvB_LOD37_StaticMeshComponent0; // 0x0610 (size: 0x8)
    class UStaticMeshComponent* Aset_castle_structure_M_sgyvB_LOD36_StaticMeshComponent0; // 0x0618 (size: 0x8)
    class UStaticMeshComponent* quoin_scanB_short20_StaticMeshComponent0;             // 0x0620 (size: 0x8)
    class UStaticMeshComponent* quoin_scanB_short19_StaticMeshComponent0;             // 0x0628 (size: 0x8)
    class UStaticMeshComponent* quoin_scanB_short18_StaticMeshComponent0;             // 0x0630 (size: 0x8)
    class UStaticMeshComponent* quoin_scanB_short17_StaticMeshComponent0;             // 0x0638 (size: 0x8)
    class UStaticMeshComponent* quoin_scanB_short16_StaticMeshComponent0;             // 0x0640 (size: 0x8)
    class UStaticMeshComponent* quoin_scanB_short15_StaticMeshComponent0;             // 0x0648 (size: 0x8)
    class UStaticMeshComponent* quoin_scanB_short14_StaticMeshComponent0;             // 0x0650 (size: 0x8)
    class UStaticMeshComponent* quoin_scanB_short13_StaticMeshComponent0;             // 0x0658 (size: 0x8)
    class UStaticMeshComponent* quoin_scanB_short12_StaticMeshComponent0;             // 0x0660 (size: 0x8)
    class UStaticMeshComponent* quoin_scanB_short11_StaticMeshComponent0;             // 0x0668 (size: 0x8)
    class UStaticMeshComponent* quoinB_luv132_StaticMeshComponent0;                   // 0x0670 (size: 0x8)
    class UStaticMeshComponent* quoinB_luv131_StaticMeshComponent0;                   // 0x0678 (size: 0x8)
    class UStaticMeshComponent* quoinB_luv130_StaticMeshComponent0;                   // 0x0680 (size: 0x8)
    class UStaticMeshComponent* quoinB_luv129_StaticMeshComponent0;                   // 0x0688 (size: 0x8)
    class UStaticMeshComponent* quoinB_luv128_StaticMeshComponent0;                   // 0x0690 (size: 0x8)
    class UStaticMeshComponent* quoinB_luv127_StaticMeshComponent0;                   // 0x0698 (size: 0x8)
    class UStaticMeshComponent* sg_gatehouseDoor_low12_StaticMeshComponent0;          // 0x06A0 (size: 0x8)
    class UStaticMeshComponent* quoinB_luv126_StaticMeshComponent0;                   // 0x06A8 (size: 0x8)
    class UStaticMeshComponent* quoinB_luv125_StaticMeshComponent0;                   // 0x06B0 (size: 0x8)
    class UStaticMeshComponent* quoinB_luv124_StaticMeshComponent0;                   // 0x06B8 (size: 0x8)
    class UStaticMeshComponent* quoinB_luv123_StaticMeshComponent0;                   // 0x06C0 (size: 0x8)
    class UStaticMeshComponent* quoinB_luv122_StaticMeshComponent0;                   // 0x06C8 (size: 0x8)
    class UStaticMeshComponent* quoinB_luv121_StaticMeshComponent0;                   // 0x06D0 (size: 0x8)
    class UStaticMeshComponent* quoinB_luv120_StaticMeshComponent0;                   // 0x06D8 (size: 0x8)
    class UStaticMeshComponent* quoinB_luv119_StaticMeshComponent0;                   // 0x06E0 (size: 0x8)
    class UStaticMeshComponent* Mossy_Stone_Pieces_LOD5_sgmgq5_StaticMeshComponent0;  // 0x06E8 (size: 0x8)
    class UStaticMeshComponent* Mossy_Stone_Pieces_LOD5_sgmgq4_StaticMeshComponent0;  // 0x06F0 (size: 0x8)
    class UStaticMeshComponent* Aset_castle_structure_M_sgyvB_LOD35_StaticMeshComponent0; // 0x06F8 (size: 0x8)
    class UStaticMeshComponent* Aset_castle_structure_M_sgyvB_LOD34_StaticMeshComponent0; // 0x0700 (size: 0x8)
    class UStaticMeshComponent* Aset_castle_structure_M_sgyvB_LOD33_StaticMeshComponent0; // 0x0708 (size: 0x8)
    class UStaticMeshComponent* Aset_castle_structure_M_sgyvB_LOD32_StaticMeshComponent0; // 0x0710 (size: 0x8)
    class UStaticMeshComponent* sg_gatehouseDoor_low11_StaticMeshComponent0;          // 0x0718 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m639_StaticMeshComponent0;                // 0x0720 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m638_StaticMeshComponent0;                // 0x0728 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m637_StaticMeshComponent0;                // 0x0730 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m636_StaticMeshComponent0;                // 0x0738 (size: 0x8)
    class UStaticMeshComponent* Aset_castle_wall_M_sdAta_lower22_StaticMeshComponent0; // 0x0740 (size: 0x8)
    class UStaticMeshComponent* Aset_castle_wall_M_sdAta_lower21_StaticMeshComponent0; // 0x0748 (size: 0x8)
    class UStaticMeshComponent* Aset_castle_wall_M_sdAta_lower20_StaticMeshComponent0; // 0x0750 (size: 0x8)
    class UStaticMeshComponent* Aset_castle_wall_M_sdAta_lower19_StaticMeshComponent0; // 0x0758 (size: 0x8)
    class UStaticMeshComponent* Aset_castle_wall_M_sdAta_lower18_StaticMeshComponent0; // 0x0760 (size: 0x8)
    class UStaticMeshComponent* Aset_castle_wall_M_sdAta_lower17_StaticMeshComponent0; // 0x0768 (size: 0x8)
    class UStaticMeshComponent* Aset_castle_wall_M_sdAta_lower16_StaticMeshComponent0; // 0x0770 (size: 0x8)
    class UStaticMeshComponent* Aset_castle_wall_M_sdAta_lower15_StaticMeshComponent0; // 0x0778 (size: 0x8)
    class UStaticMeshComponent* sg_gatehouseDoor_low10_StaticMeshComponent0;          // 0x0780 (size: 0x8)
    class UStaticMeshComponent* sg_gatehouseDoor_low9_StaticMeshComponent0;           // 0x0788 (size: 0x8)
    class UStaticMeshComponent* sg_gatehouseDoor_low8_StaticMeshComponent0;           // 0x0790 (size: 0x8)
    class UStaticMeshComponent* sg_gatehouseDoor_low5_StaticMeshComponent0;           // 0x0798 (size: 0x8)
    class UStaticMeshComponent* sg_gatehouse_lv3_BASE2_StaticMeshComponent0;          // 0x07A0 (size: 0x8)
    class USceneComponent* SG_Gatehouse_LV4_DefaultSceneRoot;                         // 0x07A8 (size: 0x8)

}; // Size: 0x7B0

#endif
