#ifndef UE4SS_SDK_C_SG_Manor_Tower_Lv1_00_HPP
#define UE4SS_SDK_C_SG_Manor_Tower_Lv1_00_HPP

class AC_SG_Manor_Tower_Lv1_00_C : public AConstructionBP_C
{
    class UStaticMeshComponent* door_lower;                                           // 0x0550 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA136_StaticMeshComponent0;           // 0x0558 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA135_StaticMeshComponent0;           // 0x0560 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA134_StaticMeshComponent0;           // 0x0568 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA133_StaticMeshComponent0;           // 0x0570 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA132_StaticMeshComponent0;           // 0x0578 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA131_StaticMeshComponent0;           // 0x0580 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA130_StaticMeshComponent0;           // 0x0588 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA129_StaticMeshComponent0;           // 0x0590 (size: 0x8)
    class UStaticMeshComponent* Foundation_DoorStepStoneFlat2_StaticMeshComponent0;   // 0x0598 (size: 0x8)
    class UStaticMeshComponent* roof_tower_lv1_lowpoly2_StaticMeshComponent0;         // 0x05A0 (size: 0x8)
    class UStaticMeshComponent* FoundationSeamless_Tower_Lv2_StaticMeshComponent0;    // 0x05A8 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg62_StaticMeshComponent0;     // 0x05B0 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg61_StaticMeshComponent0;     // 0x05B8 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg60_StaticMeshComponent0;     // 0x05C0 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg59_StaticMeshComponent0;     // 0x05C8 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg58_StaticMeshComponent0;     // 0x05D0 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg57_StaticMeshComponent0;     // 0x05D8 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg56_StaticMeshComponent0;     // 0x05E0 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg55_StaticMeshComponent0;     // 0x05E8 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg54_StaticMeshComponent0;     // 0x05F0 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg53_StaticMeshComponent0;     // 0x05F8 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg52_StaticMeshComponent0;     // 0x0600 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg51_StaticMeshComponent0;     // 0x0608 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg50_StaticMeshComponent0;     // 0x0610 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg49_StaticMeshComponent0;     // 0x0618 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg48_StaticMeshComponent0;     // 0x0620 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg47_StaticMeshComponent0;     // 0x0628 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg46_StaticMeshComponent0;     // 0x0630 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg45_StaticMeshComponent0;     // 0x0638 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg44_StaticMeshComponent0;     // 0x0640 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_05_Curved4_StaticMeshComponent0;       // 0x0648 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg43_StaticMeshComponent0;     // 0x0650 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg42_StaticMeshComponent0;     // 0x0658 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg41_StaticMeshComponent0;     // 0x0660 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg40_StaticMeshComponent0;     // 0x0668 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg39_StaticMeshComponent0;     // 0x0670 (size: 0x8)
    class UStaticMeshComponent* UBeam_Strut_Short8_StaticMeshComponent0;              // 0x0678 (size: 0x8)
    class UStaticMeshComponent* UBeam_Strut_Short7_StaticMeshComponent0;              // 0x0680 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m4_StaticMeshComponent0;                    // 0x0688 (size: 0x8)
    class UStaticMeshComponent* UBeam_Strut_Short6_StaticMeshComponent0;              // 0x0690 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m3_StaticMeshComponent0;                    // 0x0698 (size: 0x8)
    class UStaticMeshComponent* UBeam_Strut_Short5_StaticMeshComponent0;              // 0x06A0 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA128_StaticMeshComponent0;           // 0x06A8 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA127_StaticMeshComponent0;           // 0x06B0 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA126_StaticMeshComponent0;           // 0x06B8 (size: 0x8)
    class UStaticMeshComponent* UBeam_windowBoardD_square__longer12_StaticMeshComponent0; // 0x06C0 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA125_StaticMeshComponent0;           // 0x06C8 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA124_StaticMeshComponent0;           // 0x06D0 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA123_StaticMeshComponent0;           // 0x06D8 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA122_StaticMeshComponent0;           // 0x06E0 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA121_StaticMeshComponent0;           // 0x06E8 (size: 0x8)
    class UStaticMeshComponent* UBeam_windowBoardD_square__longer11_StaticMeshComponent0; // 0x06F0 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA120_StaticMeshComponent0;           // 0x06F8 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA119_StaticMeshComponent0;           // 0x0700 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA118_StaticMeshComponent0;           // 0x0708 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA117_StaticMeshComponent0;           // 0x0710 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA116_StaticMeshComponent0;           // 0x0718 (size: 0x8)
    class UStaticMeshComponent* UBeam_CrookedPlank10_StaticMeshComponent0;            // 0x0720 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA115_StaticMeshComponent0;           // 0x0728 (size: 0x8)
    class UStaticMeshComponent* UBeam_windowBoardD_square__longer10_StaticMeshComponent0; // 0x0730 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA114_StaticMeshComponent0;           // 0x0738 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA113_StaticMeshComponent0;           // 0x0740 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA112_StaticMeshComponent0;           // 0x0748 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA111_StaticMeshComponent0;           // 0x0750 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA110_StaticMeshComponent0;           // 0x0758 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA109_StaticMeshComponent0;           // 0x0760 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA108_StaticMeshComponent0;           // 0x0768 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA107_StaticMeshComponent0;           // 0x0770 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA106_StaticMeshComponent0;           // 0x0778 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA105_StaticMeshComponent0;           // 0x0780 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA104_StaticMeshComponent0;           // 0x0788 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA103_StaticMeshComponent0;           // 0x0790 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA102_StaticMeshComponent0;           // 0x0798 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA101_StaticMeshComponent0;           // 0x07A0 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA100_StaticMeshComponent0;           // 0x07A8 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA99_StaticMeshComponent0;            // 0x07B0 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA98_StaticMeshComponent0;            // 0x07B8 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA97_StaticMeshComponent0;            // 0x07C0 (size: 0x8)
    class UStaticMeshComponent* UBeam_CrookedPlank9_StaticMeshComponent0;             // 0x07C8 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA96_StaticMeshComponent0;            // 0x07D0 (size: 0x8)
    class UStaticMeshComponent* UBeam_windowBoardD_square__longer9_StaticMeshComponent0; // 0x07D8 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA95_StaticMeshComponent0;            // 0x07E0 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA94_StaticMeshComponent0;            // 0x07E8 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA93_StaticMeshComponent0;            // 0x07F0 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA92_StaticMeshComponent0;            // 0x07F8 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA91_StaticMeshComponent0;            // 0x0800 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA90_StaticMeshComponent0;            // 0x0808 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA89_StaticMeshComponent0;            // 0x0810 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA88_StaticMeshComponent0;            // 0x0818 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA87_StaticMeshComponent0;            // 0x0820 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA86_StaticMeshComponent0;            // 0x0828 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA85_StaticMeshComponent0;            // 0x0830 (size: 0x8)
    class UStaticMeshComponent* UBeam_windowBoardD_square__longer8_StaticMeshComponent0; // 0x0838 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA84_StaticMeshComponent0;            // 0x0840 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA83_StaticMeshComponent0;            // 0x0848 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA82_StaticMeshComponent0;            // 0x0850 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA81_StaticMeshComponent0;            // 0x0858 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA80_StaticMeshComponent0;            // 0x0860 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA79_StaticMeshComponent0;            // 0x0868 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA78_StaticMeshComponent0;            // 0x0870 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA77_StaticMeshComponent0;            // 0x0878 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoard_Slits2_StaticMeshComponent0;        // 0x0880 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA76_StaticMeshComponent0;            // 0x0888 (size: 0x8)
    class UStaticMeshComponent* UBeam_windowBoard_TwoRoundedWindows4_StaticMeshComponent0; // 0x0890 (size: 0x8)
    class UStaticMeshComponent* UBeam_windowBoardD_square__longer7_StaticMeshComponent0; // 0x0898 (size: 0x8)
    class UStaticMeshComponent* UBeam_windowBoard_TwoRoundedWindows3_StaticMeshComponent0; // 0x08A0 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg38_StaticMeshComponent0;     // 0x08A8 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg37_StaticMeshComponent0;     // 0x08B0 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg36_StaticMeshComponent0;     // 0x08B8 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg35_StaticMeshComponent0;     // 0x08C0 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg34_StaticMeshComponent0;     // 0x08C8 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg33_StaticMeshComponent0;     // 0x08D0 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg32_StaticMeshComponent0;     // 0x08D8 (size: 0x8)
    class UStaticMeshComponent* UBeam_Strut_Straight20_StaticMeshComponent0;          // 0x08E0 (size: 0x8)
    class UStaticMeshComponent* UBeam_Strut_Straight19_StaticMeshComponent0;          // 0x08E8 (size: 0x8)
    class UStaticMeshComponent* UBeam_Strut_Straight18_StaticMeshComponent0;          // 0x08F0 (size: 0x8)
    class UStaticMeshComponent* UBeam_Strut_Straight17_StaticMeshComponent0;          // 0x08F8 (size: 0x8)
    class UStaticMeshComponent* UBeam_Strut_Straight16_StaticMeshComponent0;          // 0x0900 (size: 0x8)
    class UStaticMeshComponent* UBeam_Strut_Straight15_StaticMeshComponent0;          // 0x0908 (size: 0x8)
    class UStaticMeshComponent* UBeam_Strut_Straight14_StaticMeshComponent0;          // 0x0910 (size: 0x8)
    class UStaticMeshComponent* UBeam_Strut_Straight13_StaticMeshComponent0;          // 0x0918 (size: 0x8)
    class UStaticMeshComponent* UBeam_Strut_Straight12_StaticMeshComponent0;          // 0x0920 (size: 0x8)
    class UStaticMeshComponent* UBeam_Strut_Straight11_StaticMeshComponent0;          // 0x0928 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_22_StaticMeshComponent0;               // 0x0930 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_21_StaticMeshComponent0;               // 0x0938 (size: 0x8)
    class UStaticMeshComponent* UBeam_CrookedPlank8_StaticMeshComponent0;             // 0x0940 (size: 0x8)
    class UStaticMeshComponent* UBeam_CrookedPlank7_StaticMeshComponent0;             // 0x0948 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m36_StaticMeshComponent0;                      // 0x0950 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m35_StaticMeshComponent0;                      // 0x0958 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m34_StaticMeshComponent0;                      // 0x0960 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m33_StaticMeshComponent0;                      // 0x0968 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m32_StaticMeshComponent0;                      // 0x0970 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m31_StaticMeshComponent0;                      // 0x0978 (size: 0x8)
    class UStaticMeshComponent* UBeam_Tapered_CutE10_StaticMeshComponent0;            // 0x0980 (size: 0x8)
    class UStaticMeshComponent* UBeam_Tapered_CutE9_StaticMeshComponent0;             // 0x0988 (size: 0x8)
    class UStaticMeshComponent* UBeam_Tapered_CutE8_StaticMeshComponent0;             // 0x0990 (size: 0x8)
    class UStaticMeshComponent* UBeam_Tapered_CutE7_StaticMeshComponent0;             // 0x0998 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardB15_StaticMeshComponent0;            // 0x09A0 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardB14_StaticMeshComponent0;            // 0x09A8 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardB13_StaticMeshComponent0;            // 0x09B0 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardB12_StaticMeshComponent0;            // 0x09B8 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardB11_StaticMeshComponent0;            // 0x09C0 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardB10_StaticMeshComponent0;            // 0x09C8 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardB9_StaticMeshComponent0;             // 0x09D0 (size: 0x8)
    class UStaticMeshComponent* UBeam_Tapered_CutE6_StaticMeshComponent0;             // 0x09D8 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_05_Curved3_StaticMeshComponent0;       // 0x09E0 (size: 0x8)
    class UStaticMeshComponent* UBeam_CrookedPlank6_StaticMeshComponent0;             // 0x09E8 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m30_StaticMeshComponent0;                      // 0x09F0 (size: 0x8)
    class UStaticMeshComponent* UBeam_DoorHeadA2_StaticMeshComponent0;                // 0x09F8 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_7_StaticMeshComponent0;                // 0x0A00 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_12_lite10_StaticMeshComponent0;        // 0x0A08 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m29_StaticMeshComponent0;                      // 0x0A10 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_12_lite9_StaticMeshComponent0;         // 0x0A18 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_12_lite8_StaticMeshComponent0;         // 0x0A20 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m28_StaticMeshComponent0;                      // 0x0A28 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m27_StaticMeshComponent0;                      // 0x0A30 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m26_StaticMeshComponent0;                      // 0x0A38 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m25_StaticMeshComponent0;                      // 0x0A40 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_20_StaticMeshComponent0;               // 0x0A48 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_19_StaticMeshComponent0;               // 0x0A50 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_12_lite7_StaticMeshComponent0;         // 0x0A58 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m24_StaticMeshComponent0;                      // 0x0A60 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_12_lite6_StaticMeshComponent0;         // 0x0A68 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_18_StaticMeshComponent0;               // 0x0A70 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_17_StaticMeshComponent0;               // 0x0A78 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m23_StaticMeshComponent0;                      // 0x0A80 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_4_StaticMeshComponent0;                // 0x0A88 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m22_StaticMeshComponent0;                      // 0x0A90 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m21_StaticMeshComponent0;                      // 0x0A98 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m8_StaticMeshComponent0;                       // 0x0AA0 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m7_StaticMeshComponent0;                       // 0x0AA8 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m6_StaticMeshComponent0;                       // 0x0AB0 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m5_StaticMeshComponent0;                       // 0x0AB8 (size: 0x8)
    class USceneComponent* Actor3_DefaultSceneRoot;                                   // 0x0AC0 (size: 0x8)

}; // Size: 0xAC8

#endif
