#ifndef UE4SS_SDK_C_SG_J_ShedA_HPP
#define UE4SS_SDK_C_SG_J_ShedA_HPP

class AC_SG_J_ShedA_C : public AConstructionBP_C
{
    class UStaticMeshComponent* roofSingleSmallDisp2_StaticMeshComponent0;            // 0x0550 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly14_StaticMeshComponent0;    // 0x0558 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly13_StaticMeshComponent0;    // 0x0560 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly12_StaticMeshComponent0;    // 0x0568 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly11_StaticMeshComponent0;    // 0x0570 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed50_StaticMeshComponent0;           // 0x0578 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed49_StaticMeshComponent0;           // 0x0580 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed48_StaticMeshComponent0;           // 0x0588 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed47_StaticMeshComponent0;           // 0x0590 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed46_StaticMeshComponent0;           // 0x0598 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed45_StaticMeshComponent0;           // 0x05A0 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed44_StaticMeshComponent0;           // 0x05A8 (size: 0x8)
    class UStaticMeshComponent* ropeKnotA10_StaticMeshComponent0;                     // 0x05B0 (size: 0x8)
    class UStaticMeshComponent* ropeKnotA9_StaticMeshComponent0;                      // 0x05B8 (size: 0x8)
    class UStaticMeshComponent* ropeKnotA8_StaticMeshComponent0;                      // 0x05C0 (size: 0x8)
    class UStaticMeshComponent* ropeKnotA7_StaticMeshComponent0;                      // 0x05C8 (size: 0x8)
    class UStaticMeshComponent* all_aboard_pivot_boardB12_StaticMeshComponent0;       // 0x05D0 (size: 0x8)
    class UStaticMeshComponent* all_aboard_pivot_boardB11_StaticMeshComponent0;       // 0x05D8 (size: 0x8)
    class UStaticMeshComponent* all_aboard_pivot_boardB10_StaticMeshComponent0;       // 0x05E0 (size: 0x8)
    class UStaticMeshComponent* all_aboard_pivot_boardB9_StaticMeshComponent0;        // 0x05E8 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed43_StaticMeshComponent0;           // 0x05F0 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed42_StaticMeshComponent0;           // 0x05F8 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed41_StaticMeshComponent0;           // 0x0600 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed40_StaticMeshComponent0;           // 0x0608 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed39_StaticMeshComponent0;           // 0x0610 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed38_StaticMeshComponent0;           // 0x0618 (size: 0x8)
    class USceneComponent* SG_J_ShedA2_DefaultSceneRoot;                              // 0x0620 (size: 0x8)

}; // Size: 0x628

#endif
