#ifndef UE4SS_SDK_C_SG_ShedA_HPP
#define UE4SS_SDK_C_SG_ShedA_HPP

class AC_SG_ShedA_C : public AConstructionBP_C
{
    class UStaticMeshComponent* Modular_Fence_3_M_LOD5_ufflaitdw_1_Ultralong9_StaticMeshComponent1; // 0x0550 (size: 0x8)
    class UStaticMeshComponent* Modular_Fence_3_M_LOD5_ufflaitdw_1_Ultralong8_StaticMeshComponent1; // 0x0558 (size: 0x8)
    class UStaticMeshComponent* all_aboard_pivot_boardA103_StaticMeshComponent0;      // 0x0560 (size: 0x8)
    class UStaticMeshComponent* all_aboard_pivot_boardA102_StaticMeshComponent0;      // 0x0568 (size: 0x8)
    class UStaticMeshComponent* all_aboard_pivot_boardE40_StaticMeshComponent0;       // 0x0570 (size: 0x8)
    class UStaticMeshComponent* all_aboard_pivot_boardC40_StaticMeshComponent0;       // 0x0578 (size: 0x8)
    class UStaticMeshComponent* all_aboard_pivot_boardA101_StaticMeshComponent0;      // 0x0580 (size: 0x8)
    class UStaticMeshComponent* all_aboard_pivot_boardA100_StaticMeshComponent0;      // 0x0588 (size: 0x8)
    class UStaticMeshComponent* all_aboard_pivot_boardD20_StaticMeshComponent0;       // 0x0590 (size: 0x8)
    class UStaticMeshComponent* all_aboard_pivot_boardE39_StaticMeshComponent0;       // 0x0598 (size: 0x8)
    class UStaticMeshComponent* all_aboard_pivot_boardC39_StaticMeshComponent0;       // 0x05A0 (size: 0x8)
    class UStaticMeshComponent* all_aboard_pivot_boardA99_StaticMeshComponent0;       // 0x05A8 (size: 0x8)
    class UStaticMeshComponent* Modular_Fence_3_M_LOD5_ufflaitdw_1_Ultralong14_StaticMeshComponent0; // 0x05B0 (size: 0x8)
    class UStaticMeshComponent* all_aboard_pivot_boardD19_StaticMeshComponent0;       // 0x05B8 (size: 0x8)
    class UStaticMeshComponent* all_aboard_pivot_boardC38_StaticMeshComponent0;       // 0x05C0 (size: 0x8)
    class UStaticMeshComponent* all_aboard_pivot_boardB6_StaticMeshComponent0;        // 0x05C8 (size: 0x8)
    class UStaticMeshComponent* all_aboard_pivot_boardA98_StaticMeshComponent0;       // 0x05D0 (size: 0x8)
    class UStaticMeshComponent* all_aboard_pivot_boardE38_StaticMeshComponent0;       // 0x05D8 (size: 0x8)
    class UStaticMeshComponent* ropeKnotA15_StaticMeshComponent0;                     // 0x05E0 (size: 0x8)
    class UStaticMeshComponent* ropeKnotA14_StaticMeshComponent0;                     // 0x05E8 (size: 0x8)
    class UStaticMeshComponent* ropeKnotA13_StaticMeshComponent0;                     // 0x05F0 (size: 0x8)
    class UStaticMeshComponent* ropeKnotA12_StaticMeshComponent0;                     // 0x05F8 (size: 0x8)
    class UStaticMeshComponent* Modular_Fence_3_M_LOD5_ufflaitdw_1_Ultralong13_StaticMeshComponent0; // 0x0600 (size: 0x8)
    class UStaticMeshComponent* Modular_Fence_3_M_LOD5_ufflaitdw_1_Ultralong12_StaticMeshComponent0; // 0x0608 (size: 0x8)
    class UStaticMeshComponent* Modular_Fence_3_M_LOD5_ufflaitdw_1_Ultralong11_StaticMeshComponent0; // 0x0610 (size: 0x8)
    class UStaticMeshComponent* Modular_Fence_3_M_LOD5_ufflaitdw_1_Ultralong10_StaticMeshComponent0; // 0x0618 (size: 0x8)
    class UStaticMeshComponent* Modular_Fence_3_M_LOD5_ufflaitdw_1_Ultralong9_StaticMeshComponent0; // 0x0620 (size: 0x8)
    class UStaticMeshComponent* Modular_Fence_3_M_LOD5_ufflaitdw_1_Ultralong8_StaticMeshComponent0; // 0x0628 (size: 0x8)
    class USceneComponent* shedA2_DefaultSceneRoot;                                   // 0x0630 (size: 0x8)

}; // Size: 0x638

#endif
