#ifndef UE4SS_SDK_C_SG_Manor_LV3_Palace_HPP
#define UE4SS_SDK_C_SG_Manor_LV3_Palace_HPP

class AC_SG_Manor_LV3_Palace_C : public AConstructionBP_C
{
    class UStaticMeshComponent* SM_Beam6m_Noise836_StaticMeshComponent0;              // 0x0550 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise835_StaticMeshComponent0;              // 0x0558 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise834_StaticMeshComponent0;              // 0x0560 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise833_StaticMeshComponent0;              // 0x0568 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise832_StaticMeshComponent0;              // 0x0570 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise831_StaticMeshComponent0;              // 0x0578 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise830_StaticMeshComponent0;              // 0x0580 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise829_StaticMeshComponent0;              // 0x0588 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise828_StaticMeshComponent0;              // 0x0590 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise827_StaticMeshComponent0;              // 0x0598 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise826_StaticMeshComponent0;              // 0x05A0 (size: 0x8)
    class UStaticMeshComponent* SM_StoneWallSingle82_StaticMeshComponent0;            // 0x05A8 (size: 0x8)
    class UStaticMeshComponent* SM_StoneWallSingle81_StaticMeshComponent0;            // 0x05B0 (size: 0x8)
    class UStaticMeshComponent* SM_StoneWallSingle80_StaticMeshComponent0;            // 0x05B8 (size: 0x8)
    class UStaticMeshComponent* SM_StoneWallSingle79_StaticMeshComponent0;            // 0x05C0 (size: 0x8)
    class UStaticMeshComponent* SM_StoneWallSingle78_StaticMeshComponent0;            // 0x05C8 (size: 0x8)
    class UStaticMeshComponent* SM_StoneWallSingle77_StaticMeshComponent0;            // 0x05D0 (size: 0x8)
    class UStaticMeshComponent* SM_StoneWallSingle76_StaticMeshComponent0;            // 0x05D8 (size: 0x8)
    class UStaticMeshComponent* SM_StoneWallSingle75_StaticMeshComponent0;            // 0x05E0 (size: 0x8)
    class UStaticMeshComponent* SM_StoneWallSingle74_StaticMeshComponent0;            // 0x05E8 (size: 0x8)
    class UStaticMeshComponent* SM_StoneWallSingle73_StaticMeshComponent0;            // 0x05F0 (size: 0x8)
    class UStaticMeshComponent* SM_StoneWallSingle72_StaticMeshComponent0;            // 0x05F8 (size: 0x8)
    class UStaticMeshComponent* SM_StoneWallSingle71_StaticMeshComponent0;            // 0x0600 (size: 0x8)
    class UStaticMeshComponent* SM_StoneWallSingle70_StaticMeshComponent0;            // 0x0608 (size: 0x8)
    class UStaticMeshComponent* SM_StoneWallSingle69_StaticMeshComponent0;            // 0x0610 (size: 0x8)
    class UStaticMeshComponent* SM_StoneWallSingle68_StaticMeshComponent0;            // 0x0618 (size: 0x8)
    class UStaticMeshComponent* SM_StoneWallSingle67_StaticMeshComponent0;            // 0x0620 (size: 0x8)
    class UStaticMeshComponent* SM_StoneWallSingle66_StaticMeshComponent0;            // 0x0628 (size: 0x8)
    class UStaticMeshComponent* SM_StoneWallSingle65_StaticMeshComponent0;            // 0x0630 (size: 0x8)
    class UStaticMeshComponent* SM_StoneWallSingle64_StaticMeshComponent0;            // 0x0638 (size: 0x8)
    class UStaticMeshComponent* SM_StoneWallSingle63_StaticMeshComponent0;            // 0x0640 (size: 0x8)
    class UStaticMeshComponent* SM_StoneWallSingle62_StaticMeshComponent0;            // 0x0648 (size: 0x8)
    class UStaticMeshComponent* SM_StoneWallSingle61_StaticMeshComponent0;            // 0x0650 (size: 0x8)
    class UStaticMeshComponent* SM_StoneWallSingle60_StaticMeshComponent0;            // 0x0658 (size: 0x8)
    class UStaticMeshComponent* SM_StoneWallSingle59_StaticMeshComponent0;            // 0x0660 (size: 0x8)
    class UStaticMeshComponent* SM_StoneWallSingle58_StaticMeshComponent0;            // 0x0668 (size: 0x8)
    class UStaticMeshComponent* SM_StoneWallSingle54_StaticMeshComponent0;            // 0x0670 (size: 0x8)
    class UStaticMeshComponent* SM_StoneWallSingle53_StaticMeshComponent0;            // 0x0678 (size: 0x8)
    class UStaticMeshComponent* SM_StoneWallSingle52_StaticMeshComponent0;            // 0x0680 (size: 0x8)
    class UStaticMeshComponent* SM_StoneWallSingle37_StaticMeshComponent0;            // 0x0688 (size: 0x8)
    class UStaticMeshComponent* SM_StoneWallSingle34_StaticMeshComponent0;            // 0x0690 (size: 0x8)
    class UStaticMeshComponent* SM_StoneWallSingle33_StaticMeshComponent0;            // 0x0698 (size: 0x8)
    class UStaticMeshComponent* SM_StoneWallSingle32_StaticMeshComponent0;            // 0x06A0 (size: 0x8)
    class UStaticMeshComponent* SM_StoneWallSingle31_StaticMeshComponent0;            // 0x06A8 (size: 0x8)
    class UStaticMeshComponent* manor_foundation2_StaticMeshComponent0;               // 0x06B0 (size: 0x8)
    class UStaticMeshComponent* SM_HouseRoof10_StaticMeshComponent0;                  // 0x06B8 (size: 0x8)
    class UStaticMeshComponent* sg_shutterA31_StaticMeshComponent0;                   // 0x06C0 (size: 0x8)
    class UStaticMeshComponent* sg_shutterA30_StaticMeshComponent0;                   // 0x06C8 (size: 0x8)
    class UStaticMeshComponent* SM_HouseRoof9_StaticMeshComponent0;                   // 0x06D0 (size: 0x8)
    class UStaticMeshComponent* SG_StoneToilet4_StaticMeshComponent0;                 // 0x06D8 (size: 0x8)
    class UStaticMeshComponent* SG_StoneToilet3_StaticMeshComponent0;                 // 0x06E0 (size: 0x8)
    class UStaticMeshComponent* sg_windowBars12_StaticMeshComponent0;                 // 0x06E8 (size: 0x8)
    class UStaticMeshComponent* sg_windowBars11_StaticMeshComponent0;                 // 0x06F0 (size: 0x8)
    class UStaticMeshComponent* sg_windowBars10_StaticMeshComponent0;                 // 0x06F8 (size: 0x8)
    class UStaticMeshComponent* sg_windowBars9_StaticMeshComponent0;                  // 0x0700 (size: 0x8)
    class UStaticMeshComponent* sg_windowBars8_StaticMeshComponent0;                  // 0x0708 (size: 0x8)
    class UStaticMeshComponent* sg_windowBars7_StaticMeshComponent0;                  // 0x0710 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise825_StaticMeshComponent0;              // 0x0718 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise824_StaticMeshComponent0;              // 0x0720 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise823_StaticMeshComponent0;              // 0x0728 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise822_StaticMeshComponent0;              // 0x0730 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise821_StaticMeshComponent0;              // 0x0738 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise820_StaticMeshComponent0;              // 0x0740 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise819_StaticMeshComponent0;              // 0x0748 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise818_StaticMeshComponent0;              // 0x0750 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise817_StaticMeshComponent0;              // 0x0758 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise816_StaticMeshComponent0;              // 0x0760 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long_diagonalD225_StaticMeshComponent0; // 0x0768 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long_diagonalD224_StaticMeshComponent0; // 0x0770 (size: 0x8)
    class UStaticMeshComponent* SG_PlatformBoarding4_StaticMeshComponent0;            // 0x0778 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long_diagonalD223_StaticMeshComponent0; // 0x0780 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long_diagonalD222_StaticMeshComponent0; // 0x0788 (size: 0x8)
    class UStaticMeshComponent* SG_PlatformBoarding3_StaticMeshComponent0;            // 0x0790 (size: 0x8)
    class UStaticMeshComponent* sg_shutterA29_StaticMeshComponent0;                   // 0x0798 (size: 0x8)
    class UStaticMeshComponent* sg_shutterA28_StaticMeshComponent0;                   // 0x07A0 (size: 0x8)
    class UStaticMeshComponent* sg_shutterA27_StaticMeshComponent0;                   // 0x07A8 (size: 0x8)
    class UStaticMeshComponent* sg_shutterA26_StaticMeshComponent0;                   // 0x07B0 (size: 0x8)
    class UStaticMeshComponent* sg_shutterA25_StaticMeshComponent0;                   // 0x07B8 (size: 0x8)
    class UStaticMeshComponent* sg_shutterA24_StaticMeshComponent0;                   // 0x07C0 (size: 0x8)
    class UStaticMeshComponent* SG_BigWindowA42_StaticMeshComponent0;                 // 0x07C8 (size: 0x8)
    class UStaticMeshComponent* SG_BigWindowA41_StaticMeshComponent0;                 // 0x07D0 (size: 0x8)
    class UStaticMeshComponent* SG_BigWindowA40_StaticMeshComponent0;                 // 0x07D8 (size: 0x8)
    class UStaticMeshComponent* SG_BigWindowA39_StaticMeshComponent0;                 // 0x07E0 (size: 0x8)
    class UStaticMeshComponent* SG_BigWindowA38_StaticMeshComponent0;                 // 0x07E8 (size: 0x8)
    class UStaticMeshComponent* SG_BigWindowA37_StaticMeshComponent0;                 // 0x07F0 (size: 0x8)
    class UStaticMeshComponent* SG_BigWindowA36_StaticMeshComponent0;                 // 0x07F8 (size: 0x8)
    class UStaticMeshComponent* SG_BigWindowA_Slim10_StaticMeshComponent0;            // 0x0800 (size: 0x8)
    class UStaticMeshComponent* SG_BigWindowA_Slim9_StaticMeshComponent0;             // 0x0808 (size: 0x8)
    class UStaticMeshComponent* SG_BigWindowA_Slim8_StaticMeshComponent0;             // 0x0810 (size: 0x8)
    class UStaticMeshComponent* SG_StoneWindowA20_StaticMeshComponent0;               // 0x0818 (size: 0x8)
    class UStaticMeshComponent* Plane201_StaticMeshComponent0;                        // 0x0820 (size: 0x8)
    class UStaticMeshComponent* Plane200_StaticMeshComponent0;                        // 0x0828 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise815_StaticMeshComponent0;              // 0x0830 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise814_StaticMeshComponent0;              // 0x0838 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise813_StaticMeshComponent0;              // 0x0840 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise812_StaticMeshComponent0;              // 0x0848 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise811_StaticMeshComponent0;              // 0x0850 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise810_StaticMeshComponent0;              // 0x0858 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise809_StaticMeshComponent0;              // 0x0860 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise808_StaticMeshComponent0;              // 0x0868 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise807_StaticMeshComponent0;              // 0x0870 (size: 0x8)
    class UStaticMeshComponent* rooftiles_smallDormer4_StaticMeshComponent0;          // 0x0878 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise806_StaticMeshComponent0;              // 0x0880 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise805_StaticMeshComponent0;              // 0x0888 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise804_StaticMeshComponent0;              // 0x0890 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise803_StaticMeshComponent0;              // 0x0898 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise802_StaticMeshComponent0;              // 0x08A0 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise801_StaticMeshComponent0;              // 0x08A8 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise800_StaticMeshComponent0;              // 0x08B0 (size: 0x8)
    class UStaticMeshComponent* rooftiles_smallDormer3_StaticMeshComponent0;          // 0x08B8 (size: 0x8)
    class UStaticMeshComponent* quoinB_luv112_StaticMeshComponent0;                   // 0x08C0 (size: 0x8)
    class UStaticMeshComponent* quoinB_luv111_StaticMeshComponent0;                   // 0x08C8 (size: 0x8)
    class UStaticMeshComponent* quoinB_luv110_StaticMeshComponent0;                   // 0x08D0 (size: 0x8)
    class UStaticMeshComponent* quoinB_luv109_StaticMeshComponent0;                   // 0x08D8 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise799_StaticMeshComponent0;              // 0x08E0 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise798_StaticMeshComponent0;              // 0x08E8 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise797_StaticMeshComponent0;              // 0x08F0 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise796_StaticMeshComponent0;              // 0x08F8 (size: 0x8)
    class UStaticMeshComponent* RoofTileDormerA2_StaticMeshComponent0;                // 0x0900 (size: 0x8)
    class UStaticMeshComponent* SG_StoneWindowA19_StaticMeshComponent0;               // 0x0908 (size: 0x8)
    class UStaticMeshComponent* SG_StoneWindowA18_StaticMeshComponent0;               // 0x0910 (size: 0x8)
    class UStaticMeshComponent* RoofTilesSide_TinyHalfHip4_StaticMeshComponent0;      // 0x0918 (size: 0x8)
    class UStaticMeshComponent* RoofTilesSide_TinyHalfHip3_StaticMeshComponent0;      // 0x0920 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise795_StaticMeshComponent0;              // 0x0928 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise794_StaticMeshComponent0;              // 0x0930 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise793_StaticMeshComponent0;              // 0x0938 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise792_StaticMeshComponent0;              // 0x0940 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise791_StaticMeshComponent0;              // 0x0948 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise790_StaticMeshComponent0;              // 0x0950 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise789_StaticMeshComponent0;              // 0x0958 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise788_StaticMeshComponent0;              // 0x0960 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise787_StaticMeshComponent0;              // 0x0968 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise786_StaticMeshComponent0;              // 0x0970 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise785_StaticMeshComponent0;              // 0x0978 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise784_StaticMeshComponent0;              // 0x0980 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise783_StaticMeshComponent0;              // 0x0988 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise782_StaticMeshComponent0;              // 0x0990 (size: 0x8)
    class UStaticMeshComponent* RoofTileTopSeam2_StaticMeshComponent0;                // 0x0998 (size: 0x8)
    class UStaticMeshComponent* SG_BigWindowA35_StaticMeshComponent0;                 // 0x09A0 (size: 0x8)
    class UStaticMeshComponent* SG_BigWindowA34_StaticMeshComponent0;                 // 0x09A8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long_diagonalD221_StaticMeshComponent0; // 0x09B0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long_diagonalD220_StaticMeshComponent0; // 0x09B8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long_diagonalD219_StaticMeshComponent0; // 0x09C0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long_diagonalD218_StaticMeshComponent0; // 0x09C8 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise781_StaticMeshComponent0;              // 0x09D0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long_diagonalD217_StaticMeshComponent0; // 0x09D8 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise780_StaticMeshComponent0;              // 0x09E0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long_diagonalD216_StaticMeshComponent0; // 0x09E8 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise779_StaticMeshComponent0;              // 0x09F0 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise778_StaticMeshComponent0;              // 0x09F8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long_diagonalD215_StaticMeshComponent0; // 0x0A00 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long_diagonalD214_StaticMeshComponent0; // 0x0A08 (size: 0x8)
    class UStaticMeshComponent* Plane199_StaticMeshComponent0;                        // 0x0A10 (size: 0x8)
    class UStaticMeshComponent* Plane198_StaticMeshComponent0;                        // 0x0A18 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise777_StaticMeshComponent0;              // 0x0A20 (size: 0x8)
    class UStaticMeshComponent* Plane197_StaticMeshComponent0;                        // 0x0A28 (size: 0x8)
    class UStaticMeshComponent* SG_SmallGlassWindowA26_StaticMeshComponent0;          // 0x0A30 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise776_StaticMeshComponent0;              // 0x0A38 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise775_StaticMeshComponent0;              // 0x0A40 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise774_StaticMeshComponent0;              // 0x0A48 (size: 0x8)
    class UStaticMeshComponent* Plane196_StaticMeshComponent0;                        // 0x0A50 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise773_StaticMeshComponent0;              // 0x0A58 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise772_StaticMeshComponent0;              // 0x0A60 (size: 0x8)
    class UStaticMeshComponent* SG_BigWindowA_Slim7_StaticMeshComponent0;             // 0x0A68 (size: 0x8)
    class UStaticMeshComponent* SG_BigWindowA_Slim6_StaticMeshComponent0;             // 0x0A70 (size: 0x8)
    class UStaticMeshComponent* SG_SmallGlassWindowA25_StaticMeshComponent0;          // 0x0A78 (size: 0x8)
    class UStaticMeshComponent* SG_SmallGlassWindowA24_StaticMeshComponent0;          // 0x0A80 (size: 0x8)
    class UStaticMeshComponent* gableDecor_lod5_StaticMeshComponent0;                 // 0x0A88 (size: 0x8)
    class UStaticMeshComponent* SG_BigWindowA33_StaticMeshComponent0;                 // 0x0A90 (size: 0x8)
    class UStaticMeshComponent* SG_BigWindowA32_StaticMeshComponent0;                 // 0x0A98 (size: 0x8)
    class UStaticMeshComponent* SG_BigWindowA31_StaticMeshComponent0;                 // 0x0AA0 (size: 0x8)
    class UStaticMeshComponent* gableDecor_lod0_tinyWindows6_StaticMeshComponent0;    // 0x0AA8 (size: 0x8)
    class UStaticMeshComponent* gableDecor_lod4_StaticMeshComponent0;                 // 0x0AB0 (size: 0x8)
    class UStaticMeshComponent* gableDecor_lod0_tinyWindows4_StaticMeshComponent0;    // 0x0AB8 (size: 0x8)
    class UStaticMeshComponent* Plane195_StaticMeshComponent0;                        // 0x0AC0 (size: 0x8)
    class UStaticMeshComponent* Plane194_StaticMeshComponent0;                        // 0x0AC8 (size: 0x8)
    class UStaticMeshComponent* Plane193_StaticMeshComponent0;                        // 0x0AD0 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise771_StaticMeshComponent0;              // 0x0AD8 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise770_StaticMeshComponent0;              // 0x0AE0 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise769_StaticMeshComponent0;              // 0x0AE8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long_diagonalD213_StaticMeshComponent0; // 0x0AF0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long_diagonalD212_StaticMeshComponent0; // 0x0AF8 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise768_StaticMeshComponent0;              // 0x0B00 (size: 0x8)
    class UStaticMeshComponent* Plane192_StaticMeshComponent0;                        // 0x0B08 (size: 0x8)
    class UStaticMeshComponent* SG_SmallGlassWindowA23_StaticMeshComponent0;          // 0x0B10 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise767_StaticMeshComponent0;              // 0x0B18 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise766_StaticMeshComponent0;              // 0x0B20 (size: 0x8)
    class UStaticMeshComponent* Plane191_StaticMeshComponent0;                        // 0x0B28 (size: 0x8)
    class UStaticMeshComponent* Plane190_StaticMeshComponent0;                        // 0x0B30 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise765_StaticMeshComponent0;              // 0x0B38 (size: 0x8)
    class UStaticMeshComponent* SG_SmallGlassWindowA22_StaticMeshComponent0;          // 0x0B40 (size: 0x8)
    class UStaticMeshComponent* SG_SmallGlassWindowA21_StaticMeshComponent0;          // 0x0B48 (size: 0x8)
    class UStaticMeshComponent* Plane189_StaticMeshComponent0;                        // 0x0B50 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise764_StaticMeshComponent0;              // 0x0B58 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise763_StaticMeshComponent0;              // 0x0B60 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long_diagonalD211_StaticMeshComponent0; // 0x0B68 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long_diagonalD210_StaticMeshComponent0; // 0x0B70 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long_diagonalD209_StaticMeshComponent0; // 0x0B78 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long_diagonalD208_StaticMeshComponent0; // 0x0B80 (size: 0x8)
    class UStaticMeshComponent* Plane188_StaticMeshComponent0;                        // 0x0B88 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise762_StaticMeshComponent0;              // 0x0B90 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise761_StaticMeshComponent0;              // 0x0B98 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise760_StaticMeshComponent0;              // 0x0BA0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long_diagonalD207_StaticMeshComponent0; // 0x0BA8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long_diagonalD206_StaticMeshComponent0; // 0x0BB0 (size: 0x8)
    class UStaticMeshComponent* Plane187_StaticMeshComponent0;                        // 0x0BB8 (size: 0x8)
    class UStaticMeshComponent* Plane186_StaticMeshComponent0;                        // 0x0BC0 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise759_StaticMeshComponent0;              // 0x0BC8 (size: 0x8)
    class UStaticMeshComponent* Plane185_StaticMeshComponent0;                        // 0x0BD0 (size: 0x8)
    class UStaticMeshComponent* SG_SmallGlassWindowA20_StaticMeshComponent0;          // 0x0BD8 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise758_StaticMeshComponent0;              // 0x0BE0 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise757_StaticMeshComponent0;              // 0x0BE8 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise756_StaticMeshComponent0;              // 0x0BF0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long_diagonalD205_StaticMeshComponent0; // 0x0BF8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long_diagonalD204_StaticMeshComponent0; // 0x0C00 (size: 0x8)
    class UStaticMeshComponent* Plane184_StaticMeshComponent0;                        // 0x0C08 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise755_StaticMeshComponent0;              // 0x0C10 (size: 0x8)
    class UStaticMeshComponent* Plane183_StaticMeshComponent0;                        // 0x0C18 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise754_StaticMeshComponent0;              // 0x0C20 (size: 0x8)
    class UStaticMeshComponent* SG_SmallGlassWindowA19_StaticMeshComponent0;          // 0x0C28 (size: 0x8)
    class UStaticMeshComponent* SG_SmallGlassWindowA18_StaticMeshComponent0;          // 0x0C30 (size: 0x8)
    class UStaticMeshComponent* Plane182_StaticMeshComponent0;                        // 0x0C38 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise753_StaticMeshComponent0;              // 0x0C40 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise752_StaticMeshComponent0;              // 0x0C48 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise751_StaticMeshComponent0;              // 0x0C50 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise750_StaticMeshComponent0;              // 0x0C58 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long_diagonalD203_StaticMeshComponent0; // 0x0C60 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long_diagonalD202_StaticMeshComponent0; // 0x0C68 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long_diagonalD201_StaticMeshComponent0; // 0x0C70 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long_diagonalD200_StaticMeshComponent0; // 0x0C78 (size: 0x8)
    class UStaticMeshComponent* Plane181_StaticMeshComponent0;                        // 0x0C80 (size: 0x8)
    class UStaticMeshComponent* Plane180_StaticMeshComponent0;                        // 0x0C88 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise749_StaticMeshComponent0;              // 0x0C90 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise748_StaticMeshComponent0;              // 0x0C98 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long_diagonalD199_StaticMeshComponent0; // 0x0CA0 (size: 0x8)
    class UStaticMeshComponent* SG_BigWindowA30_StaticMeshComponent0;                 // 0x0CA8 (size: 0x8)
    class UStaticMeshComponent* SG_BigWindowA29_StaticMeshComponent0;                 // 0x0CB0 (size: 0x8)
    class UStaticMeshComponent* SG_BigWindowA19_StaticMeshComponent0;                 // 0x0CB8 (size: 0x8)
    class UStaticMeshComponent* SG_BigWindowA18_StaticMeshComponent0;                 // 0x0CC0 (size: 0x8)
    class UStaticMeshComponent* SG_BigWindowA17_StaticMeshComponent0;                 // 0x0CC8 (size: 0x8)
    class UStaticMeshComponent* SG_BigWindowA11_StaticMeshComponent0;                 // 0x0CD0 (size: 0x8)
    class UStaticMeshComponent* SG_BigWindowA10_StaticMeshComponent0;                 // 0x0CD8 (size: 0x8)
    class UStaticMeshComponent* SG_BigWindowA7_StaticMeshComponent0;                  // 0x0CE0 (size: 0x8)
    class UStaticMeshComponent* SG_BigWindowA6_StaticMeshComponent0;                  // 0x0CE8 (size: 0x8)
    class UStaticMeshComponent* SG_SmallGlassWindowA17_StaticMeshComponent0;          // 0x0CF0 (size: 0x8)
    class UStaticMeshComponent* SG_SmallGlassWindowA16_StaticMeshComponent0;          // 0x0CF8 (size: 0x8)
    class UStaticMeshComponent* SG_SmallGlassWindowA15_StaticMeshComponent0;          // 0x0D00 (size: 0x8)
    class UStaticMeshComponent* SG_SmallGlassWindowA14_StaticMeshComponent0;          // 0x0D08 (size: 0x8)
    class UStaticMeshComponent* SG_DecorSupport8_StaticMeshComponent0;                // 0x0D10 (size: 0x8)
    class UStaticMeshComponent* SG_DecorSupport7_StaticMeshComponent0;                // 0x0D18 (size: 0x8)
    class UStaticMeshComponent* SG_DecorSupport6_StaticMeshComponent0;                // 0x0D20 (size: 0x8)
    class UStaticMeshComponent* SG_DecorSupport5_StaticMeshComponent0;                // 0x0D28 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long_diagonalD198_StaticMeshComponent0; // 0x0D30 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long_diagonalD197_StaticMeshComponent0; // 0x0D38 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long_diagonalD196_StaticMeshComponent0; // 0x0D40 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long_diagonalD195_StaticMeshComponent0; // 0x0D48 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long_diagonalD194_StaticMeshComponent0; // 0x0D50 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long_diagonalD193_StaticMeshComponent0; // 0x0D58 (size: 0x8)
    class UStaticMeshComponent* Plane179_StaticMeshComponent0;                        // 0x0D60 (size: 0x8)
    class UStaticMeshComponent* Plane178_StaticMeshComponent0;                        // 0x0D68 (size: 0x8)
    class UStaticMeshComponent* Plane177_StaticMeshComponent0;                        // 0x0D70 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long_diagonalD192_StaticMeshComponent0; // 0x0D78 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long_diagonalD191_StaticMeshComponent0; // 0x0D80 (size: 0x8)
    class UStaticMeshComponent* Plane176_StaticMeshComponent0;                        // 0x0D88 (size: 0x8)
    class UStaticMeshComponent* Plane175_StaticMeshComponent0;                        // 0x0D90 (size: 0x8)
    class UStaticMeshComponent* Plane174_StaticMeshComponent0;                        // 0x0D98 (size: 0x8)
    class UStaticMeshComponent* Plane173_StaticMeshComponent0;                        // 0x0DA0 (size: 0x8)
    class UStaticMeshComponent* Plane172_StaticMeshComponent0;                        // 0x0DA8 (size: 0x8)
    class UStaticMeshComponent* Plane171_StaticMeshComponent0;                        // 0x0DB0 (size: 0x8)
    class UStaticMeshComponent* Plane170_StaticMeshComponent0;                        // 0x0DB8 (size: 0x8)
    class UStaticMeshComponent* Plane169_StaticMeshComponent0;                        // 0x0DC0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long_diagonalD190_StaticMeshComponent0; // 0x0DC8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long_diagonalD189_StaticMeshComponent0; // 0x0DD0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long_diagonalD188_StaticMeshComponent0; // 0x0DD8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long_diagonalD187_StaticMeshComponent0; // 0x0DE0 (size: 0x8)
    class UStaticMeshComponent* Plane168_StaticMeshComponent0;                        // 0x0DE8 (size: 0x8)
    class UStaticMeshComponent* Plane167_StaticMeshComponent0;                        // 0x0DF0 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise747_StaticMeshComponent0;              // 0x0DF8 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise746_StaticMeshComponent0;              // 0x0E00 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise745_StaticMeshComponent0;              // 0x0E08 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long_diagonalD186_StaticMeshComponent0; // 0x0E10 (size: 0x8)
    class UStaticMeshComponent* Plane166_StaticMeshComponent0;                        // 0x0E18 (size: 0x8)
    class UStaticMeshComponent* Plane165_StaticMeshComponent0;                        // 0x0E20 (size: 0x8)
    class UStaticMeshComponent* Plane164_StaticMeshComponent0;                        // 0x0E28 (size: 0x8)
    class UStaticMeshComponent* Plane163_StaticMeshComponent0;                        // 0x0E30 (size: 0x8)
    class UStaticMeshComponent* Plane162_StaticMeshComponent0;                        // 0x0E38 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long_diagonalD185_StaticMeshComponent0; // 0x0E40 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long_diagonalD184_StaticMeshComponent0; // 0x0E48 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise744_StaticMeshComponent0;              // 0x0E50 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise743_StaticMeshComponent0;              // 0x0E58 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise742_StaticMeshComponent0;              // 0x0E60 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise741_StaticMeshComponent0;              // 0x0E68 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise740_StaticMeshComponent0;              // 0x0E70 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise739_StaticMeshComponent0;              // 0x0E78 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise738_StaticMeshComponent0;              // 0x0E80 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise737_StaticMeshComponent0;              // 0x0E88 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise736_StaticMeshComponent0;              // 0x0E90 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise735_StaticMeshComponent0;              // 0x0E98 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise734_StaticMeshComponent0;              // 0x0EA0 (size: 0x8)
    class UStaticMeshComponent* sg_shutterA23_StaticMeshComponent0;                   // 0x0EA8 (size: 0x8)
    class UStaticMeshComponent* sg_shutterA22_StaticMeshComponent0;                   // 0x0EB0 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise733_StaticMeshComponent0;              // 0x0EB8 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise732_StaticMeshComponent0;              // 0x0EC0 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise731_StaticMeshComponent0;              // 0x0EC8 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise730_StaticMeshComponent0;              // 0x0ED0 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise729_StaticMeshComponent0;              // 0x0ED8 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise728_StaticMeshComponent0;              // 0x0EE0 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise727_StaticMeshComponent0;              // 0x0EE8 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise726_StaticMeshComponent0;              // 0x0EF0 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise725_StaticMeshComponent0;              // 0x0EF8 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise724_StaticMeshComponent0;              // 0x0F00 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise723_StaticMeshComponent0;              // 0x0F08 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise722_StaticMeshComponent0;              // 0x0F10 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise721_StaticMeshComponent0;              // 0x0F18 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise720_StaticMeshComponent0;              // 0x0F20 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise719_StaticMeshComponent0;              // 0x0F28 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise718_StaticMeshComponent0;              // 0x0F30 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise717_StaticMeshComponent0;              // 0x0F38 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise716_StaticMeshComponent0;              // 0x0F40 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise715_StaticMeshComponent0;              // 0x0F48 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise714_StaticMeshComponent0;              // 0x0F50 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise713_StaticMeshComponent0;              // 0x0F58 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam_DiagonalG57_StaticMeshComponent0;         // 0x0F60 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam_DiagonalG56_StaticMeshComponent0;         // 0x0F68 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise712_StaticMeshComponent0;              // 0x0F70 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise711_StaticMeshComponent0;              // 0x0F78 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise710_StaticMeshComponent0;              // 0x0F80 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise709_StaticMeshComponent0;              // 0x0F88 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise708_StaticMeshComponent0;              // 0x0F90 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise707_StaticMeshComponent0;              // 0x0F98 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise706_StaticMeshComponent0;              // 0x0FA0 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise705_StaticMeshComponent0;              // 0x0FA8 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise704_StaticMeshComponent0;              // 0x0FB0 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise703_StaticMeshComponent0;              // 0x0FB8 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise702_StaticMeshComponent0;              // 0x0FC0 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise701_StaticMeshComponent0;              // 0x0FC8 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise700_StaticMeshComponent0;              // 0x0FD0 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise699_StaticMeshComponent0;              // 0x0FD8 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise698_StaticMeshComponent0;              // 0x0FE0 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise697_StaticMeshComponent0;              // 0x0FE8 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise696_StaticMeshComponent0;              // 0x0FF0 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise695_StaticMeshComponent0;              // 0x0FF8 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise694_StaticMeshComponent0;              // 0x1000 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise693_StaticMeshComponent0;              // 0x1008 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise692_StaticMeshComponent0;              // 0x1010 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise691_StaticMeshComponent0;              // 0x1018 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long_diagonalD183_StaticMeshComponent0; // 0x1020 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise690_StaticMeshComponent0;              // 0x1028 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise689_StaticMeshComponent0;              // 0x1030 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise688_StaticMeshComponent0;              // 0x1038 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long_diagonalD140_StaticMeshComponent0; // 0x1040 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise687_StaticMeshComponent0;              // 0x1048 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise686_StaticMeshComponent0;              // 0x1050 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise685_StaticMeshComponent0;              // 0x1058 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise684_StaticMeshComponent0;              // 0x1060 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise683_StaticMeshComponent0;              // 0x1068 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise682_StaticMeshComponent0;              // 0x1070 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long_diagonalD137_StaticMeshComponent0; // 0x1078 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise681_StaticMeshComponent0;              // 0x1080 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise680_StaticMeshComponent0;              // 0x1088 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise679_StaticMeshComponent0;              // 0x1090 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam_DiagonalG55_StaticMeshComponent0;         // 0x1098 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise678_StaticMeshComponent0;              // 0x10A0 (size: 0x8)
    class UStaticMeshComponent* SM_HouseRoof8_StaticMeshComponent0;                   // 0x10A8 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise677_StaticMeshComponent0;              // 0x10B0 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise676_StaticMeshComponent0;              // 0x10B8 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise675_StaticMeshComponent0;              // 0x10C0 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise674_StaticMeshComponent0;              // 0x10C8 (size: 0x8)
    class UStaticMeshComponent* Scree_12_StaticMeshComponent0;                        // 0x10D0 (size: 0x8)
    class UStaticMeshComponent* Scree_11_StaticMeshComponent0;                        // 0x10D8 (size: 0x8)
    class UStaticMeshComponent* Scree_10_StaticMeshComponent0;                        // 0x10E0 (size: 0x8)
    class UStaticMeshComponent* Scree_9_StaticMeshComponent0;                         // 0x10E8 (size: 0x8)
    class UStaticMeshComponent* Scree_8_StaticMeshComponent0;                         // 0x10F0 (size: 0x8)
    class UStaticMeshComponent* Medium_Boulder_LowPoly6_StaticMeshComponent0;         // 0x10F8 (size: 0x8)
    class UStaticMeshComponent* Medium_Boulder_LowPoly5_StaticMeshComponent0;         // 0x1100 (size: 0x8)
    class UStaticMeshComponent* Scree_001_B2_StaticMeshComponent0;                    // 0x1108 (size: 0x8)
    class UStaticMeshComponent* Scree_7_StaticMeshComponent0;                         // 0x1110 (size: 0x8)
    class UStaticMeshComponent* SM_River_Rock_2_StaticMeshComponent0;                 // 0x1118 (size: 0x8)
    class UStaticMeshComponent* Medium_Boulder_LowPoly4_StaticMeshComponent0;         // 0x1120 (size: 0x8)
    class UStaticMeshComponent* Medium_Boulder_2_StaticMeshComponent0;                // 0x1128 (size: 0x8)
    class UStaticMeshComponent* Aset_castle_wall_M_sdAta_lower11_StaticMeshComponent0; // 0x1130 (size: 0x8)
    class UStaticMeshComponent* Aset_castle_wall_M_sdAta_lower10_StaticMeshComponent0; // 0x1138 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise673_StaticMeshComponent0;              // 0x1140 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise672_StaticMeshComponent0;              // 0x1148 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise671_StaticMeshComponent0;              // 0x1150 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise670_StaticMeshComponent0;              // 0x1158 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise669_StaticMeshComponent0;              // 0x1160 (size: 0x8)
    class UStaticMeshComponent* Aset_castle_wall_M_sdAta_lower9_StaticMeshComponent0; // 0x1168 (size: 0x8)
    class UStaticMeshComponent* SG_StoneDoorA6_StaticMeshComponent0;                  // 0x1170 (size: 0x8)
    class UStaticMeshComponent* SG_StoneDoorA5_StaticMeshComponent0;                  // 0x1178 (size: 0x8)
    class UStaticMeshComponent* SG_StoneDoorA4_StaticMeshComponent0;                  // 0x1180 (size: 0x8)
    class UStaticMeshComponent* manor02_sidebuilding_Door4_StaticMeshComponent0;      // 0x1188 (size: 0x8)
    class UStaticMeshComponent* manor02_sidebuilding_Door3_StaticMeshComponent0;      // 0x1190 (size: 0x8)
    class UStaticMeshComponent* Manor_LV3_Stripe2_StaticMeshComponent0;               // 0x1198 (size: 0x8)
    class UStaticMeshComponent* quoinB_luv108_StaticMeshComponent0;                   // 0x11A0 (size: 0x8)
    class UStaticMeshComponent* quoinB_luv107_StaticMeshComponent0;                   // 0x11A8 (size: 0x8)
    class UStaticMeshComponent* quoinB_luv106_StaticMeshComponent0;                   // 0x11B0 (size: 0x8)
    class UStaticMeshComponent* quoinB_luv105_StaticMeshComponent0;                   // 0x11B8 (size: 0x8)
    class UStaticMeshComponent* quoinB_luv104_StaticMeshComponent0;                   // 0x11C0 (size: 0x8)
    class UStaticMeshComponent* quoinB_luv103_StaticMeshComponent0;                   // 0x11C8 (size: 0x8)
    class UStaticMeshComponent* SG_StoneWindowA17_StaticMeshComponent0;               // 0x11D0 (size: 0x8)
    class UStaticMeshComponent* SG_StoneWindowA16_StaticMeshComponent0;               // 0x11D8 (size: 0x8)
    class UStaticMeshComponent* SG_StoneWindowA15_StaticMeshComponent0;               // 0x11E0 (size: 0x8)
    class UStaticMeshComponent* SG_StoneWindowA14_StaticMeshComponent0;               // 0x11E8 (size: 0x8)
    class UStaticMeshComponent* Aset_castle_wall_M_sdAta_lower8_StaticMeshComponent0; // 0x11F0 (size: 0x8)
    class UStaticMeshComponent* Aset_castle_wall_M_sdAta_lower7_StaticMeshComponent0; // 0x11F8 (size: 0x8)
    class UStaticMeshComponent* SG_StoneWindowA13_StaticMeshComponent0;               // 0x1200 (size: 0x8)
    class UStaticMeshComponent* SG_StoneWindowA4_StaticMeshComponent0;                // 0x1208 (size: 0x8)
    class UStaticMeshComponent* SG_StoneWindowA2_StaticMeshComponent0;                // 0x1210 (size: 0x8)
    class UStaticMeshComponent* blackness11_StaticMeshComponent0;                     // 0x1218 (size: 0x8)
    class USceneComponent* C_SG_Manor_LV4_DefaultSceneRoot;                           // 0x1220 (size: 0x8)

}; // Size: 0x1228

#endif
