#ifndef UE4SS_SDK_C_SG_EmptyBPart_3_Wide_HPP
#define UE4SS_SDK_C_SG_EmptyBPart_3_Wide_HPP

class AC_SG_EmptyBPart_3_Wide_C : public AConstructionBP_C
{
    class UStaticMeshComponent* SM_MERGED_UDaubPlane_Standard11_StaticMeshComponent0; // 0x0550 (size: 0x8)
    class UStaticMeshComponent* SM_MERGED_UDaubPlane_Standard10_StaticMeshComponent0; // 0x0558 (size: 0x8)
    class UStaticMeshComponent* SM_MERGED_UDaubPlane_StandardSingleWindow_DoubleSide2_StaticMeshComponent0; // 0x0560 (size: 0x8)
    class UStaticMeshComponent* SM_MERGED_UDaubPlane_Standard_DoubleSideB2_StaticMeshComponent0; // 0x0568 (size: 0x8)
    class UStaticMeshComponent* SM_MERGED_UDaubPlane_Standard_DoubleSide2_StaticMeshComponent0; // 0x0570 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m109_StaticMeshComponent0;                  // 0x0578 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m108_StaticMeshComponent0;                  // 0x0580 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m107_StaticMeshComponent0;                  // 0x0588 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m106_StaticMeshComponent0;                  // 0x0590 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m105_StaticMeshComponent0;                  // 0x0598 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m104_StaticMeshComponent0;                  // 0x05A0 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m103_StaticMeshComponent0;                  // 0x05A8 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m102_StaticMeshComponent0;                  // 0x05B0 (size: 0x8)
    class UStaticMeshComponent* roofSingleDisplaced_cutdown_Narrow2_StaticMeshComponent0; // 0x05B8 (size: 0x8)
    class UStaticMeshComponent* foundations_lv3_emptyB_3_wide2_StaticMeshComponent0;  // 0x05C0 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Corner8_StaticMeshComponent0;              // 0x05C8 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg103_StaticMeshComponent0;    // 0x05D0 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_51_StaticMeshComponent0;               // 0x05D8 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg102_StaticMeshComponent0;    // 0x05E0 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_50_StaticMeshComponent0;               // 0x05E8 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m101_StaticMeshComponent0;                  // 0x05F0 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Corner7_StaticMeshComponent0;              // 0x05F8 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Corner5_StaticMeshComponent0;              // 0x0600 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Corner3_StaticMeshComponent0;              // 0x0608 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Standard5_StaticMeshComponent0;            // 0x0610 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Standard4_StaticMeshComponent0;            // 0x0618 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg101_StaticMeshComponent0;    // 0x0620 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg100_StaticMeshComponent0;    // 0x0628 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg99_StaticMeshComponent0;     // 0x0630 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_49_StaticMeshComponent0;               // 0x0638 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg98_StaticMeshComponent0;     // 0x0640 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_48_StaticMeshComponent0;               // 0x0648 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg97_StaticMeshComponent0;     // 0x0650 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg96_StaticMeshComponent0;     // 0x0658 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg95_StaticMeshComponent0;     // 0x0660 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg94_StaticMeshComponent0;     // 0x0668 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg93_StaticMeshComponent0;     // 0x0670 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg92_StaticMeshComponent0;     // 0x0678 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg91_StaticMeshComponent0;     // 0x0680 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg90_StaticMeshComponent0;     // 0x0688 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg89_StaticMeshComponent0;     // 0x0690 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg88_StaticMeshComponent0;     // 0x0698 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg87_StaticMeshComponent0;     // 0x06A0 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg86_StaticMeshComponent0;     // 0x06A8 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg85_StaticMeshComponent0;     // 0x06B0 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m100_StaticMeshComponent0;                  // 0x06B8 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m99_StaticMeshComponent0;                   // 0x06C0 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m98_StaticMeshComponent0;                   // 0x06C8 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m97_StaticMeshComponent0;                   // 0x06D0 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m96_StaticMeshComponent0;                   // 0x06D8 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m95_StaticMeshComponent0;                   // 0x06E0 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m94_StaticMeshComponent0;                   // 0x06E8 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m93_StaticMeshComponent0;                   // 0x06F0 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m92_StaticMeshComponent0;                   // 0x06F8 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m91_StaticMeshComponent0;                   // 0x0700 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m90_StaticMeshComponent0;                   // 0x0708 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m89_StaticMeshComponent0;                   // 0x0710 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_47_StaticMeshComponent0;               // 0x0718 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_46_StaticMeshComponent0;               // 0x0720 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_45_StaticMeshComponent0;               // 0x0728 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m88_StaticMeshComponent0;                   // 0x0730 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m87_StaticMeshComponent0;                   // 0x0738 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_44_StaticMeshComponent0;               // 0x0740 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_43_StaticMeshComponent0;               // 0x0748 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_42_StaticMeshComponent0;               // 0x0750 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_41_StaticMeshComponent0;               // 0x0758 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m86_StaticMeshComponent0;                   // 0x0760 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m85_StaticMeshComponent0;                   // 0x0768 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m84_StaticMeshComponent0;                   // 0x0770 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m83_StaticMeshComponent0;                   // 0x0778 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m82_StaticMeshComponent0;                   // 0x0780 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m81_StaticMeshComponent0;                   // 0x0788 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m80_StaticMeshComponent0;                   // 0x0790 (size: 0x8)
    class USceneComponent* Actor4_DefaultSceneRoot;                                   // 0x0798 (size: 0x8)

}; // Size: 0x7A0

#endif
