#ifndef UE4SS_SDK_C_SG_Gatehouse_Lv1_adjusted_HPP
#define UE4SS_SDK_C_SG_Gatehouse_Lv1_adjusted_HPP

class AC_SG_Gatehouse_Lv1_adjusted_C : public AConstructionBP_C
{
    class UStaticMeshComponent* palisade_strut12_StaticMeshComponent0;                // 0x0550 (size: 0x8)
    class UStaticMeshComponent* palisade_strut11_StaticMeshComponent0;                // 0x0558 (size: 0x8)
    class UStaticMeshComponent* palisade_strut10_StaticMeshComponent0;                // 0x0560 (size: 0x8)
    class UStaticMeshComponent* palisade_strut9_StaticMeshComponent0;                 // 0x0568 (size: 0x8)
    class UStaticMeshComponent* palisade_strut8_StaticMeshComponent0;                 // 0x0570 (size: 0x8)
    class UStaticMeshComponent* palisade_strut7_StaticMeshComponent0;                 // 0x0578 (size: 0x8)
    class UStaticMeshComponent* sg_thatch_gatehouse_lv2_StaticMeshComponent0;         // 0x0580 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly94_StaticMeshComponent0;    // 0x0588 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly93_StaticMeshComponent0;    // 0x0590 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly92_StaticMeshComponent0;    // 0x0598 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly91_StaticMeshComponent0;    // 0x05A0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly90_StaticMeshComponent0;    // 0x05A8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly89_StaticMeshComponent0;    // 0x05B0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly88_StaticMeshComponent0;    // 0x05B8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly87_StaticMeshComponent0;    // 0x05C0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly86_StaticMeshComponent0;    // 0x05C8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly85_StaticMeshComponent0;    // 0x05D0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly84_StaticMeshComponent0;    // 0x05D8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly83_StaticMeshComponent0;    // 0x05E0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly82_StaticMeshComponent0;    // 0x05E8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly81_StaticMeshComponent0;    // 0x05F0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly80_StaticMeshComponent0;    // 0x05F8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly79_StaticMeshComponent0;    // 0x0600 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly78_StaticMeshComponent0;    // 0x0608 (size: 0x8)
    class UStaticMeshComponent* pebbleWall_hadnsculpted12_StaticMeshComponent0;       // 0x0610 (size: 0x8)
    class UStaticMeshComponent* pebbleWall_hadnsculpted11_StaticMeshComponent0;       // 0x0618 (size: 0x8)
    class UStaticMeshComponent* pebbleWall_hadnsculpted10_StaticMeshComponent0;       // 0x0620 (size: 0x8)
    class UStaticMeshComponent* pebbleWall_hadnsculpted9_StaticMeshComponent0;        // 0x0628 (size: 0x8)
    class UStaticMeshComponent* pebbleWall_hadnsculpted8_StaticMeshComponent0;        // 0x0630 (size: 0x8)
    class UStaticMeshComponent* pebbleWall_hadnsculpted7_StaticMeshComponent0;        // 0x0638 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly77_StaticMeshComponent0;    // 0x0640 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly76_StaticMeshComponent0;    // 0x0648 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly75_StaticMeshComponent0;    // 0x0650 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly74_StaticMeshComponent0;    // 0x0658 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly73_StaticMeshComponent0;    // 0x0660 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly72_StaticMeshComponent0;    // 0x0668 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly71_StaticMeshComponent0;    // 0x0670 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly70_StaticMeshComponent0;    // 0x0678 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly69_StaticMeshComponent0;    // 0x0680 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly68_StaticMeshComponent0;    // 0x0688 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly67_StaticMeshComponent0;    // 0x0690 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly66_StaticMeshComponent0;    // 0x0698 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly65_StaticMeshComponent0;    // 0x06A0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly64_StaticMeshComponent0;    // 0x06A8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly63_StaticMeshComponent0;    // 0x06B0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly62_StaticMeshComponent0;    // 0x06B8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly61_StaticMeshComponent0;    // 0x06C0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly60_StaticMeshComponent0;    // 0x06C8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly59_StaticMeshComponent0;    // 0x06D0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly58_StaticMeshComponent0;    // 0x06D8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly57_StaticMeshComponent0;    // 0x06E0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly56_StaticMeshComponent0;    // 0x06E8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly55_StaticMeshComponent0;    // 0x06F0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly54_StaticMeshComponent0;    // 0x06F8 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_54_StaticMeshComponent0; // 0x0700 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_53_StaticMeshComponent0; // 0x0708 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_52_StaticMeshComponent0; // 0x0710 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_51_StaticMeshComponent0; // 0x0718 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_50_StaticMeshComponent0; // 0x0720 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_49_StaticMeshComponent0; // 0x0728 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly53_StaticMeshComponent0;    // 0x0730 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly52_StaticMeshComponent0;    // 0x0738 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly51_StaticMeshComponent0;    // 0x0740 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly50_StaticMeshComponent0;    // 0x0748 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly49_StaticMeshComponent0;    // 0x0750 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly48_StaticMeshComponent0;    // 0x0758 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m57_StaticMeshComponent0;                 // 0x0760 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m56_StaticMeshComponent0;                 // 0x0768 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m55_StaticMeshComponent0;                 // 0x0770 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m54_StaticMeshComponent0;                 // 0x0778 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m53_StaticMeshComponent0;                 // 0x0780 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m52_StaticMeshComponent0;                 // 0x0788 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m51_StaticMeshComponent0;                 // 0x0790 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m50_StaticMeshComponent0;                 // 0x0798 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m49_StaticMeshComponent0;                 // 0x07A0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m48_StaticMeshComponent0;                 // 0x07A8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m47_StaticMeshComponent0;                 // 0x07B0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m46_StaticMeshComponent0;                 // 0x07B8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m45_StaticMeshComponent0;                 // 0x07C0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m44_StaticMeshComponent0;                 // 0x07C8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m43_StaticMeshComponent0;                 // 0x07D0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m42_StaticMeshComponent0;                 // 0x07D8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m41_StaticMeshComponent0;                 // 0x07E0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m40_StaticMeshComponent0;                 // 0x07E8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m39_StaticMeshComponent0;                 // 0x07F0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m38_StaticMeshComponent0;                 // 0x07F8 (size: 0x8)
    class UStaticMeshComponent* ropeKnotA4_StaticMeshComponent0;                      // 0x0800 (size: 0x8)
    class UStaticMeshComponent* ropeKnotA3_StaticMeshComponent0;                      // 0x0808 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed8_StaticMeshComponent0;            // 0x0810 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed7_StaticMeshComponent0;            // 0x0818 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed4_StaticMeshComponent0;            // 0x0820 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed2_StaticMeshComponent0;            // 0x0828 (size: 0x8)
    class UStaticMeshComponent* SG_windowBoardD_square__long6_StaticMeshComponent0;   // 0x0830 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardC_thinner48_StaticMeshComponent0;       // 0x0838 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardC_thinner_29_StaticMeshComponent0;      // 0x0840 (size: 0x8)
    class UStaticMeshComponent* SG_windowBoardD_square__long5_StaticMeshComponent0;   // 0x0848 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA32_StaticMeshComponent0;               // 0x0850 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardC_thinner_28_StaticMeshComponent0;      // 0x0858 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long14_StaticMeshComponent0;         // 0x0860 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardC_thinner46_StaticMeshComponent0;       // 0x0868 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA31_StaticMeshComponent0;               // 0x0870 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardC_thinner45_StaticMeshComponent0;       // 0x0878 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_48_StaticMeshComponent0; // 0x0880 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_47_StaticMeshComponent0; // 0x0888 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_46_StaticMeshComponent0; // 0x0890 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_45_StaticMeshComponent0; // 0x0898 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardC_thinner44_StaticMeshComponent0;       // 0x08A0 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA30_StaticMeshComponent0;               // 0x08A8 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardC_thinner_27_StaticMeshComponent0;      // 0x08B0 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardC_thinner43_StaticMeshComponent0;       // 0x08B8 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardC_thinner42_StaticMeshComponent0;       // 0x08C0 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA29_StaticMeshComponent0;               // 0x08C8 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardC_thinner_26_StaticMeshComponent0;      // 0x08D0 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardC_thinner41_StaticMeshComponent0;       // 0x08D8 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardC_thinner40_StaticMeshComponent0;       // 0x08E0 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA28_StaticMeshComponent0;               // 0x08E8 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardC_thinner_25_StaticMeshComponent0;      // 0x08F0 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardC_thinner39_StaticMeshComponent0;       // 0x08F8 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardC_thinner38_StaticMeshComponent0;       // 0x0900 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA27_StaticMeshComponent0;               // 0x0908 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardC_thinner_24_StaticMeshComponent0;      // 0x0910 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardC_thinner37_StaticMeshComponent0;       // 0x0918 (size: 0x8)
    class UStaticMeshComponent* SG_windowBoardE_double2_StaticMeshComponent0;         // 0x0920 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA26_StaticMeshComponent0;               // 0x0928 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardC_thinner_23_StaticMeshComponent0;      // 0x0930 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardC_thinner36_StaticMeshComponent0;       // 0x0938 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardC_thinner35_StaticMeshComponent0;       // 0x0940 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA25_StaticMeshComponent0;               // 0x0948 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardC_thinner_22_StaticMeshComponent0;      // 0x0950 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardC_thinner34_StaticMeshComponent0;       // 0x0958 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_44_StaticMeshComponent0; // 0x0960 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_43_StaticMeshComponent0; // 0x0968 (size: 0x8)
    class UStaticMeshComponent* SG_windowBoardC_square2_StaticMeshComponent0;         // 0x0970 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA24_StaticMeshComponent0;               // 0x0978 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardC_thinner_21_StaticMeshComponent0;      // 0x0980 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardC_thinner33_StaticMeshComponent0;       // 0x0988 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardC_thinner32_StaticMeshComponent0;       // 0x0990 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA23_StaticMeshComponent0;               // 0x0998 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardC_thinner_20_StaticMeshComponent0;      // 0x09A0 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardC_thinner31_StaticMeshComponent0;       // 0x09A8 (size: 0x8)
    class UStaticMeshComponent* SG_windowBoardD_square__long4_StaticMeshComponent0;   // 0x09B0 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA22_StaticMeshComponent0;               // 0x09B8 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardC_thinner_19_StaticMeshComponent0;      // 0x09C0 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardC_thinner30_StaticMeshComponent0;       // 0x09C8 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardC_thinner29_StaticMeshComponent0;       // 0x09D0 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA21_StaticMeshComponent0;               // 0x09D8 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardC_thinner_18_StaticMeshComponent0;      // 0x09E0 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardC_thinner28_StaticMeshComponent0;       // 0x09E8 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_42_StaticMeshComponent0; // 0x09F0 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_41_StaticMeshComponent0; // 0x09F8 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_40_StaticMeshComponent0; // 0x0A00 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_39_StaticMeshComponent0; // 0x0A08 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA20_StaticMeshComponent0;               // 0x0A10 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardC_thinner_17_StaticMeshComponent0;      // 0x0A18 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardC_thinner27_StaticMeshComponent0;       // 0x0A20 (size: 0x8)
    class UStaticMeshComponent* sg_fillerBoard_RoundedWindowsOnlyTwo2_StaticMeshComponent0; // 0x0A28 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardC_thinner26_StaticMeshComponent0;       // 0x0A30 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA19_StaticMeshComponent0;               // 0x0A38 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardC_thinner_14_StaticMeshComponent0;      // 0x0A40 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardC_thinner25_StaticMeshComponent0;       // 0x0A48 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA18_StaticMeshComponent0;               // 0x0A50 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA17_StaticMeshComponent0;               // 0x0A58 (size: 0x8)
    class UStaticMeshComponent* sg_fillerBoardB4_StaticMeshComponent0;                // 0x0A60 (size: 0x8)
    class UStaticMeshComponent* sg_fillerBoardB3_StaticMeshComponent0;                // 0x0A68 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m37_StaticMeshComponent0;                 // 0x0A70 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m36_StaticMeshComponent0;                 // 0x0A78 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m35_StaticMeshComponent0;                 // 0x0A80 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m34_StaticMeshComponent0;                 // 0x0A88 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m33_StaticMeshComponent0;                 // 0x0A90 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m32_StaticMeshComponent0;                 // 0x0A98 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m31_StaticMeshComponent0;                 // 0x0AA0 (size: 0x8)
    class UStaticMeshComponent* doorHeadA_angled2_StaticMeshComponent0;               // 0x0AA8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long28_StaticMeshComponent0;         // 0x0AB0 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_38_StaticMeshComponent0; // 0x0AB8 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_37_StaticMeshComponent0; // 0x0AC0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long27_StaticMeshComponent0;         // 0x0AC8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long26_StaticMeshComponent0;         // 0x0AD0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long25_StaticMeshComponent0;         // 0x0AD8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long24_StaticMeshComponent0;         // 0x0AE0 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_36_StaticMeshComponent0; // 0x0AE8 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_35_StaticMeshComponent0; // 0x0AF0 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_34_StaticMeshComponent0; // 0x0AF8 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_33_StaticMeshComponent0; // 0x0B00 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_32_StaticMeshComponent0; // 0x0B08 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_31_StaticMeshComponent0; // 0x0B10 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_30_StaticMeshComponent0; // 0x0B18 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_29_StaticMeshComponent0; // 0x0B20 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_28_StaticMeshComponent0; // 0x0B28 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long23_StaticMeshComponent0;         // 0x0B30 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long22_StaticMeshComponent0;         // 0x0B38 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long21_StaticMeshComponent0;         // 0x0B40 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long20_StaticMeshComponent0;         // 0x0B48 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long19_StaticMeshComponent0;         // 0x0B50 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long18_StaticMeshComponent0;         // 0x0B58 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long17_StaticMeshComponent0;         // 0x0B60 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long15_StaticMeshComponent0;         // 0x0B68 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardC_thinner47_StaticMeshComponent0;       // 0x0B70 (size: 0x8)
    class USceneComponent* Scene;                                                     // 0x0B78 (size: 0x8)
    class USceneComponent* Actor2_DefaultSceneRoot;                                   // 0x0B80 (size: 0x8)

}; // Size: 0xB88

#endif
