#ifndef UE4SS_SDK_C_SG_PithouseB_HPP
#define UE4SS_SDK_C_SG_PithouseB_HPP

class AC_SG_PithouseB_C : public AConstructionBP_C
{
    class UStaticMeshComponent* owidzThatch_small5_StaticMeshComponent0;              // 0x0550 (size: 0x8)
    class UStaticMeshComponent* owidzThatch_small4_StaticMeshComponent0;              // 0x0558 (size: 0x8)
    class UStaticMeshComponent* PlaneDenseBeveledB4_StaticMeshComponent0;             // 0x0560 (size: 0x8)
    class UStaticMeshComponent* PlaneDenseBeveledB3_StaticMeshComponent0;             // 0x0568 (size: 0x8)
    class UStaticMeshComponent* PlaneDenseCorner4_StaticMeshComponent0;               // 0x0570 (size: 0x8)
    class UStaticMeshComponent* PlaneDenseCorner3_StaticMeshComponent0;               // 0x0578 (size: 0x8)
    class UStaticMeshComponent* planeDenseTopBevel4_StaticMeshComponent0;             // 0x0580 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short63_StaticMeshComponent0;        // 0x0588 (size: 0x8)
    class UStaticMeshComponent* planeDenseTopBevel3_StaticMeshComponent0;             // 0x0590 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short62_StaticMeshComponent0;        // 0x0598 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short61_StaticMeshComponent0;        // 0x05A0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short60_StaticMeshComponent0;        // 0x05A8 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed56_StaticMeshComponent0;           // 0x05B0 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed55_StaticMeshComponent0;           // 0x05B8 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed54_StaticMeshComponent0;           // 0x05C0 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed53_StaticMeshComponent0;           // 0x05C8 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed52_StaticMeshComponent0;           // 0x05D0 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed51_StaticMeshComponent0;           // 0x05D8 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed50_StaticMeshComponent0;           // 0x05E0 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed49_StaticMeshComponent0;           // 0x05E8 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed48_StaticMeshComponent0;           // 0x05F0 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed47_StaticMeshComponent0;           // 0x05F8 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed46_StaticMeshComponent0;           // 0x0600 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed8_StaticMeshComponent0;            // 0x0608 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed7_StaticMeshComponent0;            // 0x0610 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed6_StaticMeshComponent0;            // 0x0618 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed5_StaticMeshComponent0;            // 0x0620 (size: 0x8)
    class UStaticMeshComponent* ropeKnotA6_StaticMeshComponent0;                      // 0x0628 (size: 0x8)
    class UStaticMeshComponent* ropeKnotA5_StaticMeshComponent0;                      // 0x0630 (size: 0x8)
    class USceneComponent* pithouse2_DefaultSceneRoot;                                // 0x0638 (size: 0x8)

}; // Size: 0x640

#endif
