#ifndef UE4SS_SDK_C_SG_tavern_main_Ubeam_HPP
#define UE4SS_SDK_C_SG_tavern_main_Ubeam_HPP

class AC_SG_tavern_main_Ubeam_C : public AConstructionBP_C
{
    class UStaticMeshComponent* UBeam_1_5_m55_StaticMeshComponent0;                   // 0x0550 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m56_StaticMeshComponent0;                   // 0x0558 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m57_StaticMeshComponent0;                   // 0x0560 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m58_StaticMeshComponent0;                   // 0x0568 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m59_StaticMeshComponent0;                   // 0x0570 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m60_StaticMeshComponent0;                   // 0x0578 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m61_StaticMeshComponent0;                   // 0x0580 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m62_StaticMeshComponent0;                   // 0x0588 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m4_StaticMeshComponent0;                       // 0x0590 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m5_StaticMeshComponent0;                       // 0x0598 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m6_StaticMeshComponent0;                       // 0x05A0 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_22_StaticMeshComponent0;               // 0x05A8 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_33_StaticMeshComponent0;               // 0x05B0 (size: 0x8)
    class UStaticMeshComponent* UBeam_Tapered_CutE_thiner17_StaticMeshComponent0;     // 0x05B8 (size: 0x8)
    class UStaticMeshComponent* UBeam_Tapered_CutE_thiner18_StaticMeshComponent0;     // 0x05C0 (size: 0x8)
    class UStaticMeshComponent* UBeam_Tapered_CutE_thiner19_StaticMeshComponent0;     // 0x05C8 (size: 0x8)
    class UStaticMeshComponent* UBeam_Tapered_CutE_thiner20_StaticMeshComponent0;     // 0x05D0 (size: 0x8)
    class UStaticMeshComponent* UBeam_Tapered_CutE_thiner21_StaticMeshComponent0;     // 0x05D8 (size: 0x8)
    class UStaticMeshComponent* UBeam_Tapered_CutE_thiner22_StaticMeshComponent0;     // 0x05E0 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_34_StaticMeshComponent0;               // 0x05E8 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m63_StaticMeshComponent0;                   // 0x05F0 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m64_StaticMeshComponent0;                   // 0x05F8 (size: 0x8)
    class UStaticMeshComponent* UBeam_DoorHeadA_StandardUnifiedMat3_StaticMeshComponent0; // 0x0600 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_35_StaticMeshComponent0;               // 0x0608 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m65_StaticMeshComponent0;                   // 0x0610 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m66_StaticMeshComponent0;                   // 0x0618 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m16_StaticMeshComponent0;                      // 0x0620 (size: 0x8)
    class UStaticMeshComponent* UBeam_Tapered_CutE_thiner23_StaticMeshComponent0;     // 0x0628 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m67_StaticMeshComponent0;                   // 0x0630 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m68_StaticMeshComponent0;                   // 0x0638 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m69_StaticMeshComponent0;                   // 0x0640 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m70_StaticMeshComponent0;                   // 0x0648 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m71_StaticMeshComponent0;                   // 0x0650 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m72_StaticMeshComponent0;                   // 0x0658 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m73_StaticMeshComponent0;                   // 0x0660 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m74_StaticMeshComponent0;                   // 0x0668 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m75_StaticMeshComponent0;                   // 0x0670 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m76_StaticMeshComponent0;                   // 0x0678 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m77_StaticMeshComponent0;                   // 0x0680 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m78_StaticMeshComponent0;                   // 0x0688 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m79_StaticMeshComponent0;                   // 0x0690 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m80_StaticMeshComponent0;                   // 0x0698 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m81_StaticMeshComponent0;                   // 0x06A0 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m82_StaticMeshComponent0;                   // 0x06A8 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m17_StaticMeshComponent0;                      // 0x06B0 (size: 0x8)
    class UStaticMeshComponent* UBeam_Tapered_CutE_thiner24_StaticMeshComponent0;     // 0x06B8 (size: 0x8)
    class UStaticMeshComponent* UBeam_Tapered_CutE_thiner25_StaticMeshComponent0;     // 0x06C0 (size: 0x8)
    class UStaticMeshComponent* UBeam_Tapered_CutE_thiner26_StaticMeshComponent0;     // 0x06C8 (size: 0x8)
    class UStaticMeshComponent* UBeam_Tapered_CutE_thiner27_StaticMeshComponent0;     // 0x06D0 (size: 0x8)
    class UStaticMeshComponent* UBeam_Tapered_CutE_thiner28_StaticMeshComponent0;     // 0x06D8 (size: 0x8)
    class UStaticMeshComponent* UBeam_Tapered_CutE_thiner29_StaticMeshComponent0;     // 0x06E0 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m83_StaticMeshComponent0;                   // 0x06E8 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m84_StaticMeshComponent0;                   // 0x06F0 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_36_StaticMeshComponent0;               // 0x06F8 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_37_StaticMeshComponent0;               // 0x0700 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m85_StaticMeshComponent0;                   // 0x0708 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m86_StaticMeshComponent0;                   // 0x0710 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m19_StaticMeshComponent0;                      // 0x0718 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m87_StaticMeshComponent0;                   // 0x0720 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m88_StaticMeshComponent0;                   // 0x0728 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m89_StaticMeshComponent0;                   // 0x0730 (size: 0x8)
    class UStaticMeshComponent* UBeam_DoorHeadA_StandardUnifiedMat4_StaticMeshComponent0; // 0x0738 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m90_StaticMeshComponent0;                   // 0x0740 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m91_StaticMeshComponent0;                   // 0x0748 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m92_StaticMeshComponent0;                   // 0x0750 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m93_StaticMeshComponent0;                   // 0x0758 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m94_StaticMeshComponent0;                   // 0x0760 (size: 0x8)
    class UStaticMeshComponent* UBeam_Tapered_CutE_thiner30_StaticMeshComponent0;     // 0x0768 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m95_StaticMeshComponent0;                   // 0x0770 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m96_StaticMeshComponent0;                   // 0x0778 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m97_StaticMeshComponent0;                   // 0x0780 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m98_StaticMeshComponent0;                   // 0x0788 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m99_StaticMeshComponent0;                   // 0x0790 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m100_StaticMeshComponent0;                  // 0x0798 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m101_StaticMeshComponent0;                  // 0x07A0 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m102_StaticMeshComponent0;                  // 0x07A8 (size: 0x8)
    class UStaticMeshComponent* UBeam_Tapered_CutE_thiner31_StaticMeshComponent0;     // 0x07B0 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_38_StaticMeshComponent0;               // 0x07B8 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_39_StaticMeshComponent0;               // 0x07C0 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_40_StaticMeshComponent0;               // 0x07C8 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_41_StaticMeshComponent0;               // 0x07D0 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_42_StaticMeshComponent0;               // 0x07D8 (size: 0x8)
    class UStaticMeshComponent* LevitatingOuthouse3_StaticMeshComponent0;             // 0x07E0 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m103_StaticMeshComponent0;                  // 0x07E8 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_43_StaticMeshComponent0;               // 0x07F0 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_44_StaticMeshComponent0;               // 0x07F8 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_45_StaticMeshComponent0;               // 0x0800 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_46_StaticMeshComponent0;               // 0x0808 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_47_StaticMeshComponent0;               // 0x0810 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_48_StaticMeshComponent0;               // 0x0818 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_49_StaticMeshComponent0;               // 0x0820 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_50_StaticMeshComponent0;               // 0x0828 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_51_StaticMeshComponent0;               // 0x0830 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_52_StaticMeshComponent0;               // 0x0838 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_53_StaticMeshComponent0;               // 0x0840 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_54_StaticMeshComponent0;               // 0x0848 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m104_StaticMeshComponent0;                  // 0x0850 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m105_StaticMeshComponent0;                  // 0x0858 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_55_StaticMeshComponent0;               // 0x0860 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_56_StaticMeshComponent0;               // 0x0868 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_57_StaticMeshComponent0;               // 0x0870 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m106_StaticMeshComponent0;                  // 0x0878 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m107_StaticMeshComponent0;                  // 0x0880 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_58_StaticMeshComponent0;               // 0x0888 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_59_StaticMeshComponent0;               // 0x0890 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_60_StaticMeshComponent0;               // 0x0898 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA13_StaticMeshComponent0;            // 0x08A0 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA14_StaticMeshComponent0;            // 0x08A8 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA15_StaticMeshComponent0;            // 0x08B0 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA16_StaticMeshComponent0;            // 0x08B8 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m108_StaticMeshComponent0;                  // 0x08C0 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg67_StaticMeshComponent0;     // 0x08C8 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg68_StaticMeshComponent0;     // 0x08D0 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg69_StaticMeshComponent0;     // 0x08D8 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg70_StaticMeshComponent0;     // 0x08E0 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg71_StaticMeshComponent0;     // 0x08E8 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg72_StaticMeshComponent0;     // 0x08F0 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg73_StaticMeshComponent0;     // 0x08F8 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg74_StaticMeshComponent0;     // 0x0900 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg75_StaticMeshComponent0;     // 0x0908 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg76_StaticMeshComponent0;     // 0x0910 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg77_StaticMeshComponent0;     // 0x0918 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg78_StaticMeshComponent0;     // 0x0920 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg79_StaticMeshComponent0;     // 0x0928 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg80_StaticMeshComponent0;     // 0x0930 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg81_StaticMeshComponent0;     // 0x0938 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg82_StaticMeshComponent0;     // 0x0940 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg83_StaticMeshComponent0;     // 0x0948 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg84_StaticMeshComponent0;     // 0x0950 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg85_StaticMeshComponent0;     // 0x0958 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg86_StaticMeshComponent0;     // 0x0960 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg87_StaticMeshComponent0;     // 0x0968 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg88_StaticMeshComponent0;     // 0x0970 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg89_StaticMeshComponent0;     // 0x0978 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg90_StaticMeshComponent0;     // 0x0980 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg91_StaticMeshComponent0;     // 0x0988 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg92_StaticMeshComponent0;     // 0x0990 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg93_StaticMeshComponent0;     // 0x0998 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg94_StaticMeshComponent0;     // 0x09A0 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg95_StaticMeshComponent0;     // 0x09A8 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg96_StaticMeshComponent0;     // 0x09B0 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg97_StaticMeshComponent0;     // 0x09B8 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg98_StaticMeshComponent0;     // 0x09C0 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg99_StaticMeshComponent0;     // 0x09C8 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg100_StaticMeshComponent0;    // 0x09D0 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg101_StaticMeshComponent0;    // 0x09D8 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg102_StaticMeshComponent0;    // 0x09E0 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg103_StaticMeshComponent0;    // 0x09E8 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg104_StaticMeshComponent0;    // 0x09F0 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg105_StaticMeshComponent0;    // 0x09F8 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg106_StaticMeshComponent0;    // 0x0A00 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg107_StaticMeshComponent0;    // 0x0A08 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg108_StaticMeshComponent0;    // 0x0A10 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg109_StaticMeshComponent0;    // 0x0A18 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg110_StaticMeshComponent0;    // 0x0A20 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg111_StaticMeshComponent0;    // 0x0A28 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg112_StaticMeshComponent0;    // 0x0A30 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg113_StaticMeshComponent0;    // 0x0A38 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg114_StaticMeshComponent0;    // 0x0A40 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg115_StaticMeshComponent0;    // 0x0A48 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg116_StaticMeshComponent0;    // 0x0A50 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg117_StaticMeshComponent0;    // 0x0A58 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg118_StaticMeshComponent0;    // 0x0A60 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg119_StaticMeshComponent0;    // 0x0A68 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Slit9_StaticMeshComponent0;                // 0x0A70 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Slit10_StaticMeshComponent0;               // 0x0A78 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Slit11_StaticMeshComponent0;               // 0x0A80 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Slit12_StaticMeshComponent0;               // 0x0A88 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Slit13_StaticMeshComponent0;               // 0x0A90 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Slit14_StaticMeshComponent0;               // 0x0A98 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Corner3_StaticMeshComponent0;              // 0x0AA0 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Corner4_StaticMeshComponent0;              // 0x0AA8 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Slit15_StaticMeshComponent0;               // 0x0AB0 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_SingleWindowWidePaddedLeft8_StaticMeshComponent0; // 0x0AB8 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_SingleWindowWidePaddedLeft10_StaticMeshComponent0; // 0x0AC0 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_SingleWindowWidePaddedLeft11_StaticMeshComponent0; // 0x0AC8 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_SingleWindowWidePaddedLeft12_StaticMeshComponent0; // 0x0AD0 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_SingleWindowWidePaddedLeft13_StaticMeshComponent0; // 0x0AD8 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_SingleWindowWidePaddedLeft14_StaticMeshComponent0; // 0x0AE0 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_SingleWindowWidePaddedLeft15_StaticMeshComponent0; // 0x0AE8 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_SingleWindowWidePaddedLeft16_StaticMeshComponent0; // 0x0AF0 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA_Balcony30_StaticMeshComponent0;    // 0x0AF8 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA_Balcony31_StaticMeshComponent0;    // 0x0B00 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA_Balcony32_StaticMeshComponent0;    // 0x0B08 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA_Balcony33_StaticMeshComponent0;    // 0x0B10 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA_Balcony34_StaticMeshComponent0;    // 0x0B18 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA_Balcony35_StaticMeshComponent0;    // 0x0B20 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA_Balcony36_StaticMeshComponent0;    // 0x0B28 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA_Balcony37_StaticMeshComponent0;    // 0x0B30 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA_Balcony38_StaticMeshComponent0;    // 0x0B38 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA_Balcony39_StaticMeshComponent0;    // 0x0B40 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA_Balcony40_StaticMeshComponent0;    // 0x0B48 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA_Balcony41_StaticMeshComponent0;    // 0x0B50 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA_Balcony42_StaticMeshComponent0;    // 0x0B58 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA_Balcony43_StaticMeshComponent0;    // 0x0B60 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA_Balcony44_StaticMeshComponent0;    // 0x0B68 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA_Balcony45_StaticMeshComponent0;    // 0x0B70 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA_Balcony46_StaticMeshComponent0;    // 0x0B78 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA_Balcony47_StaticMeshComponent0;    // 0x0B80 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA_Balcony48_StaticMeshComponent0;    // 0x0B88 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA_Balcony49_StaticMeshComponent0;    // 0x0B90 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA_Balcony50_StaticMeshComponent0;    // 0x0B98 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA17_StaticMeshComponent0;            // 0x0BA0 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA18_StaticMeshComponent0;            // 0x0BA8 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA19_StaticMeshComponent0;            // 0x0BB0 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA_Balcony51_StaticMeshComponent0;    // 0x0BB8 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA_Balcony52_StaticMeshComponent0;    // 0x0BC0 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA_Balcony53_StaticMeshComponent0;    // 0x0BC8 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA_Balcony54_StaticMeshComponent0;    // 0x0BD0 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA_Balcony55_StaticMeshComponent0;    // 0x0BD8 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_61_StaticMeshComponent0;               // 0x0BE0 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_62_StaticMeshComponent0;               // 0x0BE8 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_63_StaticMeshComponent0;               // 0x0BF0 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_64_StaticMeshComponent0;               // 0x0BF8 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg120_StaticMeshComponent0;    // 0x0C00 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg121_StaticMeshComponent0;    // 0x0C08 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg122_StaticMeshComponent0;    // 0x0C10 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg123_StaticMeshComponent0;    // 0x0C18 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg124_StaticMeshComponent0;    // 0x0C20 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg125_StaticMeshComponent0;    // 0x0C28 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg126_StaticMeshComponent0;    // 0x0C30 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg127_StaticMeshComponent0;    // 0x0C38 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg128_StaticMeshComponent0;    // 0x0C40 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg129_StaticMeshComponent0;    // 0x0C48 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg130_StaticMeshComponent0;    // 0x0C50 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA_Balcony56_StaticMeshComponent0;    // 0x0C58 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA_Balcony57_StaticMeshComponent0;    // 0x0C60 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA_Ridge31_StaticMeshComponent0;      // 0x0C68 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA_Ridge32_StaticMeshComponent0;      // 0x0C70 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA_Balcony58_StaticMeshComponent0;    // 0x0C78 (size: 0x8)
    class UStaticMeshComponent* UBeam_Tapered_CutE_thiner32_StaticMeshComponent0;     // 0x0C80 (size: 0x8)
    class UStaticMeshComponent* UBeam_WindowFrame2_StaticMeshComponent0;              // 0x0C88 (size: 0x8)
    class UStaticMeshComponent* UBeam_WindowFrame14_StaticMeshComponent0;             // 0x0C90 (size: 0x8)
    class UStaticMeshComponent* UBeam_WindowFrame15_StaticMeshComponent0;             // 0x0C98 (size: 0x8)
    class UStaticMeshComponent* UBeam_WindowFrame16_StaticMeshComponent0;             // 0x0CA0 (size: 0x8)
    class UStaticMeshComponent* UBeam_WindowFrame17_StaticMeshComponent0;             // 0x0CA8 (size: 0x8)
    class UStaticMeshComponent* UBeam_WindowFrame18_StaticMeshComponent0;             // 0x0CB0 (size: 0x8)
    class UStaticMeshComponent* UBeam_WindowFrame19_StaticMeshComponent0;             // 0x0CB8 (size: 0x8)
    class UStaticMeshComponent* UBeam_WindowFrame20_StaticMeshComponent0;             // 0x0CC0 (size: 0x8)
    class UStaticMeshComponent* UBeam_WindowFrame21_StaticMeshComponent0;             // 0x0CC8 (size: 0x8)
    class UStaticMeshComponent* UBeam_WindowFrame22_StaticMeshComponent0;             // 0x0CD0 (size: 0x8)
    class UStaticMeshComponent* WattleOwidzTriangle5_StaticMeshComponent0;            // 0x0CD8 (size: 0x8)
    class UStaticMeshComponent* WattleOwidzTriangle6_StaticMeshComponent0;            // 0x0CE0 (size: 0x8)
    class UStaticMeshComponent* Cube3_StaticMeshComponent0;                           // 0x0CE8 (size: 0x8)
    class UStaticMeshComponent* Cube4_StaticMeshComponent0;                           // 0x0CF0 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA20_StaticMeshComponent0;            // 0x0CF8 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA21_StaticMeshComponent0;            // 0x0D00 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA22_StaticMeshComponent0;            // 0x0D08 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA23_StaticMeshComponent0;            // 0x0D10 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA24_StaticMeshComponent0;            // 0x0D18 (size: 0x8)
    class UStaticMeshComponent* Foundation_tavern_main2_StaticMeshComponent0;         // 0x0D20 (size: 0x8)
    class UStaticMeshComponent* UBeam_Shutter2_StaticMeshComponent0;                  // 0x0D28 (size: 0x8)
    class UStaticMeshComponent* Painted_Window_Rectangle_Red16_StaticMeshComponent0;  // 0x0D30 (size: 0x8)
    class UStaticMeshComponent* Painted_Window_Rectangle_Red17_StaticMeshComponent0;  // 0x0D38 (size: 0x8)
    class UStaticMeshComponent* Roof_C_SG_Tavern_Main_Ubeam2_StaticMeshComponent0;    // 0x0D40 (size: 0x8)
    class UStaticMeshComponent* Painted_Window_Rectangle_Red18_StaticMeshComponent0;  // 0x0D48 (size: 0x8)
    class UStaticMeshComponent* Painted_Window_Rectangle_Red19_StaticMeshComponent0;  // 0x0D50 (size: 0x8)
    class UStaticMeshComponent* Painted_Window_Rectangle_Red20_StaticMeshComponent0;  // 0x0D58 (size: 0x8)
    class UStaticMeshComponent* Painted_Window_Rectangle_Red21_StaticMeshComponent0;  // 0x0D60 (size: 0x8)
    class UStaticMeshComponent* UBeam_WindowFrameArch4_StaticMeshComponent0;          // 0x0D68 (size: 0x8)
    class UStaticMeshComponent* UBeam_WindowFrameArch5_StaticMeshComponent0;          // 0x0D70 (size: 0x8)
    class UStaticMeshComponent* UBeam_WindowFrameArch6_StaticMeshComponent0;          // 0x0D78 (size: 0x8)
    class UStaticMeshComponent* Painted_Window_Rectangle_Red22_StaticMeshComponent0;  // 0x0D80 (size: 0x8)
    class UStaticMeshComponent* Painted_Window_Rectangle_Red23_StaticMeshComponent0;  // 0x0D88 (size: 0x8)
    class UStaticMeshComponent* Painted_Window_Rectangle_Red24_StaticMeshComponent0;  // 0x0D90 (size: 0x8)
    class UStaticMeshComponent* Painted_Window_Rectangle_Red25_StaticMeshComponent0;  // 0x0D98 (size: 0x8)
    class UStaticMeshComponent* Painted_Window_Rectangle_Red26_StaticMeshComponent0;  // 0x0DA0 (size: 0x8)
    class UStaticMeshComponent* Painted_Window_Rectangle_Red27_StaticMeshComponent0;  // 0x0DA8 (size: 0x8)
    class UStaticMeshComponent* Painted_Window_Rectangle_Red28_StaticMeshComponent0;  // 0x0DB0 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg131_StaticMeshComponent0;    // 0x0DB8 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg132_StaticMeshComponent0;    // 0x0DC0 (size: 0x8)
    class USceneComponent* C_SG_tavern_main_Ubeam_DefaultSceneRoot;                   // 0x0DC8 (size: 0x8)

}; // Size: 0xDD0

#endif
