#ifndef UE4SS_SDK_C_SG_StoneWell_HPP
#define UE4SS_SDK_C_SG_StoneWell_HPP

class AC_SG_StoneWell_C : public AConstructionBP_C
{
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg40_StaticMeshComponent0;     // 0x0550 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg39_StaticMeshComponent0;     // 0x0558 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg38_StaticMeshComponent0;     // 0x0560 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg37_StaticMeshComponent0;     // 0x0568 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg36_StaticMeshComponent0;     // 0x0570 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg35_StaticMeshComponent0;     // 0x0578 (size: 0x8)
    class UStaticMeshComponent* SG_pulley2_StaticMeshComponent0;                      // 0x0580 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg34_StaticMeshComponent0;     // 0x0588 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg33_StaticMeshComponent0;     // 0x0590 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg32_StaticMeshComponent0;     // 0x0598 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg31_StaticMeshComponent0;     // 0x05A0 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg30_StaticMeshComponent0;     // 0x05A8 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg29_StaticMeshComponent0;     // 0x05B0 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg28_StaticMeshComponent0;     // 0x05B8 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg27_StaticMeshComponent0;     // 0x05C0 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg26_StaticMeshComponent0;     // 0x05C8 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg25_StaticMeshComponent0;     // 0x05D0 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg24_StaticMeshComponent0;     // 0x05D8 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg23_StaticMeshComponent0;     // 0x05E0 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg22_StaticMeshComponent0;     // 0x05E8 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg21_StaticMeshComponent0;     // 0x05F0 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m34_StaticMeshComponent0;                      // 0x05F8 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m33_StaticMeshComponent0;                      // 0x0600 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_19_StaticMeshComponent0;               // 0x0608 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_18_StaticMeshComponent0;               // 0x0610 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_17_StaticMeshComponent0;               // 0x0618 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_16_StaticMeshComponent0;               // 0x0620 (size: 0x8)
    class UStaticMeshComponent* roofSingleDisplaced_cutdownTiny4_StaticMeshComponent0; // 0x0628 (size: 0x8)
    class UStaticMeshComponent* roofSingleDisplaced_cutdownTiny3_StaticMeshComponent0; // 0x0630 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m32_StaticMeshComponent0;                      // 0x0638 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_15_StaticMeshComponent0;               // 0x0640 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_14_StaticMeshComponent0;               // 0x0648 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_13_StaticMeshComponent0;               // 0x0650 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_12_StaticMeshComponent0;               // 0x0658 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m31_StaticMeshComponent0;                      // 0x0660 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m30_StaticMeshComponent0;                      // 0x0668 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m29_StaticMeshComponent0;                      // 0x0670 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m28_StaticMeshComponent0;                      // 0x0678 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m27_StaticMeshComponent0;                      // 0x0680 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m26_StaticMeshComponent0;                      // 0x0688 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m25_StaticMeshComponent0;                      // 0x0690 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m24_StaticMeshComponent0;                      // 0x0698 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m23_StaticMeshComponent0;                      // 0x06A0 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m22_StaticMeshComponent0;                      // 0x06A8 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m21_StaticMeshComponent0;                      // 0x06B0 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m20_StaticMeshComponent0;                      // 0x06B8 (size: 0x8)
    class UStaticMeshComponent* SG_stoneWellBottom2_StaticMeshComponent0;             // 0x06C0 (size: 0x8)
    class UStaticMeshComponent* SG_stoneWellCore2_StaticMeshComponent0;               // 0x06C8 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m19_StaticMeshComponent0;                      // 0x06D0 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m18_StaticMeshComponent0;                      // 0x06D8 (size: 0x8)
    class USceneComponent* SG_stoneWell2_DefaultSceneRoot;                            // 0x06E0 (size: 0x8)

}; // Size: 0x6E8

#endif
