#ifndef UE4SS_SDK_C_TatteredTentA_HPP
#define UE4SS_SDK_C_TatteredTentA_HPP

class AC_TatteredTentA_C : public AConstructionBP_C
{
    class UStaticMeshComponent* tentsAllCentered_Object004_StaticMeshComponent0;      // 0x0550 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed_long206_StaticMeshComponent0;     // 0x0558 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed_long207_StaticMeshComponent0;     // 0x0560 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed_long209_StaticMeshComponent0;     // 0x0568 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed_long210_StaticMeshComponent0;     // 0x0570 (size: 0x8)
    class UStaticMeshComponent* SM_Rope39_StaticMeshComponent0;                       // 0x0578 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed_long208_StaticMeshComponent0;     // 0x0580 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly_StaticMeshComponent0;      // 0x0588 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly2_StaticMeshComponent0;     // 0x0590 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly3_StaticMeshComponent0;     // 0x0598 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed_long204_StaticMeshComponent0;     // 0x05A0 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed_long205_StaticMeshComponent0;     // 0x05A8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly4_StaticMeshComponent0;     // 0x05B0 (size: 0x8)

}; // Size: 0x5B8

#endif
