#ifndef UE4SS_SDK_c_townhouseWideA_HPP
#define UE4SS_SDK_c_townhouseWideA_HPP

class Ac_townhouseWideA_C : public AConstructionBP_C
{
    class UStaticMeshComponent* All_Aboard_pivot_long607_StaticMeshComponent0;        // 0x0550 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long606_StaticMeshComponent0;        // 0x0558 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long605_StaticMeshComponent0;        // 0x0560 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long604_StaticMeshComponent0;        // 0x0568 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long603_StaticMeshComponent0;        // 0x0570 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long602_StaticMeshComponent0;        // 0x0578 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long601_StaticMeshComponent0;        // 0x0580 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long600_StaticMeshComponent0;        // 0x0588 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long599_StaticMeshComponent0;        // 0x0590 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long598_StaticMeshComponent0;        // 0x0598 (size: 0x8)
    class UStaticMeshComponent* TudorWallHigh88_StaticMeshComponent0;                 // 0x05A0 (size: 0x8)
    class UStaticMeshComponent* TudorWallHigh87_StaticMeshComponent0;                 // 0x05A8 (size: 0x8)
    class UStaticMeshComponent* TudorWallHigh86_StaticMeshComponent0;                 // 0x05B0 (size: 0x8)
    class UStaticMeshComponent* Aset_castle_wall_L_sebgb_LOD54_StaticMeshComponent0;  // 0x05B8 (size: 0x8)
    class UStaticMeshComponent* Aset_castle_wall_L_sebgb_LOD53_StaticMeshComponent0;  // 0x05C0 (size: 0x8)
    class UStaticMeshComponent* Aset_castle_wall_L_sebgb_LOD52_StaticMeshComponent0;  // 0x05C8 (size: 0x8)
    class UStaticMeshComponent* Aset_castle_wall_L_sebgb_LOD51_StaticMeshComponent0;  // 0x05D0 (size: 0x8)
    class UStaticMeshComponent* Aset_castle_wall_L_sebgb_LOD50_StaticMeshComponent0;  // 0x05D8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long597_StaticMeshComponent0;        // 0x05E0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long596_StaticMeshComponent0;        // 0x05E8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long595_StaticMeshComponent0;        // 0x05F0 (size: 0x8)
    class UStaticMeshComponent* Aset_castle_wall_L_sebgb_LOD49_StaticMeshComponent0;  // 0x05F8 (size: 0x8)
    class UStaticMeshComponent* Aset_castle_wall_L_sebgb_LOD48_StaticMeshComponent0;  // 0x0600 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long594_StaticMeshComponent0;        // 0x0608 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long593_StaticMeshComponent0;        // 0x0610 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long592_StaticMeshComponent0;        // 0x0618 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long591_StaticMeshComponent0;        // 0x0620 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long590_StaticMeshComponent0;        // 0x0628 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long589_StaticMeshComponent0;        // 0x0630 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long588_StaticMeshComponent0;        // 0x0638 (size: 0x8)
    class UStaticMeshComponent* TudorWallHigh85_StaticMeshComponent0;                 // 0x0640 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long587_StaticMeshComponent0;        // 0x0648 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long586_StaticMeshComponent0;        // 0x0650 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long585_StaticMeshComponent0;        // 0x0658 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long584_StaticMeshComponent0;        // 0x0660 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long583_StaticMeshComponent0;        // 0x0668 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long582_StaticMeshComponent0;        // 0x0670 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long581_StaticMeshComponent0;        // 0x0678 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long580_StaticMeshComponent0;        // 0x0680 (size: 0x8)
    class UStaticMeshComponent* TudorWallHigh84_StaticMeshComponent0;                 // 0x0688 (size: 0x8)
    class UStaticMeshComponent* TudorWallHigh44_StaticMeshComponent0;                 // 0x0690 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long579_StaticMeshComponent0;        // 0x0698 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long578_StaticMeshComponent0;        // 0x06A0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long577_StaticMeshComponent0;        // 0x06A8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long576_StaticMeshComponent0;        // 0x06B0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long575_StaticMeshComponent0;        // 0x06B8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long574_StaticMeshComponent0;        // 0x06C0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long573_StaticMeshComponent0;        // 0x06C8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long572_StaticMeshComponent0;        // 0x06D0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long571_StaticMeshComponent0;        // 0x06D8 (size: 0x8)
    class UStaticMeshComponent* TudorWallHigh43_StaticMeshComponent0;                 // 0x06E0 (size: 0x8)
    class UStaticMeshComponent* TudorWallHigh42_StaticMeshComponent0;                 // 0x06E8 (size: 0x8)
    class UStaticMeshComponent* TudorWallHigh41_StaticMeshComponent0;                 // 0x06F0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long570_StaticMeshComponent0;        // 0x06F8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long569_StaticMeshComponent0;        // 0x0700 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long568_StaticMeshComponent0;        // 0x0708 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long567_StaticMeshComponent0;        // 0x0710 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long566_StaticMeshComponent0;        // 0x0718 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long565_StaticMeshComponent0;        // 0x0720 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long564_StaticMeshComponent0;        // 0x0728 (size: 0x8)
    class UStaticMeshComponent* TudorWallHigh40_StaticMeshComponent0;                 // 0x0730 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long563_StaticMeshComponent0;        // 0x0738 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long562_StaticMeshComponent0;        // 0x0740 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long561_StaticMeshComponent0;        // 0x0748 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long560_StaticMeshComponent0;        // 0x0750 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long559_StaticMeshComponent0;        // 0x0758 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long558_StaticMeshComponent0;        // 0x0760 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long557_StaticMeshComponent0;        // 0x0768 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long556_StaticMeshComponent0;        // 0x0770 (size: 0x8)
    class UStaticMeshComponent* TudorWallHigh39_StaticMeshComponent0;                 // 0x0778 (size: 0x8)
    class UStaticMeshComponent* TudorWallHigh38_StaticMeshComponent0;                 // 0x0780 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long555_StaticMeshComponent0;        // 0x0788 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long554_StaticMeshComponent0;        // 0x0790 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long553_StaticMeshComponent0;        // 0x0798 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long552_StaticMeshComponent0;        // 0x07A0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long551_StaticMeshComponent0;        // 0x07A8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long550_StaticMeshComponent0;        // 0x07B0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long549_StaticMeshComponent0;        // 0x07B8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long548_StaticMeshComponent0;        // 0x07C0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long278_StaticMeshComponent0;        // 0x07C8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long546_StaticMeshComponent0;        // 0x07D0 (size: 0x8)
    class UStaticMeshComponent* TudorWallHigh37_StaticMeshComponent0;                 // 0x07D8 (size: 0x8)
    class UStaticMeshComponent* TudorWallHigh36_StaticMeshComponent0;                 // 0x07E0 (size: 0x8)
    class UStaticMeshComponent* TudorWallHigh35_StaticMeshComponent0;                 // 0x07E8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long545_StaticMeshComponent0;        // 0x07F0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long544_StaticMeshComponent0;        // 0x07F8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long543_StaticMeshComponent0;        // 0x0800 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long542_StaticMeshComponent0;        // 0x0808 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long541_StaticMeshComponent0;        // 0x0810 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long540_StaticMeshComponent0;        // 0x0818 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long539_StaticMeshComponent0;        // 0x0820 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long538_StaticMeshComponent0;        // 0x0828 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long537_StaticMeshComponent0;        // 0x0830 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long536_StaticMeshComponent0;        // 0x0838 (size: 0x8)
    class UStaticMeshComponent* townbuilding_window20_StaticMeshComponent0;           // 0x0840 (size: 0x8)
    class UStaticMeshComponent* townbuilding_window19_StaticMeshComponent0;           // 0x0848 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long535_StaticMeshComponent0;        // 0x0850 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long534_StaticMeshComponent0;        // 0x0858 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long533_StaticMeshComponent0;        // 0x0860 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long532_StaticMeshComponent0;        // 0x0868 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long531_StaticMeshComponent0;        // 0x0870 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long530_StaticMeshComponent0;        // 0x0878 (size: 0x8)
    class UStaticMeshComponent* TudorWallHigh34_StaticMeshComponent0;                 // 0x0880 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long529_StaticMeshComponent0;        // 0x0888 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long528_StaticMeshComponent0;        // 0x0890 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long527_StaticMeshComponent0;        // 0x0898 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long526_StaticMeshComponent0;        // 0x08A0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long525_StaticMeshComponent0;        // 0x08A8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long524_StaticMeshComponent0;        // 0x08B0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long523_StaticMeshComponent0;        // 0x08B8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long522_StaticMeshComponent0;        // 0x08C0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long521_StaticMeshComponent0;        // 0x08C8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long520_StaticMeshComponent0;        // 0x08D0 (size: 0x8)
    class UStaticMeshComponent* TudorWallHigh33_StaticMeshComponent0;                 // 0x08D8 (size: 0x8)
    class UStaticMeshComponent* TudorWallHigh32_StaticMeshComponent0;                 // 0x08E0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long519_StaticMeshComponent0;        // 0x08E8 (size: 0x8)
    class UStaticMeshComponent* townbuilding_decorA11_StaticMeshComponent0;           // 0x08F0 (size: 0x8)
    class UStaticMeshComponent* woodenPillarBend45_StaticMeshComponent0;              // 0x08F8 (size: 0x8)
    class UStaticMeshComponent* woodenPillarBend44_StaticMeshComponent0;              // 0x0900 (size: 0x8)
    class UStaticMeshComponent* woodenPillarBend43_StaticMeshComponent0;              // 0x0908 (size: 0x8)
    class UStaticMeshComponent* woodenPillarBend21_StaticMeshComponent0;              // 0x0910 (size: 0x8)
    class UStaticMeshComponent* woodenPillarBend20_StaticMeshComponent0;              // 0x0918 (size: 0x8)
    class UStaticMeshComponent* woodenPillarBend19_StaticMeshComponent0;              // 0x0920 (size: 0x8)
    class UStaticMeshComponent* woodenPillarBend18_StaticMeshComponent0;              // 0x0928 (size: 0x8)
    class UStaticMeshComponent* woodenPillarBend17_StaticMeshComponent0;              // 0x0930 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long518_StaticMeshComponent0;        // 0x0938 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long517_StaticMeshComponent0;        // 0x0940 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long516_StaticMeshComponent0;        // 0x0948 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long515_StaticMeshComponent0;        // 0x0950 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long514_StaticMeshComponent0;        // 0x0958 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long513_StaticMeshComponent0;        // 0x0960 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long302_StaticMeshComponent0;        // 0x0968 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long301_StaticMeshComponent0;        // 0x0970 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long300_StaticMeshComponent0;        // 0x0978 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long299_StaticMeshComponent0;        // 0x0980 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long298_StaticMeshComponent0;        // 0x0988 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long297_StaticMeshComponent0;        // 0x0990 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long296_StaticMeshComponent0;        // 0x0998 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long295_StaticMeshComponent0;        // 0x09A0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long294_StaticMeshComponent0;        // 0x09A8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long293_StaticMeshComponent0;        // 0x09B0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long292_StaticMeshComponent0;        // 0x09B8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long291_StaticMeshComponent0;        // 0x09C0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long290_StaticMeshComponent0;        // 0x09C8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long289_StaticMeshComponent0;        // 0x09D0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long288_StaticMeshComponent0;        // 0x09D8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long287_StaticMeshComponent0;        // 0x09E0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long286_StaticMeshComponent0;        // 0x09E8 (size: 0x8)
    class UStaticMeshComponent* townbuilding_decorA10_StaticMeshComponent0;           // 0x09F0 (size: 0x8)
    class UStaticMeshComponent* townbuilding_decorA9_StaticMeshComponent0;            // 0x09F8 (size: 0x8)
    class UStaticMeshComponent* townbuilding_decorA8_StaticMeshComponent0;            // 0x0A00 (size: 0x8)
    class UStaticMeshComponent* owidzDoorA_resym12_StaticMeshComponent0;              // 0x0A08 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long285_StaticMeshComponent0;        // 0x0A10 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long284_StaticMeshComponent0;        // 0x0A18 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long283_StaticMeshComponent0;        // 0x0A20 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long282_StaticMeshComponent0;        // 0x0A28 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long281_StaticMeshComponent0;        // 0x0A30 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long280_StaticMeshComponent0;        // 0x0A38 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long279_StaticMeshComponent0;        // 0x0A40 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long547_StaticMeshComponent0;        // 0x0A48 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long277_StaticMeshComponent0;        // 0x0A50 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long276_StaticMeshComponent0;        // 0x0A58 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long275_StaticMeshComponent0;        // 0x0A60 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long274_StaticMeshComponent0;        // 0x0A68 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long273_StaticMeshComponent0;        // 0x0A70 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long272_StaticMeshComponent0;        // 0x0A78 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long271_StaticMeshComponent0;        // 0x0A80 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long270_StaticMeshComponent0;        // 0x0A88 (size: 0x8)
    class UStaticMeshComponent* windowShutter11_StaticMeshComponent0;                 // 0x0A90 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long268_StaticMeshComponent0;        // 0x0A98 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long267_StaticMeshComponent0;        // 0x0AA0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long266_StaticMeshComponent0;        // 0x0AA8 (size: 0x8)
    class UStaticMeshComponent* townbuilding_window18_StaticMeshComponent0;           // 0x0AB0 (size: 0x8)
    class UStaticMeshComponent* windowShutter14_StaticMeshComponent0;                 // 0x0AB8 (size: 0x8)
    class UStaticMeshComponent* windowShutter13_StaticMeshComponent0;                 // 0x0AC0 (size: 0x8)
    class UStaticMeshComponent* windowShutter12_StaticMeshComponent0;                 // 0x0AC8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long269_StaticMeshComponent0;        // 0x0AD0 (size: 0x8)
    class UStaticMeshComponent* townbuilding_window17_StaticMeshComponent0;           // 0x0AD8 (size: 0x8)
    class UStaticMeshComponent* townbuilding_window16_StaticMeshComponent0;           // 0x0AE0 (size: 0x8)
    class UStaticMeshComponent* townbuilding_window15_StaticMeshComponent0;           // 0x0AE8 (size: 0x8)
    class UStaticMeshComponent* townbuilding_window14_StaticMeshComponent0;           // 0x0AF0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long265_StaticMeshComponent0;        // 0x0AF8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long264_StaticMeshComponent0;        // 0x0B00 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long263_StaticMeshComponent0;        // 0x0B08 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long262_StaticMeshComponent0;        // 0x0B10 (size: 0x8)
    class UStaticMeshComponent* Aset_castle_wall_L_sebgb_LOD46_StaticMeshComponent0;  // 0x0B18 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long260_StaticMeshComponent0;        // 0x0B20 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long259_StaticMeshComponent0;        // 0x0B28 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long258_StaticMeshComponent0;        // 0x0B30 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long257_StaticMeshComponent0;        // 0x0B38 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long256_StaticMeshComponent0;        // 0x0B40 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long255_StaticMeshComponent0;        // 0x0B48 (size: 0x8)
    class UStaticMeshComponent* Aset_castle_wall_L_sebgb_LOD47_StaticMeshComponent0;  // 0x0B50 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long261_StaticMeshComponent0;        // 0x0B58 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long254_StaticMeshComponent0;        // 0x0B60 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long253_StaticMeshComponent0;        // 0x0B68 (size: 0x8)
    class UStaticMeshComponent* TudorWallHigh31_StaticMeshComponent0;                 // 0x0B70 (size: 0x8)
    class UStaticMeshComponent* TudorWallHigh30_StaticMeshComponent0;                 // 0x0B78 (size: 0x8)
    class UStaticMeshComponent* TudorWallHigh29_StaticMeshComponent0;                 // 0x0B80 (size: 0x8)
    class UStaticMeshComponent* TudorWallHigh28_StaticMeshComponent0;                 // 0x0B88 (size: 0x8)
    class UStaticMeshComponent* TudorWallHigh27_StaticMeshComponent0;                 // 0x0B90 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long248_StaticMeshComponent0;        // 0x0B98 (size: 0x8)
    class UStaticMeshComponent* TudorWallHigh26_StaticMeshComponent0;                 // 0x0BA0 (size: 0x8)
    class UStaticMeshComponent* alphaThatchModule6_StaticMeshComponent0;              // 0x0BA8 (size: 0x8)
    class UStaticMeshComponent* alphaThatchModule5_StaticMeshComponent0;              // 0x0BB0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long252_StaticMeshComponent0;        // 0x0BB8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long251_StaticMeshComponent0;        // 0x0BC0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long250_StaticMeshComponent0;        // 0x0BC8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long249_StaticMeshComponent0;        // 0x0BD0 (size: 0x8)
    class UStaticMeshComponent* Aset_castle_wall_L_sebgb_LOD45_StaticMeshComponent0;  // 0x0BD8 (size: 0x8)
    class UStaticMeshComponent* groundGrassFlip93_StaticMeshComponent0;               // 0x0BE0 (size: 0x8)
    class UStaticMeshComponent* groundGrassFlip92_StaticMeshComponent0;               // 0x0BE8 (size: 0x8)
    class UStaticMeshComponent* groundGrassFlip91_StaticMeshComponent0;               // 0x0BF0 (size: 0x8)
    class UStaticMeshComponent* groundGrass126_StaticMeshComponent0;                  // 0x0BF8 (size: 0x8)
    class UStaticMeshComponent* groundGrassFlip90_StaticMeshComponent0;               // 0x0C00 (size: 0x8)
    class UStaticMeshComponent* groundGrassFlip89_StaticMeshComponent0;               // 0x0C08 (size: 0x8)
    class UStaticMeshComponent* groundGrass125_StaticMeshComponent0;                  // 0x0C10 (size: 0x8)
    class UStaticMeshComponent* groundGrassFlip88_StaticMeshComponent0;               // 0x0C18 (size: 0x8)
    class UStaticMeshComponent* groundGrassFlip87_StaticMeshComponent0;               // 0x0C20 (size: 0x8)
    class UStaticMeshComponent* Aset_castle_stairs_M_scCxt_LOD11_StaticMeshComponent0; // 0x0C28 (size: 0x8)
    class UStaticMeshComponent* groundGrassFlip86_StaticMeshComponent0;               // 0x0C30 (size: 0x8)
    class UStaticMeshComponent* groundGrassFlip85_StaticMeshComponent0;               // 0x0C38 (size: 0x8)
    class UStaticMeshComponent* groundGrass124_StaticMeshComponent0;                  // 0x0C40 (size: 0x8)
    class UStaticMeshComponent* groundGrassFlip84_StaticMeshComponent0;               // 0x0C48 (size: 0x8)
    class UStaticMeshComponent* groundGrass127_StaticMeshComponent0;                  // 0x0C50 (size: 0x8)
    class UStaticMeshComponent* groundGrassFlip75_StaticMeshComponent0;               // 0x0C58 (size: 0x8)
    class UStaticMeshComponent* groundGrass122_StaticMeshComponent0;                  // 0x0C60 (size: 0x8)
    class UStaticMeshComponent* owidzDoorA_resym13_StaticMeshComponent0;              // 0x0C68 (size: 0x8)
    class UStaticMeshComponent* townbuilding_window21_StaticMeshComponent0;           // 0x0C70 (size: 0x8)
    class UStaticMeshComponent* woodenPillarBend53_StaticMeshComponent0;              // 0x0C78 (size: 0x8)
    class UStaticMeshComponent* woodenPillarBend52_StaticMeshComponent0;              // 0x0C80 (size: 0x8)
    class UStaticMeshComponent* woodenPillarBend51_StaticMeshComponent0;              // 0x0C88 (size: 0x8)
    class UStaticMeshComponent* woodenPillarBend50_StaticMeshComponent0;              // 0x0C90 (size: 0x8)
    class UStaticMeshComponent* woodenPillarBend49_StaticMeshComponent0;              // 0x0C98 (size: 0x8)
    class UStaticMeshComponent* woodenPillarBend48_StaticMeshComponent0;              // 0x0CA0 (size: 0x8)
    class UStaticMeshComponent* woodenPillarBend47_StaticMeshComponent0;              // 0x0CA8 (size: 0x8)
    class UStaticMeshComponent* woodenPillarBend46_StaticMeshComponent0;              // 0x0CB0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long609_StaticMeshComponent0;        // 0x0CB8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long608_StaticMeshComponent0;        // 0x0CC0 (size: 0x8)
    class UStaticMeshComponent* groundGrass123_StaticMeshComponent0;                  // 0x0CC8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long610_StaticMeshComponent0;        // 0x0CD0 (size: 0x8)
    class UStaticMeshComponent* groundGrassFlip101_StaticMeshComponent0;              // 0x0CD8 (size: 0x8)
    class UStaticMeshComponent* groundGrassFlip100_StaticMeshComponent0;              // 0x0CE0 (size: 0x8)
    class UStaticMeshComponent* groundGrassFlip99_StaticMeshComponent0;               // 0x0CE8 (size: 0x8)
    class UStaticMeshComponent* groundGrassFlip98_StaticMeshComponent0;               // 0x0CF0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long611_StaticMeshComponent0;        // 0x0CF8 (size: 0x8)
    class UStaticMeshComponent* groundGrassFlip97_StaticMeshComponent0;               // 0x0D00 (size: 0x8)
    class UStaticMeshComponent* groundGrassFlip96_StaticMeshComponent0;               // 0x0D08 (size: 0x8)
    class UStaticMeshComponent* groundGrassFlip95_StaticMeshComponent0;               // 0x0D10 (size: 0x8)
    class UStaticMeshComponent* groundGrass128_StaticMeshComponent0;                  // 0x0D18 (size: 0x8)
    class UStaticMeshComponent* groundGrassFlip94_StaticMeshComponent0;               // 0x0D20 (size: 0x8)
    class UStaticMeshComponent* groundGrass129_StaticMeshComponent0;                  // 0x0D28 (size: 0x8)
    class USceneComponent* Scene;                                                     // 0x0D30 (size: 0x8)
    class USceneComponent* SharedRoot;                                                // 0x0D38 (size: 0x8)

}; // Size: 0xD40

#endif
