#ifndef UE4SS_SDK_CoatField_HPP
#define UE4SS_SDK_CoatField_HPP

struct FCoatField
{
    FLinearColor BG_tintA_32_0B41B29A4CBE1504FF3BF8B75098AAAB;                        // 0x0000 (size: 0x10)
    FLinearColor BG_tintB_33_532608A14C243E34E8FAEF84FEDC80CE;                        // 0x0010 (size: 0x10)
    FLinearColor fg_tintA_35_C59FD62D4D2E919216DEC2A6AD20B109;                        // 0x0020 (size: 0x10)
    FLinearColor fg_tintB_37_3375B60646163B3EEBDA9794A891A595;                        // 0x0030 (size: 0x10)
    class UTexture2D* BG_Texture_39_92368CF7469FF56B2C4E3EB4E37A8869;                 // 0x0040 (size: 0x8)
    class UTexture2D* FG_Texture_40_53D675D94E3C947DC876ADBFBA1B3457;                 // 0x0048 (size: 0x8)
    FVector2D originUV_A_18_8D50EE5948A3F7DFA12F1B80C6C16BD6;                         // 0x0050 (size: 0x10)
    FVector2D originUV_B_22_976AF1A540991DD3BE96EF80ABCF34CD;                         // 0x0060 (size: 0x10)
    FVector2D scaleUV_A_23_AD0641624EBE5E9EF1AA83A4C5A53FBA;                          // 0x0070 (size: 0x10)
    FVector2D scaleUV_B_24_9EAB8C7643D5D761611420B771595210;                          // 0x0080 (size: 0x10)
    FLinearColor maskChannel_30_5E24F3AF43D54962706296915E1BB179;                     // 0x0090 (size: 0x10)
    class UTexture2D* FG_Treatment_42_9BD2517441F11E0E2C2A1C8FF077D0C1;               // 0x00A0 (size: 0x8)
    int32 numSymbols_45_79CD0B8348ECFF8A754EF180A6E87C90;                             // 0x00A8 (size: 0x4)
    FVector2D additionalSymbolScale_48_53CCA1E846057F8A628ADCAF6D086F35;              // 0x00B0 (size: 0x10)
    FLinearColor treatmentColor_51_DE0E9AC54ECB2EC62D719F8E384E272F;                  // 0x00C0 (size: 0x10)
    float BG_Angle_54_E85942E24F1284767321B699E3F6E2CF;                               // 0x00D0 (size: 0x4)

}; // Size: 0xD4

#endif
