#ifndef UE4SS_SDK_MainUICPP_HPP
#define UE4SS_SDK_MainUICPP_HPP

class UMainUICPP_C : public UNaviGrid
{
    FPointerToUberGraphFrame UberGraphFrame;                                          // 0x0468 (size: 0x8)
    class UWidgetAnimation* hideLetterbox;                                            // 0x0470 (size: 0x8)
    class UWidgetAnimation* fadeTransition;                                           // 0x0478 (size: 0x8)
    class UWidgetAnimation* fadeIN_anim;                                              // 0x0480 (size: 0x8)
    class UWidgetAnimation* gameOver;                                                 // 0x0488 (size: 0x8)
    class UButton* Add;                                                               // 0x0490 (size: 0x8)
    class UaddSquadCard_C* addSquadCard;                                              // 0x0498 (size: 0x8)
    class UaddSquadCard_C* addSquadCard_1;                                            // 0x04A0 (size: 0x8)
    class UaddSquadCard_C* addSquadCard_2;                                            // 0x04A8 (size: 0x8)
    class UaddSquadCard_C* addSquadCard_3;                                            // 0x04B0 (size: 0x8)
    class UaddSquadCard_C* addSquadCard_4;                                            // 0x04B8 (size: 0x8)
    class UBorder* Army_Border;                                                       // 0x04C0 (size: 0x8)
    class UHorizontalBox* army_categories_HB_1;                                       // 0x04C8 (size: 0x8)
    class UScrollBox* army_scrollBox;                                                 // 0x04D0 (size: 0x8)
    class USizeBox* ArmySizeBox;                                                      // 0x04D8 (size: 0x8)
    class UHorizontalBox* ArmyWindow_HB;                                              // 0x04E0 (size: 0x8)
    class UCanvasPanel* big_panels;                                                   // 0x04E8 (size: 0x8)
    class UbuildingCardWidget_C* bm_clayFurnace;                                      // 0x04F0 (size: 0x8)
    class UTextBlock* boop_mode_txt;                                                  // 0x04F8 (size: 0x8)
    class UBorder* bottom_bar_border_1;                                               // 0x0500 (size: 0x8)
    class UButton* build_confirm;                                                     // 0x0508 (size: 0x8)
    class UHorizontalBox* build_confirm_hb;                                           // 0x0510 (size: 0x8)
    class UImage* buildConfirm_glow;                                                  // 0x0518 (size: 0x8)
    class UImage* buildConfirm_glow_1;                                                // 0x0520 (size: 0x8)
    class UImage* buildConfirmICon;                                                   // 0x0528 (size: 0x8)
    class UImage* buildConfirmIMinus;                                                 // 0x0530 (size: 0x8)
    class UImage* buildConfirmIPlus;                                                  // 0x0538 (size: 0x8)
    class UImage* buildConfirmIRotate;                                                // 0x0540 (size: 0x8)
    class UOverlay* building_categories_overlay;                                      // 0x0548 (size: 0x8)
    class UHorizontalBox* building_category_buttons_HB;                               // 0x0550 (size: 0x8)
    class UBorder* buildingCategories_border;                                         // 0x0558 (size: 0x8)
    class UHorizontalBox* buildingCategoriesHB;                                       // 0x0560 (size: 0x8)
    class UbuildingCategorySpacer_C* buildingCategorySpacer;                          // 0x0568 (size: 0x8)
    class UbuildingCategorySpacer_C* buildingCategorySpacer_1;                        // 0x0570 (size: 0x8)
    class UbuildingCategorySpacer_C* buildingCategorySpacer_2;                        // 0x0578 (size: 0x8)
    class UbuildingCategorySpacer_C* buildingCategorySpacer_3;                        // 0x0580 (size: 0x8)
    class UbuildingCategorySpacer_C* buildingCategorySpacer_4;                        // 0x0588 (size: 0x8)
    class UbuildingCategorySpacer_C* buildingCategorySpacer_7;                        // 0x0590 (size: 0x8)
    class UbuildingCategorySpacer_C* buildingCategorySpacer_11;                       // 0x0598 (size: 0x8)
    class UbuildingCategorySpacer_C* buildingCategorySpacer_12;                       // 0x05A0 (size: 0x8)
    class UbuildingCategorySpacer_C* buildingCategorySpacer_14;                       // 0x05A8 (size: 0x8)
    class UbuildingCategorySpacer_C* buildingCategorySpacer_16;                       // 0x05B0 (size: 0x8)
    class UbuildingCategorySpacer_C* buildingCategorySpacer_17;                       // 0x05B8 (size: 0x8)
    class UBorder* buildings_border;                                                  // 0x05C0 (size: 0x8)
    class UHorizontalBox* Buildings_HB;                                               // 0x05C8 (size: 0x8)
    class UbuildingCardWidget_C* buildingWidget;                                      // 0x05D0 (size: 0x8)
    class UbuildingCardWidget_C* buildingWidget_1;                                    // 0x05D8 (size: 0x8)
    class UbuildingCardWidget_C* buildingWidget_2;                                    // 0x05E0 (size: 0x8)
    class UbuildingCardWidget_C* buildingWidget_3;                                    // 0x05E8 (size: 0x8)
    class UbuildingCardWidget_C* buildingWidget_4;                                    // 0x05F0 (size: 0x8)
    class UbuildingCardWidget_C* buildingWidget_5;                                    // 0x05F8 (size: 0x8)
    class UbuildingCardWidget_C* buildingWidget_6;                                    // 0x0600 (size: 0x8)
    class UbuildingCardWidget_C* buildingWidget_7;                                    // 0x0608 (size: 0x8)
    class UbuildingCardWidget_C* buildingWidget_8;                                    // 0x0610 (size: 0x8)
    class UbuildingCardWidget_C* buildingWidget_9;                                    // 0x0618 (size: 0x8)
    class UbuildingCardWidget_C* buildingWidget_10;                                   // 0x0620 (size: 0x8)
    class UbuildingCardWidget_C* buildingWidget_11;                                   // 0x0628 (size: 0x8)
    class UbuildingCardWidget_C* buildingWidget_12;                                   // 0x0630 (size: 0x8)
    class UbuildingCardWidget_C* buildingWidget_13;                                   // 0x0638 (size: 0x8)
    class UbuildingCardWidget_C* buildingWidget_14;                                   // 0x0640 (size: 0x8)
    class UbuildingCardWidget_C* buildingWidget_15;                                   // 0x0648 (size: 0x8)
    class UbuildingCardWidget_C* buildingWidget_16;                                   // 0x0650 (size: 0x8)
    class UbuildingCardWidget_C* buildingWidget_17;                                   // 0x0658 (size: 0x8)
    class UbuildingCardWidget_C* buildingWidget_18;                                   // 0x0660 (size: 0x8)
    class UbuildingCardWidget_C* buildingWidget_19;                                   // 0x0668 (size: 0x8)
    class UbuildingCardWidget_C* buildingWidget_20;                                   // 0x0670 (size: 0x8)
    class UbuildingCardWidget_C* buildingWidget_21;                                   // 0x0678 (size: 0x8)
    class UbuildingCardWidget_C* buildingWidget_22;                                   // 0x0680 (size: 0x8)
    class UbuildingCardWidget_C* buildingWidget_24;                                   // 0x0688 (size: 0x8)
    class UbuildingCardWidget_C* buildingWidget_26;                                   // 0x0690 (size: 0x8)
    class UbuildingCardWidget_C* buildingWidget_27;                                   // 0x0698 (size: 0x8)
    class UbuildingCardWidget_C* buildingWidget_30;                                   // 0x06A0 (size: 0x8)
    class UbuildingCardWidget_C* buildingWidget_31;                                   // 0x06A8 (size: 0x8)
    class UbuildingCardWidget_C* buildingWidget_32;                                   // 0x06B0 (size: 0x8)
    class UbuildingCardWidget_C* buildingWidget_43;                                   // 0x06B8 (size: 0x8)
    class UbuildingCardWidget_C* buildingWidget_50;                                   // 0x06C0 (size: 0x8)
    class USizeBox* buildingWidgets_SizeBox;                                          // 0x06C8 (size: 0x8)
    class UbuildingCardWidget_C* BW_BaileyWall;                                       // 0x06D0 (size: 0x8)
    class UbuildingCardWidget_C* bw_granarySmall;                                     // 0x06D8 (size: 0x8)
    class UbuildingCardWidget_C* bw_hitchingPost;                                     // 0x06E0 (size: 0x8)
    class UbuildingCardWidget_C* BW_Manor_Gatehouse;                                  // 0x06E8 (size: 0x8)
    class UbuildingCardWidget_C* BW_Manor_Gatehouse_1;                                // 0x06F0 (size: 0x8)
    class UbuildingCardWidget_C* BW_Manor_Palace;                                     // 0x06F8 (size: 0x8)
    class UbuildingCardWidget_C* BW_Manor_Palace_1;                                   // 0x0700 (size: 0x8)
    class UbuildingCardWidget_C* bw_market;                                           // 0x0708 (size: 0x8)
    class UbuildingCardWidget_C* bw_stall;                                            // 0x0710 (size: 0x8)
    class UbuildingCardWidget_C* bw_stall_4;                                          // 0x0718 (size: 0x8)
    class UbuildingCardWidget_C* bw_storehouse;                                       // 0x0720 (size: 0x8)
    class UbuildingCardWidget_C* bw_storehouse_1;                                     // 0x0728 (size: 0x8)
    class UbuildingCardWidget_C* BW_tool_eraseShrubs;                                 // 0x0730 (size: 0x8)
    class UCanvasPanel* C_Gameplay;                                                   // 0x0738 (size: 0x8)
    class UCanvasPanel* C_GameSummary;                                                // 0x0740 (size: 0x8)
    class UCanvasPanel* C_LetterBox;                                                  // 0x0748 (size: 0x8)
    class UTextBlock* camera_txt;                                                     // 0x0750 (size: 0x8)
    class UTextBlock* camera_txt_5;                                                   // 0x0758 (size: 0x8)
    class UTextBlock* camera_txt_6;                                                   // 0x0760 (size: 0x8)
    class UCanvasPanel* Cards_canvas;                                                 // 0x0768 (size: 0x8)
    class UcastlePlanner_C* castlebuilderWidget;                                      // 0x0770 (size: 0x8)
    class UButton* cat_mercenaries;                                                   // 0x0778 (size: 0x8)
    class UButton* cat_squads;                                                        // 0x0780 (size: 0x8)
    class UiconButton_C* CategoryBtn_Construction;                                    // 0x0788 (size: 0x8)
    class UiconButton_C* CategoryBtn_Cosmetic;                                        // 0x0790 (size: 0x8)
    class UiconButton_C* CategoryBtn_Farm;                                            // 0x0798 (size: 0x8)
    class UiconButton_C* CategoryBtn_Industry;                                        // 0x07A0 (size: 0x8)
    class UiconButton_C* CategoryBtn_Millitary;                                       // 0x07A8 (size: 0x8)
    class UiconButton_C* CategoryBtn_Mining;                                          // 0x07B0 (size: 0x8)
    class UiconButton_C* CategoryBtn_Storage;                                         // 0x07B8 (size: 0x8)
    class UiconButton_C* CategoryBtn_Trade;                                           // 0x07C0 (size: 0x8)
    class UiconButton_C* CategoryBtn_Village;                                         // 0x07C8 (size: 0x8)
    class UCheckBox* CheckBox_6;                                                      // 0x07D0 (size: 0x8)
    class UMLDefaultCheckbox_C* checkbox_snapToNeighbour;                             // 0x07D8 (size: 0x8)
    class UMLDefaultCheckbox_C* checkbox_snapToRoad;                                  // 0x07E0 (size: 0x8)
    class UVerticalBox* claimsAndChallenges_VB;                                       // 0x07E8 (size: 0x8)
    class UTextBlock* closedBuild_txt;                                                // 0x07F0 (size: 0x8)
    class UControlTooltipPanel_C* ControlTooltipPanel;                                // 0x07F8 (size: 0x8)
    class UVerticalBox* currentChallenges_VB;                                         // 0x0800 (size: 0x8)
    class UVerticalBox* currentClaims_VB;                                             // 0x0808 (size: 0x8)
    class UImage* dark;                                                               // 0x0810 (size: 0x8)
    class UImage* dark_1;                                                             // 0x0818 (size: 0x8)
    class UTextBlock* date_day;                                                       // 0x0820 (size: 0x8)
    class UTextBlock* date_Month;                                                     // 0x0828 (size: 0x8)
    class UHorizontalBox* DateTimeHB;                                                 // 0x0830 (size: 0x8)
    class UButton* debuggerWindow_button;                                             // 0x0838 (size: 0x8)
    class UdevelopmentPanelTree_C* developmentPanel;                                  // 0x0840 (size: 0x8)
    class UBorder* DipToBlack;                                                        // 0x0848 (size: 0x8)
    class UCanvasPanel* DropCollectionCanvas;                                         // 0x0850 (size: 0x8)
    class UCanvasPanel* DynamicBigPanels;                                             // 0x0858 (size: 0x8)
    class UButton* equipment_button;                                                  // 0x0860 (size: 0x8)
    class UButton* flipRecruitmentPool_button;                                        // 0x0868 (size: 0x8)
    class UButton* friendlyFire_button;                                               // 0x0870 (size: 0x8)
    class UImage* friendlyFire_highlight;                                             // 0x0878 (size: 0x8)
    class UButton* game_over_continue_button;                                         // 0x0880 (size: 0x8)
    class UButton* game_over_continue_button_1;                                       // 0x0888 (size: 0x8)
    class UBorder* game_paused_border;                                                // 0x0890 (size: 0x8)
    class UCanvasPanel* gameCanvas_Controls;                                          // 0x0898 (size: 0x8)
    class UImage* gameOver_img;                                                       // 0x08A0 (size: 0x8)
    class UTextBlock* gameplay_txt_1;                                                 // 0x08A8 (size: 0x8)
    class UVerticalBox* gameSummaryScreenVB;                                          // 0x08B0 (size: 0x8)
    class UHorizontalBox* GB_SquadSize;                                               // 0x08B8 (size: 0x8)
    class UhiredMercenaryPanel_C* hiredMercenaryPanel;                                // 0x08C0 (size: 0x8)
    class UImage* iconImg;                                                            // 0x08C8 (size: 0x8)
    class UImage* iconImg_2;                                                          // 0x08D0 (size: 0x8)
    class UImage* Image_1;                                                            // 0x08D8 (size: 0x8)
    class UImage* Image_3;                                                            // 0x08E0 (size: 0x8)
    class UImage* Image_8;                                                            // 0x08E8 (size: 0x8)
    class UImage* Image_11;                                                           // 0x08F0 (size: 0x8)
    class UImage* Image_12;                                                           // 0x08F8 (size: 0x8)
    class UImage* Image_13;                                                           // 0x0900 (size: 0x8)
    class UImage* Image_18;                                                           // 0x0908 (size: 0x8)
    class UImage* Image_19;                                                           // 0x0910 (size: 0x8)
    class UImage* Image_20;                                                           // 0x0918 (size: 0x8)
    class UImage* Image_21;                                                           // 0x0920 (size: 0x8)
    class UImage* Image_22;                                                           // 0x0928 (size: 0x8)
    class UImage* Image_23;                                                           // 0x0930 (size: 0x8)
    class UImage* Image_25;                                                           // 0x0938 (size: 0x8)
    class UImage* Image_26;                                                           // 0x0940 (size: 0x8)
    class UImage* Image_28;                                                           // 0x0948 (size: 0x8)
    class UImage* Image_30;                                                           // 0x0950 (size: 0x8)
    class UImage* Image_104;                                                          // 0x0958 (size: 0x8)
    class UImage* Image_199;                                                          // 0x0960 (size: 0x8)
    class UImage* Image_218;                                                          // 0x0968 (size: 0x8)
    class UImage* Image_282;                                                          // 0x0970 (size: 0x8)
    class UImage* Image_324;                                                          // 0x0978 (size: 0x8)
    class UImage* Image_397;                                                          // 0x0980 (size: 0x8)
    class UImage* Image_517;                                                          // 0x0988 (size: 0x8)
    class UImage* Image_572;                                                          // 0x0990 (size: 0x8)
    class UImage* img_monthProgress;                                                  // 0x0998 (size: 0x8)
    class UCanvasPanel* inventory_canvas;                                             // 0x09A0 (size: 0x8)
    class UVerticalBox* leftHand_UI;                                                  // 0x09A8 (size: 0x8)
    class UlegacyViewWidget_C* legacyViewWidget;                                      // 0x09B0 (size: 0x8)
    class UBorder* letterbox_A;                                                       // 0x09B8 (size: 0x8)
    class UBorder* letterbox_B;                                                       // 0x09C0 (size: 0x8)
    class UlocalizedTextBox_C* localizedTextBox_C_0;                                  // 0x09C8 (size: 0x8)
    class UlocalizedTextBox_C* localizedTextBox_C_1;                                  // 0x09D0 (size: 0x8)
    class UTextBlock* log_empty_txt;                                                  // 0x09D8 (size: 0x8)
    class USizeBox* log_sb;                                                           // 0x09E0 (size: 0x8)
    class UScrollBox* LOG_ScrollBox;                                                  // 0x09E8 (size: 0x8)
    class UVerticalBox* LOG_VB;                                                       // 0x09F0 (size: 0x8)
    class USizeBox* logbox+_sb;                                                       // 0x09F8 (size: 0x8)
    class UImage* logbox_+;                                                           // 0x0A00 (size: 0x8)
    class UBorder* logbox_border;                                                     // 0x0A08 (size: 0x8)
    class UImage* logbox_spacer;                                                      // 0x0A10 (size: 0x8)
    class UImage* logbox_spacer_1;                                                    // 0x0A18 (size: 0x8)
    class UHorizontalBox* main_tabs_HB;                                               // 0x0A20 (size: 0x8)
    class UmainTabButton_C* mainTabButton_10_Explore;                                 // 0x0A28 (size: 0x8)
    class UmainTabButton_C* mainTabButton_1_Construction;                             // 0x0A30 (size: 0x8)
    class UmainTabButton_C* mainTabButton_2_Army;                                     // 0x0A38 (size: 0x8)
    class UmainTabButton_C* mainTabButton_3_Map;                                      // 0x0A40 (size: 0x8)
    class UmainTabButton_C* mainTabButton_5_Settings;                                 // 0x0A48 (size: 0x8)
    class UmainTabButton_C* mainTabButton_6_ledger_old;                               // 0x0A50 (size: 0x8)
    class UmainTabButton_C* mainTabButton_7_wiki_wip;                                 // 0x0A58 (size: 0x8)
    class UmainTabButton_C* mainTabButton_8_Road;                                     // 0x0A60 (size: 0x8)
    class UmainTabButton_C* mainTabButton_9_Recruitment;                              // 0x0A68 (size: 0x8)
    class UCanvasPanel* mainUI_canvas;                                                // 0x0A70 (size: 0x8)
    class UMainWiki_C* MainWiki;                                                      // 0x0A78 (size: 0x8)
    class UHorizontalBox* manpower_lv1;                                               // 0x0A80 (size: 0x8)
    class UHorizontalBox* manpower_lv2;                                               // 0x0A88 (size: 0x8)
    class UImage* masonry_Symbol;                                                     // 0x0A90 (size: 0x8)
    class UImage* masonry_Symbol_1;                                                   // 0x0A98 (size: 0x8)
    class UMD_NaviAutoButton_C* MD_NaviAutoButton;                                    // 0x0AA0 (size: 0x8)
    class UMD_NaviAutoButton_C* MD_NaviAutoButton_1;                                  // 0x0AA8 (size: 0x8)
    class UMD_NaviAutoButton_C* MD_NaviAutoButton_2;                                  // 0x0AB0 (size: 0x8)
    class UMD_NaviAutoButton_C* MD_NaviAutoButton_3;                                  // 0x0AB8 (size: 0x8)
    class UMD_NaviAutoButton_C* MD_NaviAutoButton_91;                                 // 0x0AC0 (size: 0x8)
    class UMD_NaviAutoTooltip_C* MD_NaviAutoTooltip;                                  // 0x0AC8 (size: 0x8)
    class UMD_NaviConsoleCursor_C* MD_NaviConsoleCursor;                              // 0x0AD0 (size: 0x8)
    class UImage* mercenaries_glows;                                                  // 0x0AD8 (size: 0x8)
    class UButton* mercenary_button;                                                  // 0x0AE0 (size: 0x8)
    class UmercenaryScreen_C* mercenaryScreen;                                        // 0x0AE8 (size: 0x8)
    class UOverlay* message_overlay;                                                  // 0x0AF0 (size: 0x8)
    class UBorder* message_txt_border;                                                // 0x0AF8 (size: 0x8)
    class UImage* militia_glow;                                                       // 0x0B00 (size: 0x8)
    class UMLDebuggerWindow_C* MLDebuggerWindow;                                      // 0x0B08 (size: 0x8)
    class UMD_NaviAutoButton_C* naviBtn_MercenaryHire;                                // 0x0B10 (size: 0x8)
    class UMD_NaviAutoButton_C* naviBtn_recruit;                                      // 0x0B18 (size: 0x8)
    class UMD_NaviAutoButton_C* naviSummeryEndGame;                                   // 0x0B20 (size: 0x8)
    class UMD_NaviAutoButton_C* naviSummeryKeepPlaying;                               // 0x0B28 (size: 0x8)
    class UTextBlock* num_bows;                                                       // 0x0B30 (size: 0x8)
    class UTextBlock* num_pavise;                                                     // 0x0B38 (size: 0x8)
    class UTextBlock* num_polearms;                                                   // 0x0B40 (size: 0x8)
    class UTextBlock* num_recruits_lv1;                                               // 0x0B48 (size: 0x8)
    class UTextBlock* num_recruits_lv2;                                               // 0x0B50 (size: 0x8)
    class UTextBlock* num_spears;                                                     // 0x0B58 (size: 0x8)
    class UTextBlock* numCrossbows_txt;                                               // 0x0B60 (size: 0x8)
    class UoverlayLegend_C* overlayLegend_C_1;                                        // 0x0B68 (size: 0x8)
    class UImage* paperBG_buildings;                                                  // 0x0B70 (size: 0x8)
    class UplayerLordsPanel_C* playerLord;                                            // 0x0B78 (size: 0x8)
    class UButton* plotDivision_Add;                                                  // 0x0B80 (size: 0x8)
    class UButton* plotDivision_Subtract;                                             // 0x0B88 (size: 0x8)
    class UVerticalBox* plotDivisionButtons_VB;                                       // 0x0B90 (size: 0x8)
    class Ucensus_C* popList;                                                         // 0x0B98 (size: 0x8)
    class UHorizontalBox* pushStances_HB;                                             // 0x0BA0 (size: 0x8)
    class UScrollBox* quest_scrollbox;                                                // 0x0BA8 (size: 0x8)
    class UGridPanel* questMsg_Grid;                                                  // 0x0BB0 (size: 0x8)
    class UquickSettings_C* quickSettings;                                            // 0x0BB8 (size: 0x8)
    class UBorder* reassignMode_header_rts_tool_border;                               // 0x0BC0 (size: 0x8)
    class UButton* recruit_button;                                                    // 0x0BC8 (size: 0x8)
    class UBorder* recruitment_border;                                                // 0x0BD0 (size: 0x8)
    class UHorizontalBox* recruitment_HB;                                             // 0x0BD8 (size: 0x8)
    class UButton* recruitment_merc_b;                                                // 0x0BE0 (size: 0x8)
    class UImage* recruitment_merc_img;                                               // 0x0BE8 (size: 0x8)
    class UButton* recruitment_militia_b;                                             // 0x0BF0 (size: 0x8)
    class UImage* recruitment_militia_img;                                            // 0x0BF8 (size: 0x8)
    class UImage* recruitment_overlay_lion;                                           // 0x0C00 (size: 0x8)
    class UBorder* recruitment_stats_border;                                          // 0x0C08 (size: 0x8)
    class UImage* recruitmentButtonIcon;                                              // 0x0C10 (size: 0x8)
    class UrecruitmentCard_C* recruitmentCard;                                        // 0x0C18 (size: 0x8)
    class UTextBlock* recruitmentStats_recruits;                                      // 0x0C20 (size: 0x8)
    class UHorizontalBox* recruits_HB;                                                // 0x0C28 (size: 0x8)
    class UBorder* rect;                                                              // 0x0C30 (size: 0x8)
    class URegionPanel_C* RegionPanel;                                                // 0x0C38 (size: 0x8)
    class UregionViewOverlay_C* regionViewOverlay;                                    // 0x0C40 (size: 0x8)
    class UrenameFullscreen_C* renameFullscreen;                                      // 0x0C48 (size: 0x8)
    class UretinueEditor_C* retiuneEditor_C_0;                                        // 0x0C50 (size: 0x8)
    class UroadCurvatureBar_WorkAreaBar_C* roadCurvatureBar;                          // 0x0C58 (size: 0x8)
    class UButton* rotateAngle_confirm_1;                                             // 0x0C60 (size: 0x8)
    class UlocalizedTextBox_C* rts_tool_descr;                                        // 0x0C68 (size: 0x8)
    class UlocalizedTextBox_C* RTS_tool_header;                                       // 0x0C70 (size: 0x8)
    class UImage* season_icon;                                                        // 0x0C78 (size: 0x8)
    class UBorder* skill_and_stances_border;                                          // 0x0C80 (size: 0x8)
    class UskillButton_C* skillButton_1;                                              // 0x0C88 (size: 0x8)
    class UskillButton_C* skillButton_2;                                              // 0x0C90 (size: 0x8)
    class UskillButton_C* skillButton_3;                                              // 0x0C98 (size: 0x8)
    class UskillButton_C* skillButton_7;                                              // 0x0CA0 (size: 0x8)
    class UskillButton_C* skillButton_8;                                              // 0x0CA8 (size: 0x8)
    class UskillButton_C* skillButton_customize;                                      // 0x0CB0 (size: 0x8)
    class UskillButton_C* skillButton_disband;                                        // 0x0CB8 (size: 0x8)
    class UskillButton_C* skillButton_outpost;                                        // 0x0CC0 (size: 0x8)
    class UskillButton_C* skillButton_rally;                                          // 0x0CC8 (size: 0x8)
    class UskillButton_C* skillButton_removeSquad;                                    // 0x0CD0 (size: 0x8)
    class UskillButton_C* skillButton_split;                                          // 0x0CD8 (size: 0x8)
    class UHorizontalBox* skills_ralliedOnly;                                         // 0x0CE0 (size: 0x8)
    class USlider* Slider_9;                                                          // 0x0CE8 (size: 0x8)
    class UImage* speed0_glow;                                                        // 0x0CF0 (size: 0x8)
    class UImage* speed1_glow;                                                        // 0x0CF8 (size: 0x8)
    class UImage* speed1_glow_1;                                                      // 0x0D00 (size: 0x8)
    class UImage* speed2_glow;                                                        // 0x0D08 (size: 0x8)
    class UImage* speed3_glow;                                                        // 0x0D10 (size: 0x8)
    class UButton* squad_minus;                                                       // 0x0D18 (size: 0x8)
    class UEditableText* squadSize_EditableText_0;                                    // 0x0D20 (size: 0x8)
    class UsquadTooltip_C* SquadTooltip;                                              // 0x0D28 (size: 0x8)
    class UstanceButton_C* stanceButton;                                              // 0x0D30 (size: 0x8)
    class UstanceButton_C* stanceButton_1;                                            // 0x0D38 (size: 0x8)
    class UstanceButton_C* stanceButton_2;                                            // 0x0D40 (size: 0x8)
    class UstanceButton_C* stanceButton_3;                                            // 0x0D48 (size: 0x8)
    class UstanceButton_C* stanceButton_4;                                            // 0x0D50 (size: 0x8)
    class UstanceButton_C* stanceButton_5;                                            // 0x0D58 (size: 0x8)
    class UstanceButton_C* stanceButton_6;                                            // 0x0D60 (size: 0x8)
    class UstanceButton_C* stanceButton_7;                                            // 0x0D68 (size: 0x8)
    class UHorizontalBox* stances_all_hb;                                             // 0x0D70 (size: 0x8)
    class UHorizontalBox* stances_hb;                                                 // 0x0D78 (size: 0x8)
    class UTextBlock* summary-continue_txt;                                           // 0x0D80 (size: 0x8)
    class UTextBlock* summary_endGameTxt;                                             // 0x0D88 (size: 0x8)
    class UTextBlock* summaryScreen_mainTxt;                                          // 0x0D90 (size: 0x8)
    class UTextBlock* summaryScreen_secondaryTxt;                                     // 0x0D98 (size: 0x8)
    class UTextBlock* temptext;                                                       // 0x0DA0 (size: 0x8)
    class UButton* time1;                                                             // 0x0DA8 (size: 0x8)
    class UButton* time2;                                                             // 0x0DB0 (size: 0x8)
    class UButton* time3;                                                             // 0x0DB8 (size: 0x8)
    class UButton* time_slowmo;                                                       // 0x0DC0 (size: 0x8)
    class UButton* time_stop;                                                         // 0x0DC8 (size: 0x8)
    class UHorizontalBox* TimeControls_HB;                                            // 0x0DD0 (size: 0x8)
    class UBorder* toltipBorder_ColoredRim;                                           // 0x0DD8 (size: 0x8)
    class UCanvasPanel* top_and_side_bars;                                            // 0x0DE0 (size: 0x8)
    class UVerticalBox* TopCluster_VB;                                                // 0x0DE8 (size: 0x8)
    class UCanvasPanel* Tutorials_Canvas;                                             // 0x0DF0 (size: 0x8)
    class UUniformGridPanel* unitCardUniformGrid;                                     // 0x0DF8 (size: 0x8)
    class UHorizontalBox* unitSkills_HB;                                              // 0x0E00 (size: 0x8)
    class UBorder* whiteTooltipBorder;                                                // 0x0E08 (size: 0x8)
    class URichTextBlock* WhiteTooltipRT;                                             // 0x0E10 (size: 0x8)
    FVector2D MousePos;                                                               // 0x0E18 (size: 0x10)
    FVector2D LMBPressed;                                                             // 0x0E28 (size: 0x10)
    int32 Main01_slideOut_Buildings;                                                  // 0x0E38 (size: 0x4)
    TArray<class UInventory_C*> OpenedInventoryTabs;                                  // 0x0E40 (size: 0x10)
    TArray<class UTownName_C*> TownNameWidgets;                                       // 0x0E50 (size: 0x10)
    double Delta;                                                                     // 0x0E60 (size: 0x8)
    bool BLMB;                                                                        // 0x0E68 (size: 0x1)
    FVector2D NewVar_0;                                                               // 0x0E70 (size: 0x10)
    TArray<class UButton*> building_buttons;                                          // 0x0E80 (size: 0x10)
    class UBigMap_C* BigMapRef;                                                       // 0x0E90 (size: 0x8)
    double buildCommitScale;                                                          // 0x0E98 (size: 0x8)
    FVector buildCommitOldPos;                                                        // 0x0EA0 (size: 0x18)
    bool isUsingUI;                                                                   // 0x0EB8 (size: 0x1)
    FGlobalSettings playerSettings;                                                   // 0x0EB9 (size: 0x2)
    class AMyPawnCPP_BP3_C* playerRef;                                                // 0x0EC0 (size: 0x8)
    TArray<class UpopIcon_C*> popIcons;                                               // 0x0EC8 (size: 0x10)
    class UBigMap3d_C* BigMapRef3d;                                                   // 0x0ED8 (size: 0x8)
    bool hideMain;                                                                    // 0x0EE0 (size: 0x1)
    int32 lastDebrisSnd;                                                              // 0x0EE4 (size: 0x4)
    class UButton* selectedButton;                                                    // 0x0EE8 (size: 0x8)
    int32 building_cat;                                                               // 0x0EF0 (size: 0x4)
    double tmpScale;                                                                  // 0x0EF8 (size: 0x8)
    double numAvailableBuildings;                                                     // 0x0F00 (size: 0x8)
    TArray<FLogEntry> removedLogEntries;                                              // 0x0F08 (size: 0x10)
    TArray<class UunitCard_C*> unitCards;                                             // 0x0F18 (size: 0x10)
    int32 mainTab;                                                                    // 0x0F28 (size: 0x4)
    bool hideTownNames;                                                               // 0x0F2C (size: 0x1)
    TArray<class ULogEntry_C*> logEntryWidgets;                                       // 0x0F30 (size: 0x10)
    TArray<class UCharacterPortrait_C*> portraitWidgets;                              // 0x0F40 (size: 0x10)
    TArray<class UCharacterSlot_C*> slotWidgets;                                      // 0x0F50 (size: 0x10)
    TArray<class UbuildingCardWidget_C*> buildingWidgets;                             // 0x0F60 (size: 0x10)
    int32 startingTime;                                                               // 0x0F70 (size: 0x4)
    int32 lastConstrSound;                                                            // 0x0F74 (size: 0x4)
    bool mapIsEnabled;                                                                // 0x0F78 (size: 0x1)
    int32 armyCat;                                                                    // 0x0F7C (size: 0x4)
    TArray<class UrecruitmentCard_C*> recruitmentCards;                               // 0x0F80 (size: 0x10)
    bool bShowRecruitmentPool;                                                        // 0x0F90 (size: 0x1)
    int32 numUnitsSelectedForRecruitment;                                             // 0x0F94 (size: 0x4)
    TArray<class UregionIconWidget_C*> regionIconWidgets;                             // 0x0F98 (size: 0x10)
    bool showLetterbox;                                                               // 0x0FA8 (size: 0x1)
    int32 recruitmentCategory;                                                        // 0x0FAC (size: 0x4)
    FText translatedTooltipText;                                                      // 0x0FB0 (size: 0x10)
    bool friendlyFireOn;                                                              // 0x0FC0 (size: 0x1)
    int32 visibleCategorySpacers;                                                     // 0x0FC4 (size: 0x4)
    double categorySpacerSize;                                                        // 0x0FC8 (size: 0x8)
    double lastLogboxMessageTime;                                                     // 0x0FD0 (size: 0x8)
    bool logboxRecentMessage;                                                         // 0x0FD8 (size: 0x1)
    double fieldAngleScale;                                                           // 0x0FE0 (size: 0x8)
    FVector2D tooltipOffset;                                                          // 0x0FE8 (size: 0x10)
    TArray<FChallenge> relevantChallenges;                                            // 0x0FF8 (size: 0x10)
    TArray<class UchallengeWidget_C*> challengeWidgets;                               // 0x1008 (size: 0x10)
    TArray<int32> recruitsPerLv;                                                      // 0x1018 (size: 0x10)
    bool recruitOnlyUnemployed;                                                       // 0x1028 (size: 0x1)
    int32 targetSquadSize;                                                            // 0x102C (size: 0x4)
    int32 buildingCategoryIndex;                                                      // 0x1030 (size: 0x4)
    TArray<class UskillButton_C*> allSkillButtonWidgets;                              // 0x1038 (size: 0x10)
    class UMaterialInstanceDynamic* monthLoadingDynamicMaterial;                      // 0x1048 (size: 0x8)
    double logboxHeightUnhovered;                                                     // 0x1050 (size: 0x8)
    double logboxHeightHovered;                                                       // 0x1058 (size: 0x8)
    TArray<class UbuildingFloater_C*> floaterWidgets;                                 // 0x1060 (size: 0x10)
    TArray<class UbuildingFloater_C*> floaterWidgets_toRemove;                        // 0x1070 (size: 0x10)
    bool bSwapUnitCards;                                                              // 0x1080 (size: 0x1)
    class UunitCard_C* tempCard;                                                      // 0x1088 (size: 0x8)
    class UunitCard_C* CurrentUnitCardDragged;                                        // 0x1090 (size: 0x8)
    class UunitCard_C* UnitCardOverDrag;                                              // 0x1098 (size: 0x8)
    double Card Spacing;                                                              // 0x10A0 (size: 0x8)
    double CardSize;                                                                  // 0x10A8 (size: 0x8)

    void SequenceEvent__ENTRYPOINTMainUICPP(class UBorder* FadeIn);
    bool OnDrop(FGeometry MyGeometry, FPointerEvent PointerEvent, class UDragDropOperation* Operation);
    void reorderUnitCardColumns();
    void respawnUnitCards();
    void Down Size Unit Box();
    void CalculateUnitCardPos(int32 Index, double CardSpacing, double& CardTargetXPosition);
    void Set Card Over Dragged to Empty if Same(class UunitCard_C* NewCardOver);
    void Set Unit Card Over Drag if Not Same as Dragged(class UunitCard_C* NewCardOver);
    void RemoveDynamicBigPanel(class UWidget* ExistingBigPanel, bool& DidRemove);
    void AddDynamicBigPanel(class UWidget* NewBigPanel);
    void AddFullscreenDialog(class UUserWidget* Fullscreen Widget);
    void AddQuestToGrid(class UUserWidget* Msg);
    void GotoExploreIfController();
    void GotoTab(int32 NextTab);
