#ifndef UE4SS_SDK_BM_CharcoalKilns_HPP
#define UE4SS_SDK_BM_CharcoalKilns_HPP

class ABM_CharcoalKilns_C : public AStaticMeshActor
{
    class UStaticMeshComponent* PS_Smoke_2;                                           // 0x02A0 (size: 0x8)
    class UStaticMeshComponent* PS_Smoke_1;                                           // 0x02A8 (size: 0x8)
    class UStaticMeshComponent* PS_Smoke;                                             // 0x02B0 (size: 0x8)
    class USceneComponent* workPos_2;                                                 // 0x02B8 (size: 0x8)
    class USceneComponent* workPos_1;                                                 // 0x02C0 (size: 0x8)
    class USceneComponent* workPos_0;                                                 // 0x02C8 (size: 0x8)
    class UStaticMeshComponent* clutter_0;                                            // 0x02D0 (size: 0x8)
    class UStaticMeshComponent* clutter_1;                                            // 0x02D8 (size: 0x8)
    class UStaticMeshComponent* dirt_0_3;                                             // 0x02E0 (size: 0x8)
    class UStaticMeshComponent* dirt_0_2;                                             // 0x02E8 (size: 0x8)
    class UStaticMeshComponent* MainBld_455_3;                                        // 0x02F0 (size: 0x8)
    class UStaticMeshComponent* MainBld_455_2;                                        // 0x02F8 (size: 0x8)
    class UStaticMeshComponent* clutter_2;                                            // 0x0300 (size: 0x8)
    class UStaticMeshComponent* dirt_0_1;                                             // 0x0308 (size: 0x8)
    class UStaticMeshComponent* MainBld_455;                                          // 0x0310 (size: 0x8)

}; // Size: 0x318

#endif
