#ifndef UE4SS_SDK_BM_DeepMine_HPP
#define UE4SS_SDK_BM_DeepMine_HPP

class ABM_DeepMine_C : public AStaticMeshActor
{
    class UStaticMeshComponent* clutter_4;                                            // 0x02A0 (size: 0x8)
    class UStaticMeshComponent* clutter_grass_05;                                     // 0x02A8 (size: 0x8)
    class UStaticMeshComponent* clutter_grass_04;                                     // 0x02B0 (size: 0x8)
    class UStaticMeshComponent* clutter_grass_03;                                     // 0x02B8 (size: 0x8)
    class UStaticMeshComponent* clutter_grass_02;                                     // 0x02C0 (size: 0x8)
    class USceneComponent* gathering;                                                 // 0x02C8 (size: 0x8)
    class USceneComponent* workPos_5;                                                 // 0x02D0 (size: 0x8)
    class UStaticMeshComponent* clutter_10;                                           // 0x02D8 (size: 0x8)
    class UStaticMeshComponent* clutter_3;                                            // 0x02E0 (size: 0x8)
    class UStaticMeshComponent* clutter_9;                                            // 0x02E8 (size: 0x8)
    class UStaticMeshComponent* bld_0_plank_6;                                        // 0x02F0 (size: 0x8)
    class UStaticMeshComponent* bld_0_plank_5;                                        // 0x02F8 (size: 0x8)
    class UStaticMeshComponent* bld_0_plank_4;                                        // 0x0300 (size: 0x8)
    class UStaticMeshComponent* bld_0_plank_3;                                        // 0x0308 (size: 0x8)
    class UStaticMeshComponent* bld_0_plank_2;                                        // 0x0310 (size: 0x8)
    class UStaticMeshComponent* bld_0_plank_1;                                        // 0x0318 (size: 0x8)
    class UStaticMeshComponent* bld_0;                                                // 0x0320 (size: 0x8)
    class UStaticMeshComponent* Dirt_6_7;                                             // 0x0328 (size: 0x8)
    class UStaticMeshComponent* Dirt_6_6;                                             // 0x0330 (size: 0x8)
    class UStaticMeshComponent* Dirt_6_5;                                             // 0x0338 (size: 0x8)
    class UStaticMeshComponent* clutter_Sand_2;                                       // 0x0340 (size: 0x8)
    class UStaticMeshComponent* clutter_Sand_1;                                       // 0x0348 (size: 0x8)
    class UStaticMeshComponent* fullBld_431;                                          // 0x0350 (size: 0x8)
    class UStaticMeshComponent* fullBld_494;                                          // 0x0358 (size: 0x8)
    class UStaticMeshComponent* fullBld_492_2;                                        // 0x0360 (size: 0x8)
    class UStaticMeshComponent* fullBld_493;                                          // 0x0368 (size: 0x8)
    class USceneComponent* exclusion_0;                                               // 0x0370 (size: 0x8)
    class UStaticMeshComponent* res_14_2;                                             // 0x0378 (size: 0x8)
    class UStaticMeshComponent* res_14_1;                                             // 0x0380 (size: 0x8)
    class UStaticMeshComponent* res_14_0;                                             // 0x0388 (size: 0x8)
    class USceneComponent* workPos_4;                                                 // 0x0390 (size: 0x8)
    class USceneComponent* workPos_3;                                                 // 0x0398 (size: 0x8)
    class USceneComponent* workPos_2;                                                 // 0x03A0 (size: 0x8)
    class USceneComponent* workPos_1;                                                 // 0x03A8 (size: 0x8)
    class USceneComponent* workPos_0;                                                 // 0x03B0 (size: 0x8)
    class UStaticMeshComponent* bld_0_2;                                              // 0x03B8 (size: 0x8)

}; // Size: 0x3C0

#endif
