#ifndef UE4SS_SDK_BM_FoodCart_HPP
#define UE4SS_SDK_BM_FoodCart_HPP

class ABM_FoodCart_C : public AStaticMeshActor
{
    class UStaticMeshComponent* clutter_2;                                            // 0x02A0 (size: 0x8)
    class UStaticMeshComponent* res_172_8;                                            // 0x02A8 (size: 0x8)
    class UStaticMeshComponent* res_172_7;                                            // 0x02B0 (size: 0x8)
    class UStaticMeshComponent* res_172_6;                                            // 0x02B8 (size: 0x8)
    class UStaticMeshComponent* res_172_5;                                            // 0x02C0 (size: 0x8)
    class UStaticMeshComponent* res_172_4;                                            // 0x02C8 (size: 0x8)
    class UStaticMeshComponent* res_172_3;                                            // 0x02D0 (size: 0x8)
    class UStaticMeshComponent* res_172_2;                                            // 0x02D8 (size: 0x8)
    class UStaticMeshComponent* res_172_1;                                            // 0x02E0 (size: 0x8)
    class UStaticMeshComponent* clutter_30;                                           // 0x02E8 (size: 0x8)
    class UStaticMeshComponent* clutter_29;                                           // 0x02F0 (size: 0x8)
    class UStaticMeshComponent* clutter_28;                                           // 0x02F8 (size: 0x8)
    class UStaticMeshComponent* clutter_27;                                           // 0x0300 (size: 0x8)
    class UStaticMeshComponent* clutter_26;                                           // 0x0308 (size: 0x8)
    class UStaticMeshComponent* clutter_23;                                           // 0x0310 (size: 0x8)
    class UStaticMeshComponent* clutter_22;                                           // 0x0318 (size: 0x8)
    class UStaticMeshComponent* clutter_21;                                           // 0x0320 (size: 0x8)
    class UStaticMeshComponent* clutter_20;                                           // 0x0328 (size: 0x8)
    class UStaticMeshComponent* clutter_19;                                           // 0x0330 (size: 0x8)
    class UStaticMeshComponent* clutter_18;                                           // 0x0338 (size: 0x8)
    class UStaticMeshComponent* clutter_17;                                           // 0x0340 (size: 0x8)
    class UStaticMeshComponent* clutter_16;                                           // 0x0348 (size: 0x8)
    class UStaticMeshComponent* clutter_15;                                           // 0x0350 (size: 0x8)
    class UStaticMeshComponent* clutter_14;                                           // 0x0358 (size: 0x8)
    class UStaticMeshComponent* clutter_13;                                           // 0x0360 (size: 0x8)
    class UStaticMeshComponent* clutter_12;                                           // 0x0368 (size: 0x8)
    class UStaticMeshComponent* clutter_11;                                           // 0x0370 (size: 0x8)
    class UStaticMeshComponent* clutter_10;                                           // 0x0378 (size: 0x8)
    class UStaticMeshComponent* clutter_9;                                            // 0x0380 (size: 0x8)
    class UStaticMeshComponent* clutter_8;                                            // 0x0388 (size: 0x8)
    class UStaticMeshComponent* clutter_7;                                            // 0x0390 (size: 0x8)
    class UStaticMeshComponent* clutter_6;                                            // 0x0398 (size: 0x8)
    class UStaticMeshComponent* clutter_5;                                            // 0x03A0 (size: 0x8)
    class UStaticMeshComponent* clutter_1;                                            // 0x03A8 (size: 0x8)
    class USceneComponent* gathering;                                                 // 0x03B0 (size: 0x8)
    class UStaticMeshComponent* dirt_0_1;                                             // 0x03B8 (size: 0x8)
    class UStaticMeshComponent* MainBld_1;                                            // 0x03C0 (size: 0x8)

}; // Size: 0x3C8

#endif
