#ifndef UE4SS_SDK_BM_SG_Townhouse_LV3_H_HPP
#define UE4SS_SDK_BM_SG_Townhouse_LV3_H_HPP

class ABM_SG_Townhouse_LV3_H_C : public AStaticMeshActor
{
    class USceneComponent* gathering;                                                 // 0x02A0 (size: 0x8)
    class UStaticMeshComponent* fullBld_477;                                          // 0x02A8 (size: 0x8)
    class USceneComponent* bounce;                                                    // 0x02B0 (size: 0x8)
    class UStaticMeshComponent* clutter_13;                                           // 0x02B8 (size: 0x8)
    class UStaticMeshComponent* clutter_12;                                           // 0x02C0 (size: 0x8)
    class UStaticMeshComponent* clutter_pavement8;                                    // 0x02C8 (size: 0x8)
    class UStaticMeshComponent* clutter_pavement7;                                    // 0x02D0 (size: 0x8)
    class UStaticMeshComponent* clutter_pavement6;                                    // 0x02D8 (size: 0x8)
    class UStaticMeshComponent* clutter_pavement5;                                    // 0x02E0 (size: 0x8)
    class UStaticMeshComponent* clutter_48;                                           // 0x02E8 (size: 0x8)
    class UStaticMeshComponent* clutter_47;                                           // 0x02F0 (size: 0x8)
    class UStaticMeshComponent* clutter_46;                                           // 0x02F8 (size: 0x8)
    class UStaticMeshComponent* clutter_36;                                           // 0x0300 (size: 0x8)
    class UStaticMeshComponent* clutter_11;                                           // 0x0308 (size: 0x8)
    class UStaticMeshComponent* clutter_10;                                           // 0x0310 (size: 0x8)
    class UStaticMeshComponent* clutter_9;                                            // 0x0318 (size: 0x8)
    class UStaticMeshComponent* dirt_0_0;                                             // 0x0320 (size: 0x8)
    class UStaticMeshComponent* dirt_4_0;                                             // 0x0328 (size: 0x8)
    class UStaticMeshComponent* MainBld_463;                                          // 0x0330 (size: 0x8)

}; // Size: 0x338

#endif
