#ifndef UE4SS_SDK_BM_SG_Storehouse_Lv2_HPP
#define UE4SS_SDK_BM_SG_Storehouse_Lv2_HPP

class ABM_SG_Storehouse_Lv2_C : public AStaticMeshActor
{
    class UStaticMeshComponent* clutter_stone6;                                       // 0x02A0 (size: 0x8)
    class UStaticMeshComponent* clutter_stone5;                                       // 0x02A8 (size: 0x8)
    class UStaticMeshComponent* res_16_3;                                             // 0x02B0 (size: 0x8)
    class UStaticMeshComponent* res_16_2;                                             // 0x02B8 (size: 0x8)
    class UStaticMeshComponent* res_16_1;                                             // 0x02C0 (size: 0x8)
    class UStaticMeshComponent* dirt_0_2;                                             // 0x02C8 (size: 0x8)
    class UStaticMeshComponent* clutter_dirt10;                                       // 0x02D0 (size: 0x8)
    class UStaticMeshComponent* clutter_dirt9;                                        // 0x02D8 (size: 0x8)
    class UStaticMeshComponent* clutter_dirt8;                                        // 0x02E0 (size: 0x8)
    class UStaticMeshComponent* clutter_barrel_2;                                     // 0x02E8 (size: 0x8)
    class UStaticMeshComponent* clutter_barrel_1;                                     // 0x02F0 (size: 0x8)
    class UStaticMeshComponent* clutter_barrel_0;                                     // 0x02F8 (size: 0x8)
    class UStaticMeshComponent* clutter_bale05;                                       // 0x0300 (size: 0x8)
    class UStaticMeshComponent* clutter_bale03;                                       // 0x0308 (size: 0x8)
    class UStaticMeshComponent* clutter_bale02;                                       // 0x0310 (size: 0x8)
    class UStaticMeshComponent* clutter_bale04;                                       // 0x0318 (size: 0x8)
    class UStaticMeshComponent* clutter_bale01;                                       // 0x0320 (size: 0x8)
    class UStaticMeshComponent* W;                                                    // 0x0328 (size: 0x8)
    class UStaticMeshComponent* clutter_dirt7;                                        // 0x0330 (size: 0x8)
    class UStaticMeshComponent* clutter_dirt6;                                        // 0x0338 (size: 0x8)
    class UStaticMeshComponent* clutter_grass_15;                                     // 0x0340 (size: 0x8)
    class UStaticMeshComponent* clutter_grass_14;                                     // 0x0348 (size: 0x8)
    class UStaticMeshComponent* clutter_grass_13;                                     // 0x0350 (size: 0x8)
    class UStaticMeshComponent* clutter_grass_12;                                     // 0x0358 (size: 0x8)
    class UStaticMeshComponent* clutter_grass_011;                                    // 0x0360 (size: 0x8)
    class UStaticMeshComponent* clutter_grass_10;                                     // 0x0368 (size: 0x8)
    class UStaticMeshComponent* clutter_grass_09;                                     // 0x0370 (size: 0x8)
    class UStaticMeshComponent* clutter_grass_08;                                     // 0x0378 (size: 0x8)
    class UStaticMeshComponent* clutter_grass_07;                                     // 0x0380 (size: 0x8)
    class UStaticMeshComponent* clutter_53;                                           // 0x0388 (size: 0x8)
    class UStaticMeshComponent* clutter_52;                                           // 0x0390 (size: 0x8)
    class UStaticMeshComponent* clutter_bush8;                                        // 0x0398 (size: 0x8)
    class UStaticMeshComponent* clutter_bush7;                                        // 0x03A0 (size: 0x8)
    class UStaticMeshComponent* Handcart5;                                            // 0x03A8 (size: 0x8)
    class UStaticMeshComponent* Handcart4;                                            // 0x03B0 (size: 0x8)
    class UStaticMeshComponent* Handcart3;                                            // 0x03B8 (size: 0x8)
    class UStaticMeshComponent* Handcart2;                                            // 0x03C0 (size: 0x8)
    class USceneComponent* gathering;                                                 // 0x03C8 (size: 0x8)
    class UStaticMeshComponent* Clutter2;                                             // 0x03D0 (size: 0x8)
    class UStaticMeshComponent* MainBld_449;                                          // 0x03D8 (size: 0x8)
    class UStaticMeshComponent* res_3_1;                                              // 0x03E0 (size: 0x8)
    class UStaticMeshComponent* res_216_8;                                            // 0x03E8 (size: 0x8)
    class UStaticMeshComponent* res_216_7;                                            // 0x03F0 (size: 0x8)
    class UStaticMeshComponent* res_216_6;                                            // 0x03F8 (size: 0x8)
    class UStaticMeshComponent* res_216_5;                                            // 0x0400 (size: 0x8)
    class UStaticMeshComponent* res_216_4;                                            // 0x0408 (size: 0x8)
    class UStaticMeshComponent* res_216_3;                                            // 0x0410 (size: 0x8)
    class UStaticMeshComponent* res_216_2;                                            // 0x0418 (size: 0x8)
    class UStaticMeshComponent* res_216_1;                                            // 0x0420 (size: 0x8)
    class UStaticMeshComponent* res_216_0;                                            // 0x0428 (size: 0x8)
    class UStaticMeshComponent* Bld_401_5;                                            // 0x0430 (size: 0x8)
    class UStaticMeshComponent* Bld_401_3;                                            // 0x0438 (size: 0x8)
    class UStaticMeshComponent* Bld_401_2;                                            // 0x0440 (size: 0x8)
    class UStaticMeshComponent* Bld_401_1;                                            // 0x0448 (size: 0x8)
    class UStaticMeshComponent* dirt_0_1;                                             // 0x0450 (size: 0x8)
    class UStaticMeshComponent* Clutter1;                                             // 0x0458 (size: 0x8)
    class UStaticMeshComponent* clutter;                                              // 0x0460 (size: 0x8)
    class UStaticMeshComponent* bld_306;                                              // 0x0468 (size: 0x8)
    class UStaticMeshComponent* Dirt_3_0;                                             // 0x0470 (size: 0x8)
    class UStaticMeshComponent* Handcart1;                                            // 0x0478 (size: 0x8)
    class UStaticMeshComponent* handcart;                                             // 0x0480 (size: 0x8)
    class USceneComponent* Scene;                                                     // 0x0488 (size: 0x8)

}; // Size: 0x490

#endif
