#ifndef UE4SS_SDK_BM_SG_Cottage_Lv1_B_HPP
#define UE4SS_SDK_BM_SG_Cottage_Lv1_B_HPP

class ABM_SG_Cottage_Lv1_B_C : public AStaticMeshActor
{
    class USceneComponent* gathering;                                                 // 0x02A0 (size: 0x8)
    class UStaticMeshComponent* fullBld_477;                                          // 0x02A8 (size: 0x8)
    class UStaticMeshComponent* clutter_11;                                           // 0x02B0 (size: 0x8)
    class UStaticMeshComponent* dirt_4_1;                                             // 0x02B8 (size: 0x8)
    class UStaticMeshComponent* dirt_0_1;                                             // 0x02C0 (size: 0x8)
    class UStaticMeshComponent* res_16_1;                                             // 0x02C8 (size: 0x8)
    class UStaticMeshComponent* res_16_0;                                             // 0x02D0 (size: 0x8)
    class UStaticMeshComponent* Dirt_3_2;                                             // 0x02D8 (size: 0x8)
    class UStaticMeshComponent* clutter_37;                                           // 0x02E0 (size: 0x8)
    class UStaticMeshComponent* clutter_32;                                           // 0x02E8 (size: 0x8)
    class UStaticMeshComponent* clutter_10;                                           // 0x02F0 (size: 0x8)
    class UStaticMeshComponent* clutter_18;                                           // 0x02F8 (size: 0x8)
    class UStaticMeshComponent* clutter_31;                                           // 0x0300 (size: 0x8)
    class UStaticMeshComponent* clutter_pavement1;                                    // 0x0308 (size: 0x8)
    class UStaticMeshComponent* clutter_36;                                           // 0x0310 (size: 0x8)
    class UStaticMeshComponent* clutter_16;                                           // 0x0318 (size: 0x8)
    class UStaticMeshComponent* clutter_15;                                           // 0x0320 (size: 0x8)
    class UStaticMeshComponent* clutter_9;                                            // 0x0328 (size: 0x8)
    class UStaticMeshComponent* clutter_14;                                           // 0x0330 (size: 0x8)
    class UStaticMeshComponent* clutter_13;                                           // 0x0338 (size: 0x8)
    class UStaticMeshComponent* MainBld_246;                                          // 0x0340 (size: 0x8)
    class USceneComponent* Scene;                                                     // 0x0348 (size: 0x8)

}; // Size: 0x350

#endif
