#ifndef UE4SS_SDK_BM_SimplePond_HPP
#define UE4SS_SDK_BM_SimplePond_HPP

class ABM_SimplePond_C : public AStaticMeshActor
{
    class USceneComponent* workPos_10;                                                // 0x02A0 (size: 0x8)
    class USceneComponent* workPos_9;                                                 // 0x02A8 (size: 0x8)
    class USceneComponent* workPos_8;                                                 // 0x02B0 (size: 0x8)
    class USceneComponent* workPos_7;                                                 // 0x02B8 (size: 0x8)
    class USceneComponent* workPos_2;                                                 // 0x02C0 (size: 0x8)
    class USceneComponent* workPos_6;                                                 // 0x02C8 (size: 0x8)
    class USceneComponent* workPos_3;                                                 // 0x02D0 (size: 0x8)
    class USceneComponent* workPos_4;                                                 // 0x02D8 (size: 0x8)
    class USceneComponent* workPos_5;                                                 // 0x02E0 (size: 0x8)
    class USceneComponent* workPos_1;                                                 // 0x02E8 (size: 0x8)
    class USceneComponent* workPos_0;                                                 // 0x02F0 (size: 0x8)
    class USceneComponent* work_positions;                                            // 0x02F8 (size: 0x8)
    class UStaticMeshComponent* clutter_reed_54_clump1;                               // 0x0300 (size: 0x8)
    class UStaticMeshComponent* clutter_reed_63;                                      // 0x0308 (size: 0x8)
    class UStaticMeshComponent* clutter_reed_62;                                      // 0x0310 (size: 0x8)
    class UStaticMeshComponent* clutter_reed_61;                                      // 0x0318 (size: 0x8)
    class UStaticMeshComponent* clutter_reed_60;                                      // 0x0320 (size: 0x8)
    class UStaticMeshComponent* clutter_reed_59;                                      // 0x0328 (size: 0x8)
    class UStaticMeshComponent* clutter_reed_54;                                      // 0x0330 (size: 0x8)
    class UStaticMeshComponent* clutter_reed_58;                                      // 0x0338 (size: 0x8)
    class UStaticMeshComponent* clutter_reed_57;                                      // 0x0340 (size: 0x8)
    class UStaticMeshComponent* clutter_reed_56;                                      // 0x0348 (size: 0x8)
    class UStaticMeshComponent* clutter_reed_55;                                      // 0x0350 (size: 0x8)
    class UStaticMeshComponent* clutter_reed_54_clump;                                // 0x0358 (size: 0x8)
    class UStaticMeshComponent* clutter_reed_53;                                      // 0x0360 (size: 0x8)
    class UStaticMeshComponent* clutter_reed_52;                                      // 0x0368 (size: 0x8)
    class UStaticMeshComponent* clutter_reed_51;                                      // 0x0370 (size: 0x8)
    class UStaticMeshComponent* clutter_reed_50;                                      // 0x0378 (size: 0x8)
    class UStaticMeshComponent* clutter_reed_49;                                      // 0x0380 (size: 0x8)
    class UStaticMeshComponent* clutter_reed_48;                                      // 0x0388 (size: 0x8)
    class UStaticMeshComponent* clutter_reed_47;                                      // 0x0390 (size: 0x8)
    class UStaticMeshComponent* clutter_reed_46;                                      // 0x0398 (size: 0x8)
    class UStaticMeshComponent* clutter_reed_45;                                      // 0x03A0 (size: 0x8)
    class UStaticMeshComponent* clutter_reed_44;                                      // 0x03A8 (size: 0x8)
    class UStaticMeshComponent* clutter_reed_43;                                      // 0x03B0 (size: 0x8)
    class UStaticMeshComponent* clutter_reed_42;                                      // 0x03B8 (size: 0x8)
    class UStaticMeshComponent* clutter_reed_41;                                      // 0x03C0 (size: 0x8)
    class UStaticMeshComponent* clutter_reed_40;                                      // 0x03C8 (size: 0x8)
    class UStaticMeshComponent* clutter_reed_39;                                      // 0x03D0 (size: 0x8)
    class UStaticMeshComponent* clutter_reed_38;                                      // 0x03D8 (size: 0x8)
    class UStaticMeshComponent* clutter_reed_37;                                      // 0x03E0 (size: 0x8)
    class UStaticMeshComponent* clutter_reed_36;                                      // 0x03E8 (size: 0x8)
    class UStaticMeshComponent* clutter_reed_35;                                      // 0x03F0 (size: 0x8)
    class UStaticMeshComponent* clutter_reed_34;                                      // 0x03F8 (size: 0x8)
    class UStaticMeshComponent* clutter_reed_33;                                      // 0x0400 (size: 0x8)
    class UStaticMeshComponent* clutter_reed_32;                                      // 0x0408 (size: 0x8)
    class UStaticMeshComponent* clutter_reed_31;                                      // 0x0410 (size: 0x8)
    class UStaticMeshComponent* dirt_0_1;                                             // 0x0418 (size: 0x8)
    class UStaticMeshComponent* Dirt_6_7;                                             // 0x0420 (size: 0x8)
    class UStaticMeshComponent* Dirt_6_8;                                             // 0x0428 (size: 0x8)
    class USceneComponent* Dirt;                                                      // 0x0430 (size: 0x8)
    class UStaticMeshComponent* clutter_reed_30;                                      // 0x0438 (size: 0x8)
    class UStaticMeshComponent* clutter_reed_13;                                      // 0x0440 (size: 0x8)
    class UStaticMeshComponent* clutter_reed_11;                                      // 0x0448 (size: 0x8)
    class UStaticMeshComponent* clutter_reed_29;                                      // 0x0450 (size: 0x8)
    class UStaticMeshComponent* clutter_reed_28;                                      // 0x0458 (size: 0x8)
    class UStaticMeshComponent* clutter_reed_27;                                      // 0x0460 (size: 0x8)
    class UStaticMeshComponent* clutter_reed_26;                                      // 0x0468 (size: 0x8)
    class UStaticMeshComponent* clutter_reed_14;                                      // 0x0470 (size: 0x8)
    class UStaticMeshComponent* clutter_reed_4;                                       // 0x0478 (size: 0x8)
    class UStaticMeshComponent* clutter_reed_5;                                       // 0x0480 (size: 0x8)
    class UStaticMeshComponent* clutter_reed_6;                                       // 0x0488 (size: 0x8)
    class UStaticMeshComponent* clutter_reed_7;                                       // 0x0490 (size: 0x8)
    class UStaticMeshComponent* clutter_reed_8;                                       // 0x0498 (size: 0x8)
    class UStaticMeshComponent* clutter_reed_9;                                       // 0x04A0 (size: 0x8)
    class UStaticMeshComponent* clutter_reed_12;                                      // 0x04A8 (size: 0x8)
    class UStaticMeshComponent* clutter_reed_10;                                      // 0x04B0 (size: 0x8)
    class UStaticMeshComponent* clutter_reed_0;                                       // 0x04B8 (size: 0x8)
    class UStaticMeshComponent* clutter_reed_3;                                       // 0x04C0 (size: 0x8)
    class UStaticMeshComponent* clutter_reed_2;                                       // 0x04C8 (size: 0x8)
    class UStaticMeshComponent* clutter_reed_1;                                       // 0x04D0 (size: 0x8)
    class UStaticMeshComponent* clutter_reed_24;                                      // 0x04D8 (size: 0x8)
    class UStaticMeshComponent* clutter_reed_23;                                      // 0x04E0 (size: 0x8)
    class UStaticMeshComponent* clutter_reed_22;                                      // 0x04E8 (size: 0x8)
    class UStaticMeshComponent* clutter_reed_21;                                      // 0x04F0 (size: 0x8)
    class UStaticMeshComponent* clutter_reed_19;                                      // 0x04F8 (size: 0x8)
    class UStaticMeshComponent* clutter_reed_25;                                      // 0x0500 (size: 0x8)
    class UStaticMeshComponent* clutter_reed_18;                                      // 0x0508 (size: 0x8)
    class UStaticMeshComponent* clutter_reed_17;                                      // 0x0510 (size: 0x8)
    class UStaticMeshComponent* clutter_reed_16;                                      // 0x0518 (size: 0x8)
    class UStaticMeshComponent* clutter_reed_15;                                      // 0x0520 (size: 0x8)
    class UStaticMeshComponent* clutter_reed_20;                                      // 0x0528 (size: 0x8)
    class USceneComponent* reeds;                                                     // 0x0530 (size: 0x8)
    class USceneComponent* ambience_pond;                                             // 0x0538 (size: 0x8)
    class USceneComponent* Reflection;                                                // 0x0540 (size: 0x8)
    class UStaticMeshComponent* clutter_water;                                        // 0x0548 (size: 0x8)
    class USceneComponent* exclusion_0;                                               // 0x0550 (size: 0x8)
    class UStaticMeshComponent* bld_0;                                                // 0x0558 (size: 0x8)
    class UStaticMeshComponent* bld_478;                                              // 0x0560 (size: 0x8)

}; // Size: 0x568

#endif
