#ifndef UE4SS_SDK_BM_SG_Windmill_HPP
#define UE4SS_SDK_BM_SG_Windmill_HPP

class ABM_SG_Windmill_C : public AStaticMeshActor
{
    class UStaticMeshComponent* res_16_2;                                             // 0x02A0 (size: 0x8)
    class UStaticMeshComponent* res_16_1;                                             // 0x02A8 (size: 0x8)
    class UStaticMeshComponent* clutter_52;                                           // 0x02B0 (size: 0x8)
    class UStaticMeshComponent* res_5_6;                                              // 0x02B8 (size: 0x8)
    class UStaticMeshComponent* res_5_5;                                              // 0x02C0 (size: 0x8)
    class UStaticMeshComponent* res_5_4;                                              // 0x02C8 (size: 0x8)
    class UStaticMeshComponent* res_5_3;                                              // 0x02D0 (size: 0x8)
    class UStaticMeshComponent* res_5_2;                                              // 0x02D8 (size: 0x8)
    class UStaticMeshComponent* res_5_1;                                              // 0x02E0 (size: 0x8)
    class UStaticMeshComponent* res_1_7;                                              // 0x02E8 (size: 0x8)
    class UStaticMeshComponent* res_1_6;                                              // 0x02F0 (size: 0x8)
    class UStaticMeshComponent* res_1_5;                                              // 0x02F8 (size: 0x8)
    class UStaticMeshComponent* res_1_4;                                              // 0x0300 (size: 0x8)
    class UStaticMeshComponent* res_1_3;                                              // 0x0308 (size: 0x8)
    class UStaticMeshComponent* res_1_2;                                              // 0x0310 (size: 0x8)
    class UStaticMeshComponent* dirt_0_1;                                             // 0x0318 (size: 0x8)
    class UStaticMeshComponent* MainBld_458;                                          // 0x0320 (size: 0x8)
    class UStaticMeshComponent* Shaft;                                                // 0x0328 (size: 0x8)
    class UStaticMeshComponent* MainBld_43;                                           // 0x0330 (size: 0x8)

}; // Size: 0x338

#endif
