#ifndef UE4SS_SDK_BM_SG_Sawpit_Alt_HPP
#define UE4SS_SDK_BM_SG_Sawpit_Alt_HPP

class ABM_SG_Sawpit_Alt_C : public AStaticMeshActor
{
    class UStaticMeshComponent* res_17_10;                                            // 0x02A0 (size: 0x8)
    class UStaticMeshComponent* res_17_9;                                             // 0x02A8 (size: 0x8)
    class UStaticMeshComponent* res_17_8;                                             // 0x02B0 (size: 0x8)
    class UStaticMeshComponent* res_17_7;                                             // 0x02B8 (size: 0x8)
    class UStaticMeshComponent* res_17_0;                                             // 0x02C0 (size: 0x8)
    class UStaticMeshComponent* res_17_1;                                             // 0x02C8 (size: 0x8)
    class UStaticMeshComponent* res_17_6;                                             // 0x02D0 (size: 0x8)
    class UStaticMeshComponent* res_17_5;                                             // 0x02D8 (size: 0x8)
    class UStaticMeshComponent* res_17_4;                                             // 0x02E0 (size: 0x8)
    class UStaticMeshComponent* res_17_3;                                             // 0x02E8 (size: 0x8)
    class UStaticMeshComponent* res_17_2;                                             // 0x02F0 (size: 0x8)
    class UStaticMeshComponent* FullBld_00;                                           // 0x02F8 (size: 0x8)
    class UStaticMeshComponent* res_16_4;                                             // 0x0300 (size: 0x8)
    class UStaticMeshComponent* res_16_3;                                             // 0x0308 (size: 0x8)
    class USceneComponent* gatheringSpot;                                             // 0x0310 (size: 0x8)
    class UStaticMeshComponent* res_16_2;                                             // 0x0318 (size: 0x8)
    class UStaticMeshComponent* Dirt_3_8;                                             // 0x0320 (size: 0x8)
    class USceneComponent* exclusion_0;                                               // 0x0328 (size: 0x8)
    class UStaticMeshComponent* Dirt_5_7;                                             // 0x0330 (size: 0x8)
    class UStaticMeshComponent* dirt_0_6;                                             // 0x0338 (size: 0x8)
    class UStaticMeshComponent* dirt_0_5;                                             // 0x0340 (size: 0x8)
    class UStaticMeshComponent* Dirt_3_4;                                             // 0x0348 (size: 0x8)
    class UStaticMeshComponent* dirt_0_3;                                             // 0x0350 (size: 0x8)
    class UStaticMeshComponent* res_16_1;                                             // 0x0358 (size: 0x8)
    class UStaticMeshComponent* res_16_0;                                             // 0x0360 (size: 0x8)
    class UStaticMeshComponent* Dirt_3_0;                                             // 0x0368 (size: 0x8)
    class UStaticMeshComponent* clutter_6;                                            // 0x0370 (size: 0x8)
    class UStaticMeshComponent* MainBld_474;                                          // 0x0378 (size: 0x8)
    class USceneComponent* workPos_0;                                                 // 0x0380 (size: 0x8)
    class UStaticMeshComponent* dirt_0_1;                                             // 0x0388 (size: 0x8)
    class UStaticMeshComponent* bld_0;                                                // 0x0390 (size: 0x8)
    class UStaticMeshComponent* bld_475;                                              // 0x0398 (size: 0x8)

}; // Size: 0x3A0

#endif
