#ifndef UE4SS_SDK_BM_SG_Malthouse_HPP
#define UE4SS_SDK_BM_SG_Malthouse_HPP

class ABM_SG_Malthouse_C : public AStaticMeshActor
{
    class USceneComponent* workPos_3;                                                 // 0x02A0 (size: 0x8)
    class USceneComponent* workPos_2;                                                 // 0x02A8 (size: 0x8)
    class USceneComponent* workPos_1;                                                 // 0x02B0 (size: 0x8)
    class USceneComponent* workPos_0;                                                 // 0x02B8 (size: 0x8)
    class UStaticMeshComponent* res_216_8;                                            // 0x02C0 (size: 0x8)
    class UStaticMeshComponent* res_216_7;                                            // 0x02C8 (size: 0x8)
    class UStaticMeshComponent* res_216_6;                                            // 0x02D0 (size: 0x8)
    class UStaticMeshComponent* res_216_5;                                            // 0x02D8 (size: 0x8)
    class UStaticMeshComponent* res_216_4;                                            // 0x02E0 (size: 0x8)
    class UStaticMeshComponent* res_216_3;                                            // 0x02E8 (size: 0x8)
    class UStaticMeshComponent* res_216_2;                                            // 0x02F0 (size: 0x8)
    class UStaticMeshComponent* res_216_1;                                            // 0x02F8 (size: 0x8)
    class UStaticMeshComponent* res_216_0;                                            // 0x0300 (size: 0x8)
    class UStaticMeshComponent* clutter_fire;                                         // 0x0308 (size: 0x8)
    class UStaticMeshComponent* Dirt_3_1;                                             // 0x0310 (size: 0x8)
    class UStaticMeshComponent* Res_165_3;                                            // 0x0318 (size: 0x8)
    class UStaticMeshComponent* Res_165_2;                                            // 0x0320 (size: 0x8)
    class UStaticMeshComponent* Res_165_1;                                            // 0x0328 (size: 0x8)
    class UStaticMeshComponent* clutter_6;                                            // 0x0330 (size: 0x8)
    class UStaticMeshComponent* clutter_5;                                            // 0x0338 (size: 0x8)
    class UStaticMeshComponent* Res_165_0;                                            // 0x0340 (size: 0x8)
    class UStaticMeshComponent* res_29_3;                                             // 0x0348 (size: 0x8)
    class UStaticMeshComponent* res_29_2;                                             // 0x0350 (size: 0x8)
    class UStaticMeshComponent* res_29_1;                                             // 0x0358 (size: 0x8)
    class UStaticMeshComponent* res_29_0;                                             // 0x0360 (size: 0x8)
    class UStaticMeshComponent* clutter_4;                                            // 0x0368 (size: 0x8)
    class UStaticMeshComponent* clutter_2;                                            // 0x0370 (size: 0x8)
    class UStaticMeshComponent* clutter_1;                                            // 0x0378 (size: 0x8)
    class UStaticMeshComponent* clutter_0;                                            // 0x0380 (size: 0x8)
    class UStaticMeshComponent* clutter_3;                                            // 0x0388 (size: 0x8)
    class UStaticMeshComponent* fullBld_428;                                          // 0x0390 (size: 0x8)
    class UStaticMeshComponent* dirt_0_3;                                             // 0x0398 (size: 0x8)
    class UStaticMeshComponent* dirt_0_2;                                             // 0x03A0 (size: 0x8)
    class UStaticMeshComponent* Dirt_3_0;                                             // 0x03A8 (size: 0x8)
    class UStaticMeshComponent* dirt_1_3;                                             // 0x03B0 (size: 0x8)
    class UStaticMeshComponent* dirt_1_2;                                             // 0x03B8 (size: 0x8)
    class UStaticMeshComponent* Clutter1;                                             // 0x03C0 (size: 0x8)
    class UStaticMeshComponent* Bld_401_16;                                           // 0x03C8 (size: 0x8)
    class UStaticMeshComponent* Bld_401_7;                                            // 0x03D0 (size: 0x8)
    class UStaticMeshComponent* Bld_401_6;                                            // 0x03D8 (size: 0x8)
    class UStaticMeshComponent* Bld_401_4;                                            // 0x03E0 (size: 0x8)
    class UStaticMeshComponent* clutter;                                              // 0x03E8 (size: 0x8)
    class UStaticMeshComponent* MainBld_417;                                          // 0x03F0 (size: 0x8)

}; // Size: 0x3F8

#endif
