#ifndef UE4SS_SDK_BM_SG_Ext_CobblerShed_HPP
#define UE4SS_SDK_BM_SG_Ext_CobblerShed_HPP

class ABM_SG_Ext_CobblerShed_C : public AStaticMeshActor
{
    class USceneComponent* workpos1;                                                  // 0x02A0 (size: 0x8)
    class USceneComponent* workPos;                                                   // 0x02A8 (size: 0x8)
    class UStaticMeshComponent* clutter_3;                                            // 0x02B0 (size: 0x8)
    class UStaticMeshComponent* Dirt_3_2;                                             // 0x02B8 (size: 0x8)
    class UStaticMeshComponent* clutter_stones8;                                      // 0x02C0 (size: 0x8)
    class UStaticMeshComponent* clutter_stones7;                                      // 0x02C8 (size: 0x8)
    class UStaticMeshComponent* clutter_stones3;                                      // 0x02D0 (size: 0x8)
    class UStaticMeshComponent* clutter_stones2;                                      // 0x02D8 (size: 0x8)
    class UStaticMeshComponent* res_16_0;                                             // 0x02E0 (size: 0x8)
    class UStaticMeshComponent* clutter_stones1;                                      // 0x02E8 (size: 0x8)
    class UStaticMeshComponent* dirt_0_0;                                             // 0x02F0 (size: 0x8)
    class UStaticMeshComponent* fullBld_441;                                          // 0x02F8 (size: 0x8)
    class USceneComponent* Scene;                                                     // 0x0300 (size: 0x8)

}; // Size: 0x308

#endif
