#ifndef UE4SS_SDK_BM_SG_Roadpost_HPP
#define UE4SS_SDK_BM_SG_Roadpost_HPP

class ABM_SG_Roadpost_C : public AStaticMeshActor
{
    class UStaticMeshComponent* clutter_5;                                            // 0x02A0 (size: 0x8)
    class UStaticMeshComponent* clutter_6;                                            // 0x02A8 (size: 0x8)
    class UStaticMeshComponent* clutter_4;                                            // 0x02B0 (size: 0x8)
    class UStaticMeshComponent* clutter_2;                                            // 0x02B8 (size: 0x8)
    class UStaticMeshComponent* clutter_1;                                            // 0x02C0 (size: 0x8)
    class UStaticMeshComponent* dirt_1_3;                                             // 0x02C8 (size: 0x8)
    class UStaticMeshComponent* dirt_1_2;                                             // 0x02D0 (size: 0x8)
    class UStaticMeshComponent* MainBld_422;                                          // 0x02D8 (size: 0x8)

}; // Size: 0x2E0

#endif
