#ifndef UE4SS_SDK_c_barn_HPP
#define UE4SS_SDK_c_barn_HPP

class Ac_barn_C : public AConstructionBP_C
{
    class USceneComponent* Core;                                                      // 0x0550 (size: 0x8)
    class UStaticMeshComponent* StaticMesh1;                                          // 0x0558 (size: 0x8)
    class UStaticMeshComponent* StaticMesh;                                           // 0x0560 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent0101;                              // 0x0568 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent0102;                              // 0x0570 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent0103;                              // 0x0578 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent099;                               // 0x0580 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent0100;                              // 0x0588 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent096;                               // 0x0590 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent093;                               // 0x0598 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent094;                               // 0x05A0 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent095;                               // 0x05A8 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent098;                               // 0x05B0 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent097;                               // 0x05B8 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent092;                               // 0x05C0 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent0183;                              // 0x05C8 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent0182;                              // 0x05D0 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent0181;                              // 0x05D8 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent0180;                              // 0x05E0 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent0179;                              // 0x05E8 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent0178;                              // 0x05F0 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent0177;                              // 0x05F8 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent0176;                              // 0x0600 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent0175;                              // 0x0608 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent0174;                              // 0x0610 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent0173;                              // 0x0618 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent0172;                              // 0x0620 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent0171;                              // 0x0628 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent0170;                              // 0x0630 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent0169;                              // 0x0638 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent0168;                              // 0x0640 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent0167;                              // 0x0648 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent0166;                              // 0x0650 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent0165;                              // 0x0658 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent0164;                              // 0x0660 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent0163;                              // 0x0668 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent0162;                              // 0x0670 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent0161;                              // 0x0678 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent0160;                              // 0x0680 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent0159;                              // 0x0688 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent0158;                              // 0x0690 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent0157;                              // 0x0698 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent0156;                              // 0x06A0 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent0155;                              // 0x06A8 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent0154;                              // 0x06B0 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent0153;                              // 0x06B8 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent0152;                              // 0x06C0 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent0151;                              // 0x06C8 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent0150;                              // 0x06D0 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent0149;                              // 0x06D8 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent0148;                              // 0x06E0 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent0147;                              // 0x06E8 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent0146;                              // 0x06F0 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent0145;                              // 0x06F8 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent0144;                              // 0x0700 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent0143;                              // 0x0708 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent0142;                              // 0x0710 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent0141;                              // 0x0718 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent0140;                              // 0x0720 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent0139;                              // 0x0728 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent0138;                              // 0x0730 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent0137;                              // 0x0738 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent0136;                              // 0x0740 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent0135;                              // 0x0748 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent0134;                              // 0x0750 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent0133;                              // 0x0758 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent0132;                              // 0x0760 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent0131;                              // 0x0768 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent0130;                              // 0x0770 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent0129;                              // 0x0778 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent0128;                              // 0x0780 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent0127;                              // 0x0788 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent0126;                              // 0x0790 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent0125;                              // 0x0798 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent0124;                              // 0x07A0 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent0123;                              // 0x07A8 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent0122;                              // 0x07B0 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent0121;                              // 0x07B8 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent0120;                              // 0x07C0 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent0119;                              // 0x07C8 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent0118;                              // 0x07D0 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent0117;                              // 0x07D8 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent0116;                              // 0x07E0 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent0115;                              // 0x07E8 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent0114;                              // 0x07F0 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent0113;                              // 0x07F8 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent0112;                              // 0x0800 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent0111;                              // 0x0808 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent0110;                              // 0x0810 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent0109;                              // 0x0818 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent0108;                              // 0x0820 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent0107;                              // 0x0828 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent0106;                              // 0x0830 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent0105;                              // 0x0838 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent0104;                              // 0x0840 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent0184;                              // 0x0848 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent091;                               // 0x0850 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent090;                               // 0x0858 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent089;                               // 0x0860 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent088;                               // 0x0868 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent087;                               // 0x0870 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent086;                               // 0x0878 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent085;                               // 0x0880 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent084;                               // 0x0888 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent083;                               // 0x0890 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent082;                               // 0x0898 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent081;                               // 0x08A0 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent080;                               // 0x08A8 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent079;                               // 0x08B0 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent078;                               // 0x08B8 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent077;                               // 0x08C0 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent076;                               // 0x08C8 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent075;                               // 0x08D0 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent074;                               // 0x08D8 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent073;                               // 0x08E0 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent072;                               // 0x08E8 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent071;                               // 0x08F0 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent070;                               // 0x08F8 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent069;                               // 0x0900 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent068;                               // 0x0908 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent067;                               // 0x0910 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent066;                               // 0x0918 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent065;                               // 0x0920 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent064;                               // 0x0928 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent063;                               // 0x0930 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent062;                               // 0x0938 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent061;                               // 0x0940 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent060;                               // 0x0948 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent059;                               // 0x0950 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent058;                               // 0x0958 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent057;                               // 0x0960 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent056;                               // 0x0968 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent055;                               // 0x0970 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent054;                               // 0x0978 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent053;                               // 0x0980 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent052;                               // 0x0988 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent051;                               // 0x0990 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent050;                               // 0x0998 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent049;                               // 0x09A0 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent048;                               // 0x09A8 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent047;                               // 0x09B0 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent046;                               // 0x09B8 (size: 0x8)
    class USceneComponent* barndoor1;                                                 // 0x09C0 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent044;                               // 0x09C8 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent043;                               // 0x09D0 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent042;                               // 0x09D8 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent041;                               // 0x09E0 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent040;                               // 0x09E8 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent039;                               // 0x09F0 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent038;                               // 0x09F8 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent037;                               // 0x0A00 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent036;                               // 0x0A08 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent035;                               // 0x0A10 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent034;                               // 0x0A18 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent033;                               // 0x0A20 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent032;                               // 0x0A28 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent031;                               // 0x0A30 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent030;                               // 0x0A38 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent029;                               // 0x0A40 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent028;                               // 0x0A48 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent027;                               // 0x0A50 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent026;                               // 0x0A58 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent025;                               // 0x0A60 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent024;                               // 0x0A68 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent023;                               // 0x0A70 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent022;                               // 0x0A78 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent021;                               // 0x0A80 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent020;                               // 0x0A88 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent019;                               // 0x0A90 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent018;                               // 0x0A98 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent017;                               // 0x0AA0 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent016;                               // 0x0AA8 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent015;                               // 0x0AB0 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent014;                               // 0x0AB8 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent013;                               // 0x0AC0 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent012;                               // 0x0AC8 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent011;                               // 0x0AD0 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent010;                               // 0x0AD8 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent09;                                // 0x0AE0 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent08;                                // 0x0AE8 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent07;                                // 0x0AF0 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent06;                                // 0x0AF8 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent05;                                // 0x0B00 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent04;                                // 0x0B08 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent03;                                // 0x0B10 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent02;                                // 0x0B18 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent01;                                // 0x0B20 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent0;                                 // 0x0B28 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent045;                               // 0x0B30 (size: 0x8)

}; // Size: 0xB38

#endif
