#ifndef UE4SS_SDK_C_BakeryAttachment_HPP
#define UE4SS_SDK_C_BakeryAttachment_HPP

class AC_BakeryAttachment_C : public AConstructionBP_C
{
    class UStaticMeshComponent* dirtHeapA248_StaticMeshComponent0;                    // 0x0550 (size: 0x8)
    class UStaticMeshComponent* table_megascans_LOD12_StaticMeshComponent0;           // 0x0558 (size: 0x8)
    class UStaticMeshComponent* table_megascans_LOD11_StaticMeshComponent0;           // 0x0560 (size: 0x8)
    class UStaticMeshComponent* table_megascans_LOD10_StaticMeshComponent0;           // 0x0568 (size: 0x8)
    class UStaticMeshComponent* strut20_StaticMeshComponent0;                         // 0x0570 (size: 0x8)
    class UStaticMeshComponent* strut19_StaticMeshComponent0;                         // 0x0578 (size: 0x8)
    class UStaticMeshComponent* strut18_StaticMeshComponent0;                         // 0x0580 (size: 0x8)
    class UStaticMeshComponent* strut17_StaticMeshComponent0;                         // 0x0588 (size: 0x8)
    class UStaticMeshComponent* strut16_StaticMeshComponent0;                         // 0x0590 (size: 0x8)
    class UStaticMeshComponent* strut15_StaticMeshComponent0;                         // 0x0598 (size: 0x8)
    class UStaticMeshComponent* strut14_StaticMeshComponent0;                         // 0x05A0 (size: 0x8)
    class UStaticMeshComponent* strut13_StaticMeshComponent0;                         // 0x05A8 (size: 0x8)
    class UStaticMeshComponent* strut12_StaticMeshComponent0;                         // 0x05B0 (size: 0x8)
    class UStaticMeshComponent* strut6_StaticMeshComponent0;                          // 0x05B8 (size: 0x8)
    class UStaticMeshComponent* dirtHeapA247_StaticMeshComponent0;                    // 0x05C0 (size: 0x8)
    class UStaticMeshComponent* dirtHeapA246_StaticMeshComponent0;                    // 0x05C8 (size: 0x8)
    class UStaticMeshComponent* dirtHeapA245_StaticMeshComponent0;                    // 0x05D0 (size: 0x8)
    class UStaticMeshComponent* groundGrass105_StaticMeshComponent0;                  // 0x05D8 (size: 0x8)
    class UStaticMeshComponent* groundGrass104_StaticMeshComponent0;                  // 0x05E0 (size: 0x8)
    class UStaticMeshComponent* groundGrass103_StaticMeshComponent0;                  // 0x05E8 (size: 0x8)
    class UStaticMeshComponent* groundGrass102_StaticMeshComponent0;                  // 0x05F0 (size: 0x8)
    class UStaticMeshComponent* groundGrass101_StaticMeshComponent0;                  // 0x05F8 (size: 0x8)
    class UStaticMeshComponent* groundGrass100_StaticMeshComponent0;                  // 0x0600 (size: 0x8)
    class UStaticMeshComponent* groundGrass99_StaticMeshComponent0;                   // 0x0608 (size: 0x8)
    class UStaticMeshComponent* groundGrass98_StaticMeshComponent0;                   // 0x0610 (size: 0x8)
    class UStaticMeshComponent* groundGrass97_StaticMeshComponent0;                   // 0x0618 (size: 0x8)
    class UStaticMeshComponent* groundGrass96_StaticMeshComponent0;                   // 0x0620 (size: 0x8)
    class UStaticMeshComponent* groundGrass95_StaticMeshComponent0;                   // 0x0628 (size: 0x8)
    class UStaticMeshComponent* groundGrass94_StaticMeshComponent0;                   // 0x0630 (size: 0x8)
    class UStaticMeshComponent* groundGrass93_StaticMeshComponent0;                   // 0x0638 (size: 0x8)
    class UStaticMeshComponent* groundGrass92_StaticMeshComponent0;                   // 0x0640 (size: 0x8)
    class UStaticMeshComponent* groundGrass91_StaticMeshComponent0;                   // 0x0648 (size: 0x8)
    class UStaticMeshComponent* groundGrass90_StaticMeshComponent0;                   // 0x0650 (size: 0x8)
    class UStaticMeshComponent* groundGrass89_StaticMeshComponent0;                   // 0x0658 (size: 0x8)
    class UStaticMeshComponent* groundGrass88_StaticMeshComponent0;                   // 0x0660 (size: 0x8)
    class UStaticMeshComponent* groundGrass87_StaticMeshComponent0;                   // 0x0668 (size: 0x8)
    class UStaticMeshComponent* groundGrass86_StaticMeshComponent0;                   // 0x0670 (size: 0x8)
    class UStaticMeshComponent* groundGrass85_StaticMeshComponent0;                   // 0x0678 (size: 0x8)
    class UStaticMeshComponent* groundGrass84_StaticMeshComponent0;                   // 0x0680 (size: 0x8)
    class UStaticMeshComponent* groundGrass83_StaticMeshComponent0;                   // 0x0688 (size: 0x8)
    class UStaticMeshComponent* groundGrass82_StaticMeshComponent0;                   // 0x0690 (size: 0x8)
    class UStaticMeshComponent* groundGrass81_StaticMeshComponent0;                   // 0x0698 (size: 0x8)
    class UStaticMeshComponent* groundGrass80_StaticMeshComponent0;                   // 0x06A0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short48_StaticMeshComponent0;        // 0x06A8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short47_StaticMeshComponent0;        // 0x06B0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short46_StaticMeshComponent0;        // 0x06B8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short45_StaticMeshComponent0;        // 0x06C0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short44_StaticMeshComponent0;        // 0x06C8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short43_StaticMeshComponent0;        // 0x06D0 (size: 0x8)
    class UStaticMeshComponent* hromada_hlina_01_30k_f2_StaticMeshComponent0;         // 0x06D8 (size: 0x8)
    class UStaticMeshComponent* dirtHeapA230_StaticMeshComponent0;                    // 0x06E0 (size: 0x8)
    class UStaticMeshComponent* dirtHeapA229_StaticMeshComponent0;                    // 0x06E8 (size: 0x8)
    class UStaticMeshComponent* dirtHeapA228_StaticMeshComponent0;                    // 0x06F0 (size: 0x8)
    class UStaticMeshComponent* dirtHeapA227_StaticMeshComponent0;                    // 0x06F8 (size: 0x8)
    class UStaticMeshComponent* dirtHeapA226_StaticMeshComponent0;                    // 0x0700 (size: 0x8)
    class UStaticMeshComponent* dirtHeapA225_StaticMeshComponent0;                    // 0x0708 (size: 0x8)
    class UStaticMeshComponent* dirtHeapA224_StaticMeshComponent0;                    // 0x0710 (size: 0x8)
    class UStaticMeshComponent* dirtHeapA223_StaticMeshComponent0;                    // 0x0718 (size: 0x8)
    class UStaticMeshComponent* dirtHeapA222_StaticMeshComponent0;                    // 0x0720 (size: 0x8)
    class UStaticMeshComponent* dirtHeapA221_StaticMeshComponent0;                    // 0x0728 (size: 0x8)
    class UStaticMeshComponent* dirtHeapA220_StaticMeshComponent0;                    // 0x0730 (size: 0x8)
    class UStaticMeshComponent* dirtHeapA219_StaticMeshComponent0;                    // 0x0738 (size: 0x8)
    class UStaticMeshComponent* dirtHeapA218_StaticMeshComponent0;                    // 0x0740 (size: 0x8)
    class UStaticMeshComponent* dirtHeapA217_StaticMeshComponent0;                    // 0x0748 (size: 0x8)
    class UStaticMeshComponent* uckmaibfa_LOD9_StaticMeshComponent0;                  // 0x0750 (size: 0x8)
    class UStaticMeshComponent* uckmaibfa_LOD8_StaticMeshComponent0;                  // 0x0758 (size: 0x8)
    class UStaticMeshComponent* bale2_StaticMeshComponent0;                           // 0x0760 (size: 0x8)
    class UStaticMeshComponent* basket3_StaticMeshComponent0;                         // 0x0768 (size: 0x8)
    class UStaticMeshComponent* bag34_StaticMeshComponent0;                           // 0x0770 (size: 0x8)
    class UStaticMeshComponent* bag33_StaticMeshComponent0;                           // 0x0778 (size: 0x8)
    class UStaticMeshComponent* bag32_StaticMeshComponent0;                           // 0x0780 (size: 0x8)
    class UStaticMeshComponent* barrel_lod7_StaticMeshComponent0;                     // 0x0788 (size: 0x8)
    class UStaticMeshComponent* ubupeirfa_LOD5_bucket8_StaticMeshComponent0;          // 0x0790 (size: 0x8)
    class UStaticMeshComponent* table_megascans_LOD6_StaticMeshComponent0;            // 0x0798 (size: 0x8)
    class UStaticMeshComponent* udribbjqx_LOD10_StaticMeshComponent0;                 // 0x07A0 (size: 0x8)
    class UStaticMeshComponent* udribbjqx_LOD9_StaticMeshComponent0;                  // 0x07A8 (size: 0x8)
    class UStaticMeshComponent* udribbjqx_LOD8_StaticMeshComponent0;                  // 0x07B0 (size: 0x8)
    class UStaticMeshComponent* stool_lod6_StaticMeshComponent0;                      // 0x07B8 (size: 0x8)
    class UStaticMeshComponent* Aset_castle_wall_M_scywx_LOD25_StaticMeshComponent0;  // 0x07C0 (size: 0x8)
    class UStaticMeshComponent* Aset_castle_wall_M_scywx_LOD24_StaticMeshComponent0;  // 0x07C8 (size: 0x8)
    class UStaticMeshComponent* Aset_castle_wall_M_scywx_LOD23_StaticMeshComponent0;  // 0x07D0 (size: 0x8)
    class UStaticMeshComponent* black3_StaticMeshComponent0;                          // 0x07D8 (size: 0x8)
    class UStaticMeshComponent* Aset_castle_wall_M_scywx_LOD13_StaticMeshComponent0;  // 0x07E0 (size: 0x8)
    class UStaticMeshComponent* Aset_castle_wall_M_scywx_LOD12_StaticMeshComponent0;  // 0x07E8 (size: 0x8)
    class UStaticMeshComponent* Aset_castle_wall_M_scywx_LOD11_StaticMeshComponent0;  // 0x07F0 (size: 0x8)
    class UStaticMeshComponent* quoinB_luv87_StaticMeshComponent0;                    // 0x07F8 (size: 0x8)
    class UStaticMeshComponent* quoinArc3_StaticMeshComponent0;                       // 0x0800 (size: 0x8)
    class UStaticMeshComponent* quoinB_luv86_StaticMeshComponent0;                    // 0x0808 (size: 0x8)
    class UStaticMeshComponent* quoinB_luv85_StaticMeshComponent0;                    // 0x0810 (size: 0x8)
    class UStaticMeshComponent* bakerOvenIdk2_StaticMeshComponent0;                   // 0x0818 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short42_StaticMeshComponent0;        // 0x0820 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short41_StaticMeshComponent0;        // 0x0828 (size: 0x8)
    class UStaticMeshComponent* MegaRoofProper4_StaticMeshComponent0;                 // 0x0830 (size: 0x8)
    class UStaticMeshComponent* MegaRoofProper3_StaticMeshComponent0;                 // 0x0838 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short40_StaticMeshComponent0;        // 0x0840 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short39_StaticMeshComponent0;        // 0x0848 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short38_StaticMeshComponent0;        // 0x0850 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short37_StaticMeshComponent0;        // 0x0858 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short36_StaticMeshComponent0;        // 0x0860 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short35_StaticMeshComponent0;        // 0x0868 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short34_StaticMeshComponent0;        // 0x0870 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short33_StaticMeshComponent0;        // 0x0878 (size: 0x8)
    class UStaticMeshComponent* SM_Balk_Medium_20_StaticMeshComponent0;               // 0x0880 (size: 0x8)
    class UStaticMeshComponent* SM_Balk_Medium_19_StaticMeshComponent0;               // 0x0888 (size: 0x8)
    class UStaticMeshComponent* SM_Balk_Medium_18_StaticMeshComponent0;               // 0x0890 (size: 0x8)
    class UStaticMeshComponent* SM_Balk_Medium_17_StaticMeshComponent0;               // 0x0898 (size: 0x8)
    class UStaticMeshComponent* SM_Balk_Medium_16_StaticMeshComponent0;               // 0x08A0 (size: 0x8)
    class USceneComponent* bakeryAttachment2_DefaultSceneRoot;                        // 0x08A8 (size: 0x8)

}; // Size: 0x8B0

#endif
