#ifndef UE4SS_SDK_C_House_LV2_Bpart_A_HPP
#define UE4SS_SDK_C_House_LV2_Bpart_A_HPP

class AC_House_LV2_Bpart_A_C : public AConstructionBP_C
{
    class UStaticMeshComponent* StaticMesh;                                           // 0x0550 (size: 0x8)
    class UStaticMeshComponent* Cube01;                                               // 0x0558 (size: 0x8)
    class UStaticMeshComponent* UBeam_TaperedCutB15_StaticMeshComponent0;             // 0x0560 (size: 0x8)
    class UStaticMeshComponent* UGable_Standard2_StaticMeshComponent0;                // 0x0568 (size: 0x8)
    class UStaticMeshComponent* UGable_Half_Window_Small2_StaticMeshComponent0;       // 0x0570 (size: 0x8)
    class UStaticMeshComponent* WoodRoof_sg_House_LV2_Bpart_A2_StaticMeshComponent0;  // 0x0578 (size: 0x8)
    class UStaticMeshComponent* Foundation_sg_House_LV2_Bpart_A2_StaticMeshComponent0; // 0x0580 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_12_StaticMeshComponent0;               // 0x0588 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_05_Curved_B2_StaticMeshComponent0;     // 0x0590 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardBeveled4_StaticMeshComponent0;       // 0x0598 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardBeveled7_StaticMeshComponent0;       // 0x05A0 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardBeveled8_StaticMeshComponent0;       // 0x05A8 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardBeveled9_StaticMeshComponent0;       // 0x05B0 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardBeveled10_StaticMeshComponent0;      // 0x05B8 (size: 0x8)
    class UStaticMeshComponent* UBeam_windowBoardD_square__longer4_StaticMeshComponent0; // 0x05C0 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardBeveledSharp32_StaticMeshComponent0; // 0x05C8 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardBeveledSharp33_StaticMeshComponent0; // 0x05D0 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardBeveledSharp34_StaticMeshComponent0; // 0x05D8 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardBeveledSharp35_StaticMeshComponent0; // 0x05E0 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardBeveledSharp36_StaticMeshComponent0; // 0x05E8 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardBeveledSharp37_StaticMeshComponent0; // 0x05F0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m4_StaticMeshComponent0;                  // 0x05F8 (size: 0x8)
    class UStaticMeshComponent* doorHeadA_angled2_StaticMeshComponent0;               // 0x0600 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_9_StaticMeshComponent0; // 0x0608 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_10_StaticMeshComponent0; // 0x0610 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_11_StaticMeshComponent0; // 0x0618 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_12_StaticMeshComponent0; // 0x0620 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Tapered_CutE15_StaticMeshComponent0;        // 0x0628 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Tapered_CutE16_StaticMeshComponent0;        // 0x0630 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Tapered_CutE17_StaticMeshComponent0;        // 0x0638 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Tapered_CutE18_StaticMeshComponent0;        // 0x0640 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_13_StaticMeshComponent0; // 0x0648 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_14_StaticMeshComponent0; // 0x0650 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m5_StaticMeshComponent0;                  // 0x0658 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m29_StaticMeshComponent0;                 // 0x0660 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m30_StaticMeshComponent0;                 // 0x0668 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m31_StaticMeshComponent0;                 // 0x0670 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m32_StaticMeshComponent0;                 // 0x0678 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m33_StaticMeshComponent0;                 // 0x0680 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m46_StaticMeshComponent0;                 // 0x0688 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m47_StaticMeshComponent0;                 // 0x0690 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m48_StaticMeshComponent0;                 // 0x0698 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m49_StaticMeshComponent0;                 // 0x06A0 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Tapered_CutE19_StaticMeshComponent0;        // 0x06A8 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Tapered_CutE20_StaticMeshComponent0;        // 0x06B0 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Tapered_CutE21_StaticMeshComponent0;        // 0x06B8 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Tapered_CutE22_StaticMeshComponent0;        // 0x06C0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m50_StaticMeshComponent0;                 // 0x06C8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m51_StaticMeshComponent0;                 // 0x06D0 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed9_StaticMeshComponent0;            // 0x06D8 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed10_StaticMeshComponent0;           // 0x06E0 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed11_StaticMeshComponent0;           // 0x06E8 (size: 0x8)
    class UStaticMeshComponent* planeDenseBeveled_ThinTinyWindow2_StaticMeshComponent0; // 0x06F0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly9_StaticMeshComponent0;     // 0x06F8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly10_StaticMeshComponent0;    // 0x0700 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly11_StaticMeshComponent0;    // 0x0708 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly12_StaticMeshComponent0;    // 0x0710 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly13_StaticMeshComponent0;    // 0x0718 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly14_StaticMeshComponent0;    // 0x0720 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly15_StaticMeshComponent0;    // 0x0728 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly16_StaticMeshComponent0;    // 0x0730 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m52_StaticMeshComponent0;                 // 0x0738 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m53_StaticMeshComponent0;                 // 0x0740 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Tapered_CutE23_StaticMeshComponent0;        // 0x0748 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Tapered_CutE24_StaticMeshComponent0;        // 0x0750 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Tapered_CutE25_StaticMeshComponent0;        // 0x0758 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Tapered_CutE26_StaticMeshComponent0;        // 0x0760 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Tapered_CutE27_StaticMeshComponent0;        // 0x0768 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Tapered_CutE28_StaticMeshComponent0;        // 0x0770 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m54_StaticMeshComponent0;                 // 0x0778 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m55_StaticMeshComponent0;                 // 0x0780 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed12_StaticMeshComponent0;           // 0x0788 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed13_StaticMeshComponent0;           // 0x0790 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed14_StaticMeshComponent0;           // 0x0798 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed15_StaticMeshComponent0;           // 0x07A0 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed16_StaticMeshComponent0;           // 0x07A8 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m14_StaticMeshComponent0;                      // 0x07B0 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m15_StaticMeshComponent0;                      // 0x07B8 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m16_StaticMeshComponent0;                      // 0x07C0 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m17_StaticMeshComponent0;                      // 0x07C8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m6_StaticMeshComponent0;                  // 0x07D0 (size: 0x8)
    class UStaticMeshComponent* UBeam_TaperedCutB12_StaticMeshComponent0;             // 0x07D8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m56_StaticMeshComponent0;                 // 0x07E0 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m5_StaticMeshComponent0;                    // 0x07E8 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m6_StaticMeshComponent0;                    // 0x07F0 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m7_StaticMeshComponent0;                    // 0x07F8 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m8_StaticMeshComponent0;                    // 0x0800 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m18_StaticMeshComponent0;                      // 0x0808 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m19_StaticMeshComponent0;                      // 0x0810 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Narrow5_StaticMeshComponent0;              // 0x0818 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Narrow6_StaticMeshComponent0;              // 0x0820 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Narrow7_StaticMeshComponent0;              // 0x0828 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Narrow8_StaticMeshComponent0;              // 0x0830 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_SingleWindowsTopOnly2_StaticMeshComponent0; // 0x0838 (size: 0x8)
    class UStaticMeshComponent* UBeam_WindowFrame7_StaticMeshComponent0;              // 0x0840 (size: 0x8)
    class UStaticMeshComponent* UBeam_WindowFrame8_StaticMeshComponent0;              // 0x0848 (size: 0x8)
    class UStaticMeshComponent* UBeam_WindowFrame9_StaticMeshComponent0;              // 0x0850 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_TwoWindowsStandard2_StaticMeshComponent0;  // 0x0858 (size: 0x8)
    class UStaticMeshComponent* UBeam_WindowFrame10_StaticMeshComponent0;             // 0x0860 (size: 0x8)
    class UStaticMeshComponent* UBeam_WindowFrame11_StaticMeshComponent0;             // 0x0868 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m57_StaticMeshComponent0;                 // 0x0870 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m58_StaticMeshComponent0;                 // 0x0878 (size: 0x8)
    class UStaticMeshComponent* UBeam_TaperedCutB13_StaticMeshComponent0;             // 0x0880 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m59_StaticMeshComponent0;                 // 0x0888 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m60_StaticMeshComponent0;                 // 0x0890 (size: 0x8)
    class UStaticMeshComponent* UBeam_TaperedCutB14_StaticMeshComponent0;             // 0x0898 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m61_StaticMeshComponent0;                 // 0x08A0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m62_StaticMeshComponent0;                 // 0x08A8 (size: 0x8)
    class UStaticMeshComponent* UBeam_TaperedCutB16_StaticMeshComponent0;             // 0x08B0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m63_StaticMeshComponent0;                 // 0x08B8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m64_StaticMeshComponent0;                 // 0x08C0 (size: 0x8)
    class UStaticMeshComponent* UBeam_TaperedCutB17_StaticMeshComponent0;             // 0x08C8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m65_StaticMeshComponent0;                 // 0x08D0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m66_StaticMeshComponent0;                 // 0x08D8 (size: 0x8)
    class UStaticMeshComponent* UBeam_TaperedCutB18_StaticMeshComponent0;             // 0x08E0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m67_StaticMeshComponent0;                 // 0x08E8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m68_StaticMeshComponent0;                 // 0x08F0 (size: 0x8)
    class UStaticMeshComponent* UBeam_TaperedCutB19_StaticMeshComponent0;             // 0x08F8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m69_StaticMeshComponent0;                 // 0x0900 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m70_StaticMeshComponent0;                 // 0x0908 (size: 0x8)
    class UStaticMeshComponent* UBeam_TaperedCutB20_StaticMeshComponent0;             // 0x0910 (size: 0x8)
    class UStaticMeshComponent* UBeam_TaperedCutB21_StaticMeshComponent0;             // 0x0918 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Standard2_StaticMeshComponent0;            // 0x0920 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_TwoWindowsStandard_Wide2_StaticMeshComponent0; // 0x0928 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m20_StaticMeshComponent0;                      // 0x0930 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m21_StaticMeshComponent0;                      // 0x0938 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m22_StaticMeshComponent0;                      // 0x0940 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m23_StaticMeshComponent0;                      // 0x0948 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m71_StaticMeshComponent0;                 // 0x0950 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m24_StaticMeshComponent0;                      // 0x0958 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m25_StaticMeshComponent0;                      // 0x0960 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m26_StaticMeshComponent0;                      // 0x0968 (size: 0x8)
    class UStaticMeshComponent* UBeam_WindowFrame12_StaticMeshComponent0;             // 0x0970 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardBeveledSharp38_StaticMeshComponent0; // 0x0978 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardBeveledSharp39_StaticMeshComponent0; // 0x0980 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardBeveledSharp40_StaticMeshComponent0; // 0x0988 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardBeveledSharp41_StaticMeshComponent0; // 0x0990 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardBeveledSharp42_StaticMeshComponent0; // 0x0998 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardBeveledSharp43_StaticMeshComponent0; // 0x09A0 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardBeveledSharp44_StaticMeshComponent0; // 0x09A8 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardBeveledSharp45_StaticMeshComponent0; // 0x09B0 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardBeveledSharp46_StaticMeshComponent0; // 0x09B8 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardBeveledSharp47_StaticMeshComponent0; // 0x09C0 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardBeveledSharp48_StaticMeshComponent0; // 0x09C8 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardBeveledSharp49_StaticMeshComponent0; // 0x09D0 (size: 0x8)
    class UStaticMeshComponent* UBeam_windowBoardD_square__longer5_StaticMeshComponent0; // 0x09D8 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardBeveledSharp50_StaticMeshComponent0; // 0x09E0 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardBeveledSharp51_StaticMeshComponent0; // 0x09E8 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardBeveledSharp52_StaticMeshComponent0; // 0x09F0 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardBeveledSharp53_StaticMeshComponent0; // 0x09F8 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardBeveledSharp54_StaticMeshComponent0; // 0x0A00 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardBeveledSharp55_StaticMeshComponent0; // 0x0A08 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardBeveledSharp56_StaticMeshComponent0; // 0x0A10 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardBeveledSharp57_StaticMeshComponent0; // 0x0A18 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardBeveledSharp58_StaticMeshComponent0; // 0x0A20 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardBeveledSharp59_StaticMeshComponent0; // 0x0A28 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardBeveledSharp60_StaticMeshComponent0; // 0x0A30 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardBeveledSharp61_StaticMeshComponent0; // 0x0A38 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardBeveledSharp62_StaticMeshComponent0; // 0x0A40 (size: 0x8)
    class UStaticMeshComponent* UBeam_TaperedCutB22_StaticMeshComponent0;             // 0x0A48 (size: 0x8)
    class USceneComponent* C_House_LV2_Bpart_A_DefaultSceneRoot;                      // 0x0A50 (size: 0x8)

}; // Size: 0xA58

#endif
