#ifndef UE4SS_SDK_C_SG_CommunalOven_HPP
#define UE4SS_SDK_C_SG_CommunalOven_HPP

class AC_SG_CommunalOven_C : public AConstructionBP_C
{
    class UStaticMeshComponent* SG_Oven_Roof2_StaticMeshComponent0;                   // 0x0550 (size: 0x8)
    class UStaticMeshComponent* roofSingleDisplaced3_StaticMeshComponent0;            // 0x0558 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m110_StaticMeshComponent0;                // 0x0560 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly76_StaticMeshComponent0;    // 0x0568 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly75_StaticMeshComponent0;    // 0x0570 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short71_StaticMeshComponent0;        // 0x0578 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short70_StaticMeshComponent0;        // 0x0580 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed22_StaticMeshComponent0;           // 0x0588 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed21_StaticMeshComponent0;           // 0x0590 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed20_StaticMeshComponent0;           // 0x0598 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed19_StaticMeshComponent0;           // 0x05A0 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed18_StaticMeshComponent0;           // 0x05A8 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed17_StaticMeshComponent0;           // 0x05B0 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed16_StaticMeshComponent0;           // 0x05B8 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed15_StaticMeshComponent0;           // 0x05C0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly74_StaticMeshComponent0;    // 0x05C8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly73_StaticMeshComponent0;    // 0x05D0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly72_StaticMeshComponent0;    // 0x05D8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly71_StaticMeshComponent0;    // 0x05E0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly70_StaticMeshComponent0;    // 0x05E8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly69_StaticMeshComponent0;    // 0x05F0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly68_StaticMeshComponent0;    // 0x05F8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly67_StaticMeshComponent0;    // 0x0600 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly66_StaticMeshComponent0;    // 0x0608 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly65_StaticMeshComponent0;    // 0x0610 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly64_StaticMeshComponent0;    // 0x0618 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly63_StaticMeshComponent0;    // 0x0620 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_57_StaticMeshComponent0; // 0x0628 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_56_StaticMeshComponent0; // 0x0630 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_55_StaticMeshComponent0; // 0x0638 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_54_StaticMeshComponent0; // 0x0640 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_53_StaticMeshComponent0; // 0x0648 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_52_StaticMeshComponent0; // 0x0650 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_51_StaticMeshComponent0; // 0x0658 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_50_StaticMeshComponent0; // 0x0660 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth_tapered47_StaticMeshComponent0;   // 0x0668 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m109_StaticMeshComponent0;                // 0x0670 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m108_StaticMeshComponent0;                // 0x0678 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth_tapered46_StaticMeshComponent0;   // 0x0680 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth_tapered45_StaticMeshComponent0;   // 0x0688 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m107_StaticMeshComponent0;                // 0x0690 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m106_StaticMeshComponent0;                // 0x0698 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth_tapered44_StaticMeshComponent0;   // 0x06A0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth_tapered43_StaticMeshComponent0;   // 0x06A8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m105_StaticMeshComponent0;                // 0x06B0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m104_StaticMeshComponent0;                // 0x06B8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth_tapered42_StaticMeshComponent0;   // 0x06C0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth_tapered41_StaticMeshComponent0;   // 0x06C8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m103_StaticMeshComponent0;                // 0x06D0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m63_StaticMeshComponent0;                 // 0x06D8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth_tapered40_StaticMeshComponent0;   // 0x06E0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth_tapered39_StaticMeshComponent0;   // 0x06E8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m62_StaticMeshComponent0;                 // 0x06F0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m61_StaticMeshComponent0;                 // 0x06F8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth_tapered38_StaticMeshComponent0;   // 0x0700 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m60_StaticMeshComponent0;                 // 0x0708 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m59_StaticMeshComponent0;                 // 0x0710 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short69_StaticMeshComponent0;        // 0x0718 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short68_StaticMeshComponent0;        // 0x0720 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short67_StaticMeshComponent0;        // 0x0728 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short66_StaticMeshComponent0;        // 0x0730 (size: 0x8)
    class USceneComponent* Actor4_DefaultSceneRoot;                                   // 0x0738 (size: 0x8)

}; // Size: 0x740

#endif
