#ifndef UE4SS_SDK_C_SG_Manor_Lv1_Palace_Ubeam_HPP
#define UE4SS_SDK_C_SG_Manor_Lv1_Palace_Ubeam_HPP

class AC_SG_Manor_Lv1_Palace_Ubeam_C : public AConstructionBP_C
{
    class UStaticMeshComponent* UDaubPlane_Narrow6_StaticMeshComponent1;              // 0x0550 (size: 0x8)
    class UStaticMeshComponent* SG_PlatformBoardingDinkyDingShort3_StaticMeshComponent0; // 0x0558 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_109_StaticMeshComponent0; // 0x0560 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_108_StaticMeshComponent0; // 0x0568 (size: 0x8)
    class UStaticMeshComponent* sg_fillerBoardB40_StaticMeshComponent0;               // 0x0570 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA26_StaticMeshComponent0;               // 0x0578 (size: 0x8)
    class UStaticMeshComponent* sg_fillerBoardB39_StaticMeshComponent0;               // 0x0580 (size: 0x8)
    class UStaticMeshComponent* SG_PlatformBoardingDinkyDingShort4_StaticMeshComponent0; // 0x0588 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short58_StaticMeshComponent0;        // 0x0590 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short57_StaticMeshComponent0;        // 0x0598 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short56_StaticMeshComponent0;        // 0x05A0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short55_StaticMeshComponent0;        // 0x05A8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short54_StaticMeshComponent0;        // 0x05B0 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA25_StaticMeshComponent0;               // 0x05B8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth121_StaticMeshComponent0;          // 0x05C0 (size: 0x8)
    class UStaticMeshComponent* SG_StairStepTriangularA42_StaticMeshComponent0;       // 0x05C8 (size: 0x8)
    class UStaticMeshComponent* SG_StairStepTriangularA41_StaticMeshComponent0;       // 0x05D0 (size: 0x8)
    class UStaticMeshComponent* SG_StairStepTriangularA40_StaticMeshComponent0;       // 0x05D8 (size: 0x8)
    class UStaticMeshComponent* SG_StairStepTriangularA39_StaticMeshComponent0;       // 0x05E0 (size: 0x8)
    class UStaticMeshComponent* SG_StairStepTriangularA38_StaticMeshComponent0;       // 0x05E8 (size: 0x8)
    class UStaticMeshComponent* SG_StairStepTriangularA37_StaticMeshComponent0;       // 0x05F0 (size: 0x8)
    class UStaticMeshComponent* SG_StairStepTriangularA36_StaticMeshComponent0;       // 0x05F8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth119_StaticMeshComponent0;          // 0x0600 (size: 0x8)
    class UStaticMeshComponent* SG_StairStepTriangularA34_StaticMeshComponent0;       // 0x0608 (size: 0x8)
    class UStaticMeshComponent* SG_StairStepTriangularA33_StaticMeshComponent0;       // 0x0610 (size: 0x8)
    class UStaticMeshComponent* SG_StairStepTriangularA32_StaticMeshComponent0;       // 0x0618 (size: 0x8)
    class UStaticMeshComponent* SG_StairStepTriangularA31_StaticMeshComponent0;       // 0x0620 (size: 0x8)
    class UStaticMeshComponent* SG_StairStepTriangularA30_StaticMeshComponent0;       // 0x0628 (size: 0x8)
    class UStaticMeshComponent* SG_StairStepTriangularA29_StaticMeshComponent0;       // 0x0630 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth120_StaticMeshComponent0;          // 0x0638 (size: 0x8)
    class UStaticMeshComponent* SG_StairStepTriangularA35_StaticMeshComponent0;       // 0x0640 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA28_StaticMeshComponent0;               // 0x0648 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA27_StaticMeshComponent0;               // 0x0650 (size: 0x8)
    class UStaticMeshComponent* sg_fillerBoardB41_StaticMeshComponent0;               // 0x0658 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth127_StaticMeshComponent0;          // 0x0660 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth126_StaticMeshComponent0;          // 0x0668 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth125_StaticMeshComponent0;          // 0x0670 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth124_StaticMeshComponent0;          // 0x0678 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth123_StaticMeshComponent0;          // 0x0680 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth122_StaticMeshComponent0;          // 0x0688 (size: 0x8)
    class UStaticMeshComponent* roof_palace_lv1_ubeam2_StaticMeshComponent0;          // 0x0690 (size: 0x8)
    class UStaticMeshComponent* Foundation_DoorStepStoneFlat2_StaticMeshComponent0;   // 0x0698 (size: 0x8)
    class UStaticMeshComponent* sg_woodenGableA6_StaticMeshComponent0;                // 0x06A0 (size: 0x8)
    class UStaticMeshComponent* PlaneDenseWindowSlotsA_wider4_StaticMeshComponent0;   // 0x06A8 (size: 0x8)
    class UStaticMeshComponent* Foundation_Palace_lv1_ubeam2_StaticMeshComponent0;    // 0x06B0 (size: 0x8)
    class UStaticMeshComponent* Cube4_StaticMeshComponent0;                           // 0x06B8 (size: 0x8)
    class UStaticMeshComponent* Cube3_StaticMeshComponent0;                           // 0x06C0 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Narrow6_StaticMeshComponent0;              // 0x06C8 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Narrow5_StaticMeshComponent0;              // 0x06D0 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Narrow4_StaticMeshComponent0;              // 0x06D8 (size: 0x8)
    class UStaticMeshComponent* sg_WallRough_D38_StaticMeshComponent0;                // 0x06E0 (size: 0x8)
    class UStaticMeshComponent* sg_WallRough_D37_StaticMeshComponent0;                // 0x06E8 (size: 0x8)
    class UStaticMeshComponent* sg_WallRough_D36_StaticMeshComponent0;                // 0x06F0 (size: 0x8)
    class UStaticMeshComponent* sg_WallRough_D35_StaticMeshComponent0;                // 0x06F8 (size: 0x8)
    class UStaticMeshComponent* sg_WallRough_D34_StaticMeshComponent0;                // 0x0700 (size: 0x8)
    class UStaticMeshComponent* sg_WallRough_D33_StaticMeshComponent0;                // 0x0708 (size: 0x8)
    class UStaticMeshComponent* sg_WallRough_D32_StaticMeshComponent0;                // 0x0710 (size: 0x8)
    class UStaticMeshComponent* sg_WallRough_D31_StaticMeshComponent0;                // 0x0718 (size: 0x8)
    class UStaticMeshComponent* sg_WallRough_D30_StaticMeshComponent0;                // 0x0720 (size: 0x8)
    class UStaticMeshComponent* sg_WallRough_D29_StaticMeshComponent0;                // 0x0728 (size: 0x8)
    class UStaticMeshComponent* sg_WallRough_D28_StaticMeshComponent0;                // 0x0730 (size: 0x8)
    class UStaticMeshComponent* sg_WallRough_D27_StaticMeshComponent0;                // 0x0738 (size: 0x8)
    class UStaticMeshComponent* sg_WallRough_D6_StaticMeshComponent0;                 // 0x0740 (size: 0x8)
    class UStaticMeshComponent* sg_WallRough_D26_StaticMeshComponent0;                // 0x0748 (size: 0x8)
    class UStaticMeshComponent* sg_WallRough_D25_StaticMeshComponent0;                // 0x0750 (size: 0x8)
    class UStaticMeshComponent* sg_WallRough_D24_StaticMeshComponent0;                // 0x0758 (size: 0x8)
    class UStaticMeshComponent* sg_WallRough_D23_StaticMeshComponent0;                // 0x0760 (size: 0x8)
    class UStaticMeshComponent* sg_WallRough_D22_StaticMeshComponent0;                // 0x0768 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short61_StaticMeshComponent0;        // 0x0770 (size: 0x8)
    class UStaticMeshComponent* PlaneDenseCorner12_StaticMeshComponent0;              // 0x0778 (size: 0x8)
    class UStaticMeshComponent* PlaneDenseCorner11_StaticMeshComponent0;              // 0x0780 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_127_StaticMeshComponent0; // 0x0788 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_126_StaticMeshComponent0; // 0x0790 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_125_StaticMeshComponent0; // 0x0798 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_124_StaticMeshComponent0; // 0x07A0 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_123_StaticMeshComponent0; // 0x07A8 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_122_StaticMeshComponent0; // 0x07B0 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_121_StaticMeshComponent0; // 0x07B8 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_120_StaticMeshComponent0; // 0x07C0 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_119_StaticMeshComponent0; // 0x07C8 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_118_StaticMeshComponent0; // 0x07D0 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_117_StaticMeshComponent0; // 0x07D8 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_116_StaticMeshComponent0; // 0x07E0 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_115_StaticMeshComponent0; // 0x07E8 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_114_StaticMeshComponent0; // 0x07F0 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_113_StaticMeshComponent0; // 0x07F8 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_112_StaticMeshComponent0; // 0x0800 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_111_StaticMeshComponent0; // 0x0808 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_110_StaticMeshComponent0; // 0x0810 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short60_StaticMeshComponent0;        // 0x0818 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short59_StaticMeshComponent0;        // 0x0820 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Tapered_CutB37_StaticMeshComponent0;        // 0x0828 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Tapered_CutB36_StaticMeshComponent0;        // 0x0830 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Tapered_CutB35_StaticMeshComponent0;        // 0x0838 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Tapered_CutB34_StaticMeshComponent0;        // 0x0840 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Tapered_CutB33_StaticMeshComponent0;        // 0x0848 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Tapered_CutB32_StaticMeshComponent0;        // 0x0850 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Tapered_CutB31_StaticMeshComponent0;        // 0x0858 (size: 0x8)
    class UStaticMeshComponent* DormerWindowPremade_V6_StaticMeshComponent0;          // 0x0860 (size: 0x8)
    class UStaticMeshComponent* DormerWindowPremade_V5_StaticMeshComponent0;          // 0x0868 (size: 0x8)
    class UStaticMeshComponent* DormerWindowPremade_V4_StaticMeshComponent0;          // 0x0870 (size: 0x8)
    class UStaticMeshComponent* ChimneyLP2_StaticMeshComponent0;                      // 0x0878 (size: 0x8)
    class USceneComponent* stairs2_DefaultSceneRoot;                                  // 0x0880 (size: 0x8)
    class USceneComponent* stair_platform2_DefaultSceneRoot;                          // 0x0888 (size: 0x8)
    class UStaticMeshComponent* sg_shutterA10_StaticMeshComponent0;                   // 0x0890 (size: 0x8)
    class UStaticMeshComponent* sg_shutterA9_StaticMeshComponent0;                    // 0x0898 (size: 0x8)
    class UStaticMeshComponent* sg_shutterA8_StaticMeshComponent0;                    // 0x08A0 (size: 0x8)
    class UStaticMeshComponent* sg_shutterA7_StaticMeshComponent0;                    // 0x08A8 (size: 0x8)
    class UStaticMeshComponent* sg_shutterA6_StaticMeshComponent0;                    // 0x08B0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly95_StaticMeshComponent0;    // 0x08B8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly94_StaticMeshComponent0;    // 0x08C0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly93_StaticMeshComponent0;    // 0x08C8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly92_StaticMeshComponent0;    // 0x08D0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly91_StaticMeshComponent0;    // 0x08D8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly90_StaticMeshComponent0;    // 0x08E0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly89_StaticMeshComponent0;    // 0x08E8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly88_StaticMeshComponent0;    // 0x08F0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly87_StaticMeshComponent0;    // 0x08F8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly86_StaticMeshComponent0;    // 0x0900 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly85_StaticMeshComponent0;    // 0x0908 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly84_StaticMeshComponent0;    // 0x0910 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly83_StaticMeshComponent0;    // 0x0918 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly82_StaticMeshComponent0;    // 0x0920 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly81_StaticMeshComponent0;    // 0x0928 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly80_StaticMeshComponent0;    // 0x0930 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly79_StaticMeshComponent0;    // 0x0938 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly78_StaticMeshComponent0;    // 0x0940 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly77_StaticMeshComponent0;    // 0x0948 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly76_StaticMeshComponent0;    // 0x0950 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly75_StaticMeshComponent0;    // 0x0958 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly74_StaticMeshComponent0;    // 0x0960 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly73_StaticMeshComponent0;    // 0x0968 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly72_StaticMeshComponent0;    // 0x0970 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly71_StaticMeshComponent0;    // 0x0978 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly70_StaticMeshComponent0;    // 0x0980 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly69_StaticMeshComponent0;    // 0x0988 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly68_StaticMeshComponent0;    // 0x0990 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly67_StaticMeshComponent0;    // 0x0998 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly66_StaticMeshComponent0;    // 0x09A0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly65_StaticMeshComponent0;    // 0x09A8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly64_StaticMeshComponent0;    // 0x09B0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly63_StaticMeshComponent0;    // 0x09B8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly62_StaticMeshComponent0;    // 0x09C0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly61_StaticMeshComponent0;    // 0x09C8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly60_StaticMeshComponent0;    // 0x09D0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly59_StaticMeshComponent0;    // 0x09D8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly58_StaticMeshComponent0;    // 0x09E0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly57_StaticMeshComponent0;    // 0x09E8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly56_StaticMeshComponent0;    // 0x09F0 (size: 0x8)
    class UStaticMeshComponent* sg_WallRough_D5_StaticMeshComponent0;                 // 0x09F8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth118_StaticMeshComponent0;          // 0x0A00 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth117_StaticMeshComponent0;          // 0x0A08 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth116_StaticMeshComponent0;          // 0x0A10 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth115_StaticMeshComponent0;          // 0x0A18 (size: 0x8)
    class UStaticMeshComponent* PlaneDenseCorner10_StaticMeshComponent0;              // 0x0A20 (size: 0x8)
    class UStaticMeshComponent* PlaneDenseCorner9_StaticMeshComponent0;               // 0x0A28 (size: 0x8)
    class UStaticMeshComponent* PlaneDenseWindowSlotsA_wider3_StaticMeshComponent0;   // 0x0A30 (size: 0x8)
    class UStaticMeshComponent* PlaneDenseCorner8_StaticMeshComponent0;               // 0x0A38 (size: 0x8)
    class UStaticMeshComponent* PlaneDenseCorner7_StaticMeshComponent0;               // 0x0A40 (size: 0x8)
    class UStaticMeshComponent* PlaneDenseWindowSingleWide2_StaticMeshComponent0;     // 0x0A48 (size: 0x8)
    class UStaticMeshComponent* PlaneDenseWindowSlotsA_v2_Bevel_Taller2_StaticMeshComponent0; // 0x0A50 (size: 0x8)
    class UStaticMeshComponent* manorWindowPlanks_Carved_5_StaticMeshComponent0;      // 0x0A58 (size: 0x8)
    class UStaticMeshComponent* sg_fillerBoardB38_StaticMeshComponent0;               // 0x0A60 (size: 0x8)
    class UStaticMeshComponent* sg_fillerBoardB37_StaticMeshComponent0;               // 0x0A68 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA24_StaticMeshComponent0;               // 0x0A70 (size: 0x8)
    class UStaticMeshComponent* sg_fillerBoardB36_StaticMeshComponent0;               // 0x0A78 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA23_StaticMeshComponent0;               // 0x0A80 (size: 0x8)
    class UStaticMeshComponent* manorWindowPlanks_Carved2_StaticMeshComponent0;       // 0x0A88 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardA22_StaticMeshComponent0;               // 0x0A90 (size: 0x8)
    class UStaticMeshComponent* PlaneDenseWindowPaintedSingleNarrow2_StaticMeshComponent0; // 0x0A98 (size: 0x8)
    class UStaticMeshComponent* PlaneDenseWindowSlotsB2_StaticMeshComponent0;         // 0x0AA0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth114_StaticMeshComponent0;          // 0x0AA8 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Tapered_CutB30_StaticMeshComponent0;        // 0x0AB0 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_107_StaticMeshComponent0; // 0x0AB8 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_106_StaticMeshComponent0; // 0x0AC0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth113_StaticMeshComponent0;          // 0x0AC8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth112_StaticMeshComponent0;          // 0x0AD0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth111_StaticMeshComponent0;          // 0x0AD8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth110_StaticMeshComponent0;          // 0x0AE0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth109_StaticMeshComponent0;          // 0x0AE8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth108_StaticMeshComponent0;          // 0x0AF0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth107_StaticMeshComponent0;          // 0x0AF8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth106_StaticMeshComponent0;          // 0x0B00 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth105_StaticMeshComponent0;          // 0x0B08 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth104_StaticMeshComponent0;          // 0x0B10 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth103_StaticMeshComponent0;          // 0x0B18 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth102_StaticMeshComponent0;          // 0x0B20 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth101_StaticMeshComponent0;          // 0x0B28 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth100_StaticMeshComponent0;          // 0x0B30 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short53_StaticMeshComponent0;        // 0x0B38 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short52_StaticMeshComponent0;        // 0x0B40 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short51_StaticMeshComponent0;        // 0x0B48 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short50_StaticMeshComponent0;        // 0x0B50 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth99_StaticMeshComponent0;           // 0x0B58 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth98_StaticMeshComponent0;           // 0x0B60 (size: 0x8)
    class UStaticMeshComponent* sg_woodenGableA5_StaticMeshComponent0;                // 0x0B68 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth97_StaticMeshComponent0;           // 0x0B70 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth96_StaticMeshComponent0;           // 0x0B78 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth95_StaticMeshComponent0;           // 0x0B80 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth94_StaticMeshComponent0;           // 0x0B88 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_105_StaticMeshComponent0; // 0x0B90 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_104_StaticMeshComponent0; // 0x0B98 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Tapered_CutB29_StaticMeshComponent0;        // 0x0BA0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth93_StaticMeshComponent0;           // 0x0BA8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth92_StaticMeshComponent0;           // 0x0BB0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short49_StaticMeshComponent0;        // 0x0BB8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short48_StaticMeshComponent0;        // 0x0BC0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth91_StaticMeshComponent0;           // 0x0BC8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth90_StaticMeshComponent0;           // 0x0BD0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short47_StaticMeshComponent0;        // 0x0BD8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth89_StaticMeshComponent0;           // 0x0BE0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth88_StaticMeshComponent0;           // 0x0BE8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short46_StaticMeshComponent0;        // 0x0BF0 (size: 0x8)
    class UStaticMeshComponent* doorHeadA_angled2_StaticMeshComponent0;               // 0x0BF8 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_103_StaticMeshComponent0; // 0x0C00 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_102_StaticMeshComponent0; // 0x0C08 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_101_StaticMeshComponent0; // 0x0C10 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_100_StaticMeshComponent0; // 0x0C18 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Tapered_CutB28_StaticMeshComponent0;        // 0x0C20 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Tapered_CutB27_StaticMeshComponent0;        // 0x0C28 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Tapered_CutB26_StaticMeshComponent0;        // 0x0C30 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Tapered_CutB25_StaticMeshComponent0;        // 0x0C38 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Tapered_CutB24_StaticMeshComponent0;        // 0x0C40 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Tapered_CutB23_StaticMeshComponent0;        // 0x0C48 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Tapered_CutB22_StaticMeshComponent0;        // 0x0C50 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Tapered_CutB21_StaticMeshComponent0;        // 0x0C58 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_99_StaticMeshComponent0; // 0x0C60 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_98_StaticMeshComponent0; // 0x0C68 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_97_StaticMeshComponent0; // 0x0C70 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_96_StaticMeshComponent0; // 0x0C78 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_95_StaticMeshComponent0; // 0x0C80 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_94_StaticMeshComponent0; // 0x0C88 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_93_StaticMeshComponent0; // 0x0C90 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_92_StaticMeshComponent0; // 0x0C98 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_91_StaticMeshComponent0; // 0x0CA0 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_90_StaticMeshComponent0; // 0x0CA8 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_89_StaticMeshComponent0; // 0x0CB0 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_88_StaticMeshComponent0; // 0x0CB8 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_87_StaticMeshComponent0; // 0x0CC0 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_86_StaticMeshComponent0; // 0x0CC8 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Tapered_CutB20_StaticMeshComponent0;        // 0x0CD0 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_85_StaticMeshComponent0; // 0x0CD8 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_84_StaticMeshComponent0; // 0x0CE0 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_83_StaticMeshComponent0; // 0x0CE8 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_82_StaticMeshComponent0; // 0x0CF0 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_81_StaticMeshComponent0; // 0x0CF8 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_80_StaticMeshComponent0; // 0x0D00 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_79_StaticMeshComponent0; // 0x0D08 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_78_StaticMeshComponent0; // 0x0D10 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_77_StaticMeshComponent0; // 0x0D18 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_76_StaticMeshComponent0; // 0x0D20 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_75_StaticMeshComponent0; // 0x0D28 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth87_StaticMeshComponent0;           // 0x0D30 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth86_StaticMeshComponent0;           // 0x0D38 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth85_StaticMeshComponent0;           // 0x0D40 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth55_StaticMeshComponent0;           // 0x0D48 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short45_StaticMeshComponent0;        // 0x0D50 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth54_StaticMeshComponent0;           // 0x0D58 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth53_StaticMeshComponent0;           // 0x0D60 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth52_StaticMeshComponent0;           // 0x0D68 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth51_StaticMeshComponent0;           // 0x0D70 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short44_StaticMeshComponent0;        // 0x0D78 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short43_StaticMeshComponent0;        // 0x0D80 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short42_StaticMeshComponent0;        // 0x0D88 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short41_StaticMeshComponent0;        // 0x0D90 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short40_StaticMeshComponent0;        // 0x0D98 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short39_StaticMeshComponent0;        // 0x0DA0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short38_StaticMeshComponent0;        // 0x0DA8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short37_StaticMeshComponent0;        // 0x0DB0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short36_StaticMeshComponent0;        // 0x0DB8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short35_StaticMeshComponent0;        // 0x0DC0 (size: 0x8)
    class USceneComponent* palace_lv1_ubeam2_DefaultSceneRoot;                        // 0x0DC8 (size: 0x8)

}; // Size: 0xDD0

#endif
