#ifndef UE4SS_SDK_C_SG_Tanner_LV1_Ubeam_HPP
#define UE4SS_SDK_C_SG_Tanner_LV1_Ubeam_HPP

class AC_SG_Tanner_LV1_Ubeam_C : public AConstructionBP_C
{
    class UStaticMeshComponent* Foundation_SG_Tanner_LV1_Ubeam2_StaticMeshComponent0; // 0x0550 (size: 0x8)
    class UStaticMeshComponent* ThatchRoof_SG_Tanner_LV1_Ubeam2_StaticMeshComponent0; // 0x0558 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m_rough10_StaticMeshComponent0;             // 0x0560 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m_rough11_StaticMeshComponent0;             // 0x0568 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m_rough12_StaticMeshComponent0;             // 0x0570 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m_rough13_StaticMeshComponent0;             // 0x0578 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m_rough14_StaticMeshComponent0;             // 0x0580 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m_rough15_StaticMeshComponent0;             // 0x0588 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m_rough16_StaticMeshComponent0;             // 0x0590 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m_rough17_StaticMeshComponent0;             // 0x0598 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m4_StaticMeshComponent0;                       // 0x05A0 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m5_StaticMeshComponent0;                       // 0x05A8 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m6_StaticMeshComponent0;                       // 0x05B0 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_17_StaticMeshComponent0;               // 0x05B8 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_18_StaticMeshComponent0;               // 0x05C0 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_19_StaticMeshComponent0;               // 0x05C8 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_20_StaticMeshComponent0;               // 0x05D0 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_21_StaticMeshComponent0;               // 0x05D8 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_22_StaticMeshComponent0;               // 0x05E0 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_23_StaticMeshComponent0;               // 0x05E8 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_24_StaticMeshComponent0;               // 0x05F0 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_25_StaticMeshComponent0;               // 0x05F8 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_26_StaticMeshComponent0;               // 0x0600 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_27_StaticMeshComponent0;               // 0x0608 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_28_StaticMeshComponent0;               // 0x0610 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_29_StaticMeshComponent0;               // 0x0618 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_30_StaticMeshComponent0;               // 0x0620 (size: 0x8)
    class UStaticMeshComponent* UBeam_TaperedCutB7_StaticMeshComponent0;              // 0x0628 (size: 0x8)
    class UStaticMeshComponent* UBeam_TaperedCutB8_StaticMeshComponent0;              // 0x0630 (size: 0x8)
    class UStaticMeshComponent* UBeam_TaperedCutB9_StaticMeshComponent0;              // 0x0638 (size: 0x8)
    class UStaticMeshComponent* UBeam_TaperedCutB10_StaticMeshComponent0;             // 0x0640 (size: 0x8)
    class UStaticMeshComponent* UBeam_TaperedCutB11_StaticMeshComponent0;             // 0x0648 (size: 0x8)
    class UStaticMeshComponent* UBeam_TaperedCutB12_StaticMeshComponent0;             // 0x0650 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m16_StaticMeshComponent0;                      // 0x0658 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m17_StaticMeshComponent0;                      // 0x0660 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m18_StaticMeshComponent0;                      // 0x0668 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m19_StaticMeshComponent0;                      // 0x0670 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m20_StaticMeshComponent0;                      // 0x0678 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m21_StaticMeshComponent0;                      // 0x0680 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m22_StaticMeshComponent0;                      // 0x0688 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m23_StaticMeshComponent0;                      // 0x0690 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m24_StaticMeshComponent0;                      // 0x0698 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m25_StaticMeshComponent0;                      // 0x06A0 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m26_StaticMeshComponent0;                      // 0x06A8 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m27_StaticMeshComponent0;                      // 0x06B0 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m28_StaticMeshComponent0;                      // 0x06B8 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m29_StaticMeshComponent0;                      // 0x06C0 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m30_StaticMeshComponent0;                      // 0x06C8 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m_rough18_StaticMeshComponent0;             // 0x06D0 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg20_StaticMeshComponent0;     // 0x06D8 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg21_StaticMeshComponent0;     // 0x06E0 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg22_StaticMeshComponent0;     // 0x06E8 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg23_StaticMeshComponent0;     // 0x06F0 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg24_StaticMeshComponent0;     // 0x06F8 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg25_StaticMeshComponent0;     // 0x0700 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg26_StaticMeshComponent0;     // 0x0708 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg27_StaticMeshComponent0;     // 0x0710 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg28_StaticMeshComponent0;     // 0x0718 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg29_StaticMeshComponent0;     // 0x0720 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg30_StaticMeshComponent0;     // 0x0728 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg31_StaticMeshComponent0;     // 0x0730 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg32_StaticMeshComponent0;     // 0x0738 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg33_StaticMeshComponent0;     // 0x0740 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg34_StaticMeshComponent0;     // 0x0748 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg35_StaticMeshComponent0;     // 0x0750 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg36_StaticMeshComponent0;     // 0x0758 (size: 0x8)
    class UStaticMeshComponent* UDaub_Standard_TwoWindowsKitchen6_StaticMeshComponent0; // 0x0760 (size: 0x8)
    class UStaticMeshComponent* UDaub_Standard_TwoWindowsKitchen7_StaticMeshComponent0; // 0x0768 (size: 0x8)
    class UStaticMeshComponent* UDaub_Standard_TwoWindowsKitchen8_StaticMeshComponent0; // 0x0770 (size: 0x8)
    class UStaticMeshComponent* UDaub_Standard_TwoWindowsKitchen9_StaticMeshComponent0; // 0x0778 (size: 0x8)
    class UStaticMeshComponent* UBeam_DoorHeadA_StandardUnifiedMat2_StaticMeshComponent0; // 0x0780 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA14_StaticMeshComponent0;            // 0x0788 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA15_StaticMeshComponent0;            // 0x0790 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA16_StaticMeshComponent0;            // 0x0798 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA17_StaticMeshComponent0;            // 0x07A0 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA18_StaticMeshComponent0;            // 0x07A8 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA19_StaticMeshComponent0;            // 0x07B0 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA20_StaticMeshComponent0;            // 0x07B8 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA21_StaticMeshComponent0;            // 0x07C0 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA22_StaticMeshComponent0;            // 0x07C8 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA23_StaticMeshComponent0;            // 0x07D0 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA24_StaticMeshComponent0;            // 0x07D8 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA25_StaticMeshComponent0;            // 0x07E0 (size: 0x8)
    class UStaticMeshComponent* UDaub_Standard_TwoWindowsKitchen10_StaticMeshComponent0; // 0x07E8 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA26_StaticMeshComponent0;            // 0x07F0 (size: 0x8)
    class UStaticMeshComponent* UBeam_WindowFrame6_StaticMeshComponent0;              // 0x07F8 (size: 0x8)
    class UStaticMeshComponent* UBeam_WindowFrame7_StaticMeshComponent0;              // 0x0800 (size: 0x8)
    class UStaticMeshComponent* UBeam_WindowFrame8_StaticMeshComponent0;              // 0x0808 (size: 0x8)
    class UStaticMeshComponent* UBeam_WindowFrame9_StaticMeshComponent0;              // 0x0810 (size: 0x8)
    class UStaticMeshComponent* UBeam_WindowFrame10_StaticMeshComponent0;             // 0x0818 (size: 0x8)
    class UStaticMeshComponent* UBeam_Strut_Wonky8_StaticMeshComponent0;              // 0x0820 (size: 0x8)
    class UStaticMeshComponent* UBeam_Strut_Wonky9_StaticMeshComponent0;              // 0x0828 (size: 0x8)
    class UStaticMeshComponent* UBeam_Strut_Straight2_StaticMeshComponent0;           // 0x0830 (size: 0x8)
    class UStaticMeshComponent* UBeam_Strut_Wonky10_StaticMeshComponent0;             // 0x0838 (size: 0x8)
    class UStaticMeshComponent* UBeam_Strut_Wonky11_StaticMeshComponent0;             // 0x0840 (size: 0x8)
    class UStaticMeshComponent* UBeam_Strut_Wonky12_StaticMeshComponent0;             // 0x0848 (size: 0x8)
    class UStaticMeshComponent* UBeam_Strut_Wonky13_StaticMeshComponent0;             // 0x0850 (size: 0x8)
    class UStaticMeshComponent* UBeam_Strut_Wonky14_StaticMeshComponent0;             // 0x0858 (size: 0x8)
    class UStaticMeshComponent* FakeInterior2_StaticMeshComponent0;                   // 0x0860 (size: 0x8)
    class UStaticMeshComponent* UGable_Bottom2_StaticMeshComponent0;                  // 0x0868 (size: 0x8)
    class UStaticMeshComponent* UGable_Top2_StaticMeshComponent0;                     // 0x0870 (size: 0x8)
    class UStaticMeshComponent* rope_dangling5_StaticMeshComponent0;                  // 0x0878 (size: 0x8)
    class UStaticMeshComponent* rope_dangling6_StaticMeshComponent0;                  // 0x0880 (size: 0x8)
    class UStaticMeshComponent* SM_Rope_6_StaticMeshComponent0;                       // 0x0888 (size: 0x8)
    class UStaticMeshComponent* SM_Rope_7_StaticMeshComponent0;                       // 0x0890 (size: 0x8)
    class UStaticMeshComponent* UBeam_Shutter2_StaticMeshComponent0;                  // 0x0898 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardB5_StaticMeshComponent0;             // 0x08A0 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardB6_StaticMeshComponent0;             // 0x08A8 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardB7_StaticMeshComponent0;             // 0x08B0 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardB8_StaticMeshComponent0;             // 0x08B8 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_31_StaticMeshComponent0;               // 0x08C0 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg37_StaticMeshComponent0;     // 0x08C8 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg38_StaticMeshComponent0;     // 0x08D0 (size: 0x8)
    class USceneComponent* C_SG_Tanner_LV1_Ubeam_DefaultSceneRoot;                    // 0x08D8 (size: 0x8)

}; // Size: 0x8E0

#endif
