#ifndef UE4SS_SDK_C_SG_Sawpit_Ubeam_HPP
#define UE4SS_SDK_C_SG_Sawpit_Ubeam_HPP

class AC_SG_Sawpit_Ubeam_C : public AConstructionBP_C
{
    class UStaticMeshComponent* sg_peg55_StaticMeshComponent0;                        // 0x0550 (size: 0x8)
    class UStaticMeshComponent* sg_peg54_StaticMeshComponent0;                        // 0x0558 (size: 0x8)
    class UStaticMeshComponent* sg_peg53_StaticMeshComponent0;                        // 0x0560 (size: 0x8)
    class UStaticMeshComponent* sg_peg52_StaticMeshComponent0;                        // 0x0568 (size: 0x8)
    class UStaticMeshComponent* RopeWrapped3_StaticMeshComponent0;                    // 0x0570 (size: 0x8)
    class UStaticMeshComponent* sg_ubeam_gable_planks4_StaticMeshComponent0;          // 0x0578 (size: 0x8)
    class UStaticMeshComponent* sg_ubeam_gable_planks3_StaticMeshComponent0;          // 0x0580 (size: 0x8)
    class UStaticMeshComponent* sg_WallRough_A80_StaticMeshComponent0;                // 0x0588 (size: 0x8)
    class UStaticMeshComponent* sg_WallRough_A79_StaticMeshComponent0;                // 0x0590 (size: 0x8)
    class UStaticMeshComponent* sg_WallRough_A78_StaticMeshComponent0;                // 0x0598 (size: 0x8)
    class UStaticMeshComponent* sg_WallRough_A77_StaticMeshComponent0;                // 0x05A0 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise_Beveled118_StaticMeshComponent0;      // 0x05A8 (size: 0x8)
    class UStaticMeshComponent* sg_WallRough_A76_StaticMeshComponent0;                // 0x05B0 (size: 0x8)
    class UStaticMeshComponent* sg_WallRough_A75_StaticMeshComponent0;                // 0x05B8 (size: 0x8)
    class UStaticMeshComponent* sg_WallRough_A74_StaticMeshComponent0;                // 0x05C0 (size: 0x8)
    class UStaticMeshComponent* sg_WallRough_A73_StaticMeshComponent0;                // 0x05C8 (size: 0x8)
    class UStaticMeshComponent* sg_WallRough_A72_StaticMeshComponent0;                // 0x05D0 (size: 0x8)
    class UStaticMeshComponent* sg_WallRough_A71_StaticMeshComponent0;                // 0x05D8 (size: 0x8)
    class UStaticMeshComponent* sg_WallRough_A70_StaticMeshComponent0;                // 0x05E0 (size: 0x8)
    class UStaticMeshComponent* sg_WallRough_A69_StaticMeshComponent0;                // 0x05E8 (size: 0x8)
    class UStaticMeshComponent* sg_WallRough_A68_StaticMeshComponent0;                // 0x05F0 (size: 0x8)
    class UStaticMeshComponent* sg_WallRough_A67_StaticMeshComponent0;                // 0x05F8 (size: 0x8)
    class UStaticMeshComponent* sg_WallRough_A66_StaticMeshComponent0;                // 0x0600 (size: 0x8)
    class UStaticMeshComponent* sg_WallRough_A65_StaticMeshComponent0;                // 0x0608 (size: 0x8)
    class UStaticMeshComponent* sg_WallRough_A23_StaticMeshComponent0;                // 0x0610 (size: 0x8)
    class UStaticMeshComponent* sg_WallRough_A64_StaticMeshComponent0;                // 0x0618 (size: 0x8)
    class UStaticMeshComponent* sg_WallRough_A63_StaticMeshComponent0;                // 0x0620 (size: 0x8)
    class UStaticMeshComponent* sg_WallRough_A22_StaticMeshComponent0;                // 0x0628 (size: 0x8)
    class UStaticMeshComponent* sg_WallRough_A62_StaticMeshComponent0;                // 0x0630 (size: 0x8)
    class UStaticMeshComponent* sg_WallRough_A61_StaticMeshComponent0;                // 0x0638 (size: 0x8)
    class UStaticMeshComponent* sg_WallRough_A21_StaticMeshComponent0;                // 0x0640 (size: 0x8)
    class UStaticMeshComponent* sg_WallRough_A60_StaticMeshComponent0;                // 0x0648 (size: 0x8)
    class UStaticMeshComponent* sg_WallRough_A59_StaticMeshComponent0;                // 0x0650 (size: 0x8)
    class UStaticMeshComponent* sg_WallRough_A20_StaticMeshComponent0;                // 0x0658 (size: 0x8)
    class UStaticMeshComponent* sg_WallRough_A58_StaticMeshComponent0;                // 0x0660 (size: 0x8)
    class UStaticMeshComponent* sg_WallRough_A57_StaticMeshComponent0;                // 0x0668 (size: 0x8)
    class UStaticMeshComponent* sg_WallRough_A19_StaticMeshComponent0;                // 0x0670 (size: 0x8)
    class UStaticMeshComponent* sg_WallRough_A18_StaticMeshComponent0;                // 0x0678 (size: 0x8)
    class UStaticMeshComponent* sg_WallRough_A17_StaticMeshComponent0;                // 0x0680 (size: 0x8)
    class UStaticMeshComponent* sg_peg51_StaticMeshComponent0;                        // 0x0688 (size: 0x8)
    class UStaticMeshComponent* sg_peg50_StaticMeshComponent0;                        // 0x0690 (size: 0x8)
    class UStaticMeshComponent* sg_peg49_StaticMeshComponent0;                        // 0x0698 (size: 0x8)
    class UStaticMeshComponent* sawpit_roof2_StaticMeshComponent0;                    // 0x06A0 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_37_StaticMeshComponent0; // 0x06A8 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_36_StaticMeshComponent0; // 0x06B0 (size: 0x8)
    class UStaticMeshComponent* sg_peg48_StaticMeshComponent0;                        // 0x06B8 (size: 0x8)
    class UStaticMeshComponent* sg_peg47_StaticMeshComponent0;                        // 0x06C0 (size: 0x8)
    class UStaticMeshComponent* sg_peg46_StaticMeshComponent0;                        // 0x06C8 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_35_StaticMeshComponent0; // 0x06D0 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_34_StaticMeshComponent0; // 0x06D8 (size: 0x8)
    class UStaticMeshComponent* sg_peg45_StaticMeshComponent0;                        // 0x06E0 (size: 0x8)
    class UStaticMeshComponent* sg_peg44_StaticMeshComponent0;                        // 0x06E8 (size: 0x8)
    class UStaticMeshComponent* sg_peg43_StaticMeshComponent0;                        // 0x06F0 (size: 0x8)
    class UStaticMeshComponent* sg_peg42_StaticMeshComponent0;                        // 0x06F8 (size: 0x8)
    class UStaticMeshComponent* sg_peg29_StaticMeshComponent0;                        // 0x0700 (size: 0x8)
    class UStaticMeshComponent* sg_peg28_StaticMeshComponent0;                        // 0x0708 (size: 0x8)
    class UStaticMeshComponent* sg_peg26_StaticMeshComponent0;                        // 0x0710 (size: 0x8)
    class UStaticMeshComponent* sg_peg24_StaticMeshComponent0;                        // 0x0718 (size: 0x8)
    class UStaticMeshComponent* sg_peg21_StaticMeshComponent0;                        // 0x0720 (size: 0x8)
    class UStaticMeshComponent* sg_peg19_StaticMeshComponent0;                        // 0x0728 (size: 0x8)
    class UStaticMeshComponent* sg_peg17_StaticMeshComponent0;                        // 0x0730 (size: 0x8)
    class UStaticMeshComponent* sg_peg14_StaticMeshComponent0;                        // 0x0738 (size: 0x8)
    class UStaticMeshComponent* sg_peg11_StaticMeshComponent0;                        // 0x0740 (size: 0x8)
    class UStaticMeshComponent* sg_peg10_StaticMeshComponent0;                        // 0x0748 (size: 0x8)
    class UStaticMeshComponent* sg_peg7_StaticMeshComponent0;                         // 0x0750 (size: 0x8)
    class UStaticMeshComponent* sg_peg6_StaticMeshComponent0;                         // 0x0758 (size: 0x8)
    class UStaticMeshComponent* sg_peg2_StaticMeshComponent0;                         // 0x0760 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise_Beveled117_StaticMeshComponent0;      // 0x0768 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise_Beveled116_StaticMeshComponent0;      // 0x0770 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise_Beveled115_StaticMeshComponent0;      // 0x0778 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise_Beveled114_StaticMeshComponent0;      // 0x0780 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise_Beveled113_StaticMeshComponent0;      // 0x0788 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise_Beveled112_StaticMeshComponent0;      // 0x0790 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise_Beveled111_StaticMeshComponent0;      // 0x0798 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise_Beveled110_StaticMeshComponent0;      // 0x07A0 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise_Beveled109_StaticMeshComponent0;      // 0x07A8 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise_Beveled108_StaticMeshComponent0;      // 0x07B0 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise_Beveled107_StaticMeshComponent0;      // 0x07B8 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise_Beveled106_StaticMeshComponent0;      // 0x07C0 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise_Beveled105_StaticMeshComponent0;      // 0x07C8 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise_Beveled104_StaticMeshComponent0;      // 0x07D0 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise_Beveled103_StaticMeshComponent0;      // 0x07D8 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise_Beveled102_StaticMeshComponent0;      // 0x07E0 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise_Beveled101_StaticMeshComponent0;      // 0x07E8 (size: 0x8)
    class UStaticMeshComponent* roofSingleDisplaced4_StaticMeshComponent0;            // 0x07F0 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_33_StaticMeshComponent0; // 0x07F8 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_32_StaticMeshComponent0; // 0x0800 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise_Beveled100_StaticMeshComponent0;      // 0x0808 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_31_StaticMeshComponent0; // 0x0810 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_30_StaticMeshComponent0; // 0x0818 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_29_StaticMeshComponent0; // 0x0820 (size: 0x8)
    class UStaticMeshComponent* sg_WallRough_A56_StaticMeshComponent0;                // 0x0828 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise_Beveled99_StaticMeshComponent0;       // 0x0830 (size: 0x8)
    class UStaticMeshComponent* sg_woodenGableAHalf2_StaticMeshComponent0;            // 0x0838 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_28_StaticMeshComponent0; // 0x0840 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_27_StaticMeshComponent0; // 0x0848 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_26_StaticMeshComponent0; // 0x0850 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_16_StaticMeshComponent0; // 0x0858 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_15_StaticMeshComponent0; // 0x0860 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_14_StaticMeshComponent0; // 0x0868 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_13_StaticMeshComponent0; // 0x0870 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_12_StaticMeshComponent0; // 0x0878 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_11_StaticMeshComponent0; // 0x0880 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise_Beveled98_StaticMeshComponent0;       // 0x0888 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise_Beveled97_StaticMeshComponent0;       // 0x0890 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise_Beveled96_StaticMeshComponent0;       // 0x0898 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise_Beveled95_StaticMeshComponent0;       // 0x08A0 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise_Beveled94_StaticMeshComponent0;       // 0x08A8 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise_Beveled93_StaticMeshComponent0;       // 0x08B0 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise_Beveled92_StaticMeshComponent0;       // 0x08B8 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise_Beveled91_StaticMeshComponent0;       // 0x08C0 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise_Beveled90_StaticMeshComponent0;       // 0x08C8 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise_Beveled89_StaticMeshComponent0;       // 0x08D0 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise_Beveled88_StaticMeshComponent0;       // 0x08D8 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise_Beveled87_StaticMeshComponent0;       // 0x08E0 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise_Beveled86_StaticMeshComponent0;       // 0x08E8 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise_Beveled85_StaticMeshComponent0;       // 0x08F0 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise_Beveled84_StaticMeshComponent0;       // 0x08F8 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise_Beveled83_StaticMeshComponent0;       // 0x0900 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise_Beveled82_StaticMeshComponent0;       // 0x0908 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise_Beveled81_StaticMeshComponent0;       // 0x0910 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise_Beveled80_StaticMeshComponent0;       // 0x0918 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise_Beveled79_StaticMeshComponent0;       // 0x0920 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise_Beveled78_StaticMeshComponent0;       // 0x0928 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise_Beveled77_StaticMeshComponent0;       // 0x0930 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise_Beveled76_StaticMeshComponent0;       // 0x0938 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise_Beveled75_StaticMeshComponent0;       // 0x0940 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise_Beveled74_StaticMeshComponent0;       // 0x0948 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise_Beveled73_StaticMeshComponent0;       // 0x0950 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise_Beveled72_StaticMeshComponent0;       // 0x0958 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise_Beveled71_StaticMeshComponent0;       // 0x0960 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise_Beveled70_StaticMeshComponent0;       // 0x0968 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise_Beveled69_StaticMeshComponent0;       // 0x0970 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise_Beveled68_StaticMeshComponent0;       // 0x0978 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise_Beveled67_StaticMeshComponent0;       // 0x0980 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise_Beveled66_StaticMeshComponent0;       // 0x0988 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise_Beveled65_StaticMeshComponent0;       // 0x0990 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise_Beveled64_StaticMeshComponent0;       // 0x0998 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise_Beveled63_StaticMeshComponent0;       // 0x09A0 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise_Beveled62_StaticMeshComponent0;       // 0x09A8 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise_Beveled61_StaticMeshComponent0;       // 0x09B0 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise_Beveled60_StaticMeshComponent0;       // 0x09B8 (size: 0x8)
    class UStaticMeshComponent* sg_WallRough_A16_StaticMeshComponent0;                // 0x09C0 (size: 0x8)
    class USceneComponent* sawpit_ubeam2_DefaultSceneRoot;                            // 0x09C8 (size: 0x8)

}; // Size: 0x9D0

#endif
