#ifndef UE4SS_SDK_C_SG_FancyFenceSegment_HPP
#define UE4SS_SDK_C_SG_FancyFenceSegment_HPP

class AC_SG_FancyFenceSegment_C : public AConstructionBP_C
{
    class UStaticMeshComponent* Common_Spruce_Branch_LOD5_uehjahtfa119_StaticMeshComponent0; // 0x0550 (size: 0x8)
    class UStaticMeshComponent* Common_Spruce_Branch_LOD5_uehjahtfa120_StaticMeshComponent0; // 0x0558 (size: 0x8)
    class UStaticMeshComponent* Common_Spruce_Branch_LOD5_uehjahtfa121_StaticMeshComponent0; // 0x0560 (size: 0x8)
    class UStaticMeshComponent* Common_Spruce_Branch_LOD5_uehjahtfa122_StaticMeshComponent0; // 0x0568 (size: 0x8)
    class UStaticMeshComponent* Common_Spruce_Branch_LOD5_uehjahtfa123_StaticMeshComponent0; // 0x0570 (size: 0x8)
    class UStaticMeshComponent* Common_Spruce_Branch_LOD5_uehjahtfa124_StaticMeshComponent0; // 0x0578 (size: 0x8)
    class UStaticMeshComponent* Common_Spruce_Branch_LOD5_uehjahtfa125_StaticMeshComponent0; // 0x0580 (size: 0x8)
    class UStaticMeshComponent* sg_fancyFence_StaticMeshComponent0;                   // 0x0588 (size: 0x8)
    class USceneComponent* SharedRoot;                                                // 0x0590 (size: 0x8)

}; // Size: 0x598

#endif
