#ifndef UE4SS_SDK_C_SG_Gate_Lv2_HPP
#define UE4SS_SDK_C_SG_Gate_Lv2_HPP

class AC_SG_Gate_Lv2_C : public AConstructionBP_C
{
    class UStaticMeshComponent* diag3;                                                // 0x0550 (size: 0x8)
    class UStaticMeshComponent* diag2;                                                // 0x0558 (size: 0x8)
    class UStaticMeshComponent* diag1;                                                // 0x0560 (size: 0x8)
    class UStaticMeshComponent* diag;                                                 // 0x0568 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise75_StaticMeshComponent0;               // 0x0570 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise74_StaticMeshComponent0;               // 0x0578 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise73_StaticMeshComponent0;               // 0x0580 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise72_StaticMeshComponent0;               // 0x0588 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise71_StaticMeshComponent0;               // 0x0590 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise70_StaticMeshComponent0;               // 0x0598 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise69_StaticMeshComponent0;               // 0x05A0 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise68_StaticMeshComponent0;               // 0x05A8 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise67_StaticMeshComponent0;               // 0x05B0 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise66_StaticMeshComponent0;               // 0x05B8 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise65_StaticMeshComponent0;               // 0x05C0 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise64_StaticMeshComponent0;               // 0x05C8 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise63_StaticMeshComponent0;               // 0x05D0 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Noise62_StaticMeshComponent0;               // 0x05D8 (size: 0x8)
    class USceneComponent* sg_gate_lv3_DefaultSceneRoot;                              // 0x05E0 (size: 0x8)

}; // Size: 0x5E8

#endif
