#ifndef UE4SS_SDK_C_SG_ShedC_Higher_Ubeam_HPP
#define UE4SS_SDK_C_SG_ShedC_Higher_Ubeam_HPP

class AC_SG_ShedC_Higher_Ubeam_C : public AConstructionBP_C
{
    class UStaticMeshComponent* UBeam_FillerBoardA_Lowpoly16_StaticMeshComponent0;    // 0x0550 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA_Lowpoly15_StaticMeshComponent0;    // 0x0558 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA_Lowpoly14_StaticMeshComponent0;    // 0x0560 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA_Lowpoly13_StaticMeshComponent0;    // 0x0568 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA_Lowpoly12_StaticMeshComponent0;    // 0x0570 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA_Lowpoly11_StaticMeshComponent0;    // 0x0578 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA_Lowpoly10_StaticMeshComponent0;    // 0x0580 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA_Lowpoly9_StaticMeshComponent0;     // 0x0588 (size: 0x8)
    class UStaticMeshComponent* ropeKnotA4_StaticMeshComponent0;                      // 0x0590 (size: 0x8)
    class UStaticMeshComponent* ropeKnotA3_StaticMeshComponent0;                      // 0x0598 (size: 0x8)
    class UStaticMeshComponent* Modular_Fence_3_M_LOD5_ufflaitdw_8_StaticMeshComponent0; // 0x05A0 (size: 0x8)
    class UStaticMeshComponent* Modular_Fence_3_M_LOD5_ufflaitdw_7_StaticMeshComponent0; // 0x05A8 (size: 0x8)
    class UStaticMeshComponent* Modular_Fence_3_M_LOD5_ufflaitdw_6_StaticMeshComponent0; // 0x05B0 (size: 0x8)
    class UStaticMeshComponent* Modular_Fence_3_M_LOD5_ufflaitdw_5_StaticMeshComponent0; // 0x05B8 (size: 0x8)
    class UStaticMeshComponent* Modular_Fence_3_M_LOD5_ufflaitdw_1_Ultralong8_StaticMeshComponent0; // 0x05C0 (size: 0x8)
    class UStaticMeshComponent* Modular_Fence_3_M_LOD5_ufflaitdw_1_Ultralong7_StaticMeshComponent0; // 0x05C8 (size: 0x8)
    class UStaticMeshComponent* Modular_Fence_3_M_LOD5_ufflaitdw_1_Ultralong6_StaticMeshComponent0; // 0x05D0 (size: 0x8)
    class UStaticMeshComponent* Modular_Fence_3_M_LOD5_ufflaitdw_1_Ultralong5_StaticMeshComponent0; // 0x05D8 (size: 0x8)
    class USceneComponent* C_SG_ShedC_Higher_Ubeam2_DefaultSceneRoot;                 // 0x05E0 (size: 0x8)

}; // Size: 0x5E8

#endif
