#ifndef UE4SS_SDK_C_SG_Cottage_LV2_C_UBeam_HPP
#define UE4SS_SDK_C_SG_Cottage_LV2_C_UBeam_HPP

class AC_SG_Cottage_LV2_C_UBeam_C : public AConstructionBP_C
{
    class UStaticMeshComponent* Box02;                                                // 0x0550 (size: 0x8)
    class UStaticMeshComponent* Box01;                                                // 0x0558 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short25_StaticMeshComponent1;        // 0x0560 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m184_StaticMeshComponent0;                // 0x0568 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m183_StaticMeshComponent0;                // 0x0570 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m182_StaticMeshComponent0;                // 0x0578 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m181_StaticMeshComponent0;                // 0x0580 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m180_StaticMeshComponent0;                // 0x0588 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m179_StaticMeshComponent0;                // 0x0590 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m178_StaticMeshComponent0;                // 0x0598 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m177_StaticMeshComponent0;                // 0x05A0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m176_StaticMeshComponent0;                // 0x05A8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m175_StaticMeshComponent0;                // 0x05B0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m174_StaticMeshComponent0;                // 0x05B8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m173_StaticMeshComponent0;                // 0x05C0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m172_StaticMeshComponent0;                // 0x05C8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m171_StaticMeshComponent0;                // 0x05D0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m170_StaticMeshComponent0;                // 0x05D8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m169_StaticMeshComponent0;                // 0x05E0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m168_StaticMeshComponent0;                // 0x05E8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m167_StaticMeshComponent0;                // 0x05F0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m166_StaticMeshComponent0;                // 0x05F8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m165_StaticMeshComponent0;                // 0x0600 (size: 0x8)
    class UStaticMeshComponent* Foundation_House_Lv2_C2_StaticMeshComponent0;         // 0x0608 (size: 0x8)
    class UStaticMeshComponent* planeDenseBeveledA67_StaticMeshComponent0;            // 0x0610 (size: 0x8)
    class UStaticMeshComponent* PlaneDenseWindowsWidePainted13_StaticMeshComponent0;  // 0x0618 (size: 0x8)
    class UStaticMeshComponent* planeDenseBeveledA66_StaticMeshComponent0;            // 0x0620 (size: 0x8)
    class UStaticMeshComponent* planeDenseBeveledA65_StaticMeshComponent0;            // 0x0628 (size: 0x8)
    class UStaticMeshComponent* planeDenseBeveledA64_StaticMeshComponent0;            // 0x0630 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m164_StaticMeshComponent0;                // 0x0638 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m163_StaticMeshComponent0;                // 0x0640 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m162_StaticMeshComponent0;                // 0x0648 (size: 0x8)
    class UStaticMeshComponent* planeDenseBeveledA63_StaticMeshComponent0;            // 0x0650 (size: 0x8)
    class UStaticMeshComponent* planeDenseBeveledA62_StaticMeshComponent0;            // 0x0658 (size: 0x8)
    class UStaticMeshComponent* planeDenseBeveledA61_StaticMeshComponent0;            // 0x0660 (size: 0x8)
    class UStaticMeshComponent* PlaneDenseWindowsWidePainted12_StaticMeshComponent0;  // 0x0668 (size: 0x8)
    class UStaticMeshComponent* PlaneDenseWindowsWidePainted11_StaticMeshComponent0;  // 0x0670 (size: 0x8)
    class UStaticMeshComponent* planeDenseBeveledA60_StaticMeshComponent0;            // 0x0678 (size: 0x8)
    class UStaticMeshComponent* planeDenseBeveledA59_StaticMeshComponent0;            // 0x0680 (size: 0x8)
    class UStaticMeshComponent* planeDenseBeveledA58_StaticMeshComponent0;            // 0x0688 (size: 0x8)
    class UStaticMeshComponent* planeDenseBeveledA57_StaticMeshComponent0;            // 0x0690 (size: 0x8)
    class UStaticMeshComponent* planeDenseBeveledA56_StaticMeshComponent0;            // 0x0698 (size: 0x8)
    class UStaticMeshComponent* planeDenseBeveledA55_StaticMeshComponent0;            // 0x06A0 (size: 0x8)
    class UStaticMeshComponent* planeDenseBeveledA54_StaticMeshComponent0;            // 0x06A8 (size: 0x8)
    class UStaticMeshComponent* planeDenseBeveledA53_StaticMeshComponent0;            // 0x06B0 (size: 0x8)
    class UStaticMeshComponent* planeDenseBeveledA52_StaticMeshComponent0;            // 0x06B8 (size: 0x8)
    class UStaticMeshComponent* planeDenseBeveledA51_StaticMeshComponent0;            // 0x06C0 (size: 0x8)
    class UStaticMeshComponent* planeDenseBeveledA50_StaticMeshComponent0;            // 0x06C8 (size: 0x8)
    class UStaticMeshComponent* planeDenseBeveledA49_StaticMeshComponent0;            // 0x06D0 (size: 0x8)
    class UStaticMeshComponent* planeDenseBeveledA48_StaticMeshComponent0;            // 0x06D8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m161_StaticMeshComponent0;                // 0x06E0 (size: 0x8)
    class UStaticMeshComponent* planeDenseBeveledA47_StaticMeshComponent0;            // 0x06E8 (size: 0x8)
    class UStaticMeshComponent* planeDenseBeveledA25_StaticMeshComponent0;            // 0x06F0 (size: 0x8)
    class UStaticMeshComponent* planeDenseBeveledA24_StaticMeshComponent0;            // 0x06F8 (size: 0x8)
    class UStaticMeshComponent* planeDenseBeveledA23_StaticMeshComponent0;            // 0x0700 (size: 0x8)
    class UStaticMeshComponent* planeDenseBeveledA22_StaticMeshComponent0;            // 0x0708 (size: 0x8)
    class UStaticMeshComponent* PlaneDenseWindowsWidePainted10_StaticMeshComponent0;  // 0x0710 (size: 0x8)
    class UStaticMeshComponent* PlaneDenseWindowsWidePainted9_StaticMeshComponent0;   // 0x0718 (size: 0x8)
    class UStaticMeshComponent* sg_peg130_StaticMeshComponent0;                       // 0x0720 (size: 0x8)
    class UStaticMeshComponent* sg_peg129_StaticMeshComponent0;                       // 0x0728 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_125_StaticMeshComponent0; // 0x0730 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_124_StaticMeshComponent0; // 0x0738 (size: 0x8)
    class UStaticMeshComponent* roofSideTaxCollector4_StaticMeshComponent0;           // 0x0740 (size: 0x8)
    class UStaticMeshComponent* roofSideTaxCollector3_StaticMeshComponent0;           // 0x0748 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m160_StaticMeshComponent0;                // 0x0750 (size: 0x8)
    class UStaticMeshComponent* sg_peg128_StaticMeshComponent0;                       // 0x0758 (size: 0x8)
    class UStaticMeshComponent* sg_peg127_StaticMeshComponent0;                       // 0x0760 (size: 0x8)
    class UStaticMeshComponent* sg_peg126_StaticMeshComponent0;                       // 0x0768 (size: 0x8)
    class UStaticMeshComponent* sg_peg125_StaticMeshComponent0;                       // 0x0770 (size: 0x8)
    class UStaticMeshComponent* sg_woodenGableA2_StaticMeshComponent0;                // 0x0778 (size: 0x8)
    class UStaticMeshComponent* sg_peg124_StaticMeshComponent0;                       // 0x0780 (size: 0x8)
    class UStaticMeshComponent* sg_peg123_StaticMeshComponent0;                       // 0x0788 (size: 0x8)
    class UStaticMeshComponent* sg_shutterA12_StaticMeshComponent0;                   // 0x0790 (size: 0x8)
    class UStaticMeshComponent* sg_peg122_StaticMeshComponent0;                       // 0x0798 (size: 0x8)
    class UStaticMeshComponent* sg_peg121_StaticMeshComponent0;                       // 0x07A0 (size: 0x8)
    class UStaticMeshComponent* sg_peg120_StaticMeshComponent0;                       // 0x07A8 (size: 0x8)
    class UStaticMeshComponent* sg_peg119_StaticMeshComponent0;                       // 0x07B0 (size: 0x8)
    class UStaticMeshComponent* sg_peg118_StaticMeshComponent0;                       // 0x07B8 (size: 0x8)
    class UStaticMeshComponent* sg_peg117_StaticMeshComponent0;                       // 0x07C0 (size: 0x8)
    class UStaticMeshComponent* sg_peg116_StaticMeshComponent0;                       // 0x07C8 (size: 0x8)
    class UStaticMeshComponent* sg_peg115_StaticMeshComponent0;                       // 0x07D0 (size: 0x8)
    class UStaticMeshComponent* sg_peg114_StaticMeshComponent0;                       // 0x07D8 (size: 0x8)
    class UStaticMeshComponent* sg_peg113_StaticMeshComponent0;                       // 0x07E0 (size: 0x8)
    class UStaticMeshComponent* sg_peg112_StaticMeshComponent0;                       // 0x07E8 (size: 0x8)
    class UStaticMeshComponent* sg_peg111_StaticMeshComponent0;                       // 0x07F0 (size: 0x8)
    class UStaticMeshComponent* sg_peg110_StaticMeshComponent0;                       // 0x07F8 (size: 0x8)
    class UStaticMeshComponent* sg_peg109_StaticMeshComponent0;                       // 0x0800 (size: 0x8)
    class UStaticMeshComponent* sg_peg108_StaticMeshComponent0;                       // 0x0808 (size: 0x8)
    class UStaticMeshComponent* sg_peg107_StaticMeshComponent0;                       // 0x0810 (size: 0x8)
    class UStaticMeshComponent* sg_peg106_StaticMeshComponent0;                       // 0x0818 (size: 0x8)
    class UStaticMeshComponent* sg_peg105_StaticMeshComponent0;                       // 0x0820 (size: 0x8)
    class UStaticMeshComponent* sg_peg104_StaticMeshComponent0;                       // 0x0828 (size: 0x8)
    class UStaticMeshComponent* sg_peg103_StaticMeshComponent0;                       // 0x0830 (size: 0x8)
    class UStaticMeshComponent* sg_peg102_StaticMeshComponent0;                       // 0x0838 (size: 0x8)
    class UStaticMeshComponent* sg_peg101_StaticMeshComponent0;                       // 0x0840 (size: 0x8)
    class UStaticMeshComponent* sg_peg100_StaticMeshComponent0;                       // 0x0848 (size: 0x8)
    class UStaticMeshComponent* sg_peg99_StaticMeshComponent0;                        // 0x0850 (size: 0x8)
    class UStaticMeshComponent* sg_peg98_StaticMeshComponent0;                        // 0x0858 (size: 0x8)
    class UStaticMeshComponent* sg_peg97_StaticMeshComponent0;                        // 0x0860 (size: 0x8)
    class UStaticMeshComponent* sg_peg96_StaticMeshComponent0;                        // 0x0868 (size: 0x8)
    class UStaticMeshComponent* sg_peg95_StaticMeshComponent0;                        // 0x0870 (size: 0x8)
    class UStaticMeshComponent* sg_peg94_StaticMeshComponent0;                        // 0x0878 (size: 0x8)
    class UStaticMeshComponent* sg_peg93_StaticMeshComponent0;                        // 0x0880 (size: 0x8)
    class UStaticMeshComponent* sg_peg92_StaticMeshComponent0;                        // 0x0888 (size: 0x8)
    class UStaticMeshComponent* sg_peg91_StaticMeshComponent0;                        // 0x0890 (size: 0x8)
    class UStaticMeshComponent* sg_peg90_StaticMeshComponent0;                        // 0x0898 (size: 0x8)
    class UStaticMeshComponent* sg_peg89_StaticMeshComponent0;                        // 0x08A0 (size: 0x8)
    class UStaticMeshComponent* sg_peg88_StaticMeshComponent0;                        // 0x08A8 (size: 0x8)
    class UStaticMeshComponent* sg_peg87_StaticMeshComponent0;                        // 0x08B0 (size: 0x8)
    class UStaticMeshComponent* sg_peg86_StaticMeshComponent0;                        // 0x08B8 (size: 0x8)
    class UStaticMeshComponent* sg_peg85_StaticMeshComponent0;                        // 0x08C0 (size: 0x8)
    class UStaticMeshComponent* sg_peg84_StaticMeshComponent0;                        // 0x08C8 (size: 0x8)
    class UStaticMeshComponent* sg_chimneyTop2_StaticMeshComponent0;                  // 0x08D0 (size: 0x8)
    class UStaticMeshComponent* ChimneyLP2_StaticMeshComponent0;                      // 0x08D8 (size: 0x8)
    class UStaticMeshComponent* sg_shutterA_short10_StaticMeshComponent0;             // 0x08E0 (size: 0x8)
    class UStaticMeshComponent* sg_shutterA11_StaticMeshComponent0;                   // 0x08E8 (size: 0x8)
    class UStaticMeshComponent* sg_shutterA10_StaticMeshComponent0;                   // 0x08F0 (size: 0x8)
    class UStaticMeshComponent* sg_shutterA9_StaticMeshComponent0;                    // 0x08F8 (size: 0x8)
    class UStaticMeshComponent* sg_shutterA_short9_StaticMeshComponent0;              // 0x0900 (size: 0x8)
    class UStaticMeshComponent* sg_shutterA_short8_StaticMeshComponent0;              // 0x0908 (size: 0x8)
    class UStaticMeshComponent* sg_shutterA8_StaticMeshComponent0;                    // 0x0910 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_123_StaticMeshComponent0; // 0x0918 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m159_StaticMeshComponent0;                // 0x0920 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m158_StaticMeshComponent0;                // 0x0928 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m157_StaticMeshComponent0;                // 0x0930 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m156_StaticMeshComponent0;                // 0x0938 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m155_StaticMeshComponent0;                // 0x0940 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m154_StaticMeshComponent0;                // 0x0948 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m153_StaticMeshComponent0;                // 0x0950 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m152_StaticMeshComponent0;                // 0x0958 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m151_StaticMeshComponent0;                // 0x0960 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m150_StaticMeshComponent0;                // 0x0968 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_122_StaticMeshComponent0; // 0x0970 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_121_StaticMeshComponent0; // 0x0978 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_120_StaticMeshComponent0; // 0x0980 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m149_StaticMeshComponent0;                // 0x0988 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m148_StaticMeshComponent0;                // 0x0990 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_119_StaticMeshComponent0; // 0x0998 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_118_StaticMeshComponent0; // 0x09A0 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_117_StaticMeshComponent0; // 0x09A8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short40_StaticMeshComponent0;        // 0x09B0 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardC_thinner_25_StaticMeshComponent0;      // 0x09B8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m147_StaticMeshComponent0;                // 0x09C0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m146_StaticMeshComponent0;                // 0x09C8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m145_StaticMeshComponent0;                // 0x09D0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m144_StaticMeshComponent0;                // 0x09D8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m143_StaticMeshComponent0;                // 0x09E0 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_116_StaticMeshComponent0; // 0x09E8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m142_StaticMeshComponent0;                // 0x09F0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m141_StaticMeshComponent0;                // 0x09F8 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_115_StaticMeshComponent0; // 0x0A00 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m140_StaticMeshComponent0;                // 0x0A08 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m139_StaticMeshComponent0;                // 0x0A10 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m138_StaticMeshComponent0;                // 0x0A18 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m137_StaticMeshComponent0;                // 0x0A20 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m136_StaticMeshComponent0;                // 0x0A28 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m135_StaticMeshComponent0;                // 0x0A30 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m134_StaticMeshComponent0;                // 0x0A38 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m133_StaticMeshComponent0;                // 0x0A40 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m132_StaticMeshComponent0;                // 0x0A48 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m131_StaticMeshComponent0;                // 0x0A50 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m130_StaticMeshComponent0;                // 0x0A58 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m129_StaticMeshComponent0;                // 0x0A60 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m128_StaticMeshComponent0;                // 0x0A68 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m127_StaticMeshComponent0;                // 0x0A70 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m126_StaticMeshComponent0;                // 0x0A78 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m125_StaticMeshComponent0;                // 0x0A80 (size: 0x8)
    class UStaticMeshComponent* planeDenseBeveledA21_StaticMeshComponent0;            // 0x0A88 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardC_thinner_24_StaticMeshComponent0;      // 0x0A90 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardC_thinner_23_StaticMeshComponent0;      // 0x0A98 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardC_thinner_22_StaticMeshComponent0;      // 0x0AA0 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardC_thinner_21_StaticMeshComponent0;      // 0x0AA8 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardC_thinner_20_StaticMeshComponent0;      // 0x0AB0 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardC_thinner_19_StaticMeshComponent0;      // 0x0AB8 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardC_thinner_18_StaticMeshComponent0;      // 0x0AC0 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardC_thinner_17_StaticMeshComponent0;      // 0x0AC8 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardC_thinner_16_StaticMeshComponent0;      // 0x0AD0 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardC_thinner_15_StaticMeshComponent0;      // 0x0AD8 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardC_thinner_14_StaticMeshComponent0;      // 0x0AE0 (size: 0x8)
    class UStaticMeshComponent* planeDenseBeveledA20_StaticMeshComponent0;            // 0x0AE8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m124_StaticMeshComponent0;                // 0x0AF0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m123_StaticMeshComponent0;                // 0x0AF8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m122_StaticMeshComponent0;                // 0x0B00 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m121_StaticMeshComponent0;                // 0x0B08 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short39_StaticMeshComponent0;        // 0x0B10 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short38_StaticMeshComponent0;        // 0x0B18 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m120_StaticMeshComponent0;                // 0x0B20 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m119_StaticMeshComponent0;                // 0x0B28 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_114_StaticMeshComponent0; // 0x0B30 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_113_StaticMeshComponent0; // 0x0B38 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_112_StaticMeshComponent0; // 0x0B40 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_111_StaticMeshComponent0; // 0x0B48 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m118_StaticMeshComponent0;                // 0x0B50 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short37_StaticMeshComponent0;        // 0x0B58 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m117_StaticMeshComponent0;                // 0x0B60 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short36_StaticMeshComponent0;        // 0x0B68 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_110_StaticMeshComponent0; // 0x0B70 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_109_StaticMeshComponent0; // 0x0B78 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short35_StaticMeshComponent0;        // 0x0B80 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short34_StaticMeshComponent0;        // 0x0B88 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m116_StaticMeshComponent0;                // 0x0B90 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m115_StaticMeshComponent0;                // 0x0B98 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m114_StaticMeshComponent0;                // 0x0BA0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m113_StaticMeshComponent0;                // 0x0BA8 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_108_StaticMeshComponent0; // 0x0BB0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short33_StaticMeshComponent0;        // 0x0BB8 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_107_StaticMeshComponent0; // 0x0BC0 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_106_StaticMeshComponent0; // 0x0BC8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m112_StaticMeshComponent0;                // 0x0BD0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short32_StaticMeshComponent0;        // 0x0BD8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m111_StaticMeshComponent0;                // 0x0BE0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m110_StaticMeshComponent0;                // 0x0BE8 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_105_StaticMeshComponent0; // 0x0BF0 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_104_StaticMeshComponent0; // 0x0BF8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short31_StaticMeshComponent0;        // 0x0C00 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short30_StaticMeshComponent0;        // 0x0C08 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m109_StaticMeshComponent0;                // 0x0C10 (size: 0x8)
    class UStaticMeshComponent* sg_shutterA7_StaticMeshComponent0;                    // 0x0C18 (size: 0x8)
    class UStaticMeshComponent* sg_shutterA_short7_StaticMeshComponent0;              // 0x0C20 (size: 0x8)
    class UStaticMeshComponent* sg_shutterA_short6_StaticMeshComponent0;              // 0x0C28 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m108_StaticMeshComponent0;                // 0x0C30 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m107_StaticMeshComponent0;                // 0x0C38 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m106_StaticMeshComponent0;                // 0x0C40 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m105_StaticMeshComponent0;                // 0x0C48 (size: 0x8)
    class UStaticMeshComponent* sg_peg83_StaticMeshComponent0;                        // 0x0C50 (size: 0x8)
    class UStaticMeshComponent* sg_peg82_StaticMeshComponent0;                        // 0x0C58 (size: 0x8)
    class UStaticMeshComponent* sg_peg81_StaticMeshComponent0;                        // 0x0C60 (size: 0x8)
    class UStaticMeshComponent* sg_peg80_StaticMeshComponent0;                        // 0x0C68 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_103_StaticMeshComponent0; // 0x0C70 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short29_StaticMeshComponent0;        // 0x0C78 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_102_StaticMeshComponent0; // 0x0C80 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short28_StaticMeshComponent0;        // 0x0C88 (size: 0x8)
    class UStaticMeshComponent* SG_SmallGlassWindowA16_StaticMeshComponent0;          // 0x0C90 (size: 0x8)
    class UStaticMeshComponent* SG_SmallGlassWindowA15_StaticMeshComponent0;          // 0x0C98 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m104_StaticMeshComponent0;                // 0x0CA0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m103_StaticMeshComponent0;                // 0x0CA8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m102_StaticMeshComponent0;                // 0x0CB0 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_101_StaticMeshComponent0; // 0x0CB8 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_100_StaticMeshComponent0; // 0x0CC0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short27_StaticMeshComponent0;        // 0x0CC8 (size: 0x8)
    class UStaticMeshComponent* PlaneDenseWindowsWidePainted8_StaticMeshComponent0;   // 0x0CD0 (size: 0x8)
    class UStaticMeshComponent* SG_SmallGlassWindowA14_StaticMeshComponent0;          // 0x0CD8 (size: 0x8)
    class UStaticMeshComponent* SG_SmallGlassWindowA13_StaticMeshComponent0;          // 0x0CE0 (size: 0x8)
    class UStaticMeshComponent* sg_peg79_StaticMeshComponent0;                        // 0x0CE8 (size: 0x8)
    class UStaticMeshComponent* sg_peg78_StaticMeshComponent0;                        // 0x0CF0 (size: 0x8)
    class UStaticMeshComponent* sg_peg77_StaticMeshComponent0;                        // 0x0CF8 (size: 0x8)
    class UStaticMeshComponent* sg_peg76_StaticMeshComponent0;                        // 0x0D00 (size: 0x8)
    class UStaticMeshComponent* sg_peg75_StaticMeshComponent0;                        // 0x0D08 (size: 0x8)
    class UStaticMeshComponent* sg_peg74_StaticMeshComponent0;                        // 0x0D10 (size: 0x8)
    class UStaticMeshComponent* sg_peg68_StaticMeshComponent0;                        // 0x0D18 (size: 0x8)
    class UStaticMeshComponent* sg_peg67_StaticMeshComponent0;                        // 0x0D20 (size: 0x8)
    class UStaticMeshComponent* sg_peg54_StaticMeshComponent0;                        // 0x0D28 (size: 0x8)
    class UStaticMeshComponent* sg_peg53_StaticMeshComponent0;                        // 0x0D30 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m101_StaticMeshComponent0;                // 0x0D38 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m100_StaticMeshComponent0;                // 0x0D40 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m99_StaticMeshComponent0;                 // 0x0D48 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m98_StaticMeshComponent0;                 // 0x0D50 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m97_StaticMeshComponent0;                 // 0x0D58 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m96_StaticMeshComponent0;                 // 0x0D60 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_99_StaticMeshComponent0; // 0x0D68 (size: 0x8)
    class UStaticMeshComponent* sg_peg44_StaticMeshComponent0;                        // 0x0D70 (size: 0x8)
    class UStaticMeshComponent* sg_peg29_StaticMeshComponent0;                        // 0x0D78 (size: 0x8)
    class UStaticMeshComponent* sg_peg27_StaticMeshComponent0;                        // 0x0D80 (size: 0x8)
    class UStaticMeshComponent* sg_peg26_StaticMeshComponent0;                        // 0x0D88 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_98_StaticMeshComponent0; // 0x0D90 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_97_StaticMeshComponent0; // 0x0D98 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_doorHead_A_SpikyTop4_StaticMeshComponent0; // 0x0DA0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short26_StaticMeshComponent0;        // 0x0DA8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short25_StaticMeshComponent0;        // 0x0DB0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short24_StaticMeshComponent0;        // 0x0DB8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m95_StaticMeshComponent0;                 // 0x0DC0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m21_StaticMeshComponent0;                 // 0x0DC8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m4_StaticMeshComponent0;                  // 0x0DD0 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_96_StaticMeshComponent0; // 0x0DD8 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_95_StaticMeshComponent0; // 0x0DE0 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_94_StaticMeshComponent0; // 0x0DE8 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_93_StaticMeshComponent0; // 0x0DF0 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_92_StaticMeshComponent0; // 0x0DF8 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_91_StaticMeshComponent0; // 0x0E00 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short23_StaticMeshComponent0;        // 0x0E08 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short22_StaticMeshComponent0;        // 0x0E10 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short21_StaticMeshComponent0;        // 0x0E18 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_90_StaticMeshComponent0; // 0x0E20 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_89_StaticMeshComponent0; // 0x0E28 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_88_StaticMeshComponent0; // 0x0E30 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_87_StaticMeshComponent0; // 0x0E38 (size: 0x8)
    class UStaticMeshComponent* SG_SmallGlassWindowA12_StaticMeshComponent0;          // 0x0E40 (size: 0x8)
    class UStaticMeshComponent* SG_SmallGlassWindowA11_StaticMeshComponent0;          // 0x0E48 (size: 0x8)
    class UStaticMeshComponent* SG_SmallGlassWindowA10_StaticMeshComponent0;          // 0x0E50 (size: 0x8)
    class UStaticMeshComponent* SG_SmallGlassWindowA9_StaticMeshComponent0;           // 0x0E58 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_86_StaticMeshComponent0; // 0x0E60 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_85_StaticMeshComponent0; // 0x0E68 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_84_StaticMeshComponent0; // 0x0E70 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_83_StaticMeshComponent0; // 0x0E78 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_82_StaticMeshComponent0; // 0x0E80 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_81_StaticMeshComponent0; // 0x0E88 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_80_StaticMeshComponent0; // 0x0E90 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_79_StaticMeshComponent0; // 0x0E98 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_78_StaticMeshComponent0; // 0x0EA0 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_77_StaticMeshComponent0; // 0x0EA8 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_76_StaticMeshComponent0; // 0x0EB0 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_doorHead_A_SpikyTop3_StaticMeshComponent0; // 0x0EB8 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_75_StaticMeshComponent0; // 0x0EC0 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_74_StaticMeshComponent0; // 0x0EC8 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_73_StaticMeshComponent0; // 0x0ED0 (size: 0x8)
    class UStaticMeshComponent* roofSingleDisplaced_cutdown2_StaticMeshComponent0;    // 0x0ED8 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_72_StaticMeshComponent0; // 0x0EE0 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_71_StaticMeshComponent0; // 0x0EE8 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_70_StaticMeshComponent0; // 0x0EF0 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_69_StaticMeshComponent0; // 0x0EF8 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_68_StaticMeshComponent0; // 0x0F00 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_67_StaticMeshComponent0; // 0x0F08 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_66_StaticMeshComponent0; // 0x0F10 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_65_StaticMeshComponent0; // 0x0F18 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_64_StaticMeshComponent0; // 0x0F20 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_63_StaticMeshComponent0; // 0x0F28 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_62_StaticMeshComponent0; // 0x0F30 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_61_StaticMeshComponent0; // 0x0F38 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_49_StaticMeshComponent0; // 0x0F40 (size: 0x8)
    class UStaticMeshComponent* paintedPlaneNoShadow4_StaticMeshComponent0;           // 0x0F48 (size: 0x8)
    class UStaticMeshComponent* paintedPlaneNoShadow3_StaticMeshComponent0;           // 0x0F50 (size: 0x8)
    class USceneComponent* SG_TaxCollector_LV2_DefaultSceneRoot;                      // 0x0F58 (size: 0x8)

}; // Size: 0xF60

#endif
