#ifndef UE4SS_SDK_C_SG_Forager_Core_HPP
#define UE4SS_SDK_C_SG_Forager_Core_HPP

class AC_SG_Forager_Core_C : public AConstructionBP_C
{
    class UStaticMeshComponent* SG_fillerBoardB_thin136_StaticMeshComponent0;         // 0x0550 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardB_thin135_StaticMeshComponent0;         // 0x0558 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short424_StaticMeshComponent0;       // 0x0560 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short423_StaticMeshComponent0;       // 0x0568 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short422_StaticMeshComponent0;       // 0x0570 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short421_StaticMeshComponent0;       // 0x0578 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short420_StaticMeshComponent0;       // 0x0580 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short419_StaticMeshComponent0;       // 0x0588 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short418_StaticMeshComponent0;       // 0x0590 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short417_StaticMeshComponent0;       // 0x0598 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short416_StaticMeshComponent0;       // 0x05A0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short415_StaticMeshComponent0;       // 0x05A8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short414_StaticMeshComponent0;       // 0x05B0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short413_StaticMeshComponent0;       // 0x05B8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short412_StaticMeshComponent0;       // 0x05C0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short411_StaticMeshComponent0;       // 0x05C8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short410_StaticMeshComponent0;       // 0x05D0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short409_StaticMeshComponent0;       // 0x05D8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short408_StaticMeshComponent0;       // 0x05E0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short407_StaticMeshComponent0;       // 0x05E8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short406_StaticMeshComponent0;       // 0x05F0 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardB_thin134_StaticMeshComponent0;         // 0x05F8 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardB_thin133_StaticMeshComponent0;         // 0x0600 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardB_thin132_StaticMeshComponent0;         // 0x0608 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardB_thin131_StaticMeshComponent0;         // 0x0610 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short405_StaticMeshComponent0;       // 0x0618 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short404_StaticMeshComponent0;       // 0x0620 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardB_thin130_StaticMeshComponent0;         // 0x0628 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short403_StaticMeshComponent0;       // 0x0630 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short402_StaticMeshComponent0;       // 0x0638 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short401_StaticMeshComponent0;       // 0x0640 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short400_StaticMeshComponent0;       // 0x0648 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long_diagonalD53_StaticMeshComponent0; // 0x0650 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long_diagonalD52_StaticMeshComponent0; // 0x0658 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardB_thin129_StaticMeshComponent0;         // 0x0660 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardB_thin128_StaticMeshComponent0;         // 0x0668 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardB_thin127_StaticMeshComponent0;         // 0x0670 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardB_thin126_StaticMeshComponent0;         // 0x0678 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardB_thin125_StaticMeshComponent0;         // 0x0680 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth153_StaticMeshComponent0;          // 0x0688 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardB_thin124_StaticMeshComponent0;         // 0x0690 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardB_thin123_StaticMeshComponent0;         // 0x0698 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardB_thin122_StaticMeshComponent0;         // 0x06A0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long_diagonalD51_StaticMeshComponent0; // 0x06A8 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardB_thin121_StaticMeshComponent0;         // 0x06B0 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardB_thin120_StaticMeshComponent0;         // 0x06B8 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardB_thin119_StaticMeshComponent0;         // 0x06C0 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardB_thin118_StaticMeshComponent0;         // 0x06C8 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardB_thin117_StaticMeshComponent0;         // 0x06D0 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardB_thin116_StaticMeshComponent0;         // 0x06D8 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardB_thin115_StaticMeshComponent0;         // 0x06E0 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardB_thin114_StaticMeshComponent0;         // 0x06E8 (size: 0x8)
    class UStaticMeshComponent* blackness13_StaticMeshComponent0;                     // 0x06F0 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardB_thin113_StaticMeshComponent0;         // 0x06F8 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardB_thin112_StaticMeshComponent0;         // 0x0700 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardB_thin111_StaticMeshComponent0;         // 0x0708 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed_long286_StaticMeshComponent0;     // 0x0710 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed_long285_StaticMeshComponent0;     // 0x0718 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed_long284_StaticMeshComponent0;     // 0x0720 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed_long283_StaticMeshComponent0;     // 0x0728 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed_long282_StaticMeshComponent0;     // 0x0730 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed_long281_StaticMeshComponent0;     // 0x0738 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed_long280_StaticMeshComponent0;     // 0x0740 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed_long279_StaticMeshComponent0;     // 0x0748 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed_long278_StaticMeshComponent0;     // 0x0750 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed_long277_StaticMeshComponent0;     // 0x0758 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed_long276_StaticMeshComponent0;     // 0x0760 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed_long275_StaticMeshComponent0;     // 0x0768 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed_long274_StaticMeshComponent0;     // 0x0770 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed_long273_StaticMeshComponent0;     // 0x0778 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed_long272_StaticMeshComponent0;     // 0x0780 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed_long271_StaticMeshComponent0;     // 0x0788 (size: 0x8)
    class UStaticMeshComponent* owidzThatch_halfHip5_StaticMeshComponent0;            // 0x0790 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed_long270_StaticMeshComponent0;     // 0x0798 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed_long269_StaticMeshComponent0;     // 0x07A0 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed_long268_StaticMeshComponent0;     // 0x07A8 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed_long267_StaticMeshComponent0;     // 0x07B0 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed_long266_StaticMeshComponent0;     // 0x07B8 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed_long265_StaticMeshComponent0;     // 0x07C0 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed_long264_StaticMeshComponent0;     // 0x07C8 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed_long263_StaticMeshComponent0;     // 0x07D0 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed_long262_StaticMeshComponent0;     // 0x07D8 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed_long261_StaticMeshComponent0;     // 0x07E0 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed_long260_StaticMeshComponent0;     // 0x07E8 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed_long259_StaticMeshComponent0;     // 0x07F0 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed_long258_StaticMeshComponent0;     // 0x07F8 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed_long257_StaticMeshComponent0;     // 0x0800 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed_long256_StaticMeshComponent0;     // 0x0808 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed_long255_StaticMeshComponent0;     // 0x0810 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed_long254_StaticMeshComponent0;     // 0x0818 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed_long253_StaticMeshComponent0;     // 0x0820 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed_long252_StaticMeshComponent0;     // 0x0828 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed_long251_StaticMeshComponent0;     // 0x0830 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth152_StaticMeshComponent0;          // 0x0838 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth151_StaticMeshComponent0;          // 0x0840 (size: 0x8)
    class UStaticMeshComponent* blackness12_StaticMeshComponent0;                     // 0x0848 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardB_thin110_StaticMeshComponent0;         // 0x0850 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardB_thin109_StaticMeshComponent0;         // 0x0858 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardB_thin108_StaticMeshComponent0;         // 0x0860 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardB_thin107_StaticMeshComponent0;         // 0x0868 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardB_thin106_StaticMeshComponent0;         // 0x0870 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardB_thin105_StaticMeshComponent0;         // 0x0878 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardB_thin104_StaticMeshComponent0;         // 0x0880 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardB_thin103_StaticMeshComponent0;         // 0x0888 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardB_thin102_StaticMeshComponent0;         // 0x0890 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardB_thin101_StaticMeshComponent0;         // 0x0898 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardB_thin100_StaticMeshComponent0;         // 0x08A0 (size: 0x8)
    class UStaticMeshComponent* blackness11_StaticMeshComponent0;                     // 0x08A8 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardB_thin99_StaticMeshComponent0;          // 0x08B0 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardB_thin98_StaticMeshComponent0;          // 0x08B8 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardB_thin97_StaticMeshComponent0;          // 0x08C0 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardB_thin96_StaticMeshComponent0;          // 0x08C8 (size: 0x8)
    class UStaticMeshComponent* blackness10_StaticMeshComponent0;                     // 0x08D0 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardB_thin95_StaticMeshComponent0;          // 0x08D8 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardB_thin94_StaticMeshComponent0;          // 0x08E0 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardB_thin93_StaticMeshComponent0;          // 0x08E8 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardB_thin92_StaticMeshComponent0;          // 0x08F0 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardB_thin91_StaticMeshComponent0;          // 0x08F8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long_diagonalD50_StaticMeshComponent0; // 0x0900 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_long_diagonalD49_StaticMeshComponent0; // 0x0908 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth150_StaticMeshComponent0;          // 0x0910 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth149_StaticMeshComponent0;          // 0x0918 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth148_StaticMeshComponent0;          // 0x0920 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam6m_orSth147_StaticMeshComponent0;          // 0x0928 (size: 0x8)
    class UStaticMeshComponent* foundationTiling_A_detailed234_StaticMeshComponent0;  // 0x0930 (size: 0x8)
    class UStaticMeshComponent* foundationTiling_A_detailed233_StaticMeshComponent0;  // 0x0938 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short399_StaticMeshComponent0;       // 0x0940 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short398_StaticMeshComponent0;       // 0x0948 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short397_StaticMeshComponent0;       // 0x0950 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short396_StaticMeshComponent0;       // 0x0958 (size: 0x8)
    class UStaticMeshComponent* foundationTiling_A_detailed232_StaticMeshComponent0;  // 0x0960 (size: 0x8)
    class UStaticMeshComponent* foundationTiling_A_detailed231_StaticMeshComponent0;  // 0x0968 (size: 0x8)
    class UStaticMeshComponent* foundationTiling_A_detailed230_StaticMeshComponent0;  // 0x0970 (size: 0x8)
    class UStaticMeshComponent* foundationTiling_A_detailed229_StaticMeshComponent0;  // 0x0978 (size: 0x8)
    class UStaticMeshComponent* foundationTiling_A_detailed228_StaticMeshComponent0;  // 0x0980 (size: 0x8)
    class UStaticMeshComponent* foundationTiling_A_detailed227_StaticMeshComponent0;  // 0x0988 (size: 0x8)
    class UStaticMeshComponent* foundationTiling_A_detailed226_StaticMeshComponent0;  // 0x0990 (size: 0x8)
    class UStaticMeshComponent* foundationTiling_A_detailed225_StaticMeshComponent0;  // 0x0998 (size: 0x8)
    class UStaticMeshComponent* foundationTiling_A_detailed224_StaticMeshComponent0;  // 0x09A0 (size: 0x8)
    class UStaticMeshComponent* foundationTiling_A_detailed223_StaticMeshComponent0;  // 0x09A8 (size: 0x8)
    class USceneComponent* sg_foragerCore2_DefaultSceneRoot;                          // 0x09B0 (size: 0x8)

}; // Size: 0x9B8

#endif
