#ifndef UE4SS_SDK_C_SG_Cottage_LV1_BPart_A_UBeam_HPP
#define UE4SS_SDK_C_SG_Cottage_LV1_BPart_A_UBeam_HPP

class AC_SG_Cottage_LV1_BPart_A_UBeam_C : public AConstructionBP_C
{
    class UStaticMeshComponent* StaticMesh;                                           // 0x0550 (size: 0x8)
    class UStaticMeshComponent* StaticMesh1;                                          // 0x0558 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m26_StaticMeshComponent0;                      // 0x0560 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m27_StaticMeshComponent0;                      // 0x0568 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m28_StaticMeshComponent0;                      // 0x0570 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m29_StaticMeshComponent0;                      // 0x0578 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m30_StaticMeshComponent0;                      // 0x0580 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m31_StaticMeshComponent0;                      // 0x0588 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m32_StaticMeshComponent0;                      // 0x0590 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m33_StaticMeshComponent0;                      // 0x0598 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m34_StaticMeshComponent0;                      // 0x05A0 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m35_StaticMeshComponent0;                      // 0x05A8 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m36_StaticMeshComponent0;                      // 0x05B0 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m37_StaticMeshComponent0;                      // 0x05B8 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m38_StaticMeshComponent0;                      // 0x05C0 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m39_StaticMeshComponent0;                      // 0x05C8 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m40_StaticMeshComponent0;                      // 0x05D0 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m41_StaticMeshComponent0;                      // 0x05D8 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m42_StaticMeshComponent0;                      // 0x05E0 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m43_StaticMeshComponent0;                      // 0x05E8 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m44_StaticMeshComponent0;                      // 0x05F0 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m45_StaticMeshComponent0;                      // 0x05F8 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m46_StaticMeshComponent0;                      // 0x0600 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m47_StaticMeshComponent0;                      // 0x0608 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m48_StaticMeshComponent0;                      // 0x0610 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m49_StaticMeshComponent0;                      // 0x0618 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m50_StaticMeshComponent0;                      // 0x0620 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m3_StaticMeshComponent0;                  // 0x0628 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m4_StaticMeshComponent0;                  // 0x0630 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Tapered_Cut8_StaticMeshComponent0;          // 0x0638 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Tapered_Cut9_StaticMeshComponent0;          // 0x0640 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Tapered_Cut10_StaticMeshComponent0;         // 0x0648 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Tapered_Cut11_StaticMeshComponent0;         // 0x0650 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Tapered_Cut12_StaticMeshComponent0;         // 0x0658 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Tapered_Cut13_StaticMeshComponent0;         // 0x0660 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m_tapered_oneSide3_StaticMeshComponent0;  // 0x0668 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m_tapered_oneSide4_StaticMeshComponent0;  // 0x0670 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short13_StaticMeshComponent0;        // 0x0678 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed28_StaticMeshComponent0;           // 0x0680 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed29_StaticMeshComponent0;           // 0x0688 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed30_StaticMeshComponent0;           // 0x0690 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed31_StaticMeshComponent0;           // 0x0698 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed32_StaticMeshComponent0;           // 0x06A0 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed33_StaticMeshComponent0;           // 0x06A8 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed34_StaticMeshComponent0;           // 0x06B0 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed35_StaticMeshComponent0;           // 0x06B8 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed36_StaticMeshComponent0;           // 0x06C0 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed37_StaticMeshComponent0;           // 0x06C8 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed38_StaticMeshComponent0;           // 0x06D0 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed39_StaticMeshComponent0;           // 0x06D8 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed40_StaticMeshComponent0;           // 0x06E0 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed41_StaticMeshComponent0;           // 0x06E8 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed42_StaticMeshComponent0;           // 0x06F0 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed43_StaticMeshComponent0;           // 0x06F8 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed44_StaticMeshComponent0;           // 0x0700 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed45_StaticMeshComponent0;           // 0x0708 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed46_StaticMeshComponent0;           // 0x0710 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed47_StaticMeshComponent0;           // 0x0718 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed48_StaticMeshComponent0;           // 0x0720 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed49_StaticMeshComponent0;           // 0x0728 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed50_StaticMeshComponent0;           // 0x0730 (size: 0x8)
    class UStaticMeshComponent* strut_straighteneed51_StaticMeshComponent0;           // 0x0738 (size: 0x8)
    class UStaticMeshComponent* PlaneDenseBeveledWide5_StaticMeshComponent0;          // 0x0740 (size: 0x8)
    class UStaticMeshComponent* PlaneDenseSmallSegmentNarrower2_StaticMeshComponent0; // 0x0748 (size: 0x8)
    class UStaticMeshComponent* planeDenseBeveledA2_StaticMeshComponent0;             // 0x0750 (size: 0x8)
    class UStaticMeshComponent* PlaneDenseWindowSlotsA_wider3_StaticMeshComponent0;   // 0x0758 (size: 0x8)
    class UStaticMeshComponent* SM_WindowFrame9_StaticMeshComponent0;                 // 0x0760 (size: 0x8)
    class UStaticMeshComponent* PlaneDenseBeveledWide6_StaticMeshComponent0;          // 0x0768 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardB_thin3_StaticMeshComponent0;           // 0x0770 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly18_StaticMeshComponent0;    // 0x0778 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly19_StaticMeshComponent0;    // 0x0780 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly20_StaticMeshComponent0;    // 0x0788 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly21_StaticMeshComponent0;    // 0x0790 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly22_StaticMeshComponent0;    // 0x0798 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly23_StaticMeshComponent0;    // 0x07A0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly24_StaticMeshComponent0;    // 0x07A8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly25_StaticMeshComponent0;    // 0x07B0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly26_StaticMeshComponent0;    // 0x07B8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly27_StaticMeshComponent0;    // 0x07C0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly28_StaticMeshComponent0;    // 0x07C8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly29_StaticMeshComponent0;    // 0x07D0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly30_StaticMeshComponent0;    // 0x07D8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly31_StaticMeshComponent0;    // 0x07E0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly32_StaticMeshComponent0;    // 0x07E8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly33_StaticMeshComponent0;    // 0x07F0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly34_StaticMeshComponent0;    // 0x07F8 (size: 0x8)
    class UStaticMeshComponent* Thatch_FullUV_LV1BPartA2_StaticMeshComponent0;        // 0x0800 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Tapered_Cut14_StaticMeshComponent0;         // 0x0808 (size: 0x8)
    class UStaticMeshComponent* PlaneDenseBeveledWide7_StaticMeshComponent0;          // 0x0810 (size: 0x8)
    class UStaticMeshComponent* PlaneDenseBeveledWide8_StaticMeshComponent0;          // 0x0818 (size: 0x8)
    class UStaticMeshComponent* planeDenseBeveledA4_StaticMeshComponent0;             // 0x0820 (size: 0x8)
    class UStaticMeshComponent* PlaneDenseWindowSlotsA_wider4_StaticMeshComponent0;   // 0x0828 (size: 0x8)
    class UStaticMeshComponent* SM_WindowFrame10_StaticMeshComponent0;                // 0x0830 (size: 0x8)
    class UStaticMeshComponent* SM_WindowFrame11_StaticMeshComponent0;                // 0x0838 (size: 0x8)
    class UStaticMeshComponent* SM_WindowFrame12_StaticMeshComponent0;                // 0x0840 (size: 0x8)
    class UStaticMeshComponent* SM_WindowFrame13_StaticMeshComponent0;                // 0x0848 (size: 0x8)
    class UStaticMeshComponent* Foundation_SG_Cottage_LV1_BPart_A2_StaticMeshComponent0; // 0x0850 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardB_thin14_StaticMeshComponent0;          // 0x0858 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardB_thin15_StaticMeshComponent0;          // 0x0860 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardB_thin16_StaticMeshComponent0;          // 0x0868 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardB_thin17_StaticMeshComponent0;          // 0x0870 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardB_thin18_StaticMeshComponent0;          // 0x0878 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardB_thin19_StaticMeshComponent0;          // 0x0880 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardB_thin20_StaticMeshComponent0;          // 0x0888 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardB_thin21_StaticMeshComponent0;          // 0x0890 (size: 0x8)
    class UStaticMeshComponent* SG_fillerBoardB_thin22_StaticMeshComponent0;          // 0x0898 (size: 0x8)
    class USceneComponent* C_SG_Cottage_LV1_BPart_A_DefaultSceneRoot;                 // 0x08A0 (size: 0x8)

}; // Size: 0x8A8

#endif
