#ifndef UE4SS_SDK_C_SG_Granary_Lv2_Ubeam_HPP
#define UE4SS_SDK_C_SG_Granary_Lv2_Ubeam_HPP

class AC_SG_Granary_Lv2_Ubeam_C : public AConstructionBP_C
{
    class UStaticMeshComponent* rope_dangling2_StaticMeshComponent0;                  // 0x0550 (size: 0x8)
    class UStaticMeshComponent* ropeTubeC2_StaticMeshComponent0;                      // 0x0558 (size: 0x8)
    class UStaticMeshComponent* Cube2_StaticMeshComponent0;                           // 0x0560 (size: 0x8)
    class UStaticMeshComponent* J_SG_WoodenDoorA4_StaticMeshComponent0;               // 0x0568 (size: 0x8)
    class UStaticMeshComponent* J_SG_WoodenDoorA3_StaticMeshComponent0;               // 0x0570 (size: 0x8)
    class UStaticMeshComponent* roof_sg_granary_lvl3_StaticMeshComponent0;            // 0x0578 (size: 0x8)
    class UStaticMeshComponent* foundation_sg_granary_lvl3_StaticMeshComponent0;      // 0x0580 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA24_StaticMeshComponent0;            // 0x0588 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA23_StaticMeshComponent0;            // 0x0590 (size: 0x8)
    class UStaticMeshComponent* UBeam_WindowFrame10_StaticMeshComponent0;             // 0x0598 (size: 0x8)
    class UStaticMeshComponent* UBeam_WindowFrame9_StaticMeshComponent0;              // 0x05A0 (size: 0x8)
    class UStaticMeshComponent* UBeam_WindowFrame8_StaticMeshComponent0;              // 0x05A8 (size: 0x8)
    class UStaticMeshComponent* UBeam_WindowFrame7_StaticMeshComponent0;              // 0x05B0 (size: 0x8)
    class UStaticMeshComponent* UBeam_WindowFrame6_StaticMeshComponent0;              // 0x05B8 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA22_StaticMeshComponent0;            // 0x05C0 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA21_StaticMeshComponent0;            // 0x05C8 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardB34_StaticMeshComponent0;            // 0x05D0 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardB33_StaticMeshComponent0;            // 0x05D8 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardB32_StaticMeshComponent0;            // 0x05E0 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA20_StaticMeshComponent0;            // 0x05E8 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardB31_StaticMeshComponent0;            // 0x05F0 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardB30_StaticMeshComponent0;            // 0x05F8 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardB29_StaticMeshComponent0;            // 0x0600 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA19_StaticMeshComponent0;            // 0x0608 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m134_StaticMeshComponent0;                     // 0x0610 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA18_StaticMeshComponent0;            // 0x0618 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardB28_StaticMeshComponent0;            // 0x0620 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardB27_StaticMeshComponent0;            // 0x0628 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardB26_StaticMeshComponent0;            // 0x0630 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA17_StaticMeshComponent0;            // 0x0638 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardB25_StaticMeshComponent0;            // 0x0640 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardB24_StaticMeshComponent0;            // 0x0648 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardB23_StaticMeshComponent0;            // 0x0650 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA16_StaticMeshComponent0;            // 0x0658 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardB22_StaticMeshComponent0;            // 0x0660 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardB21_StaticMeshComponent0;            // 0x0668 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardB20_StaticMeshComponent0;            // 0x0670 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA15_StaticMeshComponent0;            // 0x0678 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardB19_StaticMeshComponent0;            // 0x0680 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA14_StaticMeshComponent0;            // 0x0688 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardB18_StaticMeshComponent0;            // 0x0690 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoardA13_StaticMeshComponent0;            // 0x0698 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Slit_DenseUV10_StaticMeshComponent0;       // 0x06A0 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Slit4_StaticMeshComponent0;                // 0x06A8 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m133_StaticMeshComponent0;                     // 0x06B0 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m132_StaticMeshComponent0;                     // 0x06B8 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Standard24_StaticMeshComponent0;           // 0x06C0 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Standard23_StaticMeshComponent0;           // 0x06C8 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Standard22_StaticMeshComponent0;           // 0x06D0 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Corner8_StaticMeshComponent0;              // 0x06D8 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Corner7_StaticMeshComponent0;              // 0x06E0 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Corner6_StaticMeshComponent0;              // 0x06E8 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Corner5_StaticMeshComponent0;              // 0x06F0 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Slit3_StaticMeshComponent0;                // 0x06F8 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Standard21_StaticMeshComponent0;           // 0x0700 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Standard20_StaticMeshComponent0;           // 0x0708 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Standard19_StaticMeshComponent0;           // 0x0710 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Narrow_Var3_StaticMeshComponent0;          // 0x0718 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg166_StaticMeshComponent0;    // 0x0720 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg165_StaticMeshComponent0;    // 0x0728 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg164_StaticMeshComponent0;    // 0x0730 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg163_StaticMeshComponent0;    // 0x0738 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg162_StaticMeshComponent0;    // 0x0740 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_SlitThinner5_StaticMeshComponent0;         // 0x0748 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_TwoWindowsStandard4_StaticMeshComponent0;  // 0x0750 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Standard18_StaticMeshComponent0;           // 0x0758 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_StandardSingleWindow12_StaticMeshComponent0; // 0x0760 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Standard17_StaticMeshComponent0;           // 0x0768 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_StandardSingleWindow11_StaticMeshComponent0; // 0x0770 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_81_StaticMeshComponent0;               // 0x0778 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_80_StaticMeshComponent0;               // 0x0780 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg161_StaticMeshComponent0;    // 0x0788 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg160_StaticMeshComponent0;    // 0x0790 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_79_StaticMeshComponent0;               // 0x0798 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg159_StaticMeshComponent0;    // 0x07A0 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg158_StaticMeshComponent0;    // 0x07A8 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg157_StaticMeshComponent0;    // 0x07B0 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg156_StaticMeshComponent0;    // 0x07B8 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg155_StaticMeshComponent0;    // 0x07C0 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg154_StaticMeshComponent0;    // 0x07C8 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_SlitThinner4_StaticMeshComponent0;         // 0x07D0 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Slit_DenseUV9_StaticMeshComponent0;        // 0x07D8 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Slit_DenseUV8_StaticMeshComponent0;        // 0x07E0 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Slit_DenseUV7_StaticMeshComponent0;        // 0x07E8 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Slit_DenseUV6_StaticMeshComponent0;        // 0x07F0 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg153_StaticMeshComponent0;    // 0x07F8 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg152_StaticMeshComponent0;    // 0x0800 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg151_StaticMeshComponent0;    // 0x0808 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg150_StaticMeshComponent0;    // 0x0810 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m20_StaticMeshComponent0;                      // 0x0818 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m19_StaticMeshComponent0;                      // 0x0820 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m18_StaticMeshComponent0;                      // 0x0828 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Standard16_StaticMeshComponent0;           // 0x0830 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_StandardSingleWindow10_StaticMeshComponent0; // 0x0838 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m131_StaticMeshComponent0;                     // 0x0840 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Standard15_StaticMeshComponent0;           // 0x0848 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_StandardSingleWindow9_StaticMeshComponent0; // 0x0850 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Standard14_StaticMeshComponent0;           // 0x0858 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_StandardSingleWindow8_StaticMeshComponent0; // 0x0860 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Standard13_StaticMeshComponent0;           // 0x0868 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_StandardSingleWindow7_StaticMeshComponent0; // 0x0870 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_TwoWindowsStandard3_StaticMeshComponent0;  // 0x0878 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m130_StaticMeshComponent0;                     // 0x0880 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m129_StaticMeshComponent0;                     // 0x0888 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m128_StaticMeshComponent0;                     // 0x0890 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m127_StaticMeshComponent0;                     // 0x0898 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m126_StaticMeshComponent0;                     // 0x08A0 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg149_StaticMeshComponent0;    // 0x08A8 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg148_StaticMeshComponent0;    // 0x08B0 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg147_StaticMeshComponent0;    // 0x08B8 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg146_StaticMeshComponent0;    // 0x08C0 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg145_StaticMeshComponent0;    // 0x08C8 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg144_StaticMeshComponent0;    // 0x08D0 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg143_StaticMeshComponent0;    // 0x08D8 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg142_StaticMeshComponent0;    // 0x08E0 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg141_StaticMeshComponent0;    // 0x08E8 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg140_StaticMeshComponent0;    // 0x08F0 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg139_StaticMeshComponent0;    // 0x08F8 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg138_StaticMeshComponent0;    // 0x0900 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg137_StaticMeshComponent0;    // 0x0908 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg136_StaticMeshComponent0;    // 0x0910 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg135_StaticMeshComponent0;    // 0x0918 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg134_StaticMeshComponent0;    // 0x0920 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg133_StaticMeshComponent0;    // 0x0928 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg132_StaticMeshComponent0;    // 0x0930 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg131_StaticMeshComponent0;    // 0x0938 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg130_StaticMeshComponent0;    // 0x0940 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg129_StaticMeshComponent0;    // 0x0948 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg128_StaticMeshComponent0;    // 0x0950 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg127_StaticMeshComponent0;    // 0x0958 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg126_StaticMeshComponent0;    // 0x0960 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg125_StaticMeshComponent0;    // 0x0968 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg124_StaticMeshComponent0;    // 0x0970 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg123_StaticMeshComponent0;    // 0x0978 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg122_StaticMeshComponent0;    // 0x0980 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg121_StaticMeshComponent0;    // 0x0988 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg120_StaticMeshComponent0;    // 0x0990 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg119_StaticMeshComponent0;    // 0x0998 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg118_StaticMeshComponent0;    // 0x09A0 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg117_StaticMeshComponent0;    // 0x09A8 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg116_StaticMeshComponent0;    // 0x09B0 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg115_StaticMeshComponent0;    // 0x09B8 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg114_StaticMeshComponent0;    // 0x09C0 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg113_StaticMeshComponent0;    // 0x09C8 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg112_StaticMeshComponent0;    // 0x09D0 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg111_StaticMeshComponent0;    // 0x09D8 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg110_StaticMeshComponent0;    // 0x09E0 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg109_StaticMeshComponent0;    // 0x09E8 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg108_StaticMeshComponent0;    // 0x09F0 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg107_StaticMeshComponent0;    // 0x09F8 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg106_StaticMeshComponent0;    // 0x0A00 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg105_StaticMeshComponent0;    // 0x0A08 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg104_StaticMeshComponent0;    // 0x0A10 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg103_StaticMeshComponent0;    // 0x0A18 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg102_StaticMeshComponent0;    // 0x0A20 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg101_StaticMeshComponent0;    // 0x0A28 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg100_StaticMeshComponent0;    // 0x0A30 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg99_StaticMeshComponent0;     // 0x0A38 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg98_StaticMeshComponent0;     // 0x0A40 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg97_StaticMeshComponent0;     // 0x0A48 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg96_StaticMeshComponent0;     // 0x0A50 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg95_StaticMeshComponent0;     // 0x0A58 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg94_StaticMeshComponent0;     // 0x0A60 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg93_StaticMeshComponent0;     // 0x0A68 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg92_StaticMeshComponent0;     // 0x0A70 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg91_StaticMeshComponent0;     // 0x0A78 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg90_StaticMeshComponent0;     // 0x0A80 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg89_StaticMeshComponent0;     // 0x0A88 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg88_StaticMeshComponent0;     // 0x0A90 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg87_StaticMeshComponent0;     // 0x0A98 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg86_StaticMeshComponent0;     // 0x0AA0 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg85_StaticMeshComponent0;     // 0x0AA8 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg84_StaticMeshComponent0;     // 0x0AB0 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_78_StaticMeshComponent0;               // 0x0AB8 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_77_StaticMeshComponent0;               // 0x0AC0 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m125_StaticMeshComponent0;                     // 0x0AC8 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m124_StaticMeshComponent0;                     // 0x0AD0 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m123_StaticMeshComponent0;                     // 0x0AD8 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m122_StaticMeshComponent0;                     // 0x0AE0 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_76_StaticMeshComponent0;               // 0x0AE8 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_75_StaticMeshComponent0;               // 0x0AF0 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_74_StaticMeshComponent0;               // 0x0AF8 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_73_StaticMeshComponent0;               // 0x0B00 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_72_StaticMeshComponent0;               // 0x0B08 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_71_StaticMeshComponent0;               // 0x0B10 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_70_StaticMeshComponent0;               // 0x0B18 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_69_StaticMeshComponent0;               // 0x0B20 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_68_StaticMeshComponent0;               // 0x0B28 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_67_StaticMeshComponent0;               // 0x0B30 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_66_StaticMeshComponent0;               // 0x0B38 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_65_StaticMeshComponent0;               // 0x0B40 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_64_StaticMeshComponent0;               // 0x0B48 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_63_StaticMeshComponent0;               // 0x0B50 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_62_StaticMeshComponent0;               // 0x0B58 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_61_StaticMeshComponent0;               // 0x0B60 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m17_StaticMeshComponent0;                      // 0x0B68 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m16_StaticMeshComponent0;                      // 0x0B70 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m15_StaticMeshComponent0;                      // 0x0B78 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m14_StaticMeshComponent0;                      // 0x0B80 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_60_StaticMeshComponent0;               // 0x0B88 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_59_StaticMeshComponent0;               // 0x0B90 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_58_StaticMeshComponent0;               // 0x0B98 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_57_StaticMeshComponent0;               // 0x0BA0 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_56_StaticMeshComponent0;               // 0x0BA8 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_55_StaticMeshComponent0;               // 0x0BB0 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m13_StaticMeshComponent0;                      // 0x0BB8 (size: 0x8)
    class UStaticMeshComponent* UBeam_DoorHeadA2_StaticMeshComponent0;                // 0x0BC0 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m121_StaticMeshComponent0;                     // 0x0BC8 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_54_StaticMeshComponent0;               // 0x0BD0 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_53_StaticMeshComponent0;               // 0x0BD8 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_52_StaticMeshComponent0;               // 0x0BE0 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_51_StaticMeshComponent0;               // 0x0BE8 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_50_StaticMeshComponent0;               // 0x0BF0 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m120_StaticMeshComponent0;                     // 0x0BF8 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m12_StaticMeshComponent0;                      // 0x0C00 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m119_StaticMeshComponent0;                     // 0x0C08 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_49_StaticMeshComponent0;               // 0x0C10 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_48_StaticMeshComponent0;               // 0x0C18 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_47_StaticMeshComponent0;               // 0x0C20 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_46_StaticMeshComponent0;               // 0x0C28 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_45_StaticMeshComponent0;               // 0x0C30 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_44_StaticMeshComponent0;               // 0x0C38 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_43_StaticMeshComponent0;               // 0x0C40 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_42_StaticMeshComponent0;               // 0x0C48 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m118_StaticMeshComponent0;                     // 0x0C50 (size: 0x8)
    class UStaticMeshComponent* UBeam_TaperedCutB28_StaticMeshComponent0;             // 0x0C58 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m117_StaticMeshComponent0;                     // 0x0C60 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m116_StaticMeshComponent0;                     // 0x0C68 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m115_StaticMeshComponent0;                     // 0x0C70 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m114_StaticMeshComponent0;                     // 0x0C78 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m113_StaticMeshComponent0;                     // 0x0C80 (size: 0x8)
    class UStaticMeshComponent* UBeam_TaperedCutB27_StaticMeshComponent0;             // 0x0C88 (size: 0x8)
    class UStaticMeshComponent* UBeam_TaperedCutB26_StaticMeshComponent0;             // 0x0C90 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m112_StaticMeshComponent0;                     // 0x0C98 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m111_StaticMeshComponent0;                     // 0x0CA0 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m110_StaticMeshComponent0;                     // 0x0CA8 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m109_StaticMeshComponent0;                     // 0x0CB0 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_41_StaticMeshComponent0;               // 0x0CB8 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m11_StaticMeshComponent0;                      // 0x0CC0 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m108_StaticMeshComponent0;                     // 0x0CC8 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m107_StaticMeshComponent0;                     // 0x0CD0 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m106_StaticMeshComponent0;                     // 0x0CD8 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m105_StaticMeshComponent0;                     // 0x0CE0 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m104_StaticMeshComponent0;                     // 0x0CE8 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m103_StaticMeshComponent0;                     // 0x0CF0 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m102_StaticMeshComponent0;                     // 0x0CF8 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m101_StaticMeshComponent0;                     // 0x0D00 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m100_StaticMeshComponent0;                     // 0x0D08 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m99_StaticMeshComponent0;                      // 0x0D10 (size: 0x8)
    class UStaticMeshComponent* UBeam_TaperedCutB25_StaticMeshComponent0;             // 0x0D18 (size: 0x8)
    class UStaticMeshComponent* UBeam_TaperedCutB24_StaticMeshComponent0;             // 0x0D20 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m98_StaticMeshComponent0;                      // 0x0D28 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m97_StaticMeshComponent0;                      // 0x0D30 (size: 0x8)
    class UStaticMeshComponent* UBeam_TaperedCutB23_StaticMeshComponent0;             // 0x0D38 (size: 0x8)
    class UStaticMeshComponent* UBeam_TaperedCutB22_StaticMeshComponent0;             // 0x0D40 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m96_StaticMeshComponent0;                      // 0x0D48 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m95_StaticMeshComponent0;                      // 0x0D50 (size: 0x8)
    class UStaticMeshComponent* UBeam_TaperedCutB21_StaticMeshComponent0;             // 0x0D58 (size: 0x8)
    class UStaticMeshComponent* UBeam_TaperedCutB20_StaticMeshComponent0;             // 0x0D60 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m94_StaticMeshComponent0;                      // 0x0D68 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m93_StaticMeshComponent0;                      // 0x0D70 (size: 0x8)
    class UStaticMeshComponent* UBeam_TaperedCutB19_StaticMeshComponent0;             // 0x0D78 (size: 0x8)
    class UStaticMeshComponent* UBeam_TaperedCutB15_StaticMeshComponent0;             // 0x0D80 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m92_StaticMeshComponent0;                      // 0x0D88 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m91_StaticMeshComponent0;                      // 0x0D90 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m90_StaticMeshComponent0;                      // 0x0D98 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m89_StaticMeshComponent0;                      // 0x0DA0 (size: 0x8)
    class UStaticMeshComponent* UBeam_TaperedCutB7_StaticMeshComponent0;              // 0x0DA8 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m88_StaticMeshComponent0;                      // 0x0DB0 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m87_StaticMeshComponent0;                      // 0x0DB8 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m86_StaticMeshComponent0;                      // 0x0DC0 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m85_StaticMeshComponent0;                      // 0x0DC8 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m84_StaticMeshComponent0;                      // 0x0DD0 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m83_StaticMeshComponent0;                      // 0x0DD8 (size: 0x8)
    class UStaticMeshComponent* UBeam_TaperedCutB6_StaticMeshComponent0;              // 0x0DE0 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m82_StaticMeshComponent0;                      // 0x0DE8 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m81_StaticMeshComponent0;                      // 0x0DF0 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m80_StaticMeshComponent0;                      // 0x0DF8 (size: 0x8)
    class UStaticMeshComponent* UBeam_TaperedCutB3_StaticMeshComponent0;              // 0x0E00 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m79_StaticMeshComponent0;                      // 0x0E08 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m78_StaticMeshComponent0;                      // 0x0E10 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m77_StaticMeshComponent0;                      // 0x0E18 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m76_StaticMeshComponent0;                      // 0x0E20 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m47_StaticMeshComponent0;                      // 0x0E28 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m46_StaticMeshComponent0;                      // 0x0E30 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m45_StaticMeshComponent0;                      // 0x0E38 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m44_StaticMeshComponent0;                      // 0x0E40 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m43_StaticMeshComponent0;                      // 0x0E48 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m42_StaticMeshComponent0;                      // 0x0E50 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m41_StaticMeshComponent0;                      // 0x0E58 (size: 0x8)
    class UStaticMeshComponent* UBeam_3m19_StaticMeshComponent0;                      // 0x0E60 (size: 0x8)
    class USceneComponent* Actor2_DefaultSceneRoot;                                   // 0x0E68 (size: 0x8)

}; // Size: 0xE70

#endif
