#ifndef UE4SS_SDK_C_SG_shedB_HPP
#define UE4SS_SDK_C_SG_shedB_HPP

class AC_SG_shedB_C : public AConstructionBP_C
{
    class UStaticMeshComponent* sstr_StaticMeshComponent0;                            // 0x0550 (size: 0x8)
    class UStaticMeshComponent* sstr2_StaticMeshComponent0;                           // 0x0558 (size: 0x8)
    class UStaticMeshComponent* sstr3_StaticMeshComponent0;                           // 0x0560 (size: 0x8)
    class UStaticMeshComponent* sstr4_StaticMeshComponent0;                           // 0x0568 (size: 0x8)
    class UStaticMeshComponent* sstr5_StaticMeshComponent0;                           // 0x0570 (size: 0x8)
    class UStaticMeshComponent* sstr6_StaticMeshComponent0;                           // 0x0578 (size: 0x8)
    class UStaticMeshComponent* sstr7_StaticMeshComponent0;                           // 0x0580 (size: 0x8)
    class UStaticMeshComponent* woodenShinglesMega_anotherSculpt3_StaticMeshComponent0; // 0x0588 (size: 0x8)
    class UStaticMeshComponent* ropeKnotA12_StaticMeshComponent0;                     // 0x0590 (size: 0x8)
    class UStaticMeshComponent* ropeKnotA13_StaticMeshComponent0;                     // 0x0598 (size: 0x8)
    class UStaticMeshComponent* sstr8_StaticMeshComponent0;                           // 0x05A0 (size: 0x8)
    class UStaticMeshComponent* sstr9_StaticMeshComponent0;                           // 0x05A8 (size: 0x8)
    class UStaticMeshComponent* sstr10_StaticMeshComponent0;                          // 0x05B0 (size: 0x8)
    class UStaticMeshComponent* sstr11_StaticMeshComponent0;                          // 0x05B8 (size: 0x8)
    class UStaticMeshComponent* sstr12_StaticMeshComponent0;                          // 0x05C0 (size: 0x8)
    class USceneComponent* woodcutterSHed_DefaultSceneRoot;                           // 0x05C8 (size: 0x8)

}; // Size: 0x5D0

#endif
