#ifndef UE4SS_SDK_C_SG_Beehive_HPP
#define UE4SS_SDK_C_SG_Beehive_HPP

class AC_SG_Beehive_C : public AConstructionBP_C
{
    class UStaticMeshComponent* UBeam_Strut_Straight66_StaticMeshComponent0;          // 0x0550 (size: 0x8)
    class UStaticMeshComponent* UBeam_Strut_Straight65_StaticMeshComponent0;          // 0x0558 (size: 0x8)
    class UStaticMeshComponent* UBeam_Strut_Straight64_StaticMeshComponent0;          // 0x0560 (size: 0x8)
    class UStaticMeshComponent* UBeam_Strut_Straight63_StaticMeshComponent0;          // 0x0568 (size: 0x8)
    class UStaticMeshComponent* UBeam_Strut_Straight62_StaticMeshComponent0;          // 0x0570 (size: 0x8)
    class UStaticMeshComponent* UBeam_Strut_Straight61_StaticMeshComponent0;          // 0x0578 (size: 0x8)
    class UStaticMeshComponent* UBeam_Strut_Straight60_StaticMeshComponent0;          // 0x0580 (size: 0x8)
    class UStaticMeshComponent* UBeam_Strut_Straight59_StaticMeshComponent0;          // 0x0588 (size: 0x8)
    class UStaticMeshComponent* UBeam_Strut_Straight58_StaticMeshComponent0;          // 0x0590 (size: 0x8)
    class UStaticMeshComponent* roofWoodShedD_disp2_StaticMeshComponent0;             // 0x0598 (size: 0x8)
    class UStaticMeshComponent* ropeKnotA16_StaticMeshComponent0;                     // 0x05A0 (size: 0x8)
    class UStaticMeshComponent* ropeKnotA15_StaticMeshComponent0;                     // 0x05A8 (size: 0x8)
    class UStaticMeshComponent* ropeKnotA14_StaticMeshComponent0;                     // 0x05B0 (size: 0x8)
    class UStaticMeshComponent* ropeKnotA13_StaticMeshComponent0;                     // 0x05B8 (size: 0x8)
    class UStaticMeshComponent* ropeKnotA12_StaticMeshComponent0;                     // 0x05C0 (size: 0x8)
    class UStaticMeshComponent* ropeKnotA11_StaticMeshComponent0;                     // 0x05C8 (size: 0x8)
    class UStaticMeshComponent* ropeKnotA6_StaticMeshComponent0;                      // 0x05D0 (size: 0x8)
    class UStaticMeshComponent* ropeKnotA5_StaticMeshComponent0;                      // 0x05D8 (size: 0x8)
    class UStaticMeshComponent* beehive_straw_luv6_StaticMeshComponent0;              // 0x05E0 (size: 0x8)
    class UStaticMeshComponent* beehive_straw_luv5_StaticMeshComponent0;              // 0x05E8 (size: 0x8)
    class UStaticMeshComponent* beehive_straw_luv4_StaticMeshComponent0;              // 0x05F0 (size: 0x8)
    class UStaticMeshComponent* UBeam_Strut_Straight57_StaticMeshComponent0;          // 0x05F8 (size: 0x8)
    class UStaticMeshComponent* UBeam_Strut_Straight56_StaticMeshComponent0;          // 0x0600 (size: 0x8)
    class UStaticMeshComponent* UBeam_Strut_Straight55_StaticMeshComponent0;          // 0x0608 (size: 0x8)
    class UStaticMeshComponent* UBeam_Strut_Straight54_StaticMeshComponent0;          // 0x0610 (size: 0x8)
    class UStaticMeshComponent* UBeam_Strut_Straight53_StaticMeshComponent0;          // 0x0618 (size: 0x8)
    class UStaticMeshComponent* UBeam_Strut_Straight52_StaticMeshComponent0;          // 0x0620 (size: 0x8)
    class UStaticMeshComponent* UBeam_Strut_Straight51_StaticMeshComponent0;          // 0x0628 (size: 0x8)
    class UStaticMeshComponent* UBeam_Strut_Straight50_StaticMeshComponent0;          // 0x0630 (size: 0x8)
    class UStaticMeshComponent* UBeam_Strut_Straight49_StaticMeshComponent0;          // 0x0638 (size: 0x8)
    class UStaticMeshComponent* UBeam_Strut_Straight48_StaticMeshComponent0;          // 0x0640 (size: 0x8)
    class UStaticMeshComponent* UBeam_Strut_Straight47_StaticMeshComponent0;          // 0x0648 (size: 0x8)
    class UStaticMeshComponent* UBeam_Strut_Straight46_StaticMeshComponent0;          // 0x0650 (size: 0x8)
    class UStaticMeshComponent* UBeam_Strut_Straight45_StaticMeshComponent0;          // 0x0658 (size: 0x8)
    class UStaticMeshComponent* UBeam_Strut_Straight44_StaticMeshComponent0;          // 0x0660 (size: 0x8)
    class UStaticMeshComponent* UBeam_Strut_Straight43_StaticMeshComponent0;          // 0x0668 (size: 0x8)
    class UStaticMeshComponent* UBeam_Strut_Straight42_StaticMeshComponent0;          // 0x0670 (size: 0x8)
    class UStaticMeshComponent* UBeam_Strut_Straight41_StaticMeshComponent0;          // 0x0678 (size: 0x8)
    class UStaticMeshComponent* UBeam_Strut_Straight40_StaticMeshComponent0;          // 0x0680 (size: 0x8)
    class UStaticMeshComponent* UBeam_Strut_Straight39_StaticMeshComponent0;          // 0x0688 (size: 0x8)
    class UStaticMeshComponent* UBeam_Strut_Straight38_StaticMeshComponent0;          // 0x0690 (size: 0x8)
    class USceneComponent* Actor4_DefaultSceneRoot;                                   // 0x0698 (size: 0x8)

}; // Size: 0x6A0

#endif
