#ifndef UE4SS_SDK_C_SG_Shed_Large_planked_HPP
#define UE4SS_SDK_C_SG_Shed_Large_planked_HPP

class AC_SG_Shed_Large_planked_C : public AConstructionBP_C
{
    class UStaticMeshComponent* owidzThatch_Filled4_StaticMeshComponent0;             // 0x0550 (size: 0x8)
    class UStaticMeshComponent* owidzThatch_Filled3_StaticMeshComponent0;             // 0x0558 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly63_StaticMeshComponent0;    // 0x0560 (size: 0x8)
    class UStaticMeshComponent* sg_woodenGableA6_StaticMeshComponent0;                // 0x0568 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly62_StaticMeshComponent0;    // 0x0570 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly61_StaticMeshComponent0;    // 0x0578 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly60_StaticMeshComponent0;    // 0x0580 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly59_StaticMeshComponent0;    // 0x0588 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly58_StaticMeshComponent0;    // 0x0590 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly57_StaticMeshComponent0;    // 0x0598 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly56_StaticMeshComponent0;    // 0x05A0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly55_StaticMeshComponent0;    // 0x05A8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly54_StaticMeshComponent0;    // 0x05B0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly53_StaticMeshComponent0;    // 0x05B8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly52_StaticMeshComponent0;    // 0x05C0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_CylinderLowpoly51_StaticMeshComponent0;    // 0x05C8 (size: 0x8)
    class UStaticMeshComponent* sg_woodenGableA5_StaticMeshComponent0;                // 0x05D0 (size: 0x8)
    class UStaticMeshComponent* sg_woodenGableA4_StaticMeshComponent0;                // 0x05D8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m194_StaticMeshComponent0;                // 0x05E0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m193_StaticMeshComponent0;                // 0x05E8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m192_StaticMeshComponent0;                // 0x05F0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m191_StaticMeshComponent0;                // 0x05F8 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Tapered_Cut35_StaticMeshComponent0;         // 0x0600 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m190_StaticMeshComponent0;                // 0x0608 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m189_StaticMeshComponent0;                // 0x0610 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Tapered_Cut34_StaticMeshComponent0;         // 0x0618 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m188_StaticMeshComponent0;                // 0x0620 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m187_StaticMeshComponent0;                // 0x0628 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Tapered_Cut33_StaticMeshComponent0;         // 0x0630 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m186_StaticMeshComponent0;                // 0x0638 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m185_StaticMeshComponent0;                // 0x0640 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Tapered_Cut32_StaticMeshComponent0;         // 0x0648 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m184_StaticMeshComponent0;                // 0x0650 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m183_StaticMeshComponent0;                // 0x0658 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Tapered_Cut31_StaticMeshComponent0;         // 0x0660 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m182_StaticMeshComponent0;                // 0x0668 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m181_StaticMeshComponent0;                // 0x0670 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Tapered_Cut30_StaticMeshComponent0;         // 0x0678 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m180_StaticMeshComponent0;                // 0x0680 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m179_StaticMeshComponent0;                // 0x0688 (size: 0x8)
    class UStaticMeshComponent* sg_WallRough_A44_StaticMeshComponent0;                // 0x0690 (size: 0x8)
    class UStaticMeshComponent* sg_WallRough_C36_StaticMeshComponent0;                // 0x0698 (size: 0x8)
    class UStaticMeshComponent* sg_WallRough_C35_StaticMeshComponent0;                // 0x06A0 (size: 0x8)
    class UStaticMeshComponent* sg_WallRough_B18_StaticMeshComponent0;                // 0x06A8 (size: 0x8)
    class UStaticMeshComponent* sg_WallRough_A43_StaticMeshComponent0;                // 0x06B0 (size: 0x8)
    class UStaticMeshComponent* sg_WallRough_A42_StaticMeshComponent0;                // 0x06B8 (size: 0x8)
    class UStaticMeshComponent* sg_WallRough_C34_StaticMeshComponent0;                // 0x06C0 (size: 0x8)
    class UStaticMeshComponent* sg_WallRough_C33_StaticMeshComponent0;                // 0x06C8 (size: 0x8)
    class UStaticMeshComponent* sg_WallRough_B17_StaticMeshComponent0;                // 0x06D0 (size: 0x8)
    class UStaticMeshComponent* sg_WallRough_A41_StaticMeshComponent0;                // 0x06D8 (size: 0x8)
    class UStaticMeshComponent* sg_WallRough_A40_StaticMeshComponent0;                // 0x06E0 (size: 0x8)
    class UStaticMeshComponent* sg_WallRough_A39_StaticMeshComponent0;                // 0x06E8 (size: 0x8)
    class UStaticMeshComponent* sg_WallRough_C32_StaticMeshComponent0;                // 0x06F0 (size: 0x8)
    class UStaticMeshComponent* sg_WallRough_C31_StaticMeshComponent0;                // 0x06F8 (size: 0x8)
    class UStaticMeshComponent* sg_WallRough_B16_StaticMeshComponent0;                // 0x0700 (size: 0x8)
    class UStaticMeshComponent* sg_WallRough_A38_StaticMeshComponent0;                // 0x0708 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_66_StaticMeshComponent0; // 0x0710 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_65_StaticMeshComponent0; // 0x0718 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_64_StaticMeshComponent0; // 0x0720 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_63_StaticMeshComponent0; // 0x0728 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Tapered_Cut29_StaticMeshComponent0;         // 0x0730 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_62_StaticMeshComponent0; // 0x0738 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_61_StaticMeshComponent0; // 0x0740 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_60_StaticMeshComponent0; // 0x0748 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam1_5m_orSth19_StaticMeshComponent0;         // 0x0750 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam1_5m_orSth18_StaticMeshComponent0;         // 0x0758 (size: 0x8)
    class UStaticMeshComponent* sg_WallRough_A37_StaticMeshComponent0;                // 0x0760 (size: 0x8)
    class UStaticMeshComponent* sg_WallRough_C30_StaticMeshComponent0;                // 0x0768 (size: 0x8)
    class UStaticMeshComponent* sg_WallRough_A36_StaticMeshComponent0;                // 0x0770 (size: 0x8)
    class UStaticMeshComponent* sg_WallRough_C29_StaticMeshComponent0;                // 0x0778 (size: 0x8)
    class UStaticMeshComponent* sg_WallRough_B15_StaticMeshComponent0;                // 0x0780 (size: 0x8)
    class UStaticMeshComponent* sg_WallRough_A35_StaticMeshComponent0;                // 0x0788 (size: 0x8)
    class UStaticMeshComponent* sg_WallRough_A34_StaticMeshComponent0;                // 0x0790 (size: 0x8)
    class UStaticMeshComponent* SM_Beam6m_Tapered_Cut28_StaticMeshComponent0;         // 0x0798 (size: 0x8)
    class UStaticMeshComponent* sg_WallRough_A33_StaticMeshComponent0;                // 0x07A0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m178_StaticMeshComponent0;                // 0x07A8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m177_StaticMeshComponent0;                // 0x07B0 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_59_StaticMeshComponent0; // 0x07B8 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_58_StaticMeshComponent0; // 0x07C0 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_57_StaticMeshComponent0; // 0x07C8 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_56_StaticMeshComponent0; // 0x07D0 (size: 0x8)
    class UStaticMeshComponent* sg_j_beams_sg_j_beam_diagonal_55_StaticMeshComponent0; // 0x07D8 (size: 0x8)
    class UStaticMeshComponent* sg_WallRough_A32_StaticMeshComponent0;                // 0x07E0 (size: 0x8)
    class UStaticMeshComponent* sg_WallRough_C28_StaticMeshComponent0;                // 0x07E8 (size: 0x8)
    class UStaticMeshComponent* sg_WallRough_C27_StaticMeshComponent0;                // 0x07F0 (size: 0x8)
    class UStaticMeshComponent* sg_WallRough_B14_StaticMeshComponent0;                // 0x07F8 (size: 0x8)
    class UStaticMeshComponent* sg_WallRough_A31_StaticMeshComponent0;                // 0x0800 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short100_StaticMeshComponent0;       // 0x0808 (size: 0x8)
    class UStaticMeshComponent* sg_WallRough_A30_StaticMeshComponent0;                // 0x0810 (size: 0x8)
    class UStaticMeshComponent* sg_WallRough_C26_StaticMeshComponent0;                // 0x0818 (size: 0x8)
    class UStaticMeshComponent* sg_WallRough_C25_StaticMeshComponent0;                // 0x0820 (size: 0x8)
    class UStaticMeshComponent* sg_WallRough_B13_StaticMeshComponent0;                // 0x0828 (size: 0x8)
    class UStaticMeshComponent* sg_WallRough_A29_StaticMeshComponent0;                // 0x0830 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short99_StaticMeshComponent0;        // 0x0838 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam1_5m_orSth17_StaticMeshComponent0;         // 0x0840 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam1_5m_orSth16_StaticMeshComponent0;         // 0x0848 (size: 0x8)
    class UStaticMeshComponent* sg_WallRough_A28_StaticMeshComponent0;                // 0x0850 (size: 0x8)
    class UStaticMeshComponent* sg_WallRough_C24_StaticMeshComponent0;                // 0x0858 (size: 0x8)
    class UStaticMeshComponent* sg_WallRough_A27_StaticMeshComponent0;                // 0x0860 (size: 0x8)
    class UStaticMeshComponent* sg_WallRough_C23_StaticMeshComponent0;                // 0x0868 (size: 0x8)
    class UStaticMeshComponent* sg_WallRough_B12_StaticMeshComponent0;                // 0x0870 (size: 0x8)
    class UStaticMeshComponent* sg_WallRough_A26_StaticMeshComponent0;                // 0x0878 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short98_StaticMeshComponent0;        // 0x0880 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short97_StaticMeshComponent0;        // 0x0888 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short96_StaticMeshComponent0;        // 0x0890 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short95_StaticMeshComponent0;        // 0x0898 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short94_StaticMeshComponent0;        // 0x08A0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short93_StaticMeshComponent0;        // 0x08A8 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short92_StaticMeshComponent0;        // 0x08B0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short91_StaticMeshComponent0;        // 0x08B8 (size: 0x8)
    class UStaticMeshComponent* foundationTiling_A_detailed42_StaticMeshComponent0;   // 0x08C0 (size: 0x8)
    class UStaticMeshComponent* foundationTiling_A_detailed41_StaticMeshComponent0;   // 0x08C8 (size: 0x8)
    class UStaticMeshComponent* foundationTiling_A_detailed40_StaticMeshComponent0;   // 0x08D0 (size: 0x8)
    class UStaticMeshComponent* foundationTiling_A_detailed39_StaticMeshComponent0;   // 0x08D8 (size: 0x8)
    class UStaticMeshComponent* foundationTiling_A_detailed38_StaticMeshComponent0;   // 0x08E0 (size: 0x8)
    class UStaticMeshComponent* foundationTiling_A_detailed37_StaticMeshComponent0;   // 0x08E8 (size: 0x8)
    class UStaticMeshComponent* foundationTiling_A_detailed36_StaticMeshComponent0;   // 0x08F0 (size: 0x8)
    class UStaticMeshComponent* foundationTiling_A_detailed35_StaticMeshComponent0;   // 0x08F8 (size: 0x8)
    class UStaticMeshComponent* foundationTiling_A_detailed34_StaticMeshComponent0;   // 0x0900 (size: 0x8)
    class UStaticMeshComponent* foundationTiling_A_detailed33_StaticMeshComponent0;   // 0x0908 (size: 0x8)
    class UStaticMeshComponent* foundationTiling_A_detailed32_StaticMeshComponent0;   // 0x0910 (size: 0x8)
    class UStaticMeshComponent* foundationTiling_A_detailed31_StaticMeshComponent0;   // 0x0918 (size: 0x8)
    class USceneComponent* sg_shed_large_planked2_DefaultSceneRoot;                   // 0x0920 (size: 0x8)

}; // Size: 0x928

#endif
