#ifndef UE4SS_SDK_C_SG_Farm_Core_HPP
#define UE4SS_SDK_C_SG_Farm_Core_HPP

class AC_SG_Farm_Core_C : public AConstructionBP_C
{
    class UStaticMeshComponent* strut_short39_StaticMeshComponent0;                   // 0x0550 (size: 0x8)
    class UStaticMeshComponent* strut_short38_StaticMeshComponent0;                   // 0x0558 (size: 0x8)
    class UStaticMeshComponent* strut_short37_StaticMeshComponent0;                   // 0x0560 (size: 0x8)
    class UStaticMeshComponent* strut_short36_StaticMeshComponent0;                   // 0x0568 (size: 0x8)
    class UStaticMeshComponent* strut_short35_StaticMeshComponent0;                   // 0x0570 (size: 0x8)
    class UStaticMeshComponent* strut_short34_StaticMeshComponent0;                   // 0x0578 (size: 0x8)
    class UStaticMeshComponent* strut_short33_StaticMeshComponent0;                   // 0x0580 (size: 0x8)
    class UStaticMeshComponent* strut_short32_StaticMeshComponent0;                   // 0x0588 (size: 0x8)
    class UStaticMeshComponent* strut_short31_StaticMeshComponent0;                   // 0x0590 (size: 0x8)
    class UStaticMeshComponent* strut_short30_StaticMeshComponent0;                   // 0x0598 (size: 0x8)
    class UStaticMeshComponent* strut_short29_StaticMeshComponent0;                   // 0x05A0 (size: 0x8)
    class UStaticMeshComponent* strut_short28_StaticMeshComponent0;                   // 0x05A8 (size: 0x8)
    class UStaticMeshComponent* strut_short27_StaticMeshComponent0;                   // 0x05B0 (size: 0x8)
    class UStaticMeshComponent* strut_short26_StaticMeshComponent0;                   // 0x05B8 (size: 0x8)
    class UStaticMeshComponent* rafter24_StaticMeshComponent0;                        // 0x05C0 (size: 0x8)
    class UStaticMeshComponent* rafter23_StaticMeshComponent0;                        // 0x05C8 (size: 0x8)
    class UStaticMeshComponent* rafter22_StaticMeshComponent0;                        // 0x05D0 (size: 0x8)
    class UStaticMeshComponent* rafter21_StaticMeshComponent0;                        // 0x05D8 (size: 0x8)
    class UStaticMeshComponent* rafter20_StaticMeshComponent0;                        // 0x05E0 (size: 0x8)
    class UStaticMeshComponent* rafter19_StaticMeshComponent0;                        // 0x05E8 (size: 0x8)
    class UStaticMeshComponent* rafter18_StaticMeshComponent0;                        // 0x05F0 (size: 0x8)
    class UStaticMeshComponent* rafter17_StaticMeshComponent0;                        // 0x05F8 (size: 0x8)
    class UStaticMeshComponent* rafter16_StaticMeshComponent0;                        // 0x0600 (size: 0x8)
    class UStaticMeshComponent* rafter15_StaticMeshComponent0;                        // 0x0608 (size: 0x8)
    class UStaticMeshComponent* rafter6_StaticMeshComponent0;                         // 0x0610 (size: 0x8)
    class UStaticMeshComponent* rafter5_StaticMeshComponent0;                         // 0x0618 (size: 0x8)
    class UStaticMeshComponent* sg_thatchSq2_StaticMeshComponent0;                    // 0x0620 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m606_StaticMeshComponent0;                // 0x0628 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m605_StaticMeshComponent0;                // 0x0630 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m604_StaticMeshComponent0;                // 0x0638 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m603_StaticMeshComponent0;                // 0x0640 (size: 0x8)
    class UStaticMeshComponent* sg_shutterA_short18_StaticMeshComponent0;             // 0x0648 (size: 0x8)
    class UStaticMeshComponent* sg_shutterA_short17_StaticMeshComponent0;             // 0x0650 (size: 0x8)
    class UStaticMeshComponent* sg_shutterA_short16_StaticMeshComponent0;             // 0x0658 (size: 0x8)
    class UStaticMeshComponent* sg_shutterA_short15_StaticMeshComponent0;             // 0x0660 (size: 0x8)
    class UStaticMeshComponent* Cube6_StaticMeshComponent0;                           // 0x0668 (size: 0x8)
    class UStaticMeshComponent* Cube5_StaticMeshComponent0;                           // 0x0670 (size: 0x8)
    class UStaticMeshComponent* PlaneDenseWindowsKitchen20_StaticMeshComponent0;      // 0x0678 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m602_StaticMeshComponent0;                // 0x0680 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m601_StaticMeshComponent0;                // 0x0688 (size: 0x8)
    class UStaticMeshComponent* doorHeadA5_StaticMeshComponent0;                      // 0x0690 (size: 0x8)
    class UStaticMeshComponent* PlaneDenseWindowsKitchen19_StaticMeshComponent0;      // 0x0698 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m600_StaticMeshComponent0;                // 0x06A0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m599_StaticMeshComponent0;                // 0x06A8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m598_StaticMeshComponent0;                // 0x06B0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m597_StaticMeshComponent0;                // 0x06B8 (size: 0x8)
    class UStaticMeshComponent* PlaneDenseWindowsKitchen18_StaticMeshComponent0;      // 0x06C0 (size: 0x8)
    class UStaticMeshComponent* PlaneDenseWindowsKitchen17_StaticMeshComponent0;      // 0x06C8 (size: 0x8)
    class UStaticMeshComponent* PlaneDenseWindowsKitchen16_StaticMeshComponent0;      // 0x06D0 (size: 0x8)
    class UStaticMeshComponent* PlaneDenseWindowsKitchen15_StaticMeshComponent0;      // 0x06D8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m596_StaticMeshComponent0;                // 0x06E0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m595_StaticMeshComponent0;                // 0x06E8 (size: 0x8)
    class UStaticMeshComponent* foundationTiling_A_detailed176_StaticMeshComponent0;  // 0x06F0 (size: 0x8)
    class UStaticMeshComponent* foundationTiling_A_detailed175_StaticMeshComponent0;  // 0x06F8 (size: 0x8)
    class UStaticMeshComponent* foundationTiling_A_detailed174_StaticMeshComponent0;  // 0x0700 (size: 0x8)
    class UStaticMeshComponent* foundationTiling_A_detailed173_StaticMeshComponent0;  // 0x0708 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m594_StaticMeshComponent0;                // 0x0710 (size: 0x8)
    class UStaticMeshComponent* foundationTiling_A_detailed172_StaticMeshComponent0;  // 0x0718 (size: 0x8)
    class UStaticMeshComponent* foundationTiling_A_detailed171_StaticMeshComponent0;  // 0x0720 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short361_StaticMeshComponent0;       // 0x0728 (size: 0x8)
    class UStaticMeshComponent* foundationTiling_A_detailed170_StaticMeshComponent0;  // 0x0730 (size: 0x8)
    class UStaticMeshComponent* foundationTiling_A_detailed169_StaticMeshComponent0;  // 0x0738 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m593_StaticMeshComponent0;                // 0x0740 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short360_StaticMeshComponent0;       // 0x0748 (size: 0x8)
    class UStaticMeshComponent* foundationTiling_A_detailed168_StaticMeshComponent0;  // 0x0750 (size: 0x8)
    class UStaticMeshComponent* foundationTiling_A_detailed167_StaticMeshComponent0;  // 0x0758 (size: 0x8)
    class UStaticMeshComponent* PlaneDenseWindowsKitchen14_StaticMeshComponent0;      // 0x0760 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m592_StaticMeshComponent0;                // 0x0768 (size: 0x8)
    class UStaticMeshComponent* foundationTiling_A_detailed166_StaticMeshComponent0;  // 0x0770 (size: 0x8)
    class UStaticMeshComponent* foundationTiling_A_detailed165_StaticMeshComponent0;  // 0x0778 (size: 0x8)
    class UStaticMeshComponent* PlaneDenseWindowsKitchen13_StaticMeshComponent0;      // 0x0780 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m591_StaticMeshComponent0;                // 0x0788 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m590_StaticMeshComponent0;                // 0x0790 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m589_StaticMeshComponent0;                // 0x0798 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m588_StaticMeshComponent0;                // 0x07A0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m587_StaticMeshComponent0;                // 0x07A8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m586_StaticMeshComponent0;                // 0x07B0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m585_StaticMeshComponent0;                // 0x07B8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m584_StaticMeshComponent0;                // 0x07C0 (size: 0x8)
    class UStaticMeshComponent* foundationTiling_A_detailed164_StaticMeshComponent0;  // 0x07C8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m583_StaticMeshComponent0;                // 0x07D0 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short359_StaticMeshComponent0;       // 0x07D8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m582_StaticMeshComponent0;                // 0x07E0 (size: 0x8)
    class UStaticMeshComponent* foundationTiling_A_detailed163_StaticMeshComponent0;  // 0x07E8 (size: 0x8)
    class UStaticMeshComponent* foundationTiling_A_detailed162_StaticMeshComponent0;  // 0x07F0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBeam3m581_StaticMeshComponent0;                // 0x07F8 (size: 0x8)
    class UStaticMeshComponent* foundationTiling_A_detailed161_StaticMeshComponent0;  // 0x0800 (size: 0x8)
    class UStaticMeshComponent* All_Aboard_pivot_short356_StaticMeshComponent0;       // 0x0808 (size: 0x8)
    class UStaticMeshComponent* foundationTiling_A_detailed156_StaticMeshComponent0;  // 0x0810 (size: 0x8)
    class UStaticMeshComponent* PlaneDenseWindowsKitchen12_StaticMeshComponent0;      // 0x0818 (size: 0x8)
    class UStaticMeshComponent* PlaneDenseWindowsKitchen11_StaticMeshComponent0;      // 0x0820 (size: 0x8)
    class UStaticMeshComponent* doorHeadA4_StaticMeshComponent0;                      // 0x0828 (size: 0x8)
    class USceneComponent* SG_Farm_Core2_DefaultSceneRoot;                            // 0x0830 (size: 0x8)

}; // Size: 0x838

#endif
