#ifndef UE4SS_SDK_C_SG_Weaver_Core_Ubeam_HPP
#define UE4SS_SDK_C_SG_Weaver_Core_Ubeam_HPP

class AC_SG_Weaver_Core_Ubeam_C : public AConstructionBP_C
{
    class UStaticMeshComponent* UBeam_1_5_m125_StaticMeshComponent0;                  // 0x0550 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m126_StaticMeshComponent0;                  // 0x0558 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m127_StaticMeshComponent0;                  // 0x0560 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m128_StaticMeshComponent0;                  // 0x0568 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m129_StaticMeshComponent0;                  // 0x0570 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m130_StaticMeshComponent0;                  // 0x0578 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m131_StaticMeshComponent0;                  // 0x0580 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m132_StaticMeshComponent0;                  // 0x0588 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m_Noise3_StaticMeshComponent0;                 // 0x0590 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m_Noise4_StaticMeshComponent0;                 // 0x0598 (size: 0x8)
    class UStaticMeshComponent* UBeam_Tapered_CutE_thiner7_StaticMeshComponent0;      // 0x05A0 (size: 0x8)
    class UStaticMeshComponent* UBeam_Tapered_CutE_thiner8_StaticMeshComponent0;      // 0x05A8 (size: 0x8)
    class UStaticMeshComponent* UBeam_Tapered_CutE_thiner9_StaticMeshComponent0;      // 0x05B0 (size: 0x8)
    class UStaticMeshComponent* UBeam_Tapered_CutE_thiner10_StaticMeshComponent0;     // 0x05B8 (size: 0x8)
    class UStaticMeshComponent* UBeam_Tapered_CutE_thiner11_StaticMeshComponent0;     // 0x05C0 (size: 0x8)
    class UStaticMeshComponent* UBeam_Tapered_CutE_thiner12_StaticMeshComponent0;     // 0x05C8 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m_Noise21_StaticMeshComponent0;                // 0x05D0 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m_Noise22_StaticMeshComponent0;                // 0x05D8 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m_Noise23_StaticMeshComponent0;                // 0x05E0 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m_Noise24_StaticMeshComponent0;                // 0x05E8 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m_Noise25_StaticMeshComponent0;                // 0x05F0 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m133_StaticMeshComponent0;                  // 0x05F8 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m134_StaticMeshComponent0;                  // 0x0600 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m135_StaticMeshComponent0;                  // 0x0608 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m136_StaticMeshComponent0;                  // 0x0610 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m_Noise26_StaticMeshComponent0;                // 0x0618 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m_Noise27_StaticMeshComponent0;                // 0x0620 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m_Noise28_StaticMeshComponent0;                // 0x0628 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m_Noise29_StaticMeshComponent0;                // 0x0630 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m13_StaticMeshComponent0;                      // 0x0638 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m14_StaticMeshComponent0;                      // 0x0640 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m15_StaticMeshComponent0;                      // 0x0648 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m16_StaticMeshComponent0;                      // 0x0650 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m17_StaticMeshComponent0;                      // 0x0658 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m18_StaticMeshComponent0;                      // 0x0660 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m19_StaticMeshComponent0;                      // 0x0668 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m20_StaticMeshComponent0;                      // 0x0670 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m21_StaticMeshComponent0;                      // 0x0678 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m22_StaticMeshComponent0;                      // 0x0680 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m23_StaticMeshComponent0;                      // 0x0688 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m24_StaticMeshComponent0;                      // 0x0690 (size: 0x8)
    class UStaticMeshComponent* UBeam_Strut_Straight6_StaticMeshComponent0;           // 0x0698 (size: 0x8)
    class UStaticMeshComponent* UBeam_Strut_Straight7_StaticMeshComponent0;           // 0x06A0 (size: 0x8)
    class UStaticMeshComponent* UBeam_Strut_Straight8_StaticMeshComponent0;           // 0x06A8 (size: 0x8)
    class UStaticMeshComponent* UBeam_Strut_Straight9_StaticMeshComponent0;           // 0x06B0 (size: 0x8)
    class UStaticMeshComponent* UBeam_Strut_Straight10_StaticMeshComponent0;          // 0x06B8 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m137_StaticMeshComponent0;                  // 0x06C0 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m138_StaticMeshComponent0;                  // 0x06C8 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m139_StaticMeshComponent0;                  // 0x06D0 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m140_StaticMeshComponent0;                  // 0x06D8 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m141_StaticMeshComponent0;                  // 0x06E0 (size: 0x8)
    class UStaticMeshComponent* UBeam_1_5_m142_StaticMeshComponent0;                  // 0x06E8 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m_Noise30_StaticMeshComponent0;                // 0x06F0 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m_Noise31_StaticMeshComponent0;                // 0x06F8 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m_Noise32_StaticMeshComponent0;                // 0x0700 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m_Noise33_StaticMeshComponent0;                // 0x0708 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m_Noise34_StaticMeshComponent0;                // 0x0710 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_29_StaticMeshComponent0;               // 0x0718 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_30_StaticMeshComponent0;               // 0x0720 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_31_StaticMeshComponent0;               // 0x0728 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_32_StaticMeshComponent0;               // 0x0730 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_33_StaticMeshComponent0;               // 0x0738 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_34_StaticMeshComponent0;               // 0x0740 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_35_StaticMeshComponent0;               // 0x0748 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_36_StaticMeshComponent0;               // 0x0750 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_37_StaticMeshComponent0;               // 0x0758 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_38_StaticMeshComponent0;               // 0x0760 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_39_StaticMeshComponent0;               // 0x0768 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_40_StaticMeshComponent0;               // 0x0770 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_41_StaticMeshComponent0;               // 0x0778 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_42_StaticMeshComponent0;               // 0x0780 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_43_StaticMeshComponent0;               // 0x0788 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_44_StaticMeshComponent0;               // 0x0790 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_45_StaticMeshComponent0;               // 0x0798 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_46_StaticMeshComponent0;               // 0x07A0 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_47_StaticMeshComponent0;               // 0x07A8 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_48_StaticMeshComponent0;               // 0x07B0 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_49_StaticMeshComponent0;               // 0x07B8 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_50_StaticMeshComponent0;               // 0x07C0 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_51_StaticMeshComponent0;               // 0x07C8 (size: 0x8)
    class UStaticMeshComponent* UBeam_Diagonal_52_StaticMeshComponent0;               // 0x07D0 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg34_StaticMeshComponent0;     // 0x07D8 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg51_StaticMeshComponent0;     // 0x07E0 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg52_StaticMeshComponent0;     // 0x07E8 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg53_StaticMeshComponent0;     // 0x07F0 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg54_StaticMeshComponent0;     // 0x07F8 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg55_StaticMeshComponent0;     // 0x0800 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg56_StaticMeshComponent0;     // 0x0808 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg57_StaticMeshComponent0;     // 0x0810 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg58_StaticMeshComponent0;     // 0x0818 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg59_StaticMeshComponent0;     // 0x0820 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg60_StaticMeshComponent0;     // 0x0828 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg61_StaticMeshComponent0;     // 0x0830 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg62_StaticMeshComponent0;     // 0x0838 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg63_StaticMeshComponent0;     // 0x0840 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg64_StaticMeshComponent0;     // 0x0848 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg65_StaticMeshComponent0;     // 0x0850 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg66_StaticMeshComponent0;     // 0x0858 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg67_StaticMeshComponent0;     // 0x0860 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg68_StaticMeshComponent0;     // 0x0868 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg69_StaticMeshComponent0;     // 0x0870 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg70_StaticMeshComponent0;     // 0x0878 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg71_StaticMeshComponent0;     // 0x0880 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg72_StaticMeshComponent0;     // 0x0888 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg73_StaticMeshComponent0;     // 0x0890 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg74_StaticMeshComponent0;     // 0x0898 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg75_StaticMeshComponent0;     // 0x08A0 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg76_StaticMeshComponent0;     // 0x08A8 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg77_StaticMeshComponent0;     // 0x08B0 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg78_StaticMeshComponent0;     // 0x08B8 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg79_StaticMeshComponent0;     // 0x08C0 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg80_StaticMeshComponent0;     // 0x08C8 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg81_StaticMeshComponent0;     // 0x08D0 (size: 0x8)
    class UStaticMeshComponent* UBeam_CylinderLowpoly_Peg82_StaticMeshComponent0;     // 0x08D8 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_TwoWindowsStandard_Wide9_StaticMeshComponent0; // 0x08E0 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_TwoWindowsStandard_Wide10_StaticMeshComponent0; // 0x08E8 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Standard2_StaticMeshComponent0;            // 0x08F0 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_TwoWindowsStandard_Wide12_StaticMeshComponent0; // 0x08F8 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m_Noise35_StaticMeshComponent0;                // 0x0900 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_TwoWindowsStandard_Wide13_StaticMeshComponent0; // 0x0908 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Corner5_StaticMeshComponent0;              // 0x0910 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Corner6_StaticMeshComponent0;              // 0x0918 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Narrow4_StaticMeshComponent0;              // 0x0920 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_SlitThinner2_StaticMeshComponent0;         // 0x0928 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Narrow5_StaticMeshComponent0;              // 0x0930 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Narrow6_StaticMeshComponent0;              // 0x0938 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_TwoWindowsStandard_Wide14_StaticMeshComponent0; // 0x0940 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_TwoWindowsStandard_Wide15_StaticMeshComponent0; // 0x0948 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Corner7_StaticMeshComponent0;              // 0x0950 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_Corner8_StaticMeshComponent0;              // 0x0958 (size: 0x8)
    class UStaticMeshComponent* UDaubPlane_TwoWindowsStandard_Wide16_StaticMeshComponent0; // 0x0960 (size: 0x8)
    class UStaticMeshComponent* UGable_Standard4_StaticMeshComponent0;                // 0x0968 (size: 0x8)
    class UStaticMeshComponent* UBeam_WindowSingle8_StaticMeshComponent0;             // 0x0970 (size: 0x8)
    class UStaticMeshComponent* UBeam_WindowSingle9_StaticMeshComponent0;             // 0x0978 (size: 0x8)
    class UStaticMeshComponent* UBeam_WindowSingle10_StaticMeshComponent0;            // 0x0980 (size: 0x8)
    class UStaticMeshComponent* UBeam_WindowSingle11_StaticMeshComponent0;            // 0x0988 (size: 0x8)
    class UStaticMeshComponent* UBeam_WindowSingle12_StaticMeshComponent0;            // 0x0990 (size: 0x8)
    class UStaticMeshComponent* UBeam_WindowSingle13_StaticMeshComponent0;            // 0x0998 (size: 0x8)
    class UStaticMeshComponent* UBeam_WindowSingle14_StaticMeshComponent0;            // 0x09A0 (size: 0x8)
    class UStaticMeshComponent* Foundation_SG_WeaverCore_Ubeam2_StaticMeshComponent0; // 0x09A8 (size: 0x8)
    class UStaticMeshComponent* UBeam_6m_Noise36_StaticMeshComponent0;                // 0x09B0 (size: 0x8)
    class UStaticMeshComponent* Cube7_StaticMeshComponent0;                           // 0x09B8 (size: 0x8)
    class UStaticMeshComponent* Cube8_StaticMeshComponent0;                           // 0x09C0 (size: 0x8)
    class UStaticMeshComponent* Thatch_SG_WeaverCore_Ubeam2_StaticMeshComponent0;     // 0x09C8 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoard3_StaticMeshComponent0;              // 0x09D0 (size: 0x8)
    class UStaticMeshComponent* UBeam_FillerBoard4_StaticMeshComponent0;              // 0x09D8 (size: 0x8)
    class UStaticMeshComponent* WattleOwidzTriangle5_StaticMeshComponent0;            // 0x09E0 (size: 0x8)
    class USceneComponent* C_SG_Weaver_Core_Ubeam_DefaultSceneRoot;                   // 0x09E8 (size: 0x8)

}; // Size: 0x9F0

#endif
