#ifndef UE4SS_SDK_c_warehouse_HPP
#define UE4SS_SDK_c_warehouse_HPP

class Ac_warehouse_C : public AConstructionBP_C
{
    class UStaticMeshComponent* all_aboard_longboardB_StaticMeshComponent12;          // 0x0550 (size: 0x8)
    class UStaticMeshComponent* Blackness;                                            // 0x0558 (size: 0x8)
    class UStaticMeshComponent* all_aboard_longboardB_StaticMeshComponent11;          // 0x0560 (size: 0x8)
    class UStaticMeshComponent* all_aboard_longboardB_StaticMeshComponent10;          // 0x0568 (size: 0x8)
    class UStaticMeshComponent* all_aboard_longboardB_StaticMeshComponent9;           // 0x0570 (size: 0x8)
    class UStaticMeshComponent* all_aboard_longboardB_StaticMeshComponent8;           // 0x0578 (size: 0x8)
    class UStaticMeshComponent* all_aboard_longboardB_StaticMeshComponent7;           // 0x0580 (size: 0x8)
    class UStaticMeshComponent* all_aboard_longboardB_StaticMeshComponent6;           // 0x0588 (size: 0x8)
    class UStaticMeshComponent* all_aboard_longboardB_StaticMeshComponent5;           // 0x0590 (size: 0x8)
    class UStaticMeshComponent* all_aboard_longboardB_StaticMeshComponent4;           // 0x0598 (size: 0x8)
    class UStaticMeshComponent* all_aboard_longboardB_StaticMeshComponent3;           // 0x05A0 (size: 0x8)
    class UStaticMeshComponent* all_aboard_longboardB_StaticMeshComponent2;           // 0x05A8 (size: 0x8)
    class UStaticMeshComponent* all_aboard_longboardB_StaticMeshComponent1;           // 0x05B0 (size: 0x8)
    class UStaticMeshComponent* r3;                                                   // 0x05B8 (size: 0x8)
    class UStaticMeshComponent* r2;                                                   // 0x05C0 (size: 0x8)
    class UStaticMeshComponent* r1;                                                   // 0x05C8 (size: 0x8)
    class UStaticMeshComponent* R;                                                    // 0x05D0 (size: 0x8)
    class UStaticMeshComponent* SM_Rope04_StaticMeshComponent0;                       // 0x05D8 (size: 0x8)
    class UStaticMeshComponent* SM_MERGED_woodenRoofMegas17_190_StaticMeshComponent0; // 0x05E0 (size: 0x8)
    class UStaticMeshComponent* SM_Ladder_3_StaticMeshComponent0;                     // 0x05E8 (size: 0x8)
    class UStaticMeshComponent* SM_Ladder_2_StaticMeshComponent0;                     // 0x05F0 (size: 0x8)
    class UStaticMeshComponent* ropeSwingingA2_StaticMeshComponent0;                  // 0x05F8 (size: 0x8)
    class UStaticMeshComponent* ropeSwingingA_StaticMeshComponent0;                   // 0x0600 (size: 0x8)
    class UStaticMeshComponent* Plane55_StaticMeshComponent0;                         // 0x0608 (size: 0x8)
    class UStaticMeshComponent* Plane54_StaticMeshComponent0;                         // 0x0610 (size: 0x8)
    class UStaticMeshComponent* Plane53_StaticMeshComponent0;                         // 0x0618 (size: 0x8)
    class UStaticMeshComponent* Plane52_StaticMeshComponent0;                         // 0x0620 (size: 0x8)
    class UStaticMeshComponent* Plane35_StaticMeshComponent0;                         // 0x0628 (size: 0x8)
    class UStaticMeshComponent* Plane30_StaticMeshComponent0;                         // 0x0630 (size: 0x8)
    class UStaticMeshComponent* Plane29_StaticMeshComponent0;                         // 0x0638 (size: 0x8)
    class UStaticMeshComponent* Plane28_StaticMeshComponent0;                         // 0x0640 (size: 0x8)
    class UStaticMeshComponent* Plane27_StaticMeshComponent0;                         // 0x0648 (size: 0x8)
    class UStaticMeshComponent* pb_buildingTopCapWide2_StaticMeshComponent0;          // 0x0650 (size: 0x8)
    class UStaticMeshComponent* pb_buildingTopCapWide_StaticMeshComponent0;           // 0x0658 (size: 0x8)
    class UStaticMeshComponent* groundGrass19_StaticMeshComponent0;                   // 0x0660 (size: 0x8)
    class UStaticMeshComponent* groundGrass18_StaticMeshComponent0;                   // 0x0668 (size: 0x8)
    class UStaticMeshComponent* groundGrass17_StaticMeshComponent0;                   // 0x0670 (size: 0x8)
    class UStaticMeshComponent* groundGrass15_StaticMeshComponent0;                   // 0x0678 (size: 0x8)
    class UStaticMeshComponent* groundGrass11_StaticMeshComponent0;                   // 0x0680 (size: 0x8)
    class UStaticMeshComponent* groundGrass10_StaticMeshComponent0;                   // 0x0688 (size: 0x8)
    class UStaticMeshComponent* groundGrass9_StaticMeshComponent0;                    // 0x0690 (size: 0x8)
    class UStaticMeshComponent* Floor_400x402_StaticMeshComponent0;                   // 0x0698 (size: 0x8)
    class UStaticMeshComponent* Floor_400x401_StaticMeshComponent0;                   // 0x06A0 (size: 0x8)
    class UStaticMeshComponent* doorMegaA_noHinge6_StaticMeshComponent0;              // 0x06A8 (size: 0x8)
    class UStaticMeshComponent* doorMegaA_noHinge5_StaticMeshComponent0;              // 0x06B0 (size: 0x8)
    class UStaticMeshComponent* doorMegaA_noHinge4_StaticMeshComponent0;              // 0x06B8 (size: 0x8)
    class UStaticMeshComponent* doorMegaA_noHinge3_StaticMeshComponent0;              // 0x06C0 (size: 0x8)
    class UStaticMeshComponent* doorMegaA_noHinge2_StaticMeshComponent0;              // 0x06C8 (size: 0x8)
    class UStaticMeshComponent* doorMegaA_noHinge_StaticMeshComponent0;               // 0x06D0 (size: 0x8)
    class UStaticMeshComponent* dirtHeapA25_StaticMeshComponent0;                     // 0x06D8 (size: 0x8)
    class UStaticMeshComponent* dirtHeapA24_StaticMeshComponent0;                     // 0x06E0 (size: 0x8)
    class UStaticMeshComponent* dirtHeapA23_StaticMeshComponent0;                     // 0x06E8 (size: 0x8)
    class UStaticMeshComponent* dirtHeapA22_StaticMeshComponent0;                     // 0x06F0 (size: 0x8)
    class UStaticMeshComponent* dirtHeapA21_StaticMeshComponent0;                     // 0x06F8 (size: 0x8)
    class UStaticMeshComponent* dirtHeapA20_StaticMeshComponent0;                     // 0x0700 (size: 0x8)
    class UStaticMeshComponent* dirtHeapA19_StaticMeshComponent0;                     // 0x0708 (size: 0x8)
    class UStaticMeshComponent* dirtHeapA9_StaticMeshComponent0;                      // 0x0710 (size: 0x8)
    class UStaticMeshComponent* dirtHeapA4_StaticMeshComponent0;                      // 0x0718 (size: 0x8)
    class UStaticMeshComponent* dirtHeapA3_StaticMeshComponent0;                      // 0x0720 (size: 0x8)
    class UStaticMeshComponent* dirtHeapA2_StaticMeshComponent0;                      // 0x0728 (size: 0x8)
    class UStaticMeshComponent* dirtHeapA_StaticMeshComponent0;                       // 0x0730 (size: 0x8)
    class UStaticMeshComponent* box3_StaticMeshComponent0;                            // 0x0738 (size: 0x8)
    class UStaticMeshComponent* barrel_lod7_StaticMeshComponent0;                     // 0x0740 (size: 0x8)
    class UStaticMeshComponent* barrel_lod6_StaticMeshComponent0;                     // 0x0748 (size: 0x8)
    class UStaticMeshComponent* bag14_StaticMeshComponent0;                           // 0x0750 (size: 0x8)
    class UStaticMeshComponent* bag13_StaticMeshComponent0;                           // 0x0758 (size: 0x8)
    class UStaticMeshComponent* bag12_StaticMeshComponent0;                           // 0x0760 (size: 0x8)
    class UStaticMeshComponent* bag11_StaticMeshComponent0;                           // 0x0768 (size: 0x8)
    class UStaticMeshComponent* bag10_StaticMeshComponent0;                           // 0x0770 (size: 0x8)
    class UStaticMeshComponent* bag9_StaticMeshComponent0;                            // 0x0778 (size: 0x8)
    class UStaticMeshComponent* bag8_StaticMeshComponent0;                            // 0x0780 (size: 0x8)
    class UStaticMeshComponent* bag3_StaticMeshComponent0;                            // 0x0788 (size: 0x8)
    class UStaticMeshComponent* bag2_StaticMeshComponent0;                            // 0x0790 (size: 0x8)
    class UStaticMeshComponent* bag1_StaticMeshComponent0;                            // 0x0798 (size: 0x8)
    class UStaticMeshComponent* Aset_castle_wall_M_sctv3_LOD15_StaticMeshComponent0;  // 0x07A0 (size: 0x8)
    class UStaticMeshComponent* Aset_castle_wall_M_sctv3_LOD14_StaticMeshComponent0;  // 0x07A8 (size: 0x8)
    class UStaticMeshComponent* Aset_castle_wall_M_sctv3_LOD13_StaticMeshComponent0;  // 0x07B0 (size: 0x8)
    class UStaticMeshComponent* Aset_castle_wall_M_sctv3_LOD12_StaticMeshComponent0;  // 0x07B8 (size: 0x8)
    class UStaticMeshComponent* Aset_castle_wall_M_sctv3_LOD11_StaticMeshComponent0;  // 0x07C0 (size: 0x8)
    class UStaticMeshComponent* Aset_castle_wall_M_sctv3_LOD10_StaticMeshComponent0;  // 0x07C8 (size: 0x8)
    class UStaticMeshComponent* Aset_castle_wall_M_sctv3_LOD9_StaticMeshComponent0;   // 0x07D0 (size: 0x8)
    class UStaticMeshComponent* Aset_castle_wall_M_sctv3_LOD8_StaticMeshComponent0;   // 0x07D8 (size: 0x8)
    class UStaticMeshComponent* Aset_castle_wall_M_sctv3_LOD7_StaticMeshComponent0;   // 0x07E0 (size: 0x8)
    class UStaticMeshComponent* Aset_castle_wall_M_sctv3_LOD6_StaticMeshComponent0;   // 0x07E8 (size: 0x8)
    class UStaticMeshComponent* Aset_castle_wall_M_sctv3_LOD5_StaticMeshComponent0;   // 0x07F0 (size: 0x8)
    class UStaticMeshComponent* Aset_castle_wall_M_sctv3_LOD4_StaticMeshComponent0;   // 0x07F8 (size: 0x8)
    class UStaticMeshComponent* Aset_castle_wall_M_sctv3_LOD3_StaticMeshComponent0;   // 0x0800 (size: 0x8)
    class UStaticMeshComponent* Aset_castle_wall_M_sctv3_LOD2_StaticMeshComponent0;   // 0x0808 (size: 0x8)
    class UStaticMeshComponent* Aset_castle_wall_M_sctv3_LOD1_StaticMeshComponent0;   // 0x0810 (size: 0x8)
    class UStaticMeshComponent* Aset_castle_wall_M_sctv3_LOD0_StaticMeshComponent0;   // 0x0818 (size: 0x8)
    class UStaticMeshComponent* all_aboard_ropeknotA2_StaticMeshComponent0;           // 0x0820 (size: 0x8)
    class UStaticMeshComponent* all_aboard_ropeknotA_StaticMeshComponent0;            // 0x0828 (size: 0x8)
    class UStaticMeshComponent* all_aboard_longboardB75_StaticMeshComponent0;         // 0x0830 (size: 0x8)
    class UStaticMeshComponent* all_aboard_longboardB74_StaticMeshComponent0;         // 0x0838 (size: 0x8)
    class UStaticMeshComponent* all_aboard_longboardB73_StaticMeshComponent0;         // 0x0840 (size: 0x8)
    class UStaticMeshComponent* all_aboard_longboardB72_StaticMeshComponent0;         // 0x0848 (size: 0x8)
    class UStaticMeshComponent* all_aboard_longboardB71_StaticMeshComponent0;         // 0x0850 (size: 0x8)
    class UStaticMeshComponent* all_aboard_longboardB70_StaticMeshComponent0;         // 0x0858 (size: 0x8)
    class UStaticMeshComponent* all_aboard_longboardB69_StaticMeshComponent0;         // 0x0860 (size: 0x8)
    class UStaticMeshComponent* all_aboard_longboardB68_StaticMeshComponent0;         // 0x0868 (size: 0x8)
    class UStaticMeshComponent* all_aboard_longboardB67_StaticMeshComponent0;         // 0x0870 (size: 0x8)
    class UStaticMeshComponent* all_aboard_longboardB65_StaticMeshComponent0;         // 0x0878 (size: 0x8)
    class UStaticMeshComponent* all_aboard_longboardB64_StaticMeshComponent0;         // 0x0880 (size: 0x8)
    class UStaticMeshComponent* all_aboard_longboardB63_StaticMeshComponent0;         // 0x0888 (size: 0x8)
    class UStaticMeshComponent* all_aboard_longboardB62_StaticMeshComponent0;         // 0x0890 (size: 0x8)
    class UStaticMeshComponent* all_aboard_longboardB61_StaticMeshComponent0;         // 0x0898 (size: 0x8)
    class UStaticMeshComponent* all_aboard_longboardB60_StaticMeshComponent0;         // 0x08A0 (size: 0x8)
    class UStaticMeshComponent* all_aboard_longboardB59_StaticMeshComponent0;         // 0x08A8 (size: 0x8)
    class UStaticMeshComponent* all_aboard_longboardB58_StaticMeshComponent0;         // 0x08B0 (size: 0x8)
    class UStaticMeshComponent* all_aboard_longboardB57_StaticMeshComponent0;         // 0x08B8 (size: 0x8)
    class UStaticMeshComponent* all_aboard_longboardB56_StaticMeshComponent0;         // 0x08C0 (size: 0x8)
    class UStaticMeshComponent* all_aboard_longboardB53_StaticMeshComponent0;         // 0x08C8 (size: 0x8)
    class UStaticMeshComponent* all_aboard_longboardB52_StaticMeshComponent0;         // 0x08D0 (size: 0x8)
    class UStaticMeshComponent* all_aboard_longboardB49_StaticMeshComponent0;         // 0x08D8 (size: 0x8)
    class UStaticMeshComponent* all_aboard_longboardB48_StaticMeshComponent0;         // 0x08E0 (size: 0x8)
    class UStaticMeshComponent* all_aboard_longboardB47_StaticMeshComponent0;         // 0x08E8 (size: 0x8)
    class UStaticMeshComponent* all_aboard_longboardB46_StaticMeshComponent0;         // 0x08F0 (size: 0x8)
    class UStaticMeshComponent* all_aboard_longboardB45_StaticMeshComponent0;         // 0x08F8 (size: 0x8)
    class UStaticMeshComponent* all_aboard_longboardB43_StaticMeshComponent0;         // 0x0900 (size: 0x8)
    class UStaticMeshComponent* all_aboard_longboardB42_StaticMeshComponent0;         // 0x0908 (size: 0x8)
    class UStaticMeshComponent* all_aboard_longboardB41_StaticMeshComponent0;         // 0x0910 (size: 0x8)
    class UStaticMeshComponent* all_aboard_longboardB40_StaticMeshComponent0;         // 0x0918 (size: 0x8)
    class UStaticMeshComponent* all_aboard_longboardB39_StaticMeshComponent0;         // 0x0920 (size: 0x8)
    class UStaticMeshComponent* all_aboard_longboardB38_StaticMeshComponent0;         // 0x0928 (size: 0x8)
    class UStaticMeshComponent* all_aboard_longboardB37_StaticMeshComponent0;         // 0x0930 (size: 0x8)
    class UStaticMeshComponent* all_aboard_longboardB36_StaticMeshComponent0;         // 0x0938 (size: 0x8)
    class UStaticMeshComponent* all_aboard_longboardB35_StaticMeshComponent0;         // 0x0940 (size: 0x8)
    class UStaticMeshComponent* all_aboard_longboardB29_StaticMeshComponent0;         // 0x0948 (size: 0x8)
    class UStaticMeshComponent* all_aboard_longboardB28_StaticMeshComponent0;         // 0x0950 (size: 0x8)
    class UStaticMeshComponent* all_aboard_longboardB27_StaticMeshComponent0;         // 0x0958 (size: 0x8)
    class UStaticMeshComponent* all_aboard_longboardB26_StaticMeshComponent0;         // 0x0960 (size: 0x8)
    class UStaticMeshComponent* all_aboard_longboardB25_StaticMeshComponent0;         // 0x0968 (size: 0x8)
    class UStaticMeshComponent* all_aboard_longboardB24_StaticMeshComponent0;         // 0x0970 (size: 0x8)
    class UStaticMeshComponent* all_aboard_longboardB23_StaticMeshComponent0;         // 0x0978 (size: 0x8)
    class UStaticMeshComponent* all_aboard_longboardB22_StaticMeshComponent0;         // 0x0980 (size: 0x8)
    class UStaticMeshComponent* all_aboard_longboardB21_StaticMeshComponent0;         // 0x0988 (size: 0x8)
    class UStaticMeshComponent* all_aboard_longboardB20_StaticMeshComponent0;         // 0x0990 (size: 0x8)
    class UStaticMeshComponent* all_aboard_longboardB19_StaticMeshComponent0;         // 0x0998 (size: 0x8)
    class UStaticMeshComponent* all_aboard_longboardB18_StaticMeshComponent0;         // 0x09A0 (size: 0x8)
    class UStaticMeshComponent* all_aboard_longboardB17_StaticMeshComponent0;         // 0x09A8 (size: 0x8)
    class UStaticMeshComponent* all_aboard_longboardB16_StaticMeshComponent0;         // 0x09B0 (size: 0x8)
    class UStaticMeshComponent* all_aboard_longboardB15_StaticMeshComponent0;         // 0x09B8 (size: 0x8)
    class UStaticMeshComponent* all_aboard_longboardB14_StaticMeshComponent0;         // 0x09C0 (size: 0x8)
    class UStaticMeshComponent* all_aboard_longboardB13_StaticMeshComponent0;         // 0x09C8 (size: 0x8)
    class UStaticMeshComponent* all_aboard_longboardB12_StaticMeshComponent0;         // 0x09D0 (size: 0x8)
    class UStaticMeshComponent* all_aboard_longboardB11_StaticMeshComponent0;         // 0x09D8 (size: 0x8)
    class UStaticMeshComponent* all_aboard_longboardB10_StaticMeshComponent0;         // 0x09E0 (size: 0x8)
    class UStaticMeshComponent* all_aboard_longboardB9_StaticMeshComponent0;          // 0x09E8 (size: 0x8)
    class UStaticMeshComponent* all_aboard_longboardB8_StaticMeshComponent0;          // 0x09F0 (size: 0x8)
    class UStaticMeshComponent* all_aboard_longboardB6_StaticMeshComponent0;          // 0x09F8 (size: 0x8)
    class UStaticMeshComponent* all_aboard_longboardB5_StaticMeshComponent0;          // 0x0A00 (size: 0x8)
    class UStaticMeshComponent* all_aboard_longboardB4_StaticMeshComponent0;          // 0x0A08 (size: 0x8)
    class UStaticMeshComponent* all_aboard_longboardB_StaticMeshComponent0;           // 0x0A10 (size: 0x8)
    class USceneComponent* warehouse_center_DefaultSceneRoot;                         // 0x0A18 (size: 0x8)

}; // Size: 0xA20

#endif
